[
  {
    "corpus": "DCS",
    "chapter": 3,
    "anchor": "3.05",
    "heading": "TREE PROTECTION FOR CONSTRUCTION SITES",
    "page_start": 4,
    "page_end": 4,
    "verbatim": "(A) Tree Protection Required ............................................................................................................... 3-8\n(B) Tree Protection Procedures ............................................................................................................ 3-9\n3.06 GENERAL LANDSCAPING AND MAINTENANCE REQUIREMENTS .................................. 3-13\n(A) Protecting Existing Improvements .............................................................................................. 3-13\n(B) Maintenance of Landscaping ....................................................................................................... 3-14"
  },
  {
    "corpus": "DCS",
    "chapter": 3,
    "anchor": "3.01(A)",
    "heading": "Intent",
    "page_start": 96,
    "page_end": 96,
    "verbatim": "The Streetscape Design and Tree Protection Standards are intended to improve public safety by\npreventing sight distance and facility obstructions, mitigating sidewalk and street damage,\npromoting suitable landscape species selection for streetscapes, and minimizing tree and\nlandscape maintenance costs."
  },
  {
    "corpus": "DCS",
    "chapter": 3,
    "anchor": "3.01(B)",
    "heading": "Scope",
    "page_start": 96,
    "page_end": 96,
    "verbatim": "These Standards apply to public and private streetscapes and , include the planting, maintenance,\npruning and spraying, protection, and removal of trees and landscaping materials located,\nstanding, or growing within or upon any City of Boulder public right-of-way. Tree protection\nstandards also apply to any existing private trees required to be preserved as a part of a\ndevelopment approval under Title 9 of the B.R.C. 1981. The requirements of this chapter are in\naddition to and supplement those set forth in Chapter 10, “Streetscape & Landscape Standards,”\nand applicable streetscape drawings in Chapter 11, “Technical Drawings,” of these Standards and\nthe B.R.C. 1981."
  },
  {
    "corpus": "DCS",
    "chapter": 3,
    "anchor": "3.01(C)",
    "heading": "Reference Standards",
    "page_start": 96,
    "page_end": 96,
    "verbatim": "Where not specified in these Standards or the B.R.C. 1981, in order to protect the public health,\nsafety, and welfare, the Director of Public Works in consultation with the Director of Parks and\nRecreation will specify the standards to be applied to the design and construction of streetscapes\nand the planting of trees and may refer to one or more of the references listed in the References\nSection of these Standards."
  },
  {
    "corpus": "DCS",
    "chapter": 3,
    "anchor": "3.01(D)",
    "heading": "City Approval Required",
    "page_start": 96,
    "page_end": 96,
    "verbatim": "All work associated with the planting, maintenance, and removal of trees and landscaping\nmaterials located, standing, or growing within or upon any City of Boulder public right-of-way is\nsubject to City of Boulder approval or permit issuance as set forth in Chapter 8-5, “Work in the\nPublic Right-of-Way and Public Easements,” and Chapter 6-6, “Protection of Trees and Plants,”\nB.R.C. 1981."
  },
  {
    "corpus": "DCS",
    "chapter": 3,
    "anchor": "3.02(A)",
    "heading": "Landscaping Plan Required",
    "page_start": 96,
    "page_end": 96,
    "verbatim": "An applicant for construction approval involving a project or development where streetscaping\nimprovements are to be provided or potentially impacted by the installation or construction of\npublic improvements, or where prescribed by a City-adopted subcommunity, area, or special\nimprovement plan, shall submit a Landscaping Plan in compliance with these Standards and those\nset forth in Chapter 6-6, “Protection of Trees and Plants,” Chapter 9-9, “Development Standards,”\nand Chapter 9--12, “Subdivision,” B.R.C. 1981."
  },
  {
    "corpus": "DCS",
    "chapter": 3,
    "anchor": "3.02(B)",
    "heading": "Tree Protection",
    "page_start": 96,
    "page_end": 97,
    "verbatim": "The Landscaping Plan shall include design details and notes, construction activity controls and\nmeasures, and any necessary provisions or restrictions to ensure the protection of existing trees as\nrequired in Section 6-6-6, “Protection of Trees and Plants,” B.R.C. 1981, and Section 3.05, “Tree\nProtection for Construction Sites” of these Design & Construction Standards. For projects larger\nthan one single family dwelling, a separate Tree Protection Plan in addition to the required\nLandscaping Plan shall be required. All tree protection measures shall be installed and monitored\nby a certified arborist."
  },
  {
    "corpus": "DCS",
    "chapter": 3,
    "anchor": "3.02(C)",
    "heading": "Landscaping Plan Requirements",
    "page_start": 97,
    "page_end": 97,
    "verbatim": "The Landscaping Plan shall be prepared in compliance with the requirements in Section 1.03,\n“Submittal Requirements for Construction Approval” of these Standards and Section 9-9-12,\nB.R.C. 1981, and shall include but are not limited to the following elements:\n(1) Location, species, and size of all existing trees and landscaping materials, and\nidentification of any required tree protection measures as outlined in Section\n3.02(B), “Tree Protection” of these Standards.\n(2) Design location, species, and size of all trees and landscaping materials proposed\nto be planted, removed, or relocated.\n(3) Location of existing and proposed public utilities and transportation\nimprovements and public rights-of-way boundaries.\n(4) When a drainage report is required in accordance with Chapter 7 of these\nStandards, the Landscaping Plan shall display drainage flow arrows and the\nlocation of open channels, storm inlets, and stormwater control measures to\nindicate the interaction between plantings and drainage.\n(5) Specifications and construction notes for proposed trees and landscaping\nmaterials, including without limitation, plant variety types, number and size of\nplants to be installed, location, sizing, and design details for irrigation systems,\nplanting and maintenance requirements for specific species, tree protection\nsystems and measures, and tree grate type and installation details."
  },
  {
    "corpus": "DCS",
    "chapter": 3,
    "anchor": "3.03(A)",
    "heading": "Tree Selection",
    "page_start": 97,
    "page_end": 98,
    "verbatim": "(1) Trees proposed to be planted in non-paved public rights-of-way shall be selected\nfrom the “Approved Tree List” unless an alternative tree selection has been\nreviewed by the Director of Parks and Recreation and approved by the Director\nof Public Works. Alternative species and varieties should be thornless,\ncottonless, minimally fruiting, minimally seeding, and single-stem tree-form\nvarieties.\n(2) Trees to be planted in non-paved medians or landscape planting strips shall be\nselected using the minimum planting strip width requirements for the tree species\nlisted in the “Approved Tree List” for the available planting strip width.\n(3) Trees shall not be planted in planting strips that are less than 4 feet in width. For\ndetached sidewalk landscaped planting strips, the planting strip width is\nmeasured from the back edge of curb to the front edge of the sidewalk.\n(4) Evergreen trees shall not be selected for placement in public rights-of-way\nmedians or landscaping strips, due to the potential for overcrowding, sight\nobstructions, and icing.\n(5) Whenever possible, trees should be selected from species noted as having xeric\nor minimum moisture level requirements as noted in the “Approved Tree List.”\n(6) A variety of trees, as required in Table 3-1, “Limitations on Individual Tree\nSpecies,” shall be selected for planting within any given site or street corridor,\nincluding street medians and curbside landscape strips, to prevent uniform insect\nor disease susceptibility associated with planting a single genus or species. A\nmaximum of three plantings of the same tree species type are allowed to be\nplanted in a row.\n(7) Trees proposed for the public rights-of-way in the Downtown Area shall follow\nthe guidelines outlined in the most recently adopted version of the Downtown\nUrban Design Guidelines.\nTable 3-1: Limitations on Individual Tree Species\n(The following table applies to all genus and species unless otherwise approved by the Director)\nNumber of Trees in the Site or Corridor Maximum Percentage of Any Genus or Species\n≤3 100% Genus\n4 to 8 50% Genus\n9 to 15 33% Genus\n16 to 50 20% Species, 30% Genus\n≥51 10% Species, 20% Genus\nNote: Any exceptions to the above diversity percentages must be approved by the City Manager. Tree availability at the\ntime of construction may impact tree diversity requirements. Genus and species substitutes, as well as revisions to tree\ndiversity requirements will be reviewed on a project by project basis by the City Manager."
  },
  {
    "corpus": "DCS",
    "chapter": 3,
    "anchor": "3.03(B)",
    "heading": "Tree Placement in Non-paved Medians and Landscape Planting",
    "page_start": 98,
    "page_end": 99,
    "verbatim": "Strips\n(1) Tree placement shall be designed and based on the expected mature height and\ncanopy spread for the selected species, to prevent unnecessary competition or\novercrowding of trees.\n(2) Trees shall not be placed where the expected mature height and canopy spread\ncould obstruct sight distance of any public sign, driveway, alley, or intersection,\nas set forth in Section 9-9-7, “Sight Triangles,” B.R.C. 1981, or where the\nphysical obstruction of any sidewalk, trail, alley, or street lane could occur.\n(3) New or transplanted trees shall not be placed within 10 feet of existing\nunderground water, sewer, or storm water utility lines. New underground utilities\nshould not be placed within 10 feet of existing trees without the prior review and\napproval of the Director.\n(4) Trees shall not be placed within 10 feet of any utility pole, streetlight, or\npedestal. When tree placement is allowed under overhead utility lines, only those\ntree species listed as “Small Maturing Trees” on the “Approved Tree List” shall\nbe planted.\n(5) Trees shall not be placed within 15 feet of any ditch embankment, and ditch\nowners should be consulted prior to any tree planting within ditch easements.\n(6) Trees shall be located at least 10 feet away from buildings and offset from\nbuilding entrances. When available space is limited, only species with columnar\nor fastigiate forms shall be planted.\n(7) Trees shall be planted in the center of right-of-way planting strips, or\nappropriately placed for mature height and spread, to ensure tree health, prevent\nroot damage to sidewalks and street facilities, and to avoid a sight distance\nobstruction.\nTrees shall not be placed in the right-of-way where the planting strip extends less\nthan 4 feet to the property line from the back edge of an attached sidewalk, the\nedge of the pavement, or the curb.\n(8) Tree spacing for trees placed in landscaped planting strips shall comply with the\n“Spacing Between Trees” requirements listed in the species headings in ,\n“Approved Tree List.” Tree placement should meet the recommended tree\nspacing and shall not be less than the minimum tree spacing requirements unless\napproved by the Director."
  },
  {
    "corpus": "DCS",
    "chapter": 3,
    "anchor": "3.03(C)",
    "heading": "Tree Placement in Paved Areas Using Tree Grates and Planting Pits",
    "page_start": 99,
    "page_end": 101,
    "verbatim": "(1) Trees within grates and planting pits shall be placed in compliance with the\ndesign standards for tree spacing and shall be planted in a 4 ft. x 10 ft. two-piece\nNeenah Foundry, or approved equal, grate. Tree spacing for tree grates shall\ncomply with the “Spacing Between Trees” requirements listed in the “Approved\nTree List.”\nTable 3-3: Tree Grates and Planting Pits Standards\nTree Species Size Tree Spacing Minimum Tree Grate Minimum Soil Volume*\nArea\n(Width x Length)\nSmall Tree 15 Ft. minimum, 20 Sq. Ft. minimum, 600 Cu. Ft. minimum,\n4 Ft. min. width 3 Ft. min. depth\n(Ex. 4 ft. x 5 ft.)\nMedium Tree 25 Ft. minimum, 32 Sq. Ft. minimum, 900 Cu. Ft. minimum,\n4 Ft. min. width 3 Ft. min. depth\n(Ex. 4 ft. x 8 ft.)\nLarge Tree 30 Ft. minimum, 40 Sq. Ft. minimum, 1200 Cu. Ft. minimum,\n4 Ft. min. width 3 Ft. min. depth\n(Ex. 4 ft. x 10 ft.)\n*Where soil volumes between trees overlap, up to 25% of the required soil volume per tree may\nbe shared.\n(2) Tree grates, tree guards, and planting pits shall be provided in locations where a\nhard surface or paved area is required to adequately accommodate pedestrians,\nincluding without limitation downtown or commercial sidewalks, malls, and\nplazas. The tree grate allows air and moisture to reach tree roots and limits\ncompaction of the soil around the tree to maintain healthy growth.\n(3) Trees within tree grates shall not be placed where the expected mature height and\ncanopy spread could obstruct sight distance of any public sign, driveway, alley,\nor intersection, as set forth in Section 9-9-7, “Sight Triangle,” B.R.C. 1981, or\nwhere the physical obstruction of any sidewalk, trail, alley, or street lane could\noccur.\n(4) Trees within tree grates shall not be placed within 10 feet of any existing\nunderground water, sewer, or storm water utility line or within 10 feet of any\nutility poles or pedestal. When tree placement is allowed under overhead utility\nlines, only those tree species listed as “Small Maturing Trees” on the “Approved\nTree List,” shall be planted.\n(5) Trees within tree grates should be located at least 10 feet away from buildings\nand offset from building entrances. Below grade parking structures are\nconsidered buildings and shall satisfy this requirement.\n(6) Adequate growing space between the tree trunk and first ring of the tree grate\nshall be provided to allow the tree to grow properly without girdling. The\nopening in the center of the tree grate through which the tree grows shall provide\n4-6 inches of clearance from the tree trunk and be at least 18 inches in diameter.\nThe tree shall be centered within the tree grate opening.\n(7) The soil surface within a planting pit and beneath a tree grate shall be level with\nthe bottom of the sidewalk slab. This is to avoid problems with root flares lifting\ngrates as the tree grows and allows the roots to find air and water. Trees are then\nto be planted so that the top of the root ball is 2” above the finished grade of the\nsoil.\n(8) Planting pits shall be 3 feet deep and have the same surface area as the required\ntree grate area and may not be deepened unless warranted by the depth of the root\nball of the tree to be planted. A planting pit shall not be deepened to increase pit\nvolume as an alternative to providing the minimum tree grate surface area.\n(9) Tree grates shall be flush with the finish grade of adjacent pavement.\n(10) All tree grates shall be installed per the manufacturer’s specifications. Grates\nshall be supported by a frame which has anchors embedded in the surrounding\nconcrete. Final frame dimensions shall be 1/16 to 1/8-inch larger than the grate\ndimension on all sides to allow the grate to drop into the frame seat. Frame\nsections are to be bolted together and cast into the surrounding concrete. Frames\nmust be level and the seat for the grate must be in a true, flat, plane to prevent\nrocking of the grate. The seat for the grate shall be cleaned prior to setting the\ngrate. To ensure proper fit, the grate or a template shall be placed in the frame\nbefore concrete is poured so that the final installation will be square and level.\n(11) Tree grates are to be of the pedestrian safe style with slot openings 3/8-inch in\nwidth or less and designed to accommodate a tree guard.\n(12) Tree guards shall have an 18” opening to match the tree grate and shall be\ninstalled per the manufacturer’s specifications."
  },
  {
    "corpus": "DCS",
    "chapter": 3,
    "anchor": "3.04(A)",
    "heading": "Permit Required for Tree Removal or Relocation",
    "page_start": 101,
    "page_end": 102,
    "verbatim": "(1) An applicant for construction approval shall not remove or relocate any tree\nexisting within any public right-of-way without first having a Landscaping Plan\napproved, obtaining a right-of-way permit under Chapter 8-5 “Work in the Public\nRight-of-way and Public Easements,” B.R.C. 1981, and receiving any approvals\nrequired under Chapter 6-6, “Protection of Trees and Plants,” B.R.C. 1981.\n(2) An applicant for construction approval may not request City approval nor\npropose as part of a Landscaping Plan for a project or development the removal\nor relocation of a tree in the public right-of-way unless:\n(a) The site cannot feasibly be developed, through design or construction\nalternatives, without removing or relocating the tree, and the applicant\nmitigates the loss of the tree,\n(b) The tree is determined by the city to be undesirable as outlined in Section\n3.04(B), “Undesirable Trees for Public Rights-of-Way,’ below, or\n(c) The city is requiring the removal of a tree as part of construction\napproval.\n(3) Where tree mitigation is required for tree removal pursuant to Chapter 6-6,\n“Protection of Trees and Plants,” B.R.C. 1981., trees required to be planted as\npart of standard project or development approval will not be counted towards the\nrequired mitigation.\n(4) Mitigation shall be satisfied when all fees are paid and replacement trees are\nplanted. Mitigation fees shall be determined by the Director and due prior to\nissuance of building permits. If replacement is appropriate, a Landscaping Plan\nshowing the location, species and size of all plant material shall be required."
  },
  {
    "corpus": "DCS",
    "chapter": 3,
    "anchor": "3.04(B)",
    "heading": "Undesirable Trees for Public Rights-of-Way",
    "page_start": 102,
    "page_end": 102,
    "verbatim": "The city may determine that certain trees located within the public right-of-way are undesirable\nand may recommend or require removal of these trees if:\n(1) The trees are less than 1 inch in caliper, usually representing volunteer trees or\nsuckers that seldom conform to selection and placement standards and are\nsmaller than would be required for new plantings.\n(2) The trees are smaller than 12 inches in diameter and are Cottonwood (any Poplar\nspecies), Siberian Elm, Russian Olive, Silver Maple, Tree-of-Heaven, Willow,\nand evergreens that create sight obstructions, clump forms, or multi-stem trees.\n(3) Trees that have been severely damaged or are in poor general health, as\ndetermined by the city under generally accepted forestry standards. Trees\ndamaged or in poor general health as the result of actions or inaction of the\nadjacent property owner requires the loss be mitigated by such property owner\nper Chapter 6-6, “Protection of Trees and Plants,” B.R.C. 1981.\n(4) Trees that, due to their species, location, or density would not conform to the\nexisting streetscape standards for tree placement or spacing as outlined in these\nStandards."
  },
  {
    "corpus": "DCS",
    "chapter": 3,
    "anchor": "3.04(C)",
    "heading": "Tree Removal",
    "page_start": 102,
    "page_end": 103,
    "verbatim": "(1) Trees shall only be removed in compliance with a Landscaping Plan approved by\nthe city as set forth in these Standards. Trees shall be required to be removed if\ngreater than 40% of the canopy or root system is damaged or removed during\nconstruction as determined by the Director under generally accepted forestry\nstandards.\n(2) All trees to be removed shall be marked with an “X” in blue permanent marking\nand approved by the City prior to removal.\n(3) All tree removal shall include stump grinding to a minimum depth of 12 inches."
  },
  {
    "corpus": "DCS",
    "chapter": 3,
    "anchor": "3.04(D)",
    "heading": "Tree Relocation (Transplanting)",
    "page_start": 103,
    "page_end": 103,
    "verbatim": "(1) Trees with a “transplanting ease” rating of 1 or a 2, as defined in the Tree and\nShrub Transplanting Manual, are considered eligible for transplanting, subject to\ncity approval. All transplanting shall be in a location approved by the city.\n(2) Trees eligible for transplanting shall meet the following requirements:\n(a) Be 8 inches or less in caliper, unless approved by the city, and\n(b) Have a root ball size of 1 foot per 1 inch of trunk caliper, evenly\ndistributed on all sides from the center line of the trunk. For example, a\ntree with a 4-inch caliper shall have a root ball with a 4-foot diameter,\nevenly distributed with 2 feet on all sides from the centerline of the\ntrunk.\n(3) Transplanting shall be done only by a certified arborist with a valid contractor\nlicense pursuant to Chapter 4-28, \"Tree Contractor License,\" B.R.C. 1981and in\naccordance with a Landscaping Plan approved by the city.\n(4) The applicant for construction approval shall ensure that the transplanted tree\nsurvives without significant loss of tree value in compliance with the tree\nprotection standards set forth in Chapter 6-6, “Protection of Trees and Plants,”\nB.R.C. 1981.(5) Transplanting periods:\n(a) Transplanting shall be done between December 1 and April 30 for all\ntrees, except for trees identified in the Tree and Shrub Transplanting\nManual as unsuitable for early spring transplanting.\n(b) Trees identified as unsuitable for early spring transplanting shall be\ntransplanted only between September 15 and October 30."
  },
  {
    "corpus": "DCS",
    "chapter": 3,
    "anchor": "3.05(A)",
    "heading": "Tree Protection Required",
    "page_start": 103,
    "page_end": 104,
    "verbatim": "(1) An applicant for construction approval shall protect trees and plants in the public\nright-of-way and on any project or construction site where public improvements\nare proposed.\n(2) An applicant for construction approval shall submit a landscaping plan\nincorporating proposed tree protection measures for any existing trees located in\nthe public right-of-way and on site at any project or construction site where\npublic improvements are proposed in compliance with these Standards. For\nprojects larger than one single family dwelling, a separate Tree Protection Plan in\naddition to the required Landscaping Plan shall be required.\n(3) The Landscaping Plan shall identify any potential detrimental effects to existing\ntrees that might result from proposed construction activities within 20 feet of the\ndripline of any existing trees located on site or in the adjacent public\nright-of-way. The plan shall include the species, size, and location of all existing\ntrees that are 2-inches or larger caliper size. If no existing trees are present that\nrequire protection, this shall be noted on the Landscaping Plan. Existing trees\napproved to be removed or relocated shall be clearly identified on the\nLandscaping Plan and Tree Protection Plan.\n(4) The applicant for construction approval shall notify the city within 24-hours of\nany suspected damage to trees resulting from construction activities. If damage\noccurs during construction, the applicant shall have the damaged tree evaluated\nimmediately by a certified arborist with a valid contractor license pursuant to\nChapter 4-28, \"Tree Contractor License,\" B.R.C. 1981.\n(5) If greater than 25% of the canopy or root system is damaged or removed during\nconstruction, the tree shall be evaluated for safety and future health by a certified\narborist with a valid contractor license pursuant to Chapter 4-28, \"Tree\nContractor License,\" B.R.C. 1981. A complete copy of the evaluation shall be\nsubmitted to the Director. Mitigation shall be required if the tree is deemed\nunsafe and is required to be removed.\n(6) Prior to issuing a right-of-way permit or building permit or upon discovery of\nany damage to existing trees located in the public right-of-way and identified in\nthe Landscaping Plan, the Director may require an applicant for construction\napproval to provide an escrow of funds or other financial guarantee that is\nacceptable to the Director for the full value of any such trees, as determined by\nthe Director in accordance with the Guide for Plant Appraisal published by the\nCouncil of Tree and Landscape Appraisers, for the duration of construction\nactivities and the public improvement warranty period. If, upon completion of\nconstruction activities and the public improvement warranty period, any damaged\ntrees have not been restored by a qualified arborist or replaced by trees of an\nequivalent or greater value, the Director may cause such restoration or\nreplacement to be completed and collect against the financial guarantee.\n(7) Upon discovery of any violation of the Landscaping Plan or any damage to\nexisting trees located in the public right-of-way and identified in the landscaping\nplan, the Director may issue a stop work order and halt all construction activities\npending restoration, mitigation, or replacement of the damaged trees to the\nsatisfaction of the Director."
  },
  {
    "corpus": "DCS",
    "chapter": 3,
    "anchor": "3.05(B)",
    "heading": "Tree Protection Procedures",
    "page_start": 104,
    "page_end": 108,
    "verbatim": "(1) Protective Maintenance: An applicant for construction approval shall\nprovide maintenance and care for existing trees required to be protected on site\nand in the public right-of-way adjacent to any project or construction site during\nconstruction activities and the public improvement warranty period, as provided\nin Section 9-12-14 “Public Improvement Warranty” B.R.C. 1981, to ensure that\nexisting trees survive and are not damaged.\n(2) Watering: The applicant for construction approval shall water trees identified\nfor protection in the Tree Protection Plan in accordance with the following:\nWater trees 1”-3” in diameter weekly at a rate of 10 gallons/inch of diameter;\nwater trees 4”-9” in diameter 3x per month at a rate of 10 gallons /inch of\ndiameter; and water trees 10” in diameter or larger 2x per month at the rate of 15\ngallons/inch of diameter. The above schedule shall be followed April through\nSeptember; October through March the trees shall be watered once per month\nfollowing the above amounts.\n(3) Soil Compaction Prevention:\n(a) To prevent soil compaction, designated routes for equipment and foot\ntraffic by work crews shall be determined prior to commencing\nconstruction activities and as indicated in the Landscaping Plan and Tree\nProtection Plan.\n(b) These planned routes shall be marked at the site before construction\ncommences with durable fencing material that is at least 4 feet high.\nFlagging tape or any other material that may be torn down, moved, or\nevaded is not acceptable.\n(c) The contractor shall inform all construction crew members on the site of\naccess routes and will ensure that only these routes are used.\n(d) To prevent tree root smothering, no soil stockpiles, supplies, equipment,\nportable toilets, or any other material shall be placed or stored within a\ntree dripline or within 15 feet of the tree trunk, whichever distance is\ngreater.\n(e) Soil around a tree dripline may be required to be aerated during and after\nconstruction activities. This is necessary even when compaction results\nfrom heavy foot traffic. A certified arborist with a valid contractor\nlicense pursuant to Chapter 4-28, \"Tree Contractor License,\" B.R.C.\n1981shall perform the vertical aeration or soil fracturing. . Conventional\nturf aeration is not acceptable.\n(f) When foot traffic or equipment use is unavoidable within the dripline,\nthe area within the dripline shall be mulched with wood chips to a depth\nof 6 inches before construction activity begins. A 6-inch mulch depth\nshall be maintained for the duration of the project, then removed when\nconstruction activities are completed.\n(4) Root Protection:\n(a) Tree roots shall not be cut unless cutting is unavoidable.\n(b) When root cutting is unavoidable, a clean, sharp cut shall be made to\navoid shredding or smashing. Root cuts should be made back to a lateral\nroot.\n(c) Root cutting shall only be performed by a certified arborist with a valid\ncontractor license pursuant to Chapter 4-28, \"Tree Contractor License,\"\nB.R.C. 1981.\n(d) Whenever possible, tree roots should be cut between late fall and bud\nopening, when root energy supplies are high, and conditions are least\nfavorable for disease causing agents.\n(e) The Director shall be notified of any cutting of the following roots:\n(i) Two roots having a diameter of more than 3 inches, or\n(ii) Four roots having diameters between 2 and 3 inches.\n(f) Trenches shall be hand dug within the dripline.\n(g) Whenever possible, roots 2 inches or larger in diameter shall be tunneled\nor bored under and shall be covered to prevent dehydration. Exposed\nroots shall be covered immediately with soil or burlap and kept moist.\n(h) Power tools shall not be used to prune roots, with the exception of\narboriculturally approved root cutting- equipment used under the\nsupervision of the City. Only the following approved tools shall be\nacceptable: scissorstype hand pruners and loppers, except -anviltypes,\nand -arboristtype- pruning saws.\n(i) Supplemental watering, in addition to the requirements of section 3.05\nB(2), shall be provided if the tree lacks an operational sprinkler system.\nThe applicant or abutting landowner shall provide the watering.\nWatering shall commence immediately after roots have been cut or\ndamaged at the following rates:\ni. 1”-3” diameter: water weekly at a rate of 10 gallons/inch of\ndiameter;\nii. 4”-9” diameter: water 3x per month at a rate of 10 gallons/inch\nof diameter; and\niii. 10” diameter or larger apply water 2x per month at the rate of 15\ngallons/inch of diameter.\nThe above schedule should be followed April through September;\nOctober through March the trees shall be watered once per month\nfollowing above amounts.\n(j) Sidewalk and paving surfaces shall be sufficiently contoured to avoid\ncutting surface tree roots. Whenever possible, tree roots shall bridge or\nfloat over with walks.\n(k) To allow maximum aeration and water penetration to roots, walk\nmaterials other than concrete may be selected (e.g., brick, flagstone,\nhoneycomb block, chips, gravel) subject to City approval. Under no\ncircumstances shall impervious material make contact with or completely\nencircle a tree trunk.\n(l) Auger tunneling, not trenching, shall be used for utility placement within\nthe dripline of tree measuring over 6 inches in diameter.\n(m) If roots are cut, the Director may require supplemental deep root\nwatering..\n(n) Trees impacted by construction activities shall not be fertilized for a\nperiod of 1 year following the cessation of construction activities.\nThereafter, for the next 2 years, a light annual fertilization using a slow\nrelease nitrogen source is acceptable.\n(5) Tree Fencing:\n(a) Fencing material shall encircle any tree, including those on adjacent\nproperties, whose outer dripline edge is within 20 feet of any\nconstruction activities.\n(b) Fencing material shall be a bright, contrasting color, durable, and at least\n4 feet high. Fence posts shall be comparable to metal T-posts or heavier\nposts and placed at least 1.5 feet below ground.\n(c) Fencing material shall be placed at the dripline or at least 15 feet from\nany tree trunk, whichever distance is greater, and maintained in an\nupright position throughout the duration of construction activities.\n(d) The applicant for construction approval shall indicate fencing locations\non the landscaping tree protection plan.\n(e) Objects, such as wood pallets or metal railings, shall not lean against or\ncome into contact with any tree trunk.\n(6) Grade Changes: Grade changes, such as removing topsoil or adding fill\nmaterial, shall not occur within the dripline of any existing tree. If necessary, as\npart of project or site development and approved by the Director, retaining walls\nand tree wells may be used to maintain the existing grade within the dripline of\nany tree when constructed prior to site grading changes near the tree. A\nlandscaping plan containing an illustrated design scheme of the tree protection\nimprovement shall be approved by the city prior to initiating any grade changes\nnear existing trees.\n(7) Transplanting: Any proposed or required transplanting shall conform with the\nrequirements in Section 3.04(D), “Tree Relocation (Transplanting).”\n(8) Chemical/Foreign Material Disposal:\n(a) Disposing of chemicals or foreign material anywhere on site or in the\npublic right-of-way is prohibited. This shall include, but is not limited to:\npaint, stain, solvents, concrete or any construction material onsite, and\nrinse water from any cans or tools containing chemicals.\n(b) Soil samples may be taken to determine the presence of chemicals or\nforeign materials for any planter containing proposed or existing plant\nmaterial.\n(9) Pruning: Pruning shall not occur during construction activities or the public\nimprovement warranty period, except to remove dead or damaged branches or to\nprevent branch damage that could occur during construction, without the prior\napproval of the Director. Any approved pruning must be completed by a\ncertified arborist with a valid contractor license pursuant to Chapter 4-28, \"Tree\nContractor License,\" B.R.C. 1981."
  },
  {
    "corpus": "DCS",
    "chapter": 3,
    "anchor": "3.06(A)",
    "heading": "Protecting Existing Improvements",
    "page_start": 108,
    "page_end": 109,
    "verbatim": "An applicant for construction approval shall preserve and protect all trees, plants, monuments,\nstructures, and public improvements from damage due to construction activities.\n(1) Utilities: The applicant shall ask the appropriate utility company to stake exact\nlocations and depths of all water, sewer, electric, gas, or telephone lines prior to\nexcavation, and shall take the necessary precautions to protect underground lines\nfrom damage. If damage occurs, the applicant shall pay all repair costs.\n(2) Existing Trees: Protection shall comply with Section 3.05, “Tree Protection\nfor Construction Sites.”\n(3) Responsibility for Damages: The applicant shall be responsible for any\ndamage to trees, plants, fences, buildings, roadways, sidewalks, and public and\nprivate property resulting from the applicant’s activities. The city may require an\napplicant to provide, at no cost to the city, durable fencing to prevent damage to\nfragile plant materials or structures. Damage to trees in shall be calculated in\naccordance with the Guide for Plant Appraisal published by the Council of Tree\nand Landscape Appraisers. If the applicant or an agent thereof damages a tree to\nsuch an extent that it must be removed and replaced, the applicant shall be\nresponsible for the cost of removing and replacing the damaged tree with a tree\napproved by the Director, plus the difference in value between the full appraised\nvalue of the removed tree minus the cost of removal and replacement.\n(4) Omissions and Discrepancies: Omissions from any approved landscaping\nplan or specifications that affect the intent of the plans or specifications, or that\nare customarily performed, shall be performed as if fully and clearly set forth and\ndescribed in the plans and specifications."
  },
  {
    "corpus": "DCS",
    "chapter": 3,
    "anchor": "3.06(B)",
    "heading": "Maintenance",
    "page_start": 109,
    "page_end": 110,
    "verbatim": "(1) Landscape maintenance shall begin immediately after each area is planted and\nshall continue following Director acceptance through the applicable warranty\nperiod, or in perpetuity, as set forth in Section 9-9-12(d)(2) “Landscape and\nScreening Maintenance and Replacement,” Section 9-12-13 “Subdivider\nFinancial Guarantees,” and Section 9-12-14 “Public Improvement Warranty,”\nB.R.C. 1981.\n(2) Landscape maintenance shall include, without limitation, watering, weeding,\ncultivating, mulching, tightening and repairing of guys, removal of guy wires and\ntree stakes after the first full growing season, removal of tree wrap prior to April\n1, removing dead branches, resetting plants to proper grade or upright position,\nreplacing dead plants and protecting the site from damage or vandalism.\n(3) If required by the Director, the applicant for construction approval shall furnish\nwritten maintenance instructions to the Director for the care and maintenance of\nall newly planted areas for the applicable warranty period. These instructions\nshall include, but are not limited to: irrigation, staking, pruning, insect and\ndisease control, and fertilizing.\nCITY OF BOULDER\nDESIGN AND CONSTRUCTION STANDARDS"
  }
]