[
  {
    "corpus": "DCS",
    "chapter": 10,
    "anchor": "10.01(A)",
    "heading": "Intent",
    "page_start": 284,
    "page_end": 284,
    "verbatim": "The Streetscape and Landscape Standards are intended to supplement the design standards\nspecified in Chapter 3, “Streetscape Design and Tree Protection,” of these Standards, and provide\nminimum standards for the construction and planting of streetscapes in public rights-of-way."
  },
  {
    "corpus": "DCS",
    "chapter": 10,
    "anchor": "10.01(B)",
    "heading": "Scope",
    "page_start": 284,
    "page_end": 284,
    "verbatim": "These Standards apply to streetscapes and public landscapes located, standing, or growing within\nor upon any City of Boulder public right-of-way or park. The streetscape requirements of this\nchapter are in addition to those set forth in Chapter 3, “Streetscape Design and Tree Protection,”\nand applicable streetscape drawings in Chapter 11, “Technical Drawings,” of these Standards and\nthe B.R.C. 1981."
  },
  {
    "corpus": "DCS",
    "chapter": 10,
    "anchor": "10.01(C)",
    "heading": "Reference Standards",
    "page_start": 284,
    "page_end": 284,
    "verbatim": "Where not specified in these Standards or the B.R.C. 1981, in order to protect the public health,\nsafety, and welfare, the Director of Public Works in consultation with the Director of Parks and\nRecreation will specify the standards to be applied to the design and construction of streetscapes\nand public landscapes and the planting of trees, and may refer to one or more of the references\nlisted in the References Section of these Standards."
  },
  {
    "corpus": "DCS",
    "chapter": 10,
    "anchor": "10.01(D)",
    "heading": "City Approval Required",
    "page_start": 284,
    "page_end": 284,
    "verbatim": "All work associated with the planting, maintenance, and removal of trees and landscaping\nmaterials located, standing, or growing within or upon any City of Boulder public right of way is\nsubject to City of Boulder approval or permit issuance as set forth in Chapter 8-5, “Work in the\nPublic Right of Way and Public Easements,” and Chapter 6--6, “Protection of Trees and Plants,”\nB.R.C. 1981."
  },
  {
    "corpus": "DCS",
    "chapter": 10,
    "anchor": "10.01(E)",
    "heading": "Water Conservation",
    "page_start": 284,
    "page_end": 284,
    "verbatim": "All landscaping shall be designed for maximum water efficiency, as specified in Section 9-9-12-\n9-12 “Landscaping and Screening Standards,” B.R.C. 1981."
  },
  {
    "corpus": "DCS",
    "chapter": 10,
    "anchor": "10.01(F)",
    "heading": "Public Lands Other Than Public Rights-of-Way",
    "page_start": 284,
    "page_end": 284,
    "verbatim": "Unless otherwise required by the Director in consultation with the Director of Parks and\nRecreation, all landscaping construction activities on public lands other than public rights-of-way,\nsuch as parks, open space and greenway corridors, are exempt from the construction and planting\nrequirements of these Standards. However, these Standards may be used as a basis for\nconstruction and planting activities on all public lands."
  },
  {
    "corpus": "DCS",
    "chapter": 10,
    "anchor": "10.02(A)",
    "heading": "Description",
    "page_start": 284,
    "page_end": 284,
    "verbatim": "Site preparation includes, without limitation, layout, tree protection, demolition, clearing,\nexcavation, fill and backfill, addition of topsoil, and finish-grading."
  },
  {
    "corpus": "DCS",
    "chapter": 10,
    "anchor": "10.02(B)",
    "heading": "Materials",
    "page_start": 284,
    "page_end": 285,
    "verbatim": "Planting soil nutrient and mechanical compositions are unique to individual sites, species, and\n10-1\nproject conditions such as geotechnical recommendations and green infrastructure requirements.\nOne soil type may not be viable across an entire project. The following requirements shall be\nsatisfied to ensure proper soil nutrients and mechanical composition are provided.\n(1) Imported Fill: Imported fill for landscaping shall be clean, fertile, sandy loam soil that\nis free from turf, lime, ashes, debris, noxious weeds, roots, stones over 4 inches in\ndiameter, harmful chemicals, or other materials that are detrimental to plant growth. Fill\nshall have a pH of 6.0 to 8.0, salt of less than 2 mmhos/cm, sodium absorption ratio of\nless than eight, and at least an 85 percent germination rate for narrow and broadleaf\nplants. Fill shall not be hauled in a frozen, wet, or muddy condition. An agricultural\nsuitability analysis of the proposed topsoil from an accepted, accredited testing agency at\ncontractor’s cost shall be provided to the City to confirm nutrient and mechanical\nrequirements are met.\n(2) Native Soil: Surface soil in the areas designated on the soils plan as existing soil shall\nnot be altered, compacted to root limiting density, graded or contaminated before or\nduring the construction process and shall be considered acceptable for planting and\nlongterm health of the plants specified either as it exists or with only minor modification.\nAn agricultural suitability analysis of the proposed topsoil from an accepted, accredited\ntesting agency at contractor’s cost shall be provided to the City to confirm nutrient and\nmechanical requirements are met.\n(3) Soil Requirements for Imported and Native Soil:\n(a) Topsoil shall be fertile, friable, sandy loam topsoil. Topsoil shall be free of\nstones over 1 inch in diameter, lumps, refuse, plants or their roots, sticks, noxious\nweeds, salts, soil sterilant or other material that is detrimental to plant growth.\nTopsoil shall not be delivered or used while in a frozen or muddy condition.\n(b) Topsoil shall have an acidity range of pH 6.0 to 8.0 and contain not less than 5\npercent organic matter as determined by loss on ignition of moisture-free samples\ndried at 100 degrees Centigrade. Topsoil shall have salt of less than 2 mmhos/cm\nand a sodium absorption ratio of less than eight.\n(c) Topsoil shall meet the mechanical analysis outlined in Table 10-1, “Topsoil\nMechanical Analysis,” of these Standards:\nTable 10-1: Topsoil Mechanical Analysis\nPassing percent Retained percent\n1-inch screen 100% 0 - 0%\n½-inch screen 97 - 100% 0 - 3%\nNo. 100 mesh sieve 60 - 40% 40 - 60%"
  },
  {
    "corpus": "DCS",
    "chapter": 10,
    "anchor": "10.02(C)",
    "heading": "Construction Requirements",
    "page_start": 285,
    "page_end": 288,
    "verbatim": "(1) Layout:\n(a) The contractor is responsible for:\n(i) Establishing and recording all necessary boundary points, lines,\n10-2\nDESIGN AND CONSTRUCTION STANDARDS Effective: January 2, 2023\nelevations, grades, access points, and benchmarks onsite for proper\ncontrol, landscape protection, coordination with subcontractors, and\nexecution of the work.\n(ii) Verifying all furnished survey and topographic data, all points, lines, and\nelevations.\n(iii) Notifying the Director of any discrepancies between information on\napproved construction plans and actual site or field conditions or\nmeasurements and receive approval for required modification prior to\ncontinuing work.\n(iv) Staking all cuts and fills on the sites as shown on the grading plan.\n(b) Shoulders and toes of slopes shall be smoothly blended to the flat areas.\n(c) No cut or fill is allowed within the dripline of existing trees without the prior\napproval of the Director pursuant to Section 3.05(B)(5) of these Standards.\n(2) Clearing of Project Site: The contractor is responsible for:\n(a) Removing from the site all trees and shrubs, brush and weed growth, stumps, and\nroot systems designated on the approved construction plans for removal.\n(i) All trees to be removed shall be marked with an “X” in blue permanent\nmarking and approved by the Director prior to removal.\n(ii) All other plant material not designated for removal shall be protected and\nmaintained consistent with Chapter 3.05(B) of these Standards.\n(iii) Stripped-off brush and weed growth shall be hauled offsite. No burning\nor nesting of materials shall be permitted onsite.\n(b) Maintaining adequate fire protection while clearing operations are underway.\n(c) Replacing any existing sod damaged by construction operations. Replacement\nsod shall meet the standards of Section 10.04, “Seeding/Sodding,” of these\nStandards.\n(d) If specifically required on the approved construction plans, scalping the top of\nsoil, including grasses and roots, to a depth specified in the plans and stockpile\nonsite or remove as indicated.\n(3) Excavation: The contractor is responsible for:\n(a) Stripping, stockpiling, and replacing existing topsoil in areas of fill on the\nfinished grade to at least 4 inches deep.\n(b) Excavating so as to provide adequate drainage of the site at all times.\n10-3\n(c) Using hand methods of excavation within the dripline of trees pursuant to root\nprotection requirements in Section 3.05(B)(3) of these Standards.\n(4) Fill and Backfill Operations: The contractor is responsible for the following:\n(a) Obtaining the Director’s approval of the subgrade before commencing soil\npreparation, adding of topsoil, finish grading or planting, and obtaining the\nDirector’s approval of the finish grade before commencing planting, mulching or\nother subsequent operations. The following grading tolerances shall be applied:\n(i) Tolerances shall not exceed 0.1 feet above or below desired subgrade\nelevations in planted areas, and no tolerance will be allowed on\nsubgrades prepared for paving or site improvements, or subgrades\nimmediately adjacent to curbs or island pavements.\n(ii) Settling of finish grade shall not exceed 0.1 feet.\n(b) Completing clearing operations before beginning any filling or backfilling.\n(c) If sufficient suitable fill or backfill material is not available on the project site,\nfurnishing additional materials according to standards for hauled-in fill or topsoil,\nas required in these Standards.\n(d) Placing fill and backfill in layers not to exceed 6 inches in compacted depth with\nthe following compaction standards:\n(i) Each layer shall be compacted to the specified density. Landscaping fill\nand backfill shall be compacted to no less than 80 percent and no more\nthan 85 percent density in areas to be planted.\n(ii) Compaction shall not occur when soil is wet.\n(e) Ensuring that filling and backfilling shall provide adequate site drainage at all\ntimes. Fill or backfill shall not be placed on wet ground.\n(5) Finish Grading:\n(a) Work in this section shall consist of cutting, filling, shaping, and grading\naccording to the lines, grades, elevations and cross sections on the approved\nlandscaping or engineering plans.\n(b) The contractor is responsible for the following:\n(i) Completing all finish grading onsite. The top of the subgrade shall be the\ndepth below the finish grade as required for pavements, sod, walks,\nmulches and other site improvements.\n(ii) Protecting the finish grade areas and regrading to correct any\nirregularities caused by hauling materials or by other operations over the\nfinish grade.\n10-4\nDESIGN AND CONSTRUCTION STANDARDS Effective: January 2, 2023\n(iii) Repairing any erosion or other damage resulting from weathering action\nbefore final acceptance.\n(c) Excavated and filled sections and adjacent transition areas shall be smooth,\nproperly compacted and free from irregular surface changes. The degree of\nfinish grading shall be that ordinarily obtained from either blade, grader, or\nscraper operations. Where finishing cannot be satisfactorily completed with\npower equipment, hand methods shall be used.\n(d) Unless otherwise indicated, the subgrade shall be evenly sloped to provide\ndrainage away from site improvements or the centerline of medians. Swales\nshall be cut as shown on the plans but shall not reduce the thickness of the topsoil\nspecified.\n(e) Finish grading shall conform to the grade elevations shown on an approved\nlandscaping plan and shall be free from debris and other materials that would be\ndetrimental to the subgrade. Settling of any finish grade shall not be more than\n0.1 feet, and if settling is greater, the contractor shall bring the grade to specified\nelevations."
  },
  {
    "corpus": "DCS",
    "chapter": 10,
    "anchor": "10.03(A)",
    "heading": "Description",
    "page_start": 288,
    "page_end": 288,
    "verbatim": "Planting includes, without limitation, the placement of live trees and shrubs, the placement of\nmaterials to protect and enhance plant growth, and the methods applied in planting and\nmaintaining landscape plants."
  },
  {
    "corpus": "DCS",
    "chapter": 10,
    "anchor": "10.03(B)",
    "heading": "Materials",
    "page_start": 288,
    "page_end": 290,
    "verbatim": "(1) Edger: Ryerson or approved equivalent steel edger, 1/8-inch by 4- inch steel with steel\nstakes, painted with rust-inhibiting black paint. The edger shall have a rolled or folded\nedge or be capped with plastic safety-edged material.\n(2) Filter Fabric: Fabric shall not be used with any planting unless specifically approved\nas part of a detailed Landscaping Plan. Fabric shall not be used within the driplines of\nany existing trees or within 10 feet of any newly planted trees. If approved, fabric shall be\n30.1-mil DeWitt Weed Barrier or approved equivalent.\n(3) Pesticides: Comply with the specifications of Chapter 6-10, “Pesticide Use,” B.R.C.\n1981.\n(4) Tree Wrapping Material: New, 4-inch wide, bituminous impregnated tape,\ncorrugated or crepe paper, brown in color, specifically manufactured for tree wrapping.\nTree wrapping shall be fixed with pliable or nonbinding tape. No wire shall be used. If\ntree wrapping is used, the tree wrap shall be removed by April 1 of the following growing\nseason.\n(5) Compost: Well-weathered and weed-free cow or sheep manure or other composted\n10-5\nmaterials. No mountain peat shall be used.\n(6) Stakes: Green 8-foot steel tee posts with blade.\n(a) Trees shall be secured to stakes using minimum 2-inch-wide nylon and cotton\nblend webbing with heat sealed ends, a tensile strength of 1000 pounds and brass\ngrommets for attachment of wire between strap and stake.\n(b) Grommets shall be 1 ¼ - inch in diameter with a ½ -inch diameter eye that is set\nat least ½ -inch from end of strap.\n(c) Wire shall be 12-gauge galvanized steel covered with a PVC sleeve.\n(d) Straps shall be of sufficient length in relation to tree caliper so that grommets do\nnot touch trunk.\n(e) A protective cap shall be secured to the top of all stakes.\n(7) Mulch:\n(a) Wood chip mulch shall be clean wood chips or fiber, free of soil or man-made\ndebris, shredded into coarse pieces ranging in size from 1 inch to 3 inches. All\nlandscape plantings shall be mulched with 3 to 4 inches of wood chips. “\n(b) Rock, gravel, cobblestone, or other inorganic material shall not be used in\nplanting beds as a temporary or permanent mulch. unless specifically approved as\npart of a detailed Landscaping Plan.\n(8) Plant Materials:\n(a) All plants shall be “ “Northern Grown” unless otherwise specified in these\nStandards, except for plants of the genus Juniperus.\n(i) Northern Grown means plants grown in nurseries for at least two full\ngrowing seasons located in hardiness Zones 1 through 5, as shown on a\nUnited States Department of Agriculture map.\n(b) All plants shall be appropriate for the local climate and site-specific growing\nconditions. All plants shall be of species identified under and allowed by these\nStandards and shall conform to the following:\n(i) Selected to meet the goal of maximum water efficiency and zoned or\ngrouped according to their water requirements in accordance with\nSection 9-9-12,”Landscaping and Screening Standards,” B.R.C. 1981.\n(ii) Individually identified on legible, weatherproof labels securely attached\nto the plants. Labels shall be durable and shall remain legible for at least\n60 days from site delivery.\n(iii) Labels shall include the correct genus, species, variety name, accepted\n10-6\nDESIGN AND CONSTRUCTION STANDARDS Effective: January 2, 2023\ncommon name of the plant, size or grade of stock, and source nursery of\nthe plant.\n(iv) Labels shall remain until after City inspection and then shall be removed\nby the contractor.\n(c) Tree selection and placement shall be in accordance with Section 3.03, “Tree\nSelection and Placement,” of these Standards.\n(d) Trees shall conform to and have the following characteristics:\n(i) A well-developed branch structure typical of the size and species with no “V” crotches,\ncodominate stems, or included bark. The height of branching should bear a relationship typical of size\nand species so that the crown of the tree will be in balance as the tree grows.\n(ii) Healthy buds, stems, and bark that are without mechanical, injury, insect,\nor disease signs or symptoms.\n(iii) Healthy, vigorous, and free from visual defects, mechanical injuries,\nplant diseases, and all forms of insect infestation until final acceptance.\n(iv) A well-branched and vigorous root system typical of size and species and\nfree from bent or kinked roots, roots girdling the trunk, and other defects.\n(v) All trees shall be balled and burlapped. Root balls shall have a sufficient\ndiameter for the fibrous and feeding root system necessary to provide for\nfull recovery of the tree following planting. Minimum root ball sizes\nshall meet the following specifications outlined in Table 10-2,\nTable 10-2: Minimum Root Ball Sizes\nCaliper Minimum Root Ball Diameter\n1 ½” 20”\n1 ¾” 22”\n2” 24”\n2 ½” 28”\n3” 32”\n(vi) Shrubs may be either balled and burlapped or container grown.\n(e) All trees and shrubs shall be freshly dug at time of delivery, unless they are\ncontainer-grown."
  },
  {
    "corpus": "DCS",
    "chapter": 10,
    "anchor": "10.03(C)",
    "heading": "Construction Requirements",
    "page_start": 290,
    "page_end": 293,
    "verbatim": "(1) Layout and Identification: The contractor shall use stakes, flags, or containerized\nplants to locate all trees and shrubs according to an approved landscaping plan.\n10-7\n(2) Schedule:\n(a) Nothing shall be planted between October 15 and March 1 without prior written\napproval of the Director. Stock, other than container-grown stock, shall not be\nplanted between June 1 and September 1 without prior written approval of the\nDirector.\n(b) Nothing shall be planted during freezing or excessively windy, hot, or wet\nweather or when the ground conditions cannot be properly worked for digging,\nmixing, raking, or grading.\n(c) Nothing shall be planted until the adjacent site improvements, pavements,\nirrigation installation and finish grading is completed. The irrigation system shall\nbe in approved, operating condition prior to any planting.\n(3) Plant Protection and Delivery:\n(a) The contractor shall protect all installed plant material from injury, excessive\ndrying or winds, improper ventilation, over watering, freezing, high\ntemperatures, or any other condition damaging to the plant until final acceptance.\nAny plants showing evidence of poor care or that are molded, mildewed, wilted,\nor dried-out shall be rejected. Colored waxes or other materials that coat the\naerial parts of plants, or the removal of primary buds and/or shoots, including\nterminal buds and first order leaders, of plants are not acceptable.\n(b) Plant materials shall be planted on the day of delivery if possible. All plants not planted on day\nof delivery shall be placed in a temporary nursery, kept moist, shaded and protected from sun and wind.\nIf balled and burlapped plants are not planted on the day of delivery, they shall be heeled-in immediately\nin the temporary nursery, kept moist and protected with damp soil, mulch, or other acceptable material.\nAll plants shall be planted within 48 hours after delivery. Plants shall not be bound with wire or rope that\nmay damage the bark or break branches. Plants shall be lifted and handled from bottom of ball or\ncontainer and shall not be dropped or lifted by the trunk, stem or foliage. Plants with balls that are loose,\ncracked, broken, man-made or completely dry or plants with trunks loose in the ball before or during\nplanting operations shall not be accepted and shall be removed from the site at contractor's expense.\n(c) The contractor shall deliver all packaged landscape materials to the site in\noriginal unopened containers bearing name, trade name, manufacturer,\ntrademark, and conformance to State Law.\n(d) Existing trees shall be protected per Section 3.05, “Tree Protection for\nConstruction Sites,” of these Standards.\n(4) Excavation of Planting Pit:\n(a) All plant pits shall be centered on the plant location and excavated in a\ncylindrical shape with vertical sides and flat bottom. The depth of the plant pit\nshall be measured from adjacent finish grade of the soil, not from the mulch. The\nbase of all soil balls shall be placed on undisturbed soil.\n(b) Trees: The diameter of all tree pits shall be at least two times the diameter of the\n10-8\nDESIGN AND CONSTRUCTION STANDARDS Effective: January 2, 2023\nball or spread of the roots. Tree pits shall be excavated so that the top of the ball\nwill be 2 inches above finish grade.\n(c) Shrubs: The diameter of all shrub pits shall be at least two times diameter of the\nball or spread of roots. Shrub pits shall be excavated so that the top of the ball\nwill be 1 inch above finish grade.\n(d) Vines and Ground Covers: The diameter of all vine and ground cover pits shall\nbe two times the spread of roots. The planting pit shall be excavated so that the\ntop of the ball is 1 inch above finish grade.\n(e) All holes and pits shall be protected as specified in the General Conditions at all\ntimes when work is not being carried on at the site of excavation.\n(5) Planting and Staking for Plant Installation:\n(a) For all trees, the contractor shall drive stakes 3 feet vertically into firm soil\noutside the planting pit with blade on tree side. The contractor shall run a double\nstrand of wire through one grommet in the strap, wrap the strap around the trunk\nat no more than one-third the height of tree, and run wire through other grommet\nand back to stake. Strap and wire attachment between the stake and tree shall be\nadjusted so that straps are under just enough tension to avoid visible sag in lines.\nRigid guying shall not be accepted. Straps and wires shall be placed so as to be\nperpendicular to the trunk. Stakes shall be parallel or slightly angled away from\nthe trunk.\n(b) The contractor shall place stakes according to tree height or caliper as follows:\ndeciduous trees under 2 inches in width - one stake oriented northwest; deciduous\ntrees between 2 and 3 inches in width, and evergreen trees less than 5 feet in\nheight - two stakes oriented northwest and southeast; deciduous trees 3 inches in\nwidth and larger and evergreen trees 5 feet in height and larger - three stakes with\none oriented northwest and the other two oriented 120 degrees in either direction\nfrom northwest.\n(c) All deciduous trees shall have a sod-free base at least 3 feet in diameter. All\nevergreen trees shall have a sod free base extending to the dripline. This sod free\narea shall be extended where necessary to include all stakes.\n(d) The contractor shall return to the site and remove all stakes and guy wires\nbetween May 21 and June 7 after one full growing season.\n(e)Unless otherwise specified, all areas designated for mass planting such as for ground\ncovers or vines shall be amended with 5 cubic yards per 1,000 square feet of\nmanure compost. The contractor shall first prepare the subgrade by discing or\nrototilling the subgrade to a depth of 8 inches. No ripping or chiseling shall be\nallowed. After preparing the subgrade, the amendments shall be thoroughly\nrototilled into the soil to a depth of 8 inches. The contractor shall remove any\nrocks, debris or foreign matter in excess of 1 inch in length or diameter\nencountered to an 8-inch depth or in a manner adequate to accommodate typical\n10-9\nroot depth of the specified plant material.\n(6) Spraying, Pruning, Watering and Mulching for Plant Installation:\n(a) After watering on the day of planting, and throughout the maintenance period,\nthe contractor shall ensure that all plants are sufficiently, but not over, watered.\nThe contractor shall water each plant with a minimum of 10 gallons of water per\ndiameter inch trunk width per week unless otherwise specified in an approved\nTree Protection Plan.\n(b) Wood chip mulch shall be placed in all planting beds, shrub areas and the sod-\nfree area of a 3-foot radius at the base of each tree. The mulch shall be spread\ncarefully and evenly to a depth of 3-4 inches. Mulch shall be removed 2 inches\nback from the trunk. Shredded wood chip mulch shall be watered thoroughly two\ntimes to aid in matting the mulch in place. The mulched areas shall be graded so\nthat the top of the mulch will be flush with the top of the curb, sidewalk, edging\nor sod.\n(c) The contractor shall be responsible for damage to any underground utility,\nirrigation line, paving, adjacent structures or other improvements. In the event a\npipe, line, rock formation, or other obstruction interferes with a plant location,\nthe contractor shall notify the Director to receive approval for a new plant\nlocation."
  },
  {
    "corpus": "DCS",
    "chapter": 10,
    "anchor": "10.04(A)",
    "heading": "Description",
    "page_start": 293,
    "page_end": 293,
    "verbatim": "(1) Seeding/sodding includes, without limitation, the planting and installation of grasses\n(native or otherwise), preparation of soils and grading, and the methods to be applied in\nplanting and maintaining of grasses until full establishment is achieved."
  },
  {
    "corpus": "DCS",
    "chapter": 10,
    "anchor": "10.04(B)",
    "heading": "Materials",
    "page_start": 293,
    "page_end": 295,
    "verbatim": "(1) Fertilizer: Specified fertilizer shall be supplied in the original supplier's containers with\nlabel and order form showing composition and quantity. Fertilizer shall be intact, free-\nflowing, dry and in quantity, as specified for sodded or seeded areas, as shown on the\nplans. Fertilizer for sod and seeding soil preparation shall be a compound equivalent to\n18-46-0 applied at the rate of 10 pounds per 1,000 square feet.\n(2) Bluegrass: Bluegrass shall be Colorado-grown, 100 percent certified Kentucky\nBluegrass, of three improved bluegrass varieties complying with applicable Colorado and\nFederal regulations. Newport, Park, Delta and Common Kentucky Bluegrass are not\nacceptable varieties for the sod mixture. The sod shall have a vigorous and healthy root\nsystem and top growth and shall have been regularly fertilized, watered, mowed, sprayed\nand shall be free from objectionable weeds and/or grasses. Sod strip shall have from 5/8\ninch minimum to 1-inch maximum thickness of soil adhering to root system, cut into\nstrips 18-inch maximum width by 4 feet minimum length. Sod that has dried out, or sod\n10-10\nDESIGN AND CONSTRUCTION STANDARDS Effective: January 2, 2023\nwith adhering soil that breaks, tears or crumbles away will not be accepted. Sod cut for\nmore than 24 hours shall not be accepted. Sod rolls shall be kept moist, protected from\nsun, heat or wind in transport and after delivery. Prior to cutting, the sod shall be evenly\nmowed for a blade length of at least 1 inch but not more than 2 inches.\n(3) Turf-type Tall Fescue: Turf-type tall fescue seed or sod shall be purchased from a\nreputable seed dealer, complying with requirements specified. Seed mixture shall be of\nat least three varieties (a maximum of five) of dwarf type tall fescue (i.e., Monarch, El\nDorado, Rebel Jr., Crew Cut, SR 8200, or other approved varieties).\n(a) PLS shall not be less than 88 percent.\n(b) Specified PLS shall be calculated as shown in Section (5)\n(4) Buffalo Grass: Buffalo grass shall be either seed, plugs, or sod.\n(a) Buffalo grass seed shall be purchased from a reputable seed dealer, complying\nwith the requirements specified. Seed mixture shall be “Texoka” or “Sharp's\nImproved” or approved equivalent.\n(i) PLS shall not be less than 75 percent.\n(ii) Specified PLS shall be calculated as shown in Subsection (B)(5).\n(b) Buffalo grass plugs or sod shall be 100 percent certified turf-forming variety 609,\nor approved equivalent. Buffalo grass imported from states south of Colorado\nmay be approved due to the difficulty in establishing sod in the front range\nclimate.\n(i) All sod shall be healthy, in vigorous condition, of natural green color,\nfree of disease and harmful insects. The sod shall be laid within 48 hours\nof harvest.\n(ii) Plugs shall be cut from sod as described in this Section. Nursery grown\nplugs are acceptable with prior approval by the Director.\n(c) If sod is to be used for medians larger than 12 feet wide, Buffalo grass is\npreferred.\n10-11\nTable 10-4: Soil Amendment Mix Mechanical Analysis\nPercent (%) Passing Percent (%) Retained\n2\" Screen 100 0\n1\" Screen 90-100 0-10\n½ \" Screen 50-80 20-50\n#100 Mesh Sieve 0-15 85-100\n(5) Soil Amendment: Soil amendment for sod and seed areas, shall be manure compost,\nand shall contain at least 50 percent organic matter. The mixture shall be free from clay\nsubsoil, sawdust, commercial wood products, stones, lumps, plants, roots, sticks, weed\nstolons and seeds, high salt content, and other materials harmful to plant life. The\nmaterials shall be coarsely ground and thoroughly mixed together to ensure an even\ncomposition. Cow manure or mushroom compost shall be free from lumps, debris or\nchemicals harmful to landscape plantings. The soil amendment mix shall have an acidity\nfrom pH 5.5 to 8.0, and meet the mechanical analysis outlined in Table 10-4, “Soil\nAmendment Mix Mechanical Analysis,” of these Standards.\n(6) Erosion Control Netting: Jute mesh erosion control netting or approved equivalent\nshall be used."
  },
  {
    "corpus": "DCS",
    "chapter": 10,
    "anchor": "10.04(C)",
    "heading": "Construction Requirements",
    "page_start": 295,
    "page_end": 299,
    "verbatim": "(1) Subgrade and Soil Preparation:\n(a) The contractor shall lay out and stake the boundary of all areas to be sodded,\nseeded, or plugged prior to commencing any work. The contractor shall prepare\nthe subgrade of all seeded or sodded areas by discing or rototilling the soil to a\ndepth of 6 inches. No ripping or chiseling shall be allowed. No rototilling or\ndiscing is to be done within the protection area of existing trees. After the\nsubgrade has been completed, soil preparation shall begin by spreading the soil\namendment evenly within the seeding or sodding limits at the rate of (6) cubic\nyards per 1,000 square feet.\n(b) For sod, -18-46-0 fertilizer shall then be spread uniformly over the entire area at\nthe rates as specified for soil preparation. The area shall again be disced or\nrototilled at right angles to the first tillage, then formed by rolling to provide a\nproper seed bed or sodding surface. The sod or seed bed shall be totally free\nfrom rock, debris, vegetable matter, weeds or clay clods over ½ inch diameter,\nprior to any sodding or seeding operations.\n(2) Finish and Fine Grading:\n(a) Positive Surface Drainage: The contractor shall finish and fine grade the project\narea to establish an even and well-matched grade over the entire surface.\n10-12\nDESIGN AND CONSTRUCTION STANDARDS Effective: January 2, 2023\nPositive surface drainage shall be assured, and there shall be no depressions,\nsubsequent settling or irregularities in the finished grade.\n(b) Transitional Areas: At any transitional point or line where one plane intersects\nanother, such as from a sloping area or berm to a level area, a smooth and gentle\ntransition shall be made. There shall be no abrupt changes in grade. There shall\nalso be a smooth transition between existing turf and the new sod. The grade\nelevations of the two areas shall be matching.\n(3) Schedule: All seeding shall be scheduled between March 1 and October 15 unless prior\nwritten approval from the Director has been obtained.\n(a) No sodding and seeding shall take place during inclement weather.\n(b) No sodding and seeding work shall commence until the adjacent site\nimprovements, pavements, irrigation installation and finish grading is completed.\nThe irrigation system shall have been tested and be in operating order prior to\nany seeding or sodding.\n(c) The contractor shall barricade sodded area immediately after sod installation as\nspecified on the approved construction plans or in these Standards. The\nbarricade shall include the following:\n(i) Standard construction lath at 5-foot intervals connected with three tiers\nof colored plastic flagging.\n(ii) “KEEP OFF THE SOD” signs attached to the barricading every 25 feet.\n(4) Seeding:\n(a) Seeding shall be done with a Brillion drill or approved mechanical seeder. Seed\nshall be evenly distributed on a still day into a slightly moist seed bed. Seed shall\nbe drilled 1/8 inch into the prepared seed bed. If the slope is too steep to drill,\nseed shall be broadcast at double the application rate and covered with 1/8 inch\nof soil with a harrow or hand rake for small areas. The seeding shall be done in\ntwo separate applications crossing the area at right angles to guarantee proper\ncoverage. Drill seed across slopes rather than up and down, following the\ncontour to reduce erosion.\n(i) Native grasses shall be seeded at a rate of 20 pounds PLS/acre when\ndrilled and 35 pounds PLS/acre when broadcast.\n(ii) Buffalo grass shall be seeded at a rate of 3 pounds PLS/1000 square feet\nwhen drilled and 5 pounds PLS/1000 square feet. when broadcast.\n(iii) Turf type tall fescue shall be seeded at a rate of 6 pounds/1000 square\nfeet when drilled and 9 pounds/1000 square feet when broadcast.\n(b) After seeding operations have been completed, the entire seeded area shall be\n10-13\nhydromulched with “Conwed 2000\" or approved equal hydro mulch material.\nThe hydro mulch shall be applied by using mechanical hydromulcher, evenly\ndistributed on a still day. The hydro mulch material shall be applied at the rates\nrecommended by the manufacturer. Within 12 hours after seeding, the sprinkler\nsystem shall be activated to moisten seeded areas to a depth of 1 inch. All seeded\nareas shall be kept so moistened by frequent light watering until final acceptance\nof the project or as required by City Land Use Regulations, and such watering\nshall be the responsibility of the contractor.\n(c) Protect seeded slopes (greater than 2.5 horizontal to one vertical) with erosion\ncontrol netting or other methods acceptable to the Director. Cover netting with\nstraw or other acceptable mulch.\n(d) Seeding is not complete and will not be accepted until 70% coverage is achieved\nwith the intended species.\n(5) Bluegrass Sodding:\n(a) Sod shall be laid on a firm, premoistened bed with tight joints so that no voids\noccur under or between strips. All end joints shall be staggered, and the sod roll\nlength shall run perpendicular to all slope fall lines. Sod shall be tamped, rolled,\nand watered immediately after sodding operations are completed.\n(b) No sod shall be installed within a radius of 3 feet around any tree within the\nproject limits. Shredded wood chips shall be installed to a 3-inch depth in this 3\nfoot area. All rolls terminating at the project limits shall be cut in a straight line\nunless otherwise specified and the exposed edge covered with topsoil. All sod\ninstalled around planting beds shall be cut to conform to the shape of the bed as\nshown on plan or laid out onsite. Sod shall be laid flush with paving, curbs and\nirrigation heads and 1 inch below the top edge of steel edging.\n(c) In the event that sod dries or shrinks, a mixture of screened topsoil and specified\nbluegrass seed shall be brushed into the cracks and tamped flush. Excessively\nshrunk sod (over 3/4-inch shrinkage) shall be replaced with new sod. Any sod\nlaid on slopes steeper than 3:1 (33 percent) shall be laid at a 90-degree angle to\nthe slope and held in place with two wooden dowels per sod piece.\n(d) The contractor shall activate the sprinkler system to water sod immediately after\neach section of sod is laid. The contractor shall operate the sprinkler to soak all\nsod and the underlying soil to a depth of 2 inches and maintain this moisture\nlevel until final acceptance. The contractor shall water the sod in the early\nmorning and late afternoon for the duration of this period.\n(6) Buffalo Grass Sod:\n(a) Prior to sodding, the site should be lightly irrigated to alleviate “sod-wicking”\nand desiccation. The sod shall be laid by staggering joints with all edges\ntouching. Installation shall be performed between April 1 to August 31.\nImmediately following the laying of the sod, the sod should be rolled with a\n10-14\nDESIGN AND CONSTRUCTION STANDARDS Effective: January 2, 2023\nroller, weighing at least 150 pounds, heavy enough to imprint the sod into the\nsoil.\n(b) The contractor shall irrigate immediately after any sod installation, so that the\nsod and underlying soil is completely wetted to a depth of 4 to 6 inches\n(saturated). Subsequent irrigation shall be applied as necessary as determined by\ndaily inspection of the sod panels. Daily inspection should consist of manually\nraising several sod panels and testing the level of moistness in the soil by\npinching the soil together. If the soil remains 'pinched' together, and is moist,\nand the panel's sod pad is also moist, then the sod does not require watering that\nday. If the soil, after being pinched, falls apart, the sod shall be irrigated to retain\nthe required moisture level. The sod soil pad and underlying soil should be moist\nat all times.\n(c) Rainfall received during the establishment period may reduce the irrigation\nrequired. If temperatures exceed 95 degrees for periods of several days, the sod\nmay have to be inspected more frequently and additional daily irrigation cycles\nmay be required. If the soil that has been sodded is extremely hard, or\ncompacted, and not easily saturated, or dries out quickly, the sod and soil shall be\nkept consistently moist the first ten days.\n(d) Normal establishment should display the following characteristics. Within 48\nhours of installation the sod should turn a straw color, which is called a dormant\nstage, although the roots would continue to grow while the top growth is\ndormant. Within 5 to 7 days feeder roots should begin appearing. Within 14 to\n21 days new green top growth should be seen and the sod should be firmly\nrooted. Once this occurs, daily manual inspections would no longer be required.\nSod should then be watered 1½ inches per week for 2 to three months, to prevent\ndrought stress, until deeper rooting takes place.\n(e) The contractor is to thoroughly discuss required installation, establishment and\npost-establishment methods, irrigation, and maintenance requirements with the\nsod supplier (specifically for sod maintenance - weed control/removal, i.e., what\nchemical can safely be used, etc.).\n(7) Buffalo Grass Plugs:\n(a) Plugs shall be planted on 12-inch centers with a requirement of at least nine (9)\nplugs per square yard of ground. Plugging machinery must convert 16 x 24-inch\nsod panels into plugs and plant in one operation. Each 16 x 24-inch sod panel\nyields 24 4-inch square plugs, with a total of 81 plugs cut from a yard of sod. At\nleast 80 percent of the plugs shall be a 4-inch square plug (4 x 4 inches);\nminimum acceptable size for the remainder of the plugs is 2 x 4 inches, nor\nmaximum size any larger than 4-inch x 4 inch. Coordinate equipment passes to\nmaintain parallel, evenly spaced rows. Immediately following plugging, the\nplugs should be rolled with a roller, weighing at least 150 pounds, heavy enough\nto imprint the plugs into the soil.\n(b) All plugs shall be planted within 48 hours of harvest of the sod. All plugs shall\nbe healthy, in vigorous condition, of natural green color, free of disease and\n10-15\nharmful insects. Water after any portion of the plugging is complete, within 4\nhours of planting, so that the plugs are completely wetted and the underlying soil\nis wetted to a depth of 4 to 6 inches.\n(c) All buffalo grass sod establishment, irrigation, and maintenance requirements\nshall apply to plugs. Plugs will require more frequent manual inspection and\nmore frequent watering. After the initial establishment period, plugs should be\nwatered 1 inches per week until desired coverage is achieved."
  },
  {
    "corpus": "DCS",
    "chapter": 10,
    "anchor": "10.05(A)",
    "heading": "Description",
    "page_start": 299,
    "page_end": 299,
    "verbatim": "Underground irrigation includes, without limitation, installing a complete and permanent\nunderground irrigation system consisting of irrigation pipelines, sprinklers, valves, and\ncontrollers as part of any landscaping project."
  },
  {
    "corpus": "DCS",
    "chapter": 10,
    "anchor": "10.05(B)",
    "heading": "Materials",
    "page_start": 299,
    "page_end": 303,
    "verbatim": "(1) Sprinkler System Components: All sprinkler system components shall be those of\nthe manufacturers specified in these Standards, or be an approved equivalent, and shall be\ninstalled in accordance with these Standards.\n(2) Sprinkler Heads: Pop-up rotary impact or stream spray sprinklers shall be used to\nwater sod , using full and part circle heads as specified on any approved landscape plans.\nRequirements for the sprinklers include the following:\n(a) Sprinklers shall provide coverage as specified on any approved landscape plans,\nplus or minus 5 percent of the flow rate and 2 ½ feet within the design radius\nduring a low wind situation.\n(b) Sprinkler heads shall meet the following specifications:\n(i) Minimum pop-up height of 6 inches forpop ups and MP rotators or 5\ninches for larger rotors with heavy retract spring;\n(ii) Part circle sprinklers shall be adjustable for any arc between 20 and 340\ndegrees;\n(iii) Have built-in check valves in the head to control low head drainage and\nreduce air compression in lines. The check valve shall be serviceable\nfrom the top of the head without requiring excavation and removal of the\nhead from the riser.\n(c) Sprinklers shall be vandal resistant and shall have vandal-resistant cover screws\nor no exposed screws in the cover.\n(d) Sprinklers shall be tamper resistant to prevent changing the direction of throws\nby means of locking friction collars, gear drives, and limited access features.\n10-16\nDESIGN AND CONSTRUCTION STANDARDS Effective: January 2, 2023\n(e) Sprinklers shall have a drive mechanism that will ensure proper and even rotation\nand coverage on 4:1 slopes.\n(f) Sprinklers shall have rubber covers or similar protective devices.\n(3) Bubblers: Requirements for bubbler heads shall include the following items:\n(a) Heads shall operate properly between 10 psi and 80 psi;\n(b) Heads shall have a molded plastic body with a ½ inch female pipe thread;\n(c) Heads shall have a nozzle flow adjusting screw, providing fully open to\ncompletely closed positions;\n(d) Heads shall have a plastic basket screen to protect nozzles from clogging.\n(4) Automatic Control Valves:\n(a) Automatic electric remote-control valves shall be slow acting diaphragm-type\nelectric solenoid valves. Solenoids shall be two-watt running, current 24-volt\nAC, 50/60 cycle operation. The valve shall be slow opening and closing by\nmeans of a “shunt” resistor to avoid damage from surge pressures. Valve flow\nrange shall be 1 to 200 gallons per minute depending on size with a pressure\nrange of 10 to 200 PSI.\n(b) All valve bodies and bonnets shall be constructed of heavy case bronze with\naccurately machined valve seat surfaces and internal parts. Inlet part of\ndiaphragm chamber shall have a removable screen for easy cleaning, accessible\nwithout removing bonnet from valve body. Valve bonnets shall be equipped\nwith a slotted plug or bleed screw for manual operation of valves at any time\nwithout energizing the solenoid, and a manual flow control stem.\n(5) Isolation Gate Valves: Isolation gate valves for installation on main lines shall be of\nbrass construction, designed for 200 psi working pressures, and have solid disc, non-\nrising stems with a heel and screwed ends. Gate valves 3 inches or larger shall be brass\nor iron AWWA gate valves with rubber gaskets or mechanical joints.\n(6) Quick-Coupling Valves: Anti-rotation quick-coupling valves installed in main lines\nshall be of a cast brass body construction and have a self-closing and locking protective\ncover. The throat shall incorporate a single keyway with positions for regulation of water\nflow, with a flow range of 10 to 70 gallons per minute and a pressure range of 5 to 125\npsi. Replaceable seals shall be provided at the valve seat and throat, and the internal parts\nshall be removable for service. Installation on a main line in shall include a 10-inch\ncircular locking valve box over the coupler body. Size shall be 1 inch. Quick-coupling\nvalve keys shall have 1-inch male top pipe threads. Swivel hose ells shall be 1-inch\nN.P.T. x 3/4-inch hose thread.\n(7) Manual Drain Valves: The system shall be equipped with 3/4-inch curb stop manual\nglobe drain valves at all low points on main lines. Valves shall be of bronze construction\n10-17\nwith threaded connections, cross handles, and operating keys. Install valves in a locking\nvalve box. Angle valves will not be accepted.\n(8) Y-Strainers: Y-Strainers for installation on main line shall be bronze “Y” type\nstrainers with a screen mesh.\n(9) Wire Connectors: All wire connections at electric control valves and all splices of\nwire in the field shall be made using “snap-tits,” or an approved equivalent, wire\nconnectors. Significant requirements for connectors include the following items:\n(a) Connectors shall be rated at 600 volts for PVC insulated copper wire,\nUnderwriters Laboratory listed, and water-resistant.\n(b) Connectors shall consist of a PVC base socket, sealing plug, and wire crimping\nsleeve and shall provide a permanent waterproof joint by using a silicone sealer\nfor joint makeup.\n(10) Controllers:\n(a) Automatic sprinkler controllers shall be completely automatic in operation and\nshall electrically start all sprinkler cycles and time the individual stations.\nControllers shall have standard 117-volt power inputs, 24.0 volt, 60 cycle outputs\nwith separate independent timing stations, 14-day programming, and be capable\nof automatically starting a watering cycle at the beginning of any hour for 23\nhours per day. Each station shall have an “OFF” switch for “0\" time and\nindividual incremental timing control for 0-to-60-minute station timing. Each\nstation shall have an “ON-Repeat” switch for eliminating one or more stations\nfrom initiating a repeat cycle on any or all stations after the normal watering\ncycle has been completed. A 14-day clock shall be provided for maximum\nprogramming versatility and any timer pins shall be of the captive type to prevent\nloss. It shall be possible to operate controller manually and to select and operate\nmanually any station. All controls shall be capable of being manipulated at any\ntime in any sequence without damage to controller. The controller shall have the\nability for dual programming and shall have soil moisture sensing equipment.\n(b) Soil moisture sensing equipment shall have an adjustable control module with an\noverride function, and at least two in-ground sensors/tensiometers. Sensors must\nbuffer salinity and have the ability to withstand winter conditions without\nremoval.\n(c) A reset circuit breaker shall protect each controller from damage due to excessive\ncurrent. A master “ON-OFF” switch shall provide for turning controller “OFF”\nduring rainy weather, while allowing day and hour clocks to continue in\noperation. The controller shall have as standard built-in features an electrical\ncircuit to operate a master valve and moisture sensor circuit to allow operation of\ncontrollers in conjunction with a moisture sensing device. Install valve output\nsurge protection arresters for control wiring and common.\n(d) All wiring to and from controllers shall be through color-coded plugs and\nsockets. Controller cabinets shall be locking, weatherproof type, constructed of\n10-18\nDESIGN AND CONSTRUCTION STANDARDS Effective: January 2, 2023\nheavy gauge steel with corrosion resistant enamel finish inside and out.\n(e) Controllers shall conform to NEC Class 2 requirements of 24-volt valves.\nControllers shall be for wall or pedestal mounting.\n(11) Valve Boxes: Lockable valve boxes shall be sized to provide maintenance access to all\nvalve and controller component. The underside of all control valve boxes shall be clearly\nmarked to indicate controller numbers and valve numbers.\n(12) Pipe:\n(a) Main Line Pipes:\n(i) Main pressure line pipe shall be NSF approved virgin polyvinyl chloride\npipe or HDPE. Pipe shall be suitable for use at maximum hydrostatic\nworking pressures of 200 PSI. Pipe shall be made from clean, virgin,\nNSF approved, type 1, grade 1 PVC, conforming to Astin Resin\nspecification D1784-60 and project standard D2241 for PVC 1120 SDR\n26 or SDR 21. PVC pipe is to be belled end and solvent weld. Solvent\ncement and primer shall be of the type prescribed by the manufacturer.\n(ii) Gasket pipe and fittings shall be used for main lines 3 inches or larger.\nGasketed pipe shall be of the type prescribed by the manufacturer. No\ninsert gaskets or insert gasket fittings shall be accepted. Thrust blocks\nshall be provided in accordance with pipe manufacturer's\nrecommendations.\n(b) Marking and Declaration of Compliance: Pipe marking shall show the size,\nseries, identification, and manufacturer's trade name at intervals of not more than\n20 feet. Pipe shall include the seal of approval of the National Sanitation\nFoundation spaced at intervals required by NSF regulations.\n(c) PVC Fittings: All pipe fittings shall be schedule 40 PVC (ASTM D2466 and\nD1784). Solvent cement shall conform to ASTM D2564.\n(d) Brass Pipe and Fittings:\n(i) Brass pipe shall be 85 percent red brass, (ANSI) Schedule 40.\n(ii) Fittings shall be medium brass, 125-pound class, screwed type.\n(iii) Dielectric unions shall be used wherever a copper-based metal (copper,\nbrass, bronze) is connected to an iron based metal (iron, galvanized and\nstainless steel).\n(e) Copper Pipe: Copper pipe shall meet the requirements of Type K, ASTM B88.\nFittings shall be copper or cast bronze. Silver solder shall be used for joints.\n(f) Lateral Line Pipes: Pipe for rotary sprinkler laterals shall be NSF approved\nHDPE polyethylene, rated at 80 PSI, using sch 40 insert fittings and adjustable\n10-19\nstainless-steel clamps with stainless steel screws. All piping shall be CS-256-63\nASTM D2239, PE 2306-100. 2 inch or larger class 200 -1” sch 40 lateral piping\nshall meet the standards for main line pipes.\n(g) Static Pressure Reduction: Static pressure on the main line shall be relieved by\nthe installation of a “master” automatic control valve.\n(13) Risers: Rotary pop-up sprinklers shall have an adjustable swing joint riser assembly\nconsisting of Schedule 80 PVC nipples, and marlex and Schedule 40 PVC ells.\n(14) Irrigation Sleeves: All horizontal sleeves under paved areas and vertical sleeves shall\nbe PVC Class 200 pipe, or SDR 35 glue joint and glued 4-inch diameter for lines 2 inches\nand smaller, and 6-inch diameter for lines 2 ½ inches to 3 inches. A separate 2-inch\ndiameter sleeve for control valve wires shall be laid under any new pavements. This\nsleeve shall be placed next to the main line sleeve.\n(15) Backflow Prevention Device: Backflow prevention devices shall be installed in\naccordance with these Standards and B.R.C. 1981.\n(16) Electrical Copper Wires: Electrical copper wires from valves to controller shall be\n14 gauge or larger PVC-insulated copper and UNDERWRITERS LABORATORY\napproved for direct burial. Use 10-inch valve boxes for all wire splice locations. Control\nwires shall be red and common wires shall be white.\n(17) Drip Valve Assemblies: Drip valve assemblies shall have strainers with a 120-mesh\nnylon screen and ½ inch blow-out. Pressure reducing valves shall have manual adjusting\nnuts.\n(18) Drip Emitters and Tubing: Drip emitters shall use drip tubing conforming to ASTM\nD1248 and ASTM D3350. Capillary tubing shall have 1/8-inch i.d.\n(19) Drip Line Blow Out Stubs: Drip line blow out stubs shall be installed at all ends of\ndrip tubing."
  },
  {
    "corpus": "DCS",
    "chapter": 10,
    "anchor": "10.05(C)",
    "heading": "Construction Requirements",
    "page_start": 303,
    "page_end": 311,
    "verbatim": "(1) Applicable Standards:\n(a) All work involving standard plumbing systems shall be executed by a licensed\nand bonded plumber. Electrical services to controllers shall be installed by a\nlicensed electrician. All work shall be executed according to the B.R.C. 1981,\nand these Standards. The contractor shall schedule inspection of electrical\nservices to controllers with the City and allow at least 7 working days for\nsubsequent approval and connection to the power source by the Public Service\nCompany. The contractor shall furnish any additional material and labor when\nrequired to comply with the B.R.C. 1981, and these Standards.\n(b) The contractor shall perform a leakage test on all systems on the site at normal\nworking pressures.\n10-20\nDESIGN AND CONSTRUCTION STANDARDS Effective: January 2, 2023\n(c) The contractor shall guarantee irrigation application in accordance with any\napproved landscape plan; any unwatered areas due to poor layout, placement of\nor insufficient sprinklers shall be corrected by the contractor at their expense.\n(d) Work shall be in accordance with good practices prevailing in the piping trades.\n(e) All work shall be protected from vandals or flooding during construction.\n(2) Layout of Work: Before any installation operations are started, the contractor shall\ncompletely stake out the irrigation system on the site. Any discrepancies in irrigation\nwater coverage shall be reported and corrected at this time.\n(3) Schedule:\n(a) No sprinkler system construction shall take place during wet weather or when\ntemperatures are less than 30 degrees Fahrenheit.\n(b) All required sleeving shall be performed prior to any paving operations. All\nprocedures necessary for the insertion and installation of irrigation pipe and wires\ninto sleeves shall be performed after paving operations have been completed.\n(c) Installation of the system shall not take place until all earthwork has been\nsubstantially completed and compacted and all other site improvements,\npavements, etc. have been completed.\n(4) Trenching and Piping:\n(a) The contractor shall perform all necessary excavation for installation of their\nwork. Over-excavations shall be backfilled, and hand tamped prior to installing\npipe. Any pumping, shoring, or bracing shall be provided by contractor.\n(b) Manufacturer's specifications covering installation of their material shall be\nfollowed. Underground lines up to 2 inches shall have minimum horizontal\nclearance of 2 inches of each other, and larger lines shall have a clearance of 4\ninches. No sprinkler lines shall be stacked vertically in a common trench. Lines\nshall have minimum horizontal clearance of 12 inches from the lines of other\ntrades. There shall be a minimum 2-inch vertical clearance between any lines\ncrossing 45 degrees - 90 degrees. Minimum cover over lateral piping shall be 12\ninches, or to a depth to accommodate valves and other equipment, whichever is\ngreater. All PVC main line shall be at 18-inch minimum depth of bury. PVC\nmain line is to be encased in sand 4 inches on all sides.\n(c) Where trenches and lines run adjacent to existing irrigation lines and properties,\ndamage to these shall be avoided and shall be restored to their original condition\n(d) When pipe laying is not in progress, or at end of each day, pipe ends shall be\nclosed with tight plug, or cap, or taped with PVC pipe wrap. All work shall be\nperformed in accordance with good practices prevailing in the piping trades.\n10-21\n(e) Tunneling will be permitted where the pipe must pass under any obstruction that\ncannot be removed. In backfilling the tunnel, the final density of the backfill\nmust match that of the surrounding soil. It shall be acceptable to use a casing of\nsuitable diameter that shall be installed first by tunneling or jacking, and the pipe\nshall then be laid through the casing, observing the same precautions as though it\nwere installed in open trench.\n(f) Trenches shall be cut to true line and grade and shall be excavated so that the\npipe shall be supported uniformly. The contractor shall be responsible for\nstaking the trench lines. Minimum grade of piping to drain shall be 3 inches/100\nfeet.\n(g) If ground water is encountered during trench excavation above the elevation of\nthe bottom of the pipe grade, such water shall be drained until the pipe has been\ninstalled. Pipe joints and open ends shall be plugged to prevent ground water\nfrom entering the pipe.\n(h) Thrust blocks shall be installed behind all gasketed fittings, in line valves, and\ncaps. Gasket pipe fittings shall be installed according to manufacturer's\nrecommendations. Concrete for thrust blocks shall cure for 72 hours before\npressure is applied to the system.\n(5) Threaded Joints:\n(a) Field-threading of plastic pipe or fittings shall not be permitted. Only factory-\nformed threads shall be used.\n(b) Factory-made nipples shall be used wherever possible. Field-cut threads in\nmetallic pipe will be permitted only where absolutely necessary. When field\nthreading, cut threads accurately on axis with sharp dies.\n(c) All threaded joints shall be assembled with pipe joint compound consisting of\nliquid Teflon. The compound is to be applied to male threads only.\n(d) Where assembling soft metal (brass or copper) or plastic pipe, strap type friction\nwrenches shall be used; metal-jawed wrenches shall not be used.\n(6) Sleeves:\n(a) The contractor shall furnish and install sleeves of appropriate size, depth, and\nlocation to accommodate all irrigation pipe beneath any paved surfaces prior to\npipe installation as specified herein, unless they have been previously installed.\nWhere irrigation lines run under proposed paved surfaces, the contractor shall\nsleeve the lines a distance 2 feet beyond the edge of the surface. Sleeves shall be\nPVC Class 200 pipe/SDR 35 glue joint glued.\n(b) Installation of sleeves shall precede construction paving. Sleeves shall be\nencased in sand 4 inches on all sides, with backfill compacted to 95 percent of\nstandard Proctor density. Sleeves shall be buried at a depth of 18 inches.\nSeparate sleeves placed at the 18 -inch bury depth shall be provided for wires\n10-22\nDESIGN AND CONSTRUCTION STANDARDS Effective: January 2, 2023\npassing under paved sections. All sleeves installed under a parking lot or street\nshall be flow-filled\n(c) All sleeves shall be marked by the placement of nylon rope, or an approved\nequivalent marking material.\n(7) Backfilling:\n(a) Trenches shall not be backfilled until all required tests on the system have been\ncompleted and until the line has been inspected and approved by the Director.\nTrenches shall be carefully backfilled with suitable materials, free from stones\nlarger than 2 inches in maximum dimension, by depositing the material in 6-inch\nlayers and thoroughly compacting the backfill to 95 percent of standard Proctor\ndensity.\n(b) Ponding and/or jetting may be used only if prior approval is obtained and only\nwhen the backfill material is sandy or gravelly. An excess of water shall be\navoided in order to prevent disturbance of the earth under and around the pipe.\nLikewise, the amount of water used shall be controlled so as not to risk “floating”\nthe pipe out of position. Adequate dikes shall be constructed along the trench to\nretain and guide the water. When jetting is used, jets shall be of an approved\ndesign and of sufficient length to reach the bottom of each layer and the water\nsupply shall be continuous.\n(c) Site excavation material will generally be considered satisfactory for backfill\npurposes provided that backfill materials are free from rubbish, vegetable matter,\nfrozen materials, or stones larger than 2 inches in maximum dimension. Any\nmaterial not meeting these specifications for backfill shall be removed from site.\n(d) Backfilling shall not be performed in freezing weather. All trenches shall be left\nslightly mounded to allow for settlement after the backfilling is completed. If\nsinking of the trenches occurs, it is the responsibility of the contractor to correct\nsuch conditions.\n(8) Manual Drain Valves: Manual drain valves shall be located, furnished, and installed\nby the contractor at all low points on sprinkler lines. A drain sump of not less than 6\ncubic feet of 1/2 inch washed gravel shall be installed surrounding each drain valve. All\nmanual drain valves are to be installed with drain valve sleeves.\n(9) Electric Control Valves:\n(a) Electric control valves shall be automatic and purchased from the manufacturer\nspecified, or be an approved equivalent, matching size, model and quantity as\nlisted on an approved landscape plan. All control valves shall be installed at the\nlocations shown on the approved landscape plan.\n(b) Electric control valves shall be installed in accordance with the manufacturer's\nrecommendations. All valves shall have sufficient clearance from adjacent\nobstructions to provide accessibility for maintenance. All valves shall be\n10-23\ninstalled at sufficient depth to provide at least 6 inches cover to finished grade.\nOnly one control valve per valve box shall be installed.\n(c) Control wire shall have an 18-inch expansion loop at each valve and elsewhere as\nnecessary to prevent possible wire breaks. Where more than one control wire is\nlocated in the trench, the wires shall be taped together at 20-foot intervals to\nmaintain orderly and efficient installation. All control wires shall be placed\ncarefully alongside and slightly below the main line for protection. Control wires\nnot protected by the irrigation main shall be laid in a 2-inch PVC class 200\nsleeve. Electrical control wires shall be extended along the irrigation main and\nconnected to the controller.\n(d) Electrical control wires shall be connected with snap-tite connectors. Splicing\nwill be permitted only on runs exceeding 500 feet in length and shall be located\nat valve locations. Wires shall be bundled and taped at 20-foot intervals. A\nminimum wire loop of 24 inches shall be provided at each control valve, splice,\nand every 100 feet of wiring. Two spare #14-1 wires, blue in color, shall be\ninstalled along the entire length of the main line from the controller to farthest\ncontrol valve on each and every branch of the main line.\n(10) Pressure Reducing Valves: Pressure reducing valves (PRV) shall be installed to\nensure proper operating pressures at sprinkler locations.\n(11) Valve Boxes: All automatic control valves, pressure reducing valves, backflow\nprevention devices, isolation gate valves, manual drain valves, and quick-coupling valves\nare to be installed in valve boxes. The valve box and cover shall be flush with the final\ngrade and level. The valve box shall be installed with a 4inch layer of 1 ½ inch washed\ngravel on the sides and below the box. If the box encloses a double check valve\nassembly, the gravel layer below the box shall be equal in volume to the volume of the\nbox.\n(12) Quick-Coupling Valves: Quick-coupling valves shall be installed in conformance\nwith these Standards. Additional quick-coupling valves shall be located every 200 feet\nalong the main line. All valves shall be installed in separate 10-inch circular valve boxes\nplaced flush with the final grade and level.\n(13) Isolation Gate Valves: Isolation gate valves on the main line shall be plumb with\nfinished grade and installed in a valve box placed flush with the final grade and level.\nExtensions may be added onto the valve box as necessary to level box with finish grade.\n(14) Sprinklers:\n(a) Installation of sprinklers includes furnishing, installing, and testing, risers,\nfittings, sprinkler heads, bubblers, and other sprinkler system components in\naccordance with an approved Landscaping Plan. Sprinkler piping shall be\nthoroughly flushed before the installation of the sprinkler heads and bubblers.\n(b) Sprinkler heads shall be set plumb and level with finished grade at locations\nshown on an approved Landscaping Plan. Sprinklers shall be set 12 inches\n10-24\nDESIGN AND CONSTRUCTION STANDARDS Effective: January 2, 2023\nbehind concrete improvements such as curb and gutter or sidewalks. Sprinklers\ninstalled where grass has not been sodded shall be installed on temporary risers\nextending minimum 3 inches above grade. After finished grades are established\nand the ground has settled, the contractor shall lower sprinklers to finished grade.\n(c) Bubblers shall be set plumb and level before mulch is installed.\n(d) Rotary pop-up sprinklers on swing joint risers shall be installed as shown in these\nStandards and may be adjusted in the field as necessary.\n(15) Drip Valve Assemblies: Installation of drip valve assemblies shall in conformance\nwith these Standards.\n(16) Drip Emitters and Tubing: Installation of drip emitters and tubing shall be installed\nin conformance with these Standards at a depth of 4 inches below top of grade. For this\npurpose, top of grade does not include mulch or rock layers. Drip line blow-out stubs are\nto be installed at all ends of drip tubing. Drip tubing may be installed in turf areas as\nlateral piping.\n(17) Controllers and Related Work: The controller shall be mounted on three\nwolmanized CCA 6-inch x 6-inch ties, set at least 24 inches below grade and a maximum\nof 18 inches above grade. The controller shall be located as shown on an approved\nlandscape plan, and be mounted inside a locking, weather-proof metal cabinet. The\ncontractor shall provide and install a 15-amp electrical circuit breaker in a locking,\nweatherproof box. The contractor shall wire the circuit breaker and controller and run\nwire to the Public Service Company pull box, leaving an 18-inch tail of wire in the pull\nbox or sleeve. After connection, the contractor shall notify the City’s Inspection Services\nto inspect controller and circuit breaker wiring prior to notifying Public Service Company\nto connect power to the wiring. The contractor shall be responsible for manual operation\nof the sprinkler system until power is connected. All wiring shall be performed by a\nlicensed electrician.\n(18) Testing and Adjusting:\n(a) All main lines having continuous pressure shall be tested at a minimum pressure\nof 120 psi. Visual inspection shall be performed, and any leak shall be repaired.\nRepaired lines shall be retested until no leakage is occurring.\n(i) Zone lateral lines shall be tested at the design operating pressure of the\nzone. Any leaks found shall be repaired and the zone retested. All\nsprinklers shall be operating at the same pressure plus or minus 7\npercent.\n(ii) The entire irrigation system shall be tested at normal working pressure\nfor leaks in the system and retested until no leakage is occurring. The\npressure test shall be performed under the observation of the Director for\nfinal approval.\n(iii) After testing, the entire irrigation system shall be thoroughly flushed\n10-25\nwith at least 100 percent of operating flow passing through each pipe,\nbeginning with larger mains and continuing through smaller lines in\nsequence.\n(b) The entire system shall be “fine-tuned” by regulating valves, adjusting patterns\nand breakup arms, setting pressure reducing valves at proper pressure and\nsimilar, to provide optimum and efficient coverage.\n(c) Final inspection shall include observation and approval by the Director of the\nperformance, method of operation, and coverage of the irrigation system.\n(d) The contractor shall furnish two sets of keys for all quick-couplers, manual drain\nvalves, gate valves, and controllers as well as padlocks and keys for controller\ncircuit breaker boxes, two sprinklers and nozzles of each type, hose ells for all\nquick couplers, and all related loose parts necessary to operate the system, as part\nof the final acceptance by the Director.\n(19) Record Drawings (As-Builts): Upon completion of improvements and prior to final\nacceptance, the contractor shall submit as-built drawings of the irrigation system to the\nDirector. The as-built drawings shall comply with the requirements of Subsection\n1.03(G), “As-Built Drawings,” of these Standards, and shall include the location of\nfollowing items:\n(a) Connection to existing water lines.\n(b) Routing of sprinkler pressure lines (maximum 100 feet along routing).\n(c) Sprinkler control valves.\n(d) Quick coupling valves.\n(e) Drain valves.\n(f) Drip line blow-out stubs.\n(g) Control wire routing if not with pressure main line.\n(h) All gate valves.\n(i) Other related equipment as directed by the City Manager.\n(20) Operation Instruction: Prior to final acceptance of improvements, the contractor\nshall submit three written sets of operating instructions, with cut sheets of all products,\nand a guideline summer watering program.\n(21) Controller Charts:\n(a) Controller charts shall be prepared for the Director once record (as-built)\ndrawings have been accepted.\n10-26\nDESIGN AND CONSTRUCTION STANDARDS Effective: January 2, 2023\n(b) A controller chart shall be provided for each automatic controller installed.\n(c) The controller chart may be a reproduction of the record drawing if scale permits\nfitting of the chart to the controller door. If photo reduction prints are required,\nthe reductions shall be sized to ensure full legibility.\n(d) The controller chart shall represent the actual “as-built” system, showing the\nspecific area covered by that controller.\n(e) The controller chart shall identify the area of coverage of each remote-control\nvalve, using a distinctly different pastel color on drawing over the entire area of\ncoverage.\n10-27\nCITY OF BOULDER\nDESIGN AND CONSTRUCTION STANDARDS"
  }
]