[
  {
    "corpus": "DCS",
    "chapter": 1,
    "anchor": "1.01(A)",
    "heading": "Intent",
    "page_start": 22,
    "page_end": 22,
    "verbatim": "The Design and Construction Standards (“Standards”) are intended to protect the public health,\nsafety, and welfare in the provision and maintenance of public improvements within the City of\nBoulder “City”). These Standards apply to the comprehensive design and construction of adequate\nand functional public improvements associated with developing, redeveloping and subdividing\nlands and providing necessary right-of-way, transportation, and utility services."
  },
  {
    "corpus": "DCS",
    "chapter": 1,
    "anchor": "1.01(B)",
    "heading": "Scope",
    "page_start": 22,
    "page_end": 22,
    "verbatim": "The City will review, approve, and monitor the design and construction of all public improvements\nwithin the public right-of-way or public easements to ensure compliance with these Standards.\nThe City has the sole authority for approving, accepting, or denying the design and construction of\nany public improvement."
  },
  {
    "corpus": "DCS",
    "chapter": 1,
    "anchor": "1.01(C)",
    "heading": "Minimum Standards",
    "page_start": 22,
    "page_end": 22,
    "verbatim": "(1) These Standards prescribe minimum requirements that shall be met or exceeded when\ndesigning and constructing all public improvements. Whenever the requirements of these\nStandards are found to be inconsistent with any other adopted standards, regulations, or\ncodes, the more restrictive standards, regulations, or codes shall control. Reference to any\ncode, regulation, standard, criterion, or manual of any technical society, organization, or\nassociation, or to any law or regulation of any governmental authority, whether such\nreference be specific or by implication, shall mean the most recently adopted or current\nlaw, code, regulation, standard, criterion, or manual in effect at the time of City approval\nof any project.\n(2) The design of all public improvements shall be prepared by or under the direct supervision\nof a professional Engineer duly registered and licensed in the State of Colorado. The\nconstruction of all public improvements shall be performed in a professional and\nworkmanlike manner by a contractor licensed by the City as set forth in Chapters 4-6,\n“Contractor in the Public Right of Way License,” and 8-5, “Work in the Public Right-of-\nWay and Public Easements,” Boulder Revised Code, 1981. The City assumes no\nresponsibility for supervising or directing construction activities performed by a licensed\ncontractor.\n(3) All materials and equipment used for public improvements shall be of new and good\nquality. Recycled materials and equipment may be used if they meet the quality standards\nand conditions equivalent to new materials and equipment. All materials and equipment\nshall be applied, installed, connected, erected, used, cleaned, and conditioned in\naccordance with the instructions of the applicable supplier or manufacturer, except as\notherwise prescribed."
  },
  {
    "corpus": "DCS",
    "chapter": 1,
    "anchor": "1.01(D)",
    "heading": "Terminology",
    "page_start": 22,
    "page_end": 22,
    "verbatim": "Terms, words, and abbreviations used in these Standards are defined in the Glossary (Appendix\nB)."
  },
  {
    "corpus": "DCS",
    "chapter": 1,
    "anchor": "1.02(A)",
    "heading": "Using these Standards",
    "page_start": 23,
    "page_end": 23,
    "verbatim": "(1) These Standards are to be used when designing and constructing all public improvements\nand infrastructure within the City. For the purposes of this document, public\nimprovements and infrastructure include without limitation: streets, sidewalks, trails, curb\nand gutter, curb cuts, streetscaping, water mains, fire hydrants, water services and meters,\nwastewater mains and services, manholes, stormwater mains, inlets, drainage swales and\nchannels, and other improvements intended for public purposes or for the benefit of the\ncommunity located within dedicated public rights-of-way and public easements.\n(2) These Standards also provide design and construction requirements to be used when\ndeveloping private lands that create an impact on public rights-of-way and public\neasements. The required private improvements associated with property development\ninclude without limitation: traffic mitigation, site access and driveway design, stormwater\nsite drainage and detention ponding improvements, and stormwater quality and erosion\ncontrol measures."
  },
  {
    "corpus": "DCS",
    "chapter": 1,
    "anchor": "1.02(B)",
    "heading": "Restrictions",
    "page_start": 23,
    "page_end": 23,
    "verbatim": "The descriptions in this Chapter provide the reader with a general guide to using these Standards.\nNothing in this Chapter is intended to be a substitute for the requirements, criteria, and procedures\ncontained in these Standards."
  },
  {
    "corpus": "DCS",
    "chapter": 1,
    "anchor": "1.02(C)",
    "heading": "Public Improvements Design",
    "page_start": 23,
    "page_end": 23,
    "verbatim": "(1) These Standards prescribe minimum requirements and specifications for designing\nadequate and functional public improvements. However, the design of public\nimprovements also depends on the land use zoning and comprehensive planning\nrequirements for the City, as well as the specific site geography of the land to be improved\nor developed.\n(2) The City review for approval of submitted design plans for public improvements occurs as\npart of the development review process that distributes design applications to staff in\nmultiple departments, divisions, and agencies. The Department of Public Works\ndevelopment review staff has the primary responsibility for the review and approval of\nconstruction plans for public improvements. An applicant for construction approval\nwould be well advised to consult with the Department of Public Work’s development\nreview staff prior to submitting designs for public improvements."
  },
  {
    "corpus": "DCS",
    "chapter": 1,
    "anchor": "1.02(D)",
    "heading": "Construction Approvals",
    "page_start": 23,
    "page_end": 24,
    "verbatim": "(1) An applicant seeking approval to construct public improvements in the City will need to\ndevelop engineering designs and construction plans that comply with the design and\nconstruction standards provided in this manual. In addition to complying with these\nStandards, an applicant will need to file the necessary applications and meet the\nrequirements of the City’s land use regulations, permit standards, and fee assessments as\nprescribed in the Boulder Revised Code (B.R.C.), 1981.\n(2) An applicant seeking construction approval will need to consult local master plans and the\nlocation of existing public infrastructure to develop specific project designs.\n(3) In order to develop project designs that comply with these Standards, an applicant for\nconstruction approval will need to enlist the services of a professional civil Engineer and\nprofessional land surveyor to meet the requirements for certifying acceptable designs for\npublic improvements. An applicant may consult local directories for listings of\nprofessional engineering and surveying service providers."
  },
  {
    "corpus": "DCS",
    "chapter": 1,
    "anchor": "1.02(E)",
    "heading": "Public Improvements Construction",
    "page_start": 24,
    "page_end": 24,
    "verbatim": "(1) Right-of-Way Permit: The construction of public improvements in the City public rights-\nof-way and public easements requires a right-of-way permit, as set forth in Chapter 8-5,\n“Work in the Public Right-of-Way and Public Easements,” B.R.C., 1981. An applicant\nfor construction approval will need to enlist the services of a contractor licensed with the\nCity, as set forth in Chapter 4-6, “Contractor in the Public Way License,” B.R.C. 1981, in\norder to obtain a permit to construct public improvements.\n(2) Variances\n(a) When practical difficulties are involved in meeting the provisions of these\nStandards, the Director of Public Works (“Director”) may alter, modify, or waive\nthe strict application of these Standards to allow for the reasonable use of land or\naccommodate special circumstances peculiar to such land as set forth in Section\n1.04, “Alternate Materials and Methods of Construction,” and Section 1.05,\n“Alterations, Modifications, and Waivers,” of these Standards.\n(b) Alterations, modifications, or waivers are intended only for the special purposes\ndescribed, and are not to be routinely considered or approved. Where it is\nnecessary to vary from these Standards, an applicant for construction approval\nmust clearly demonstrate that the provisions of these Standards cannot be met and\nthe alteration, modification, or waiver will create the minimum variance necessary\nto accomplish the intended purpose."
  },
  {
    "corpus": "DCS",
    "chapter": 1,
    "anchor": "1.02(F)",
    "heading": "Standards",
    "page_start": 24,
    "page_end": 25,
    "verbatim": "(1) Transportation: The transportation standards prescribed in Chapter 2, “Transportation\nDesign,” and Chapter 8, “Transportation Standards,” provide for the study, design, and\nconstruction of site accesses, streets, sidewalks, bicycle facilities, and trails. A traffic\nimpact study may be required as part of construction approvals to demonstrate adequate\ndesign and mitigation for traffic impacts associated with new streets and driveways.\n(2) Streetscapes: The streetscape standards prescribed in Chapter 3, “Streetscape Design and\nTree Protection,” and Chapter 10, “Streetscaping Standards,” provide for the selection,\ndesign, placement, and protection of trees and landscaping along public streets throughout\nthe community. The City places high value on and strongly encourages the use of\nstreetscapes as a means to calm automobile traffic, address environmental concerns for\nclean air and water quality, and enhance neighborhood qualities. General criteria are also\nincluded related to subsurface work impacting transportation infrastructure.\n(3) Water and Wastewater Utilities: The utility standards prescribed in Chapter 4, “General\nUtilities Design,” Chapter 5, “Water Design,” Chapter 6, “Wastewater Design,” and\nChapter 9, “Utilities Standards,” provide for the study, design, and construction of water\nand wastewater service facilities. These Standards detail required forecasting for sizing\nwater distribution and wastewater collection mains, specific construction requirements for\nensuring public health standards, and requirements for installing domestic water and sewer\nservice lines.\n(4) Stormwater: The stormwater standards prescribed in Chapter 7, “Stormwater Design,”\nand Chapter 9, “Utilities Standards,” provide for the study, design, and construction of\nstormwater drainage, stormwater quality and flood control improvements. Detention\nponding, storm sewer and drainageway systems, stormwater quality, and erosion control\nmeasures may be required as part of construction approval to mitigate the impacts of\nincreased runoff resulting from land development and to comply with the city’s Phase II\nMunicipal Separate Stormwater System Permit.\n(5) Technical Drawings: The standards for construction detail drawings prescribed in\nChapter 11, “Technical Drawings,” provide design requirements for specific construction\nfeatures associated with the general construction of public improvements and\ninfrastructure. These drawings are intended to supplement the design and approval of\nconstruction plans and ensure consistency in project construction to promote long-term\ndependability and maintenance of public improvements and infrastructure."
  },
  {
    "corpus": "DCS",
    "chapter": 1,
    "anchor": "1.03(A)",
    "heading": "Documentation",
    "page_start": 25,
    "page_end": 26,
    "verbatim": "(1) An applicant for construction approval shall submit required engineering reports, rights-\nof-way and easement dedications, ancillary permits and agreements, and construction\nplans in compliance with these Standards. Construction approvals are subject to the\nDirector’s review, approval, and acceptance.\n(2) Prior to approving construction plans, the Director may require an applicant to submit the\nfollowing documentation:\n(a) Engineering reports\n(b) Rights-of-way and easement dedications\n(c) Permits and agreements\n(d) Financial guarantees\n(3) Prior to issuing a right-of-way permit or building permit, the Director may require an\napplicant to submit the following documentation:\n(a) Documents listed in Section 1.03, Paragraph (A)(1), above\n(b) Construction plans\n(c) City land use approvals\n(d) Financial guarantees\n(e) Documents required by Section 8-5-4, “Permit Application,” B.R.C., 1981.\n(4) Prior to the final acceptance of public improvements, the Director may require an\napplicant to submit the following documentation:\n(a) Documents listed in Section 1.03, Paragraphs (A)(1) and (A)(2), above\n(b) As-built drawings\n(c) Testing results\n(d) Inspection approvals\n(e) Financial guarantees and warranties"
  },
  {
    "corpus": "DCS",
    "chapter": 1,
    "anchor": "1.03(B)",
    "heading": "Engineering Reports",
    "page_start": 26,
    "page_end": 27,
    "verbatim": "(1) Engineering reports required for construction approval shall be prepared as follows:\n(a) In compliance with these Standards.\n(b) Under the direct supervision of the Engineer certified as an expert in areas\ncovered in the report, and it shall be signed, sealed, and dated by the Engineer.\n(c) Containing adequate information to evaluate submitted findings and designs,\nincluding calculations, details, and references.\n(2) Engineering reports required for construction approval may include the following:\n(a) Geotechnical Soils Report, which provides geotechnical conditions and design\nrequirements based on soils investigation and testing and geologic site conditions\nin compliance with standard engineering practices for soil mechanics and\ngroundwater analysis.\n(b) Pavement Design Report, which provides geotechnical soils conditions and\nadequate pavement design requirements and structural cross-sections for roadway,\nsidewalks, trails, and parking lot construction. Pavement design shall be in\naccordance with CDOT standards.\n(c) Drainage Report and Stormwater Plan, which addresses stormwater conditions,\nimpacts, and design requirements in compliance with Section 7.04, “Final\nDrainage Report and Stormwater Plan.”\n(d) Utility Report, which addresses water and wastewater utilities service impacts,\ndemands, and design requirements in compliance with Sections 5.02, “Utility\nReport,” and 6.02, “Utility Report.”\n(e) Traffic Study, which identifies traffic impacts from proposed developments or\nroadway modifications and proposes transportation design requirements and\nmitigation measures in compliance with Section 2.02, “Traffic Study.”\n(3) The Engineer shall be responsible for correcting any error or omission in the engineering\nreport. City approval of the report in no way relieves the Engineer of any responsibility for\nerrors or omissions in the report.\n(4) An applicant for construction approval shall submit at least three copies of any required\nengineering report to the Director for review and approval. If acceptable, a City approval\nstamp signed and dated by the Director will be placed on each copy of the report. The\nCity will retain one copy as a record set, one copy as a field copy for construction\ninspection, and one copy will be returned to the applicant.\n(5) Engineering report approval expires 1 year following the date of approval, unless\nconstruction of improvements under the report has been initiated."
  },
  {
    "corpus": "DCS",
    "chapter": 1,
    "anchor": "1.03(C)",
    "heading": "Rights-of-Way and Easement Dedications, Permits, and Agreements",
    "page_start": 27,
    "page_end": 27,
    "verbatim": "(1) Rights-of-way and easements required for construction approval shall be described by a\nlicensed professional land surveyor registered in the State of Colorado and dedicated as\nfollows:\n(a) In compliance with these Standards; and\n(b) By subdivision platting or by a separate legal instrument that describes a specific\nlegal description of the dedication.\n(2) Agreements required for construction approval shall be executed and may include without\nlimitation:\n(a) Development agreement\n(b) Public improvements agreement\n(c) Public improvements extensions agreement\n(d) Subdivision agreement\n(e) Utility oversizing reimbursement agreement\n(3) Permits required for construction approval shall be of approved and issued status and may\ninclude without limitation:\n(a) City of Boulder floodplain development permit\n(b) City of Boulder right-of-way construction permit\n(c) City of Boulder revocable right-of-way permit\n(d) City of Boulder wetland permit\n(e) City of Boulder erosion control permit\n(f) Colorado Department of Transportation access permit\n(g) Colorado Department of Transportation utility permit\n(h) Railroad right-of-way encroachment permit\n(i) State of Colorado Public Health and Environment Department 401 permit\n(j) State of Colorado general permit for stormwater discharges associated with\nconstruction activities\n(k) United States Corps of Engineers 404 permit"
  },
  {
    "corpus": "DCS",
    "chapter": 1,
    "anchor": "1.03(D)",
    "heading": "Construction Plans",
    "page_start": 27,
    "page_end": 31,
    "verbatim": "(1) Preparation Standards: Construction plans required for construction approval shall be\nprepared as follows:\n(a) In compliance with these Standards;\n(b) Under the direct supervision of the Engineer certified as an expert in areas\ncovered in the report, and it shall be signed, sealed, and dated by the Engineer;\nand\n(c) With adequate information and detail to evaluate submitted designs and ensure\naccurate and functional construction of public improvements.\n(2) Drafting Standards: All construction plans shall meet the following minimum drafting\nstandards to ensure legibility and consistency; to facilitate review, construction, and public\ninspection; and to provide a clear public record.\n(a) Drawings shall be submitted in both hard copy and electronic, computer-aided\ndesign and drafting (CADD) formats to allow information to be transferred to the\nCity’s geographic information system and facilitate clear microfilming or digital\nscanning.\n(b) Electronic drawing format, or electronic CADD files, shall be in “.DXF” or\n“AutoCad.DWG” format on computer media specified by the Director of Public\nWorks. Construction plan drawings are to be layered in electronic CADD format\nby improvement type in a manner acceptable to the Director of Public Works.\nSeparate layers shall be provided for individual improvement categories including\nwithout limitation base mapping, transportation, landscaping, water, wastewater,\nand stormwater.\n(c) Hard-copy drawing format shall measure 24 inches by 36 inches and be clean,\nclear, and free from objectionable background.\n(d) Symbols and line types shall comply with Technical Drawing 1.01 in Chapter 11,\n“Drafting Standards,” and shall graphically distinguish between existing and\nproposed items.\n(e) All drawings are to be numbered in consecutive order.\n(f) Abbreviations reflected on the construction plans are to correspond to those\npresented in the Glossary.\n(g) No hand-drawn or adhesively attached information, such as Kroy lettering,\nadhesive backed reproductive film, or tape, may be placed on construction plans.\n(3) Cover Sheet: Construction plans required for obtaining construction approval shall\ninclude a cover sheet with the following elements:\n(a) Project name, with legal description of the project parcel;\n(b) Vicinity map, on a scale reflecting the location of the project and all streets within\n1 mile of the project;\n(c) Key map, on drawing sets of three sheets or more, of a scale reflecting the entire\nproject, separate drawing numbers, and street names;\n(d) Index of drawings presenting the title of each drawing and drawing number; and\n(e) The following standard construction notes:\n(i) “All work shall be performed in accordance with the “Design and\nConstruction Standards” of the City of Boulder, and shall be completed to\nthe satisfaction of the Director of Public Works. In the event that a design\nelement does not reflect City standards, the matter must be immediately\nbrought to the attention of the Engineer and the Director of Public Works.\nThe Engineer shall be responsible for recommending a solution or\nalternative solutions to the City for review and approval.”\n(ii) “The approval of a Construction Plan does not relieve the Contractor of\nthe responsibility of constructing workable public improvements. All\nrevisions and/or corrections required will be solely the Contractor's\nresponsibility, and at their expense.”\n(iii) “These Plans have been checked by the City of Boulder only for\nconformance with the “Design and Construction Standards,” compliance\nwith development agreement conditions, and for general conceptual\napproval of public improvements as shown. The City’s review does not\nverify or ensure the accuracy of existing or proposed dimensions, lines,\ncoordinates, or grades shown, including all existing utilities shown or not\nshown.”\n(iv) “Utility locations shown reflect available record data. The Contractor\nshall take precautionary measures to protect all utility lines shown and\nother utility lines otherwise located. The Contractor shall contact the\n“Utility Notification Center of Colorado” at 1-800-922-1987 or 811 for\nutility locates 24 hours prior to beginning construction.”\n(v) “Before work begins, the Contractor shall obtain a permit to work in the\nright-of-way from the City and must notify the City Right-of-Way\nInspection staff at least 24 hours in advance of commencing construction\nactivities.”\n(vi) “The Contractor shall obtain and maintain a complete and approved set of\nConstruction Plans. These drawings, and any required permits, shall be\navailable at the project site at all times and shall be made available to City\nstaff upon request. If construction plans are not readily available at the\nproject site, the Director of Public Works may issue a stop work order and\nhalt all construction activities pending compliance by the Contractor.”\n(vii) “The Contractor agrees to comply with the provisions of the Traffic\nControl Plan and the current edition of the “Manual on Uniform Traffic\nControl Devices,” “Temporary Traffic Control” section, for construction\nsignage and traffic control.”\n(viii) “All surplus materials, tools, and temporary structures, furnished by the\nContractor, shall be removed from the project site by the Contractor. All\ndebris and rubbish caused by the operations of the Contractor shall be\nremoved, and the area occupied during construction activities shall be\nrestored to its original condition, within 48 hours of project completion,\nunless otherwise directed by the Director of Public Works.”\n(ix) “The Contractor shall provide tree and landscape protection as set forth in\nChapter 6-6, “Protection of Trees and Plants,” Boulder Revised Code\n(B.R.C.) 1981 and the City of Boulder Design and Construction\nStandards (DCS). All landscaping shall be provided and maintained in\ncompliance with the approved Landscaping Plan, B.R.C. and DCS.”\n(x) “The Contractor is required to provide and maintain erosion and sediment\ncontrol measures in accordance with the Urban Drainage and Flood\nControl District “Urban Storm Drainage Criteria Manual Volume 3”, the\nM-Standard Plans of the Colorado Department of Transportation, and the\napproved stormwater management plan. The Director of Public Works\nmay require the contractor to provide additional erosion control measures\ndue to unforeseen erosion problems or if the plans do not function as\nintended.”\n(xi) \"The City of Boulder requires that sidewalks constructed have a cross\nslope of less than 2%. Sidewalks shall be designed and constructed with\ncross slopes sufficiently less than 2% to ensure that they do not exceed\nthe 2% maximum.\"\n(4) Plan Sheets: Construction plans required for construction approval may include without\nlimitation the following plan sheets:\n(a) Stormwater Management Plan, prepared in compliance with Subsection 7.13,\n“Construction Stormwater Management.”\n(b) Utility Plan, prepared in compliance with Section 4.03, “Utility Plan.”\n(c) Final Stormwater Plan, prepared in compliance with Section 7.04, “Final\nDrainage Report and Stormwater Plan.”\n(d) Traffic Control Plan, when construction plans have an impact on existing\ntransportation facilities, such as utility or access construction within existing\npublic streets, sidewalks, or trails. The plan is to be prepared in compliance with\nSection 8.04, “Temporary Traffic Control Plan,” of these Standards, the current\nedition of the “Manual on Uniform Traffic Control Devices,” “Temporary Traffic\nControl” section and as set forth in Section 8-5-10, “Temporary Traffic Control,”\nB.R.C., 1981. Plans shall include adequate provision for the detour of vehicular,\nbicycle, and pedestrian traffic.\n(e) Transportation Striping and Signage Plan, when construction plans include\ntransportation traffic control measures, such as stop signs, centerline striping, and\ntrail signage. The plan is to be prepared in compliance with the current edition of\nthe “Manual on Uniform Traffic Control Devices,” and should include the\nfollowing standard construction notes:\n(i) Contact the City of Boulder Sign Shop (303-413-7122) for location of all\nsigns prior to installation and for sign layout/details prior to ordering.\n(ii) All sign sheeting to be Class XI (DG3 material) with 3M 1150 overlay\nfilm.\n(iii) All signs shall be 0.100 gauge aluminum.\n(iv) All sign posts to be 12 gauge 2 inch unistrut.\n(v) All sign bases to be 12 gauge 2-1/4 inch unistrut.\n(vi) Sign post lengths will vary, but 7 foot minimum clearance from bottom of\nsign to ground level is required.\n(vii) All sign mount hardware to be Gator Lock System.\n(f) Construction Phasing Plan, when projects are planned to be constructed in phases.\nThe plan is to illustrate the entire project site and delineate and label each separate\nphase.\n(g) Landscaping Plan, when construction plans include streetscaping improvements\nor landscaping that has an impact on public rights-of-way or public easements.\nThe plan is to be prepared in compliance with Subsection 3.02, “Landscaping\nPlan.”\n(5) Survey Information: Construction plans shall refer horizontally to the Colorado State\nPlane Coordinate System NAD83, and are to include at least two horizontal and two\nvertical control points presenting appropriate x, y, and z coordinates. Electronic base map\nand survey control monument information is available from the City and should be used as\na basis for construction plan drawings.\n(a) Horizontal control monuments reflected on drawing sheets and survey lines are to\ncorrespond to City-recognized horizontal control points. Horizontal locations for\ndesign features are to be presented in terms of survey line stationing and offset or\nx, y coordinates.\n(b) Vertical elevation control points reflected on drawing sheets are to be tied to City-\nrecognized benchmarks with reference to the City’s vertical control network.\nVertical elevations for design features are to be presented as a z coordinate."
  },
  {
    "corpus": "DCS",
    "chapter": 1,
    "anchor": "1.03(E)",
    "heading": "Plan and Profile Drawings",
    "page_start": 31,
    "page_end": 34,
    "verbatim": "(1) Required Elements: Plan and profile drawings are required as part of the construction\nplan to ensure accurate and functional construction by the contractor when the\nconstruction is for public improvements. Plan and profile drawings are to be prepared on\nstandard engineering plan and profile grid sheets and shall contain the following elements:\n(a) Drawing border at least one-half inch from all edges of the drawing;\n(b) Title block located inside the border in the lower portion of the sheet that includes\nthe following information:\n(i) Project name, location, and sheet title;\n(ii) Name, address, and telecommunication numbers of the engineering\nconsultant preparing the drawing, and the name of the supervising\nprofessional Engineer;\n(iii) Date designed, drawn, surveyed, and checked;\n(iv) Date prepared, and dates of all revisions;\n(v) Drawing number and total number of drawings; and\n(vi) Name of electronic file;\n(c) North orientation arrow and scale;\n(d) Certification space: a 2-inch by 2-inch space near the title block reserved for the\nseal and signature of the Engineer;\n(e) Approval space: a 3-inch by 3-inch space in the lower-right corner of each\ndrawing sheet reserved for the City’s approval stamp;\n(f) Revisions information space: space for noting all revisions, separate from the\noriginal plan preparation date, that includes revision numbers, a brief description\nof what was revised, and the date of the revision;\n(g) Survey information;\n(h) Property boundaries, lot lines, public rights-of-way, and public easements, which\nare to be clearly labeled by type and dimension. Dedications previously recorded\nare to be referenced by applicable film and reception numbers;\n(i) Subdivision block, and lot numbering; and\n(j) Street names.\n(2) Plan Drawing: The “plan view” is to be located on the upper half of the drawing sheet\nand drawn to a scale of 1 inch equals 20 feet. This view contains the following\ninformation:\n(a) Existing and proposed public improvements and structures, including without\nlimitation all grading, transportation, landscaping, City-operated and non-City-\noperated public utilities (including telephone, gas, electric, cable television, fiber\noptics), irrigation ditches, and other significant features.\n(b) Match lines connecting information between drawings.\n(c) Utility information required in Section 4.03, “Utility Plan,” and the following:\n(i) Pipe type, size, class and joint restraint.\n(ii) Separation distance between existing and proposed water and wastewater\nmains and services, with horizontal and vertical location of sewer\ncrossings requiring special construction.\n(iii) Angles at alignment changes.\n(iv) Horizontal and vertical locations and sizing of water service lines and\nmeters with ties to property lines.\n(v) Horizontal and vertical locations, sizing, and types of valves, fittings,\ncontrol devices, and fire hydrants.\n(vi) Horizontal and vertical locations and sizing of manholes, cleanouts, and\nservice lines for sanitary sewers.\n(vii) Horizontal locations of soil borings.\n(viii) Horizontal locations of structures.\n(d) Stormwater information required in Section 7.04, “Final Drainage Report and\nStormwater Plan,” and the following:\n(i) Existing and proposed contours of at least 2-foot intervals.\n(ii) Existing and proposed storm drainage facilities and details, including\nstorm sewers, inlets, manholes, culverts, swales, detention ponds and\ndrainageways.\n(iii) Horizontal and vertical locations and sizing of manholes and inlets for\nstorm drainage.\n(iv) Horizontal and vertical location of existing and proposed drainage outfall\npoints.\n(e) Survey, transportation, and surface improvements information including without\nlimitation:\n(i) Survey lines and stations based on center line or flowline stationing, and\nequated to flowline at bubbles, cul-de-sacs, horizontal curves, and other\ndepartures from normal street cross sections.\n(ii) Stations and elevations of flowlines at all existing and proposed curb\nreturns, such as horizontal points of curvature (PC’s), points of tangency\n(PT’s), and points of compound curvature (PCC’s); at the high or low\npoint on all vertical curves; at inlets (including invert); and at intervals of\nno more than 50 feet along the streets.\n(iii) Existing and proposed curb return radii.\n(iv) Handicap access ramps.\n(v) Complete horizontal curve data: radius (R), delta (D), arc length (L), and\ntangent length (T).\n(vi) All crown lines, where they depart from the normal cross sections\n(transitions to existing roadways), with appropriate transition starting\nelevation.\n(vii) Centerline stations at all intersecting streets.\n(viii) Stations of drainage facilities, including inlets, manholes, and storm\nwater outfalls, and directional drainage flow arrows.\n(ix) Full width of right-of-way, intersecting roadways, street cross sections,\nsidewalks and trails, existing curb cuts, and other relevant features along\nall roadways abutting the project.\n(x) Traffic control devices, including striping, markings, signage, and signals.\n(3) Profile Drawing: The “profile view” is to be located directly below the plan view along a\nmatching survey line and stationing and is to be drawn at a horizontal scale of 1 inch\nequals 20 feet and a vertical scale of 1 inch equals 5 feet. This view shall contain the\nfollowing information:\n(a) Original and proposed ground elevations.\n(b) Stationing sequence, left to right.\n(c) Elevations labeled on both left and right sides of the drawing sheet.\n(d) Match lines.\n(e) Elevations based on center line, flow line, or invert of pipe. (Top of pipe is\nacceptable only for existing utilities.)\n(f) Stations and elevations of existing and proposed grade breaks.\n(g) Crossings of existing and proposed utilities.\n(h) Elevations of manhole inverts and rims, and service line inverts.\n(i) Elevations of inlets, top of curb, flowline, inverts, and connection locations.\n(j) Slopes or grades of wastewater and stormwater sewers.\n(k) Existing and proposed finished grades over utilities.\n(l) Street profiles, including:\n(i) Stations and elevations of existing and proposed horizontal PC, PT, PCC,\nPRC.\n(ii) Vertical curves with VPI, VPC, VPT, high point or low point (not middle\nordinate) stations and elevations.\n(iii) Center line stations of all intersecting streets.\n(iv) Grades for all profiles.\n(v) Curb flowlines at 25-foot minimum intervals, and at all vertical sags or\ncrests.\n(vi) Curb return profiles to ensure positive drainage at ramp locations.\n(4) Detail Drawings: Detail drawings are required for construction details not provided in\nChapter 11, “Technical Drawings.” Detail drawings illustrate construction details for\ncritical design features such as concrete paving sections, mechanical pipeline connections,\nand detention ponding release structures. Detail drawings are to include dimensioning,\nmaterials, specifications, and specific construction notes appropriate to each construction\ndetail.\n(5) Cross-Sectional Drawings: These drawings are required with all construction plans that\ninclude varying or transitional features, such as street sections, fill slopes, and drainage\nchannels. Cross-Sectional drawings reflect dimensions, elevations, stationing, and any\nother detailed information necessary to ensure accurate construction."
  },
  {
    "corpus": "DCS",
    "chapter": 1,
    "anchor": "1.03(F)",
    "heading": "Submittal and Approval of Construction Plans and Drawings",
    "page_start": 34,
    "page_end": 35,
    "verbatim": "(1) Submittal: An applicant for construction approval shall submit at least three drawing sets\nof any required construction plans to the Director for review and approval, including:\n(a) Original black-lined drawing set prepared by the Engineer to be stamped and\napproved by the City and returned to the Engineer\n(b) 2 Sets of black-lined prints drawing set signed, sealed, and dated on each drawing\nsheet by the Engineer to be maintained on file with the City as the record set of\nthe construction plan approval documents and for use by the City right-of-way\ninspector.\n(2) Approval: The Director will review construction plans for compliance with these\nStandards. If acceptable, a City approval stamp signed and dated by the Director will be\nplaced on each drawing sheet of the construction plans.\n(3) Effective Period: Construction plan approval expires 1 year following the date of\napproval, unless construction has been initiated. An applicant for construction approval\nmay resubmit the construction plan for reapproval, subject to review for compliance with\nstandards in effect at the time of resubmittal.\n(4) Errors and Omissions: The Engineer shall be responsible for correcting any error or\nomission in the construction plans or drawings. City approval of the construction plans in\nno way relieves the Engineer of any responsibility for errors or omissions in the plans."
  },
  {
    "corpus": "DCS",
    "chapter": 1,
    "anchor": "1.03(G)",
    "heading": "As-Built Drawings",
    "page_start": 35,
    "page_end": 35,
    "verbatim": "(1) Requirements: As-built drawings reflect the actual in-place construction of public\nimprovements.\n(a) The applicant shall submit as-built drawings for final construction approval within\n60 days from the date construction was completed and prior to City acceptance of\nany public improvements.\n(b) The applicant shall ensure that every sheet of the approved construction plans\nreflects the as-built drawings conditions.\n(2) Preparation: As-built drawings shall be prepared by the Engineer responsible for the\noriginal construction plan approved by the City. Drawings shall be prepared as follows:\n(a) In compliance with the requirements in Sections 1.03(D), “Construction Plans,”\nand 1.03(E), “Plan and Profile Drawings.”\n(b) In compliance with the requirements in Section 7.17(B), “Stormwater As-Built\nDrawings.”\n(c) Based on completed field inspections, accurate measurements, survey data, and\ntesting results, materials, and equipment records.\n(d) To reflect any variations from the approved construction plans in the public\nimprovements actually constructed.\n(3) Transfer of Responsibility: If the Engineer responsible for the original construction plan\nis replaced prior to preparing as-built drawings, the replacement Engineer shall agree in\nwriting to accept the responsibility for the design certified by the original Engineer under\nthe approved construction plan prior to City acceptance of the constructed public\nimprovements."
  },
  {
    "corpus": "DCS",
    "chapter": 1,
    "anchor": "1.03(H)",
    "heading": "Submittal and Approval of As-Built Drawings",
    "page_start": 35,
    "page_end": 36,
    "verbatim": "(1) Submittal: An applicant for construction approval shall submit at least two drawing sets\nof any required as-built drawings to the Director of Public Works for review and approval.\nAs-built drawing sets shall contain a complete black-lined print drawing set of the as-built\ndrawing set reflecting the as-built conditions and signed, sealed, and dated on each\ndrawing sheet by the Engineer.\n(2) Approval:\n(a) The Director will review the as-built drawings for compliance with these\nStandards. If acceptable, a City approval stamp, signed and dated by the Director,\nwill be placed on each drawing sheet of the as-built drawings.\n(b) The Director will not approve any construction, place in service, release financial\nguarantees, or issue utility connections for any public improvements for which\nacceptable as-built drawings have not been submitted.\n(3) Variations and Discrepancies: If any substantial variations or discrepancies, particularly\nwith respect to location, design slopes, grades, dimensions, capacities and clearances, are\ndiscovered between the approved construction plans and the public improvements actually\nconstructed, the Engineer shall propose and recommend a solution or alternative solutions\nto the City for review and approval. If no proposed alternative will satisfy the\nrequirements of these Standards, the contractor shall reconstruct the deficient public\nimprovements to comply with the approved construction plans.\n(4) Errors and Omissions: The Engineer shall be responsible for the correction of any error\nor omission in the as-built drawings. City acceptance of the as-built drawings in no way\nrelieves the Engineer of any responsibility for errors or omissions in the drawings."
  },
  {
    "corpus": "DCS",
    "chapter": 1,
    "anchor": "1.04(A)",
    "heading": "Use",
    "page_start": 36,
    "page_end": 36,
    "verbatim": "The provisions of these Standards are not intended to prevent the use of any materials or methods\nof construction, design, or compliance not specifically prescribed in these Standards, provided that\nthe alternative materials or methods of construction, design, or compliance have been approved\nand their use authorized by the Director."
  },
  {
    "corpus": "DCS",
    "chapter": 1,
    "anchor": "1.04(B)",
    "heading": "Approval",
    "page_start": 36,
    "page_end": 36,
    "verbatim": "The Director may approve an alternate material or method of construction, design, or compliance,\nprovided the proposed design is satisfactory and complies with the provisions of these Standards\nand that the material, method, or work offered is, for the purpose intended, at least the equivalent\nof that prescribed in these Standards in suitability, strength, effectiveness, durability, safety, and\nsanitation."
  },
  {
    "corpus": "DCS",
    "chapter": 1,
    "anchor": "1.04(C)",
    "heading": "Proof of Claims",
    "page_start": 36,
    "page_end": 36,
    "verbatim": "The Director will require that sufficient evidence be submitted to substantiate any claims that may\nbe made regarding an alternate material or method of construction, design, or compliance. The\ndetails of any action granting approval of an alternate material or method will be recorded and\nentered in the files of the City."
  },
  {
    "corpus": "DCS",
    "chapter": 1,
    "anchor": "1.05(A)",
    "heading": "Practical Difficulties",
    "page_start": 36,
    "page_end": 36,
    "verbatim": "When practical difficulties are involved in executing the provisions of these Standards, the\nDirector may alter, modify, or waive the strict application of these Standards, according to the\nprocess described herein."
  },
  {
    "corpus": "DCS",
    "chapter": 1,
    "anchor": "1.05(B)",
    "heading": "Criteria",
    "page_start": 36,
    "page_end": 37,
    "verbatim": "No alteration, modification, or waiver of the strict application of any provision of these Standards\nshall be granted unless the applicant clearly demonstrates and the Director finds that the following\nconditions exist:\n(1) The strict application of the provisions of these Standards would deprive an individual of\nthe reasonable use of land or structure, and\n(2) Special circumstances peculiar to such land or development justify the requested\nalteration, modification, or waiver, and\n(3) Any alteration, modification, or waiver would result in a solution consistent with the goals\nof the underlying zoning district, a Boulder Valley Comprehensive Plan goal, a specific\nneighborhood plan, or an adopted design guideline, and\n(4) Any alteration, modification, or waiver represents the minimum variance from these\nStandards that will accomplish the intended purpose, and\n(5) Any alteration or modification will at least equal the suitability, strength, effectiveness,\nfire resistance, durability, safety, and sanitation performance requirements prescribed in\nthese Standards, and\n(6) Any alteration, modification, or waiver will not harm the adjacent land owners, the\nneighborhood, or the welfare of the public at large, and\n(7) Any alteration, modification, or waiver will not create an additional maintenance or\nfinancial burden for the affected property owners or the City."
  },
  {
    "corpus": "DCS",
    "chapter": 1,
    "anchor": "1.05(C)",
    "heading": "Application Requirements",
    "page_start": 37,
    "page_end": 37,
    "verbatim": "(1) An applicant for an alteration, modification, or waiver to these Standards shall submit a\nwritten request to the Director. The request shall state in detail the specific sections and\nsubsections of these Standards requested to be altered, modified, or waived, and the\nrequest shall describe in detail why the requested waiver, alteration, or modification meets\nthe criteria in Section 1.05(B), above.\n(2) The Director may require additional documentation to support the request and shall\nrequire that sufficient evidence be submitted to substantiate any claims that may be made\nregarding alterations, modifications, or waivers to these Standards. Sufficient evidence\nmay include verification by a Colorado registered professional Engineer, possessing\nrelevant expertise in the area."
  },
  {
    "corpus": "DCS",
    "chapter": 1,
    "anchor": "1.05(D)",
    "heading": "Decision",
    "page_start": 37,
    "page_end": 38,
    "verbatim": "(1) The Director will advise the applicant, in writing, of the decision on the requested\nalteration, modification, or waiver. The Director’s decision is a final action that is\nadministrative and may be appealed through the judicial process. In granting any\nalteration or modification to these Standards, the Director may impose specific conditions\nnecessary to ensure that the criteria described in Section 1.05(B), above, are, and will\nremain, satisfied.\n(2) The Director of Public Works will consult with the Planning Director when evaluating\nissues that potentially impact urban design. The details of any decision granting approval\nof an alteration, modification, or waiver to these Standards will be entered in the form of\nwritten findings. A written log of all decisions granting alterations, modifications, or\nwaivers to these Standards will be kept current in the office of the Director of Public\nWorks and will be available for public inspection.\nCITY OF BOULDER\nDESIGN AND CONSTRUCTION STANDARDS"
  }
]