[
  {
    "corpus": "DCS",
    "chapter": 9,
    "anchor": "9.01(A)",
    "heading": "Intent",
    "page_start": 222,
    "page_end": 222,
    "verbatim": "The Utilities Standards are intended to complement the design standards specified in Chapter 4,\n“General Utilities Design,” Chapter 5, “Water Design,” Chapter 6, “Wastewater Design,” Chapter\n7, “Storm Water Design,” and Chapter 11, “Technical Drawings,” of these Standards, and provide\nminimum standards for the construction of public utilities improvements in public rights-of-way\nand public easements."
  },
  {
    "corpus": "DCS",
    "chapter": 9,
    "anchor": "9.01(B)",
    "heading": "Scope",
    "page_start": 222,
    "page_end": 222,
    "verbatim": "These Standards apply to all city-operated public utility improvements within the City of Boulder\nservice area. This chapter describes the construction of public utilities and other work within the\npublic right-of-way and public easements including, but not limited to, work activities involved,\nmaterials used, installation methods, and required testing. The utilities construction requirements\nof this chapter are in addition to those set forth in Chapter 4, “General Utilities Design,” Chapter\n5, “Water Design,” Chapter 6, “Wastewater Design,” Chapter 7, “Storm Water Design,” and\nChapter 11, “Technical Drawings,” of these Standards and the B.R.C. 1981."
  },
  {
    "corpus": "DCS",
    "chapter": 9,
    "anchor": "9.01(C)",
    "heading": "Reference Standards",
    "page_start": 222,
    "page_end": 222,
    "verbatim": "Where not specified in these Standards or the B.R.C. 1981, in order to protect the public health,\nsafety, and welfare, the Director of Public Works will specify the standards to be applied to the\ndesign and construction of utilities and may refer to one or more of the references listed in the\nReferences Section of these Standards."
  },
  {
    "corpus": "DCS",
    "chapter": 9,
    "anchor": "9.01(D)",
    "heading": "City Approval Required",
    "page_start": 222,
    "page_end": 222,
    "verbatim": "All work associated with the construction of public utilities within or upon any City of Boulder\npublic right-of-way or public easement is subject to City of Boulder approval or permit issuance\nas set forth in Chapter 8-5, “Work in the Public Right Of Way and Public Easements,” B.R.C.\n1981."
  },
  {
    "corpus": "DCS",
    "chapter": 9,
    "anchor": "9.02(A)",
    "heading": "General",
    "page_start": 222,
    "page_end": 223,
    "verbatim": "(1) Scope: This section describes excavation and trenching, which includes the following:\n(a) Necessary clearing, grubbing, and preparation of the site;\n(b) Removal and disposal of debris;\n(c) Excavation and trenching as required;\n(d) The handling, storage, transportation, and disposal of all excavated material;\n(e) Necessary sheeting, shoring, and protection work;\n(f) Preparation of subgrades;\n(g) Pumping and dewatering as necessary or required;\n(h) Protection of adjacent property\n(i) Backfilling;\n(j) Pipe embedment;\n(k) Placement of fills;\n(l) Surfacing and grading; and\n(m) Other relevant work.\n(2) Quality Assurance: All tests required for the preliminary review of materials shall be\nmade by an acceptable independent testing laboratory at the expense of the contractor.\nTwo initial gradation tests shall be made for each type of pipe bedding, fill, or backfill\nmaterial, and one additional gradation test shall be made for each additional 500 tons of\neach material. The contractor shall pay for all in-place field density tests, Proctor\nmoisture-density tests, and relative density tests on the materials as required."
  },
  {
    "corpus": "DCS",
    "chapter": 9,
    "anchor": "9.02(B)",
    "heading": "Materials",
    "page_start": 223,
    "page_end": 225,
    "verbatim": "(1) General: All bedding and backfill material shall be free of frozen material, organic\nmaterial, and debris.\n(2) Pipe Bedding: Bedding materials shall conform to the following requirements:\n(a) Bedding Materials: Bedding materials shall not contain cinders or other material\nthat may cause pipe corrosion.\n(b) Concrete Arch Encasement: A concrete arch encasement is not required unless\nimproper trenching or unexpected trench conditions require its use, as determined\nby the Director.\n(c) Granular Bedding Material: Granular bedding material shall consist of well\ngraded sand or squeegee meeting a fine aggregate standard shown in Table 9-1,\n“Granular Bedding Material.” Instead of a material meeting the requirements in\nTable 9-1, the Director may approve 3/8-inch chips conforming to the grading\nand composition requirements of Course Aggregate No. 8 in Table 703-1,\n“Concrete Aggregate Gradation Table,” of the CDOT Standard Specifications for\nRoad and Bridge Construction, 2017, due to lack of availability of the materials\nmeeting Table 9-1 requirements.\nTable 9-1: Granular Bedding Material\nSieve Size Percent Passing by Weight\n3/8-inch 100%\nNo. 4 60-100%\nNo. 8 0-45%\nNo. 16 0-30%\nNo. 50 0-6%\nNo. 200 0-2%\n(d) Compaction: All granular bedding material shall be compacted by vibrating or\nslicing with a shovel and placed in layers no more than 6 inches thick.\n(3) Stabilization Material: Stabilization material shall be placed on suitably prepared\nsubgrades and compacted by vibration. Stabilization material shall be crushed rock or\ngravel; free from dust, clay, or trash; and graded 1 ½ inch to No. 4 as defined in ASTM\nC33, and shall be compacted to not less than 70 percent relative density as determined by\nASTM D4253 and D4254.\n(4) Trench Backfill: Trench backfill is material placed above the pipe bedding and shall\nmeet specifications for Class 1 structural backfill material of Subsection 703.08\n“Structural Backfill Material,” of the CDOT Standard Specifications for Road and Bridge\nConstruction (2017), or shall be flowable fill as specified in Subsection 9.02(B)(6) of\nthese Standards..\n(5) Groundwater Barrier Material: Groundwater barrier material shall be flowable fill or\nmeet AASHTO soil classification SC or CL, free from stones, organic material or debris.\n(6) Flowable Fill: Flowable fill, meeting the standards outlined in Table 9-2, “Flowable Fill\nRequirements,” shall be used for trench backfill or for groundwater barriers.\nTable 9-2: Flowable Fill Requirements\nIngredients Lbs./C.Y. Kg/m3\nCement 50 30\nCoarse Aggregate (AASHTO No. 57 or 67) 1,700 1,009\nFine Aggregate (AASHTO M 6) 1,845 1,095\nWater (39 gallons) (147L) 325 (or as needed) 193 (or as needed)\n(a) Enough water shall be used so that the flowable fill flows into place properly\nwithout excessive segregation. Approximately 39 gallons of water per cubic yard\n(193 liters per cubic meter) of flowable fill is normally needed. Additional water\nshall not be added to the mixture at the project site.\n(b) The contractor may use aggregate that does not meet the specifications in Table\n9-2, “Flowable Fill Requirements,” if the cement is increased to 100 pounds per\ncubic yard (60 kilograms per cubic meter) and the aggregate conforms to\nfollowing gradation:\nSieve Size or Designation Percent Passing\n1 inch (25.0 mm) 100%\nNo. 200 0-10%\n(c) The contractor may make the following substitutions in the flowable fill mix:\n(i) Thirty pounds per cubic yard (18 kilograms per cubic meter) of cement\nand 30 pounds per cubic yard (18 kilograms per cubic meter) of fly ash\nfor 50 pounds per cubic yard (30 kilograms per cubic meter) of cement,\nor\n(ii) Sixty pounds per cubic yard (36 kilograms per cubic meter) of cement\nand 60 pounds per cubic yard (36 kilograms per cubic meter) of fly ash\nfor 100 pounds per cubic yard (60 kilograms per cubic meter) of cement.\n(d) The City reserves the right to review the use of recycled broken glass (glass\ncullet) as part or all of the aggregate.\n(e) Compaction of flowable fill shall not be required\n(f) The maximum layer thickness for flowable fill shall be 3-feet. Additional layers\nshall not be placed until the flowable fill has lost sufficient moisture to be walked\non without indenting more than 2-inches. Any damage resulting from placing\nflowable fill in layers that are too thick or from not allowing sufficient time\nbetween placement of layers shall be repaired at the Contractor’s expense.\n(7) Rock Backfill Material: Rock backfill material shall be an imported graded material\nthat meets either the 57/67 size requirements of ASTM C33 or the requirements for\nstabilization material specified in Subsection 9.02(B)(3) of these Standards."
  },
  {
    "corpus": "DCS",
    "chapter": 9,
    "anchor": "9.02(C)",
    "heading": "Execution",
    "page_start": 225,
    "page_end": 231,
    "verbatim": "(1) Site Preparation\n(a) All sites to be occupied by permanent construction shall be cleared of all logs,\ntrees, roots, brush, tree trimmings, and other objectionable materials and debris.\nAll stumps shall be grubbed. All waste materials shall be removed from the site\nand properly disposed.\n(b) In natural areas where excavation will occur all topsoil shall be stripped or, in the\nabsence of topsoil, the top 6 inches of surface material shall be stripped and\nstored separately from other excavated materials.\n(c) For concrete walks, roadways, parking areas, and road crossings existing\npavement shall be cut full depth to a true line before excavation. For Portland\nCement pavements, cuts shall be made at existing joints.\n(2) Classification of Excavated Materials: Excavated materials shall not be classified.\nExcavation and trenching work shall include the removal and subsequent handling of all\nmaterials excavated or otherwise removed in performance of the work, regardless of the\ntype, character, composition, or condition thereof.\n(3) Unauthorized Excavation: Undermining or tunneling under walls, footings, slabs on\ngrade, foundations, sidewalks, concrete or bituminous asphalt pavements, or any other\nsurface or subsurface facilities or structures shall not be permitted unless authorized by\nthe Director. If unauthorized tunneling or undermining occurs, the contractor shall pay\nfor all repairs and restorations the Director deems necessary. The repairs and restorations\nmay include removing and replacing part or all of the affected facility or structure.\n(4) Stabilization of Subgrades\n(a) Subgrades for concrete structures and trench bottoms shall be firm, dense,\nthoroughly compacted and consolidated, and free from mud and muck.\n(b) Subgrades for concrete structures or trench bottoms that are otherwise solid, but\nbecome mucky on top due to construction operations, shall be reinforced with\ncrushed rock or gravel meeting the requirements for stabilization material,\ndescribed in Subsection 9.02(B)(3) of these Standards and approved by the\nDirector.\n(c) Stabilization material shall be spread and compacted to a depth of not more than\n4 inches. However, if the required depth exceeds 4 inches, the subgrade for\nconcrete structures or trench bottom shall be re-excavated and all mud and muck\nremoved and replaced with stabilization material, as required by Subsection\n9.02(B)(3) of these Standards and approved by the Director.\n(d) This material shall be placed, and compacted, as prescribed in these Standards.\nThe finished elevation of stabilized subgrades shall not be above subgrade\nelevations indicated on the drawings.\n(5) Blasting: Blasting or other use of explosives for excavation will not be permitted.\n(6) Shoring\n(a) All excavations shall be properly shored and braced to meet federal, state and\nlocal laws governing safe working conditions. The shoring shall be arranged so\nthat no stress is placed on any portion of the completed work until the general\nconstruction thereof has proceeded far enough to provide ample strength.\n(b) Shoring shall be removed as the work progresses. Trench sheeting shall not be\npulled before backfilling unless the pipe strength is sufficient to carry trench\nloads based on trench width to the back of sheeting, nor shall sheeting be pulled\nafter backfilling.\n(c) Where trench sheeting is left in place, such sheeting shall not be braced against\nthe pipe, but shall be supported in a manner that will preclude concentrated loads\nor horizontal thrusts on the pipe. Cross braces installed above the pipe to support\nsheeting may be removed after pipe embedment has been completed.\n(d) The contractor shall pay to repair any damage to pipes or structures resulting\nfrom missing, failed or improper shoring, sheeting, or bracing or any negligence\non the part of the contractor.\n(7) Water Control and Dewatering\n(a) Dewatering equipment shall be provided to remove and dispose of all surface\nwater and groundwater entering excavations, trenches, or other parts of the work.\nEach excavation shall be kept dry during subgrade preparation and until the\nstructure to be built or the pipe to be installed is completed to the extent that no\ndamage from hydrostatic pressure, flotation, or other cause will result.\n(b) All excavations for concrete structures or trenches that extend down to or below\nthe groundwater table shall be dewatered by lowering and keeping the\ngroundwater level 12 inches or more below the bottom of the excavation.\n(c) Surface water shall be diverted or otherwise prevented from entering the\nexcavated areas or trenches to the greatest extent practicable without causing\ndamage to adjacent property.\n(d) The contractor shall be responsible for the condition of any pipe or conduit used\nfor drainage purposes. All such pipe or conduit shall be left clean and free of\nsediment.\n(8) Trench Excavation: Trenches shall be excavated so that pipes can be laid according to\nthe profiles, grades, elevations, and minimum cover shown on the drawings or specified\nin these Standards. Trench subgrades shall be clean and free of loose material of any\nkind.\n(a) Excavation in Streets and Other Paved Surfaces: Excavations in streets with\nasphalt paving must be confined to the minimum width required to maintain a\nsafe trench condition. The contractor shall pay for replacing any pavement\ndamage resulting from their construction work. The Director will determine the\nlimits of the damaged pavement needing replacement.\n(b) Minimum Cover: Where pipe grades or elevations are not definitely fixed by the\napproved plans, trenches shall be excavated to a depth sufficient to provide a\nminimum depth of backfill cover over the top of the pipe as follows:\n(i) Water lines require at least 4.5 feet of cover;\n(ii) Sanitary sewers require at least 3 feet of cover; and\n(iii) Storm sewers require at least 1.5 feet of cover.\n(c) Trench Widths\n(i) Trench widths shall be as shown below where the maximum trench\nwidth is measured at the top of the pipe barrel:\nPipe Diameter Maximum Trench Pipe Diameter Maximum Trench\nInches Inches Inches Inches\n4 24 24 48\n6 26 27 52\n8 28 30 56\n10 30 33 60\n12 34 36 68\n14 36 39 72\n15 37 42 76\n16 38 48 82\n18 40 54 90\n20 42 72 110\n21 44\n(ii) If the stated maximum trench widths are exceeded, and if the Director\ndetermines that the combined dead- and live-loads will exceed the design\nloadings on the pipe, the Director may require the contractor to either\ncradle the pipe in concrete or use a pipe of a stronger class. Remedial\nmeasures shall be entirely at the contractor’s expense.\n(iii) As illustrated on Drawing No. 4.03 in Chapter 11, “Technical\nDrawings,” of these Standards, the pipe trench shall be excavated to a\ndepth below the bottom of the pipe, backfilled with the specified granular\nbedding material, and compacted to the requirements of these Standards.\n(d) Trench Walls\n(i) The contractor may slope or bench trench sidewalls in areas where an\nincreased trench width will not interfere with surface features or other\nutilities. Such sloping or benching shall terminate at least 1 foot above\nthe top of the pipe barrel; from that point down, the trench wall shall be\nvertical.\n(ii) The trenching operation, including the spoil bank and the sloping of\ntrench sidewalls, shall be confined to the width of any permanent and\ntemporary rights-of-way or easements.\n(iii) A sufficient clear area shall be maintained away from the top edge of the\nexcavation to avoid overloading that may cause slides or caving of the\ntrench walls. The excavated material shall be kept trimmed to avoid\ninconveniencing the public and adjoining property owners. Unless\notherwise authorized by the Director, all public thoroughfares and\ncrossroads shall be kept open to traffic. When required by the Director,\nthe contractor shall, at their own expense, provide open-cut bridging at\nstreet crossings, sidewalks, and other necessary points to prevent serious\ntravel interruptions and to provide access to fire hydrants and public and\nprivate premises.\n(e) Trench Preparation\n(i) The trench shall be excavated only so far in advance of pipe laying as\npermitted by the Director. Trench preparation shall also conform to the\ndetails shown on the drawings in Chapter 11, “Technical Drawings,” of\nthese Standards.\n(ii) Bell holes in the trench bottom shall be provided at each joint to permit\nthe jointing to be made properly and to prevent the pipe from bearing on\nthe pipe bells.\n(iii) After excavation, the trench bottom shall be uniformly graded and hand-\nshaped so that the pipe barrel (exclusive of the joint) will have uniform\nand continuous bearing on thoroughly compacted pipe bedding material\nthroughout the length of the pipe.\n(iv) The trench grade shall permit the pipe spigot to be accurately centered in\nthe preceding laid pipe joint, without lifting the pipe above the grade and\nwithout exceeding the permissible joint deflection. If raising the pipe\nsubgrade is necessary, and approved by the Director, compacted bedding\nmaterial may be used at the contractor’s expense.\n(f) Excavation Material: Excess excavated material shall be removed from the\nconstruction site and disposed of by the contractor.\n(g) Rock Excavation: In the event of rock excavation, the bottom of the trench shall\nbe lowered so that the bottom of the trench is 6 inches below the outside surface\nof the pipe. The space between the rock and the pipe shall be filled with granular\nbedding material. During its placement, the bedding material shall be shaped to\nprovide support along the full length of pipe.\n(9) Installation of Pipe Bedding\n(a) Pipe bedding material shall consist of the material as specified in Subsection\n9.02(B)(2) of these Standards. Bedding material shall be placed to provide the\ngrade and elevation specified on the approved plans.\n(b) After bedding material has been placed and approved, and after the pipe has been\ninstalled and approved, the additional granular bedding material shall be installed\nto an elevation 12 inches above the top of the pipe.\n(10) Installation of Trench Backfill\n(a) Backfilling during freezing weather shall not be performed, except by permission\nof the Director. No backfill shall be installed on frozen surfaces, nor shall frozen\nmaterials, snow, or ice be placed in any backfill.\n(b) Unless accurate results cannot be obtained, the compaction requirements shall\nconform to maximum dry density according to ASTM D698, Moisture- Density\nRelations of Soils (Standard Proctor). When the ASTM D698 test is not\napplicable, the percentage compaction requirements shall conform to ASTM\nD2049 Test for Relative Density of Cohesionless Soils.\n(c) When required by the Director, the contractor shall excavate backfilled trenches\nfor purposes of performing compaction tests at locations and depths determined\nby the Director. The contractor shall be responsible for reinstalling and\nrecompacting the test excavations.\n(d) All backfill above the bedding material shall be carefully placed and compacted.\nExcept for the backfill requirements as set forth under Section 8-5-12, “Standards\nfor Repairs and Restoration of Pavement or Sidewalks,” B.R.C. 1981, approved\nbackfill material shall be placed in loose lifts, not exceeding 8 inches thick, and\nshall be compacted by equipment and means approved by the Director. If the\ncontractor wishes to use equipment and means other than what was approved for\nthe project by the Director, the contractor shall submit, in writing, a request for\napproval of the proposed equipment and means to the Director for review and\napproval. Any approval by the Director, of an alternate method of compaction\nshall not relieve the contractor from providing a finished product that meets or\nexceeds all the intents and requirements of the approved plans and these\nStandards.\n(e) All backfill shall be compacted to 95 percent of maximum laboratory dry density\nor 70 percent relative density. The material shall be within 2 percent of optimum\nmoisture content.\n(f) A loose layer of backfill material not more than 8 inches deep may be placed\nover concrete arch encasement or concrete reaction blocking after the concrete\nhas reached its initial set, to aid curing. No additional backfill shall be placed\nover arch encasement or blocking until the concrete has been in place for at least\n3 days.\n(11) Structural Excavation and Backfill\n(a) All structural excavations shall provide adequate working space and clearances\nfor the work to be performed therein and for installation and removal of concrete\nforms. In no case shall excavation faces be undercut for extended footings.\n(b) The quality and moisture content of materials for backfill around and outside of\nstructures shall conform to the requirements for materials used for earthfills and\nembankments. Backfill materials shall be placed in loose lifts, not to exceed 8\ninches in thickness, and shall be compacted to at least 95 percent of maximum\ndry density at optimum moisture content as determined by ASTM D698.\nCompaction of structure backfill by rolling will be permitted, provided the\ndesired compaction is obtained and damage to the structure is prevented.\nCompaction of structure backfill by inundation with water will not be permitted.\n(c) No backfill shall be deposited or compacted in water.\n(d) Particular care shall be taken to compact structure backfill that will be beneath\npipes, drives, roads, parking areas, walks, curbs, gutters, or other surface\nconstruction or structures. In addition, wherever a trench is to pass through\nstructure backfill, the structure backfill shall be placed and compacted to an\nelevation not less that 12 inches above the top of pipe elevation before the trench\nis excavated. Compacted areas, in each case, shall be adequate to support the\nitem to be constructed or placed thereon.\n(12) Restoration\n(a) Streets and Roadways: Any pavements disturbed during construction shall be\nrepaired in accordance with the requirements as set forth in Section 8-5-12,\n“Standards for Repairs and Restoration of Pavement or Sidewalks,” B.R.C. 1981.\nAll dirt and debris, including dust shall be removed from streets and paved\nsurfaces within 3 days of the restoration of streets and paved surfaces. Initial\nremoval of dirt and debris shall be made using a vacuum sweeper, after which the\npaved surfaces shall be cleaned using water hoses.\n(b) Fencing and Culverts: Restore all existing structures to conditions equal to or\nexceeding existing structures.\n(c) Landscape\n(i) After other outside work has been finished, and backfilling and\nembankments completed and settled, all areas that are to be graded shall\nbe brought to grade at the indicated elevations, slopes, and contours. All\ncuts, fills, embankments, and other areas that have been disturbed or\ndamaged by construction operations shall be surfaced with topsoil to a\ndepth of at least 4 inches. Topsoil shall be of a quality at least equal to\nthe existing topsoil in adjacent areas, free from trash, stones, and debris,\nand well suited to support plant growth.\n(ii) Use of graders or other power equipment will be permitted for final\ngrading and dressing of slopes, provided the result is uniform and\nequivalent to hand work. All surfaces shall be graded to secure effective\ndrainage. Unless otherwise indicated, a slope of at least 1 percent shall\nbe provided.\n(iii) Final grading and surfacing shall be smooth, even, and free from clods\nand stones larger than 1 inch in greatest dimension, weeds, brush, and\nother debris.\n(iv) The top portion of backfill beneath established lawn areas shall be\nfinished with at least 12 inches of topsoil corresponding to, or better\nthan, that underlying adjoining lawn areas.\n(v) The Director will clarify restoration of other minor items as construction\nproceeds. Such items must be restored to equal or exceed existing\nconditions.\n(13) Cleanup: The contractor shall maintain a clean site at all times. Prior to final inspection\nand acceptance, the contractor shall remove all rubbish and excess materials and leave the\narea in a neat, satisfactory condition.\n(14) Maintenance of Backfill: All backfill shall be maintained in a satisfactory condition and\nall places showing signs of settlement shall be filled and maintained for a period of 2\nyears following the date of final acceptance of all work. When the contractor discovers\nor is notified by the City that any backfill is not in compliance with City standards, the\ncontractor shall correct such conditions. Any utilities and road surfacing damaged by\nsuch settlement shall be repaired by the contractor to the satisfaction of the City. In\naddition, the contractor shall be responsible for the cost of all claims for damages due to\nsettlement of backfilled areas."
  },
  {
    "corpus": "DCS",
    "chapter": 9,
    "anchor": "9.03(A)",
    "heading": "General",
    "page_start": 231,
    "page_end": 231,
    "verbatim": "(1) Scope: This section describes the furnishing and installation of ductile iron pipe and\nappurtenances for potable water mains, water services and fire lines in the pipe diameter\nsize range of 4 inches to 30 inches.\n(2) Quality Assurance: Manufacturer’s certificates of compliance and installation\nrecommendations shall be provided to the City inspector prior to construction.\nInstallation recommendations shall be followed during construction."
  },
  {
    "corpus": "DCS",
    "chapter": 9,
    "anchor": "9.03(B)",
    "heading": "Materials",
    "page_start": 231,
    "page_end": 232,
    "verbatim": "(1) Ductile Iron Pipe\n(a) Unless revised on the approved drawings, the ductile-iron pipe shall conform to\nANSI A21.51, AWWA C151, Class 52 thickness. The interior of each length of\npipe shall have a cement-mortar lining, conforming to the requirements set forth\nin ANSI A21.4, AWWA C104, of standard thickness. The exterior of the pipe\nshall be coated with standard coating approximately 1 mil thick.\n(b) Unless otherwise specified, the pipe joint shall be the “push-on” type, made in\naccordance with ANSI A21.11, AWWA C111, and the gaskets shall be standard\nfor buried water service and as provided by the pipe manufacturer.\n(2) Polyethylene Wrap\n(a) All ductile iron pipeline and fittings shall be wrapped in polyethylene film in\naccordance with the requirements of ANSI A21.5, AWWA C105 and in\naccordance with all recommendations and practices of the AWWA M4 l, Manual\nof Water Supply Practices - Ductile Iron Pipe and Fittings.\n(b) The polyethylene wrap shall be overlapped 1 foot in each direction at all\nconnections.\n(c) The polyethylene wrap shall consist of three layers of co-extruded linear low-\ndensity polyethylene (LLD PE), fused into a single thickness of not less than 8\nmils.\n(d) The inside surface of the polyethylene wrap to be in contact with the pipe\nexterior can be infused with a blend of anti-microbial biocide to mitigate\nmicrobiologically influenced corrosion and a volatile corrosion inhibitor to\ncontrol galvanic corrosion.\n(e) Tube Size or Sheet Width: Table 9-3, “Tube Size and Sheet Width for Pipe\nDiameter,” shows the tube size or sheet width for each pipe diameter.\nTable 9-3: Tube Size and Sheet Width for Pipe Diameter\nNominal Pipe Diameter (Inches) Flat Tube (Inches) Minimum Sheet Width (Inches)\n4” 16” 32”\n6” 20” 40”\n8” 24” 48”\n10” 27” 54”\n12” 30” 60”\n14” 34” 68”\n16” 37” 74”\n18” 41” 82”\n20” 45” 90”\n24” 54” 108”"
  },
  {
    "corpus": "DCS",
    "chapter": 9,
    "anchor": "9.03(C)",
    "heading": "Thrust Restraint",
    "page_start": 232,
    "page_end": 232,
    "verbatim": "Where designated by the Engineer with expertise in thrust restraint systems, or where existing\nconditions do not permit the use of concrete thrust blocks, individual joint restraint systems shall\nbe provided as follows:\n(1) Alternative A: Full length tie rods between joints. “Star” systems fabricated from “Cor-\nTen” steel or an equivalent according to the requirements of ASTM A-242 with a\nminimum yield stress of 46,000 psi. The number and diameter of tie rods shall be as\nshown on the detail drawings.\n(2) Alternative B: Pacific States Lock Mechanical Joint with Tyton Joint Core, or equivalent\nfittings with ductile iron joint restraint features conforming to ANSI Standard A21.10.\nPush-on joints for such fittings shall be in accordance with AWWA Standard A121.11.\nAssembly of the joint portion of the product shall be in accordance with AWWA C600-\n77\n(3) Alternative C\n(a) Follower gland type systems may be used for 12-inch diameter pipe and smaller.\nPipe clamps shall be fabricated from “Cor-Ten” steel or an equivalent according\nto the requirements of ASTM A-242 with a minimum yield stress of 46,000 psi.\nThe number and diameter of tie rods shall be as shown on the detail drawings.\nThe follower gland shall be manufactured of ductile iron conforming to ASTM\nA536. Dimensions of the gland shall be such that it can be used with the\nstandardized mechanical joint bell and tee head bolts conforming to AWWA\nC111 and C153.\n(b) The restraint mechanism shall consist of numerous individually activated\ngripping surfaces to maximize restraint capability. Twist-off nuts, sized the same\nas tee head bolts, shall be used to ensure proper actuating of restraining devices.\nWhen the nut is sheared off, a standard hex nut shall remain. The device shall\nhave a working pressure of at least 200-psi with a minimum safety factor of 2:1.\n(c) Follower gland joint restraint devices shall be of the type listed below:\n(i) “EBAA Iron, Inc.,” Megalug 1100 Series (4 -12 inches)\n(ii) “Uniflange,”1400 Series (4 -12 inches)"
  },
  {
    "corpus": "DCS",
    "chapter": 9,
    "anchor": "9.03(D)",
    "heading": "Connections to the Existing System",
    "page_start": 233,
    "page_end": 233,
    "verbatim": "(1) System Operation: Operation of the existing system must at all times remain under the\ncontrol of the Director. The contractor shall operate no valves or hydrants on the system\nwithout permission from the Director.\n(2) Connections: All points at which the existing water systems are to be disconnected and\nconnected to the new mains must be shown on the approved drawings.\n(3) Utility Service Interruptions: The contractor shall take all precautions necessary to\nminimize interruption of all utility services and will be responsible for the restoration of\nthe affected service. The contractor shall schedule existing valve locates with the Director\nat least 3 days before scheduling a shutoff.\n(4) Customer Notification: Unless otherwise specified, at any time a customer on the\nexisting system will be deprived of a supply of water, the contractor shall advise such\ncustomer in writing 24 hours in advance of when the supply will be disconnected and\nreestablished."
  },
  {
    "corpus": "DCS",
    "chapter": 9,
    "anchor": "9.03(E)",
    "heading": "Execution",
    "page_start": 233,
    "page_end": 235,
    "verbatim": "(1) Installation of Ductile Iron Pipe: Except as specified herein or unless specifically\nauthorized by the Director, all installation of pipe shall conform to the recommendations\ncontained in “Installation Guide for Ductile Iron Pipe,” published by the Ductile Iron\nPipe Research Association. The contractor shall assure that a copy is available at the job\nsite.\n(a) Pipe Laying\n(i) Pipe shall be laid with bell ends facing in the direction of laying, unless\ndirected otherwise by the Director. Pipe shall be laid on the bedding\nwith support over the full length of the pipe barrel.\n(ii) Table 9-4, “Ductile Iron Pipe Deflection,” shows the maximum\nallowable pipe joint deflections.\n(iii) The information in the columns referring to the deflection and the\napproximate radii shall be adjusted for pipe lengths different than 18-foot\nlengths. Shorter pipe lengths will be required if a shorter radius is called\nfor on the approved construction plans. Double hubs may be used to lay\npipelines on curved alignment.\nTable 9-4: Ductile-Iron Pipe Deflection\nApproximate Radius of Curve Produced by:\nSize of Pipe (Inches) Bend in One Joint (%) Deflection in One 18- Succession of 18-Foot\nFoot Length (Inches) Joints (Feet)\n4 -12 4 15 250\n14 - 24 2 7.5 510\n(iv) Vertical deflections shall not exceed any of the above values.\n(v) When pipe laying is not in progress, the open ends of pipe shall be closed\nby a watertight plug or other means approved by the Director.\n(vi) The cutting of pipe for inserting valves, fittings, or closure pieces shall\nbe done in a neat and workmanlike manner without damage to the pipe\nor cement lining so as to leave a smooth end at right angles to the axis of\nthe pipe. The flame cutting of pipe by means of an oxyacetylene torch\nwill not be allowed. The pipe end shall be beveled and free of sharp\nedges that could damage the gasket during installation.\n(b) Mechanical Joints: Mechanical joints shall be installed per the manufacturer’s\nspecifications and guidelines.\n(c) Push-On Joints: For push-on joints, the exterior 4 inches of the pipe at the spigot\nend and the inside of the adjoining bell and particularly the groove for the gasket\nshall be thoroughly cleaned to remove oil, grit, tar (other than standard coating),\nand other foreign matter. The proper gasket supplied with the pipe shall be\nplaced in the bell in compliance with the manufacturer’s specifications and\nguidelines so it will spring into its proper place inside the pipe bell. A thin film\nof the pipe manufacturer’s joint lubricant shall be applied to the gasket over its\nentire exposed surface. The spigot end of the pipe shall then be wiped clean and\ninserted into the bell to contact the gasket by crowbar, or by jack and choker\nslings. The location of the gasket shall be checked with a gauge or tool designed\nfor that purpose to assure that the gasket is in the proper position.\n(d) Installation of Polyethylene Wrap\n(i) All pipeline and fittings shall be wrapped in polyethylene film in\naccordance with the requirements of ANSI A21.5, AWWA C105 and in\naccordance with all recommendations and practices of the AWWA M4 l,\nManual of Water Supply Practices -Ductile Iron Pipe and Fittings.\n(ii) The polyethylene wrap shall be overlapped 1 foot in each direction at all\nconnections.\n(iii) The polyethylene wrap shall consist of three layers of co-extruded linear\nlow-density polyethylene (LLD PE), fused into a single thickness of not\nless than 8 mils.\n(iv) The inside surface of the polyethylene wrap to be in contact with the pipe\nexterior can be infused with a blend of anti-microbial biocide to mitigate\nmicrobiologically influenced corrosion and a volatile corrosion inhibitor\nto control galvanic corrosion.\n(2) Installation of Thrust Restraint\n(a) Thrust blocks shall be poured between undisturbed solid ground and the fitting to\nbe anchored. The area of bearing on the undisturbed trench wall shall be that\nshown on the thrust block detail or directed by the Director. The concrete shall\nbe placed so that the pipe or fitting joints will be accessible for repair. A bond\nbreaker shall be placed over the fitting before placing concrete.\n(b) Full length tie rods between joints with pipe clamps shall be assembled using\nclamps on each side of pipe bells with tie rods extending the full pipe length for\nthe dimensions shown on the drawings each direction from the restrained fitting,\nvalve or joint. Clamps shall be installed tight enough to prevent twisting around\nthe pipe. A washer shall be used at each clamp and tie rods shall be located on\neach side of the pipe. The tie rod nut should first be hand tightened with a 12-\ninch wrench (approximately 50 to 100 foot-pounds torque). Threaded tie rods\nshall extend two full threads past each nut in the final position.\n(c) Follower gland type joint restraint systems shall be assembled according to\nmanufacturer’s instructions.\n(3) Testing: Testing of ductile iron pipe shall be as specified in Section 9.13, “Testing of\nWater Pipes,” of these Standards.\n(4) Backfilling and Restoring Surface Conditions: Surface conditions shall be backfilled\nand restored as specified in Section 9.02, “Excavation and Trenching,” of these\nStandards.\n(5) Disinfecting Potable Pipelines: Ductile iron pipe shall be disinfected as specified\nSection 9.12, “Disinfecting Waterlines,” of these Standards."
  },
  {
    "corpus": "DCS",
    "chapter": 9,
    "anchor": "9.04(A)",
    "heading": "General",
    "page_start": 235,
    "page_end": 235,
    "verbatim": "(1) Scope: This section describes the furnishing and installation of polyvinyl chloride (PVC)\npressure pipe and appurtenances for potable water mains, water services and fire lines in\nthe pipe diameter size range of 4 to 12 inches.\n(2) Quality Assurance: Manufacturer’s certificates of compliance and installation\nrecommendations shall be provided to the City inspector prior to construction.\nInstallation recommendations shall be followed during construction."
  },
  {
    "corpus": "DCS",
    "chapter": 9,
    "anchor": "9.04(B)",
    "heading": "Materials",
    "page_start": 235,
    "page_end": 236,
    "verbatim": "(1) PVC Pressure Pipe\n(a) All PVC pipe shall meet the requirements of AWWA C-900-16, Polyvinyl\nChloride Pressure Pipe and Fabricated Fittings (4 – 12 inches) and shall be\nPressure Class 305 psi (DR 14), or shall meet the requirements of AWWA C-\n905-08, Polyvinyl Chloride Pressure Pipe and Fabricated Fittings (14 – 48\ninches) and shall be Pressure Class 235 psi (DR 18).\n(b) All pipe shall be suitable for use as a pressure conduit. Provisions must be made\nfor expansion and contraction at each joint with a rubber ring. The bell shall\nconsist of an integral wall section with a solid cross-section rubber ring which\nmeets the requirements of AWWA C-900-07.\n(c) Laying length of pipe shall be 20 feet for all sizes of pipe.\n(d) Each length of pipe shall bear the date manufactured, type, grade, length,\nmanufacturer's name, and NSF seal of approval.\n(e) Pipe joints shall be made using an integral bell with an elastomeric gasket push-\non type joint.\n(f) Solvent cement joints are prohibited.\n(g) The manufacturer shall furnish a certified statement that all specified tests and\ninspections have been made and the results thereof comply with the AWWA\nstandards specified in this Subsection 9.04(B). A copy of the certification shall be\nsent to the City upon request.\n(2) Polyethylene Encasement\n(a) All pipeline fittings and appurtenances shall be encased in polyethylene film in\naccordance with the requirements of ANSI A21.5, AWWA C105.\n(b) The finished polyethylene film shall have a minimum nominal thickness of\n0.008-inch (8 mil), and the minus tolerance on thickness shall not exceed 10\npercent of the nominal thickness. The film shall have at least 1200-psi tensile\nstrength of with an elongation of 300 percent minimum. The dielectric strength\nshall be at least 800 volts per mil thick.\n(3) Tracer Cable: Tracer wire shall be Type THHN, AWG size #12, UL listed with a single\ncopper conductor, PVC insulation, and nylon jacket. Test stations at fire hydrants shall\nbe CP Test Services, Glenn Series Glenn-4 with locking lid, 3½ x 4 inches, or approved\nequal."
  },
  {
    "corpus": "DCS",
    "chapter": 9,
    "anchor": "9.04(C)",
    "heading": "Thrust Restraint",
    "page_start": 236,
    "page_end": 237,
    "verbatim": "(1) Required: All fittings and joints shall be restraint from movement due to hydraulic\nforces with concrete thrust blocks as shown in Chapter 11, “Technical Drawings,” of\nthese Standards except where existing conditions or other practical difficulties do not\npermit the use of concrete thrust blocks. Where the applicant demonstrates to the\nsatisfaction of the Director that existing conditions or other practical difficulties do not\npermit the use of concrete thrust blocks, individual restraint systems shall be provided\nmeeting one of the following:\n(a) Alternative A - Full Length Threaded Tie Rods: Threaded rods shall be Type\n316L stainless steel coated with an anti-galling compound. Connecting T-bolts\nand nuts shall be Type 316L stainless steel coated with an anti-galling compound\nor corrosion resistant fluorocarbon coating such as “NSS Industries” Cor-Blue or\n“Star Pipe Products” Core Blue. The number and diameter of tie rods shall be as\nshown on the approved plans.\n(b) Alternative B - Follower Gland Type Mechanical Joint Restraint Systems:\nFollower gland type mechanical joint restraint systems may be used only for 16-\ninch diameter and smaller pipe. Restraint rings shall be manufactured of ductile\niron conforming to ASTM A536, Grade 65-45-12 with a factory applied fusion\nepoxy coating. The mechanical joint follower gland shall be incorporated into the\nrestraint. Connecting T-bolts and nuts shall be as required in Alternative A.\n(c) Alternative C - Bolt-Through Positive Restraint Mechanisms: A bolt-through\npositive restraint mechanism may be used only for connecting 12-inch diameter\nand smaller mechanical joint valves and fittings. It shall not be used for pipe\nattachment or fire hydrant connections. Adaptor body shall be made of ductile\niron, conforming to ASTM A536 80-55-06 with styrene butadiene rubber gaskets\nconforming to AWWA C111. Connecting T-bolts and nuts shall be as required in\nAlternative A.\n(2) Bell-And-Spigot Joints: Restraint devices for PVC pipe bell-and-spigot joints may be\nused, if approved by the Director, for sizes 4 to 16 inches. Devices shall be of ductile\niron conforming to ASTM A536. Connecting T-bolts and rods as required in Alternative\nA.\n(3) Mechanical Joint Restraint Required: Mechanical joint restraint devices are required for\nthe following installations:\n(a) Fire hydrants;\n(b) Fire line connections;\n(c) Three inch and larger domestic line connections;\n(d) Reducers;\n(e) Vertical and horizontal offsets (all angles);\n(f) Bends, line valves, and fittings;\n(g) Bulkheads and plugs;\n(h) Bored casing carrier pipe; and\n(i) When the bearing capacity of the soil is not sufficient to provide adequate restraint,\nas determined by the Director.\n(4) Mechanical Joint Restraint Design Requirements: The mechanical restraint mechanism\nshall consist of numerous individually activated gripping surfaces to maximize restraint\ncapability; or a series of machined serrations designed to grip the entire pipe surface; or a\nsystem that is integral to the gasket. For twist-off nut-type designs, the nuts shall be sized\nthe same as T- bolts and be used to insure proper actuating of restraining devices. When\nthe nut head is sheared off, a standard hex nut shall remain. All devices shall have a\nworking pressure of at least 200 psi with a minimum safety factor of 2:1.\n(5) Follower Gland Type Joint Restraints: Follower gland type joint restraint devices shall\nbe of the type listed below:\n(a) “EBAA Iron”\n(i) Megalug 2000 Series for PVC (4 to 16 inches)\n(ii) Megalug 1600 Series for PVC (4 to 12 inches) Pipe Bell Joints\n(iii) Megalug 2800 Series for PVC (14 inches and larger)\n(b) “Star Pipe Products”\n(i) Domestic PVC Stargrip Series 4000 (4 to 12 inches)\n(ii) Domestic 1100C Bell Restrainers Series 1100 for PVC Pipe Bell Joints\n(c) “U.S. Pipe”: MJ FIELD LOK Gasket with MJ FIELD LOK Gland, Series for PVC\n(4 to 12 inches)\n(d) “Romac Industries”: PVC RomaGrip Series, fusion bonded polyester coating is\nrequired if using C909 PVC\n(6) Bolt-Through Mechanical Joint Restraints: Bolt-through mechanical joint restraint\ndevices shall be of the type listed below:\n(a) “Infact Corporation”: Foster Adaptor (4 to12 inches) with fusion bonded epoxy\ncoating. Standard foster adaptor accessory pak is required for restraining C153\ncompact fittings and valves"
  },
  {
    "corpus": "DCS",
    "chapter": 9,
    "anchor": "9.04(D)",
    "heading": "Connections to the Existing System",
    "page_start": 238,
    "page_end": 238,
    "verbatim": "(1) System Operation: Operation of the existing system must at all times remain under the\ncontrol of the Director. The contractor shall operate no valves or hydrants on the system\nwithout permission from the Director.\n(2) Connections: All points at which the existing water systems are to be disconnected and\nconnected to the new mains must be shown on the approved construction plans.\n(3) Utility Service Interruptions: The contractor shall take all precautions necessary to\nminimize interruption of all utility services and will be responsible for the restoration of\nthe effected service. The contractor shall schedule existing valve locates with the\nDirector at least 3 days before scheduling a shutoff.\n(4) Customer Notification: Unless otherwise specified, at any time a customer on the\nexisting system will be deprived of a supply of water, the owner-developer-contractor\nshall advise such customer in writing 24 hours in advance of when the supply will be\ndisconnected and when the supply will again be available."
  },
  {
    "corpus": "DCS",
    "chapter": 9,
    "anchor": "9.04(E)",
    "heading": "Execution",
    "page_start": 238,
    "page_end": 240,
    "verbatim": "(1) Installation of PVC Pressure Pipe: Unless specifically authorized by the Director, all\npipe shall be installed as follows:\n(a) Pipe Laying\n(i) Pipe shall be laid with bell ends facing in the direction of laying. No\ndeflection in the joints shall be allowed. Whenever it is necessary to\ndeflect pipe from a straight line, either in the vertical or horizontal plane,\nto avoid obstructions or to plumb valve operators, the pipe itself may be\nuniformly curved as shown in Table 9-5, “Pipe Laying.”\nTable 9-5: Pipe Laying\nApproximate Pipe Size Offset in 20-Foot Length Radius of Curve\n(Inches) (Inches) (Feet)\n4” 15” 120’\n6” 15” 160’\n8” 15” 250’\n10” 15” 300’\n12” 15” 400’\n(ii) Pipe deflection for curvature shall not be permitted at temperatures less\nthan 32o F ambient temperature.\n(iii) When pipe laying is not in progress, the open ends of pipe shall be closed\nby a watertight plug or other means approved by the Director.\n(iv) The cutting of pipe for inserting valves, fittings, or closure pieces shall\nbe done in a neat and workmanlike manner without damage to the pipe\nso as to leave a smooth end at right angles to the axis of the pipe. Bevel\nthe end of the pipe with a beveling tool after the pipe is field cut. Place a\nclearly visible position mark at the correct distance from the end of the\nfield cut pipe.\n(v) Tracer wire shall be attached to the pipe as shown in Chapter 11,\n“Technical Drawings,” of these Standards.\n(b) Mechanical Joints: Mechanical joints shall be installed per the manufacturer’s\nspecifications and guidelines.\n(c) Push-On Joints: For push-on joints, the exterior 4 inches of the pipe at the spigot\nend and the inside of the adjoining bell and particularly the groove for the gasket\nshall be thoroughly cleaned to remove oil, grit, tar (other than standard coating),\nand other foreign matter. A thin film of the pipe manufacturer’s joint lubricant\nshall be applied to the gasket over its entire exposed surface. The spigot end of\nthe pipe shall then be wiped clean and inserted into the bell to contact the gasket\nby crowbar, or by jack and choker slings. The location of the gasket shall be\nchecked with a gauge or tool designed for that purpose to assure that the gasket is\nin the proper position. Position the completed joint so that the joint mark on the\npipe end is in line with the end of the bell.\n(2) Installation of Thrust Restraint\n(a) Thrust blocks shall be poured between undisturbed solid ground and the fitting to\nbe anchored. The area of bearing on the undisturbed trench wall shall be that\nshown on the thrust block detail or directed by the Director. The concrete shall\nbe placed so that the pipe or fitting joints will be accessible for repair. A bond\nbreaker shall be placed over the fitting before placing concrete.\n(b) Full length tie rods between joints with pipe clamps shall be assembled using\nclamps on each side of pipe bells with tie rods extending the full pipe length for\nthe dimensions shown on the drawings each direction from the restrained fitting,\nvalve or joint. Clamps shall be installed tight enough to prevent twisting around\nthe pipe. A washer shall be used at each clamp and tie rods shall be located on\neach side of the pipe. The tie rod nut should first be hand tightened with a 12-\ninch wrench (approximately 50-100 foot-pounds torque). Threaded tie rods shall\nextend two full threads past each nut in the final position.\n(c) Follower gland type joint restraint systems shall be assembled according to\nmanufacturer’s instructions.\n(3) Installation of Tracer Cable: Tracer wire shall be spirally wrapped around the pipe\nexterior, 2 wraps minimum per 20-feet of pipe, as it is installed in the trench or taped to\nthe top of the pipe. Splices due to breaks in wire continuity shall be made by stripping\ninsulation coating from each wire with wire stripper pliers. Wires shall be joined with a\nsolderless connector, 3M Direct Bury Splice Kit or equivalent in suitability, strength,\neffectiveness, and durability as approved by the Director. The join shall be made in\naccordance with manufacturer instructions. The solderless connector shall be covered\nwith Emmerson Electric Seal-A-Conn II putty or approved equal.\nThe wire shall form a continuous electrical circuit between any 2 contact points on the\nnew pipeline, including branch lines and fire hydrant laterals. Wire shall be stubbed out\nto the point where the new pipe connects to the existing main unless otherwise directed\nby the Director. Where the wire terminates at a point where there is not an installed wire,\nthe ends of the wire shall be stripped bare a minimum of 18-inches and grounded into the\nnative soil material. Special care should be taken to avoid contact from the tracer wire to\nsteel gas service lines.\n(4) Testing: Testing of PVC pressure pipe shall be as specified in Section 9.13, “Testing of\nWater Pipes,” of these Standards.\n(5) Backfilling and Restoring Surface Conditions: Shall be as specified in Section 9.02,\n“Excavation and Trenching,” of these Standards.\n(6) Disinfecting Potable Pipelines: PVC pressure pipe shall be disinfected as specified\nSection 9.12, “Disinfecting Waterlines,” of these Standards."
  },
  {
    "corpus": "DCS",
    "chapter": 9,
    "anchor": "9.05(A)",
    "heading": "General",
    "page_start": 240,
    "page_end": 240,
    "verbatim": "(1) Scope: This section describes the furnishing and installation of water services and fire\nlines in the pipe diameter size range of 3/4 to 2 inches. For water services and fire lines\ngreater than 2 inches in diameter refer to Section 9.03, “Ductile Iron Pipe,” Section 9.04,\n“Polyvinyl Chloride (PVC) Pressure Pipe,” Section 9.06, “Gate Valves,” and Section\n9.08, “Tapping Sleeves and Valves,” of these Standards.\n(2) Quality Assurance: Manufacturer’s certificates of compliance and installation\nrecommendations shall be provided to the City inspector prior to construction.\nInstallation recommendations shall be followed during construction."
  },
  {
    "corpus": "DCS",
    "chapter": 9,
    "anchor": "9.05(B)",
    "heading": "Materials",
    "page_start": 240,
    "page_end": 244,
    "verbatim": "(1) Pipe: Pipe shall be Type K copper, soft drawn, in accordance with ASTM B88.\n(2) Curb Stops: All curb stops shall be manufactured in accordance with AWWA C800-05,\nUnderground Service Line Valves and Fittings, and shall be constructed of brass in\naccordance with ASTM-B62 (common trade name 85-5-5-5). Curb stop valves shall be\nball type with a maximum working pressure of 300 psi and shall have compression\nfittings.\n(3) Corporation Stops\n(a) All corporation stops and threaded brass fittings shall be manufactured in\naccordance with AWWA C800-05, Underground Service Line Valves and\nFittings, and shall be constructed of brass in accordance with ASTM-B62\n(common trade name 85-5-5-5). All corporation stops shall be tested at the\nfactory and shall meet the following minimum physical requirements:\n(i) Tensile strength 30,000 PSI minimum.\n(ii) Yield Strength 14,000 PSI minimum.\n(iii) Elongation in 2 inches 20 percent minimum.\n(b) Corporation stops shall be ball valve type designed for a maximum working\npressure of 300 psi. The inlet side shall have AWWA taper thread (CC thread)\nand the outlet side shall have a compression fitting.\n(c) Corporation stops shall be the following type or a corporation stop approved by\nthe Director as equivalent in design and composition to the following types:\n(i) Ford – FB1000-3-NLG.\n(ii) Mcdonald – 74701BQ No lead brass.\n(iii) Mueller – B25008N.\n(4) Water Meters\n(a) General: All water meter installations shall be in accordance with the following\nstandards and the drawings in Chapter 11, “Technical Drawings,” of these\nStandards for all water services:\n(i) All meters shall be “Badger” meters.\n(ii) No connections shall be made in the meter pit other than those related to\nthe meter and bypass. Sprinkler system or backflow preventer\nconnections shall be made no closer than 5 feet from the meter pit or\nvault on the downstream side of the meter.\n(iii) The City will own and maintain the service line and fittings up to and\nincluding the meter.\n(iv) Residential 3/4-inch meters with transponders shall be provided and\ninstalled by the City upon the contractor’s request for a final meter\ninspection. All other meters and associated transponders shall be\npurchased by the contractor and then provided to the City for testing\nprior to installation.\n(v) The contractor shall contact the City's Meter Shop prior to purchasing\nmeters and transponders to verify the type of meter that will be required.\nThe contractor shall also contact the City's Meter Shop to make an\nappointment for delivery of the meter(s) to the City for testing. The\nlocation of installation and manufacturer’s information shall accompany\nthe meter when delivered by the contractor to the City. The meter will be\ntested and a schedule set for picking up the meter within two working\ndays by the contractor.\n(b) 3/4-Inch and 1-Inch Meter Installations: 3/4-inch and 1-inch meter sets shall be\ninstalled in accordance with the following standards and the drawings in Chapter\n11, “Technical Drawings,” of these Standards:\n(i) The meter shall be installed within right-of-way or a public easement.\n(ii) No meter shall be set in a street, sidewalk, driveway alignment, or\nother traffic or concrete area except where existing conditions or\nother regulatory requirements prevent installation consistent with\nthis requirement. Where existing conditions or other regulatory\nrequirements prevent installation consistent with this requirement,\nthe Director may approve an alternative design that minimizes the\nimpact of meter maintenance and replacement activities on\nadjacent structures, infrastructure, and paved surfaces.\n(iii) In attached sidewalk areas, the meter shall be located a minimum of 18\ninches from the back of the sidewalk to the edge of the meter lid.\n(iv) Where no sidewalk exists, the meter shall be located a maximum of 6\nfeet behind the back edge of the curb.\n(v) In detached sidewalk areas, the meter shall be located a maximum of 6\nfeet behind the back edge of curb but no closer than 18 inches from the\nfront edge of the sidewalk to the edge of the meter lid.\n(vi) The dome or meter lid shall be level and 2 inches above the approved\nfinal grade.\n(vii) The copper setter shall be a minimum of 15 inches and a maximum of 17\ninches below the meter pit lid.\n(viii) Meter pits shall be constructed of modified hi-density polyethylene. The\nsize shall be as specified in the detail drawing in the appendix of this\nChapter. Grade adjustment shall be made at the top of the pit using\nconcrete rings. The trench floor under the concrete rings shall be\ncompacted earth. The concrete pit shall not bear on the service pipe.\n(ix) Lids shall be a 12-inch cast iron lid and bonnet and shall have a 2-inch\ndiameter hole in the center to accommodate the transponder.\n(x) Final inspections of the meter pit will be made at the time the meter is\nset. The permit applicant is responsible for any required adjustments to\nthe copper setter or meter lid at that time.\n(c) 1-1/2-Inch and 2-Inch Meter Installations: 1-1/2 -inch and 2-inch meter sets shall\nbe installed in accordance with the following standards and the drawings in\nChapter 11, “Technical Drawings,” of these Standards:\n(i) The meter model shall be Badger E112 SS 1 ½ Model 120 or Badger E2\nSS 2 Model 170.\n(ii) 1-1/2-inch and 2-inch meters shall be installed in a manhole.\n(iii) A meter manhole shall be installed within the right-of-way or a public\nutility easement.\n(iv) No meter manhole shall be set in a street, sidewalk, driveway alignment,\nor other traffic or concrete area except where existing conditions or other\nregulatory requirements prevent installation consistent with this\nrequirement. Where existing conditions or other regulatory requirements\nprevent installation consistent with this requirement, the Director may\napprove an alternative design that minimizes the impact of meter\nmaintenance and replacement activities on adjacent structures,\ninfrastructure, and paved surfaces. If the meter manhole is approved for\nconstruction in streets or other traffic areas the manhole shall use a 24-\ninch cast iron ring and cover and shall be designed to accommodate and\nprotect the transponder.\n(v) In attached sidewalk areas, the meter manhole shall be located a\nminimum of 3 feet behind the sidewalk and in no case shall the manhole\nbe located more than 25 feet from the back edge of curb.\n(vi) Where no sidewalk exists, the meter manhole shall be located a\nmaximum of 6 feet behind the back of curb.\n(vii) In detached sidewalk areas, the meter manhole shall be located a\nmaximum of 6 feet behind the back edge of curb but no closer than 18\ninches from the front edge of the sidewalk to the edge of the meter lid.\n(viii) Meter manhole lids shall be a maximum of 2 inches above the approved\nfinal grade.\n(ix) A curb stop is required on the service line behind the back of curb and\noutside of the manhole.\n(x) Meter manholes shall use a 24-inch aluminum ring and cover, and the\noutside of the aluminum ring shall have 8 mils of tar applied. Once the\ntar is set, a 12-inch wide by 6-inch thick concrete collar shall be placed\naround the manhole ring.\n(xi) The manhole cover shall have a 2-inch diameter recessed hole in the\ncenter of the cover for the transponder, and the cover shall have the\nlettering “Water Meter” cast into the lid.\n(d) 3-Inch and Larger Meter Installations: 3-inch and larger meter sets shall be\ninstalled in accordance with the following standards and the drawings in Chapter\n11, “Technical Drawings,” of these Standards:\n(i) 3-inch and larger meters shall be installed in a vault.\n(ii) The entry hole through the roof of the vault shall be aligned\nperpendicular to the service line and adjacent to the water meter.\n(iii) Vaults shall be sealed at all joints and made watertight.\n(iv) Meter vault lids shall be a maximum of 2 inches above the approved\nfinal grade.\n(v) In attached sidewalk areas, the meter vault shall be located a minimum of\n5 feet behind sidewalk or back of curb and no more than 25 feet from the\nback of curb.\n(vi) Where no sidewalk exists, the meter shall be located a maximum of 6\nfeet behind the back of curb.\n(vii) In detached sidewalk areas, the meter shall be located a maximum of 6\nfeet behind the back edge of curb but no closer than 18 inches from the\nfront edge of the sidewalk to the edge of the meter lid.\n(viii) A curb stop is required on the service line behind the back of curb and\noutside of the vault.\n(ix) The meter vault shall be installed within the right-of-way or a public\nutility easement.\n(x) No meter manhole shall be set in a street, sidewalk, driveway alignment,\nor other traffic or concrete area except where existing conditions or other\nregulatory requirements prevent installation consistent with this\nrequirement. Where existing conditions or other regulatory requirements\nprevent installation consistent with this requirement, the Director may\napprove an alternative design that minimizes the impact of meter\nmaintenance and replacement activities on adjacent structures,\ninfrastructure, and paved surfaces. If the meter manhole is approved for\nconstruction in streets or other traffic areas the manhole shall use a 24-\ninch cast iron ring and cover and shall be designed to accommodate and\nprotect the transponder.\n(xi) Meter vaults shall use a 24-inch aluminum cover and shall have the\nlettering “Water Meter” cast into the lid.\n(xii) A 24-inch x 36-inch aluminum cover adaptor and ring shall be used to\nenlarge the access opening, and the adaptor shall have a 2-inch diameter\nhole for the transponder. The outside of the aluminum ring shall have 8\nmils of tar applied. Once the tar is set, a 12-inch wide by 6-inch thick\nconcrete collar shall be placed around the manhole ring.\n(xiii) PVC pressure pipe shall be used on the service line outside the vault\nexcept where the PVC pipe stubs through the vault walls. Ductile iron\npipe shall be used inside the vault.\n(xiv) For all 3-inch and 4-inch meter settings, 4-inch service pipe will be\nrequired on the City side of the meter. A reducer will be required before\nthe meter and on the bypass for 3-inch settings. Insulators shall be\nprovided between connections of dissimilar metals. Meter installations\nlarger than 4 inches shall require submittal of drawings for approval by\nthe Director.\n(xv) A minimum of distance 5 times the pipe diameter of straight,\nunobstructed pipe is required upstream of the meter.\n(xvi) Final inspections of the meter vault will be made at the time the meter is\nset.\n(5) Service Saddles: Corporation stops require the installation of a bronze or brass bodied\nservice saddle with 304L stainless steel double straps and studs, equivalent in design and\ncomposition to “Mueller” BR 2 S series or “McDonald\" 3855 series for cast iron or\nPVC. All saddles require an AWWA tapered thread (CC) outlet. No direct taps to PVC\npipe are allowed.\n(6) Insulators (Ferrous Pipes only): Insulators shall be installed at the inlet end of the\ncorporation stop and shall be Ford Service Insulators or an approved equivalent for\nservice lines."
  },
  {
    "corpus": "DCS",
    "chapter": 9,
    "anchor": "9.05(C)",
    "heading": "Execution",
    "page_start": 244,
    "page_end": 245,
    "verbatim": "(1) General\n(a) Size as shown, lay to grades and lines in accordance with pipe manufacturer’s\nspecifications. Thoroughly clean pipe interiors of foreign matter before placing\ninto trench. Replace with new pipe any laid section of pipe found damaged or\ndefective. All pipe fittings, valves, and appurtenances shall be installed\naccording to manufacturer’s instructions. Corporation stops shall be installed\nwith the appropriate tapping machine in the presence of the Director after the\nwaterline has been pressure tested.\n(b) All bedding, pipe zone backfill, compaction, polyethylene sheathing and other\ndetails of the water pipeline construction shall be returned to original condition\nafter service connections are completed.\n(c) Service connections to all ferrous mains shall be electrically insulated by means\nof a City approved insulating fitting.\n(2) Pipe Cutting: Cutting shall be done neatly by methods that will not damage pipe.\n(3) Testing: Testing of water service pipe shall be as specified in Section 9.13, “Testing of\nWater Pipes,” of these Standards.\n(4) Backfilling and Restoring Surface Conditions: Backfilling and Restoring surface\nconditions shall be as specified in Section 9.02, “Excavation and Trenching,” of these\nStandards.\n(5) Disinfecting Potable Pipelines: Water service pipe shall be disinfected as specified\nSection 9.12, “Disinfecting Waterlines,” of these Standards."
  },
  {
    "corpus": "DCS",
    "chapter": 9,
    "anchor": "9.06(A)",
    "heading": "General",
    "page_start": 245,
    "page_end": 245,
    "verbatim": "(1) Scope: This section describes the furnishing and installation of gate valves and\nappurtenances for potable water service in the pipe diameter size range of 4 to 12 inches.\n(2) Quality Assurance\n(a) Manufacturer’s certificates of compliance and installation recommendations shall\nbe provided to the City inspector prior to construction. Installation\nrecommendations shall be followed during construction.\n(b) All valves shall be tested in accordance with AWWA C500 or C509. Certified\ncopies of the results of all tests, together with an affidavit of compliance shall be\nprovided to the City inspector prior to construction."
  },
  {
    "corpus": "DCS",
    "chapter": 9,
    "anchor": "9.06(B)",
    "heading": "Materials",
    "page_start": 245,
    "page_end": 246,
    "verbatim": "(1) Gate Valves\n(a) Gate valves are required for 4-inch through 12-inch valve sizes. The Director\nmay approve a different valve type where practical installation of a gate valve is\nnot feasible.\n(b) Gate valves shall be iron body, resilient-seated gate valves with non-rising\nbronze stems with design, construction, and pressure ratings conforming to\nAWWA Specifications C-509-01, Resilient Seated Gate Valves, or C515-01,\nReduced Wall Resilient Seated Gate Valves, and with modifications specified\nherein.\n(c) Stem seals shall be triple \"O\" ring seals designed so that the seals above the stem\ncollar can be replaced with the valve under pressure and in full open position.\n(d) Gate valves shall be one of the following types:\n(i) American Flow Control, Series 2500 (C515 only).\n(ii) Mueller, Series 2360 (C509 only).\n(iii) American AVK.\n(iv) Series 45 CLOW Valves, Models 2639 and 2640.\n(e) With the exception of tapping valves and valves in vaults, gate valves shall have\nmechanical joint ends.\n(f) All ferrous internal and external surfaces of the valves shall be epoxy coated in\nconformance with AWWA C116-03, Protective Fusion Bonded Epoxy Coatings\nfor the Interior and Exterior Surfaces of Ductile Iron and Gray Iron Fittings, and\nC550-05, Protective Interior Coatings for Valves and Hydrants. The coating shall\nbe a two-part thermosetting epoxy suitable for field over coating and for touch-up\nwith the same coating material without special surface preparation. The supplier\nshall furnish detailed performance tests of adhesion, hardness, and abrasion\nresistance of the furnished coatings when requested by the City. The coating shall\nhave a successful record of performance in valves, pipe, or other fittings for a\nminimum of ten years.\n(g) The resilient seat gate valve stem shall have external break-off capabilities for\nover-torqueing and positive stop to prevent over compression.\n(h) All external bolts, nuts, and washers used in conjunction with valves shall be\nstainless steel, and tee-bolts shall be \"Cor-blu\".\n(i) Valves shall be delivered complete with bolts, glands, and rubber gaskets in\nconformance with AWWA C111-07, Rubber Gasket Joints for Ductile Iron\nPressure Pipe and Fittings.\n(2) Valve Boxes\n(a) All buried valves shall be provided with valve boxes. Valve boxes shall be of\ncast iron, 3 piece screw type, suitable for the depth of cover required by the\ndrawings. Valve boxes shall be 5 ½ inches in diameter, shall have a minimum\nthickness at any point of 1/16 inch, and shall be provided with suitable cast iron\nbases and stay-put covers. Covers shall have cast thereon “water” on the top.\nThey shall be Tyler 6860 series or approved equal.\n(b) The valve box shall have at least 6 inches adjustment above and below specified\ndepth of cover over pipe.\n(c) All parts of valve boxes, bases, and covers shall be coated by dipping in\nbituminous varnish.\n(d) Valves and valve boxes shall be set plumb. Each valve box shall be placed\ndirectly over the valve it serves, with the top of the box brought flush with the\nfinished grade. After being placed in proper position, earth shall be filled in\naround each valve box and thoroughly tamped on each side of the box.\n(4) Special Wrenches and Keys: All tools needed to operate valve and to open valve box\nlid. At least one of each type as required for each style and size of box and lid shall be\nfurnished by the contractor. Provide 1 key for each valve. Key lengths shall be as\napproved by the Director."
  },
  {
    "corpus": "DCS",
    "chapter": 9,
    "anchor": "9.06(C)",
    "heading": "Execution",
    "page_start": 246,
    "page_end": 247,
    "verbatim": "(1) Handling: All valves and actuators shall be transported and stored in a manner that will\nprotect them from damage.\n(2) Installation: Install valves as indicated in Chapter 11, “Technical Drawings,” of these\nStandards, and set plumb on a firm base. All foreign matter shall be removed from the\nvalve interior prior to installation.\n(3) Valve Boxes: Install a valve box over the gate valve with the base section centered over\nthe operating nut and resting on well-compacted backfill. The top section shall be so set\nas to allow equal movement above and below finished grade, with the final elevation to\nbe 1/4 inch below finished grade in roadways and 1 to 2 inches above grade outside of\nroadways. The top of base section shall be placed approximately on line with the\noperating nut at the top of the valve stem, and the entire assembly shall be plumb.\n(4) Tests: Gate valve tests shall be with and part of the general tests on the companion water\nlines.\n(5) Disinfection: Gate valve disinfection shall be done with and as a part of the disinfection\nto the companion water lines."
  },
  {
    "corpus": "DCS",
    "chapter": 9,
    "anchor": "9.07(A)",
    "heading": "General",
    "page_start": 247,
    "page_end": 247,
    "verbatim": "(1) Scope: This section describes the furnishing and installation of butterfly valves and\nappurtenances for potable water service in the pipe diameter size range of 12 inches to 24\ninches.\n(2) Quality Assurance: Manufacturer’s installation recommendations and certificates of\ncompliance shall be provided to the City inspector prior to construction. Installation\nrecommendations shall be followed during construction.\n(3) Testing: All valves shall be tested in accordance with Section 3.8 of AWWA C504.\nCertified copies of the results of all tests, together with an affidavit of compliance shall\nbe provided to the City inspector prior to construction."
  },
  {
    "corpus": "DCS",
    "chapter": 9,
    "anchor": "9.07(B)",
    "heading": "Materials",
    "page_start": 247,
    "page_end": 248,
    "verbatim": "(1) Butterfly Valves\n(a) Butterfly valves shall be rubber-seated conforming to the AWWA C504 and\ndesigned for buried service. The valves shall be designed to operate as open or\nclosed with a design velocity of 8 feet per second. The valves shall have a cast-\niron body with mechanical joint ends conforming to ANSI 21.11, AWWA C111\nand shall be rated for a design working pressure of 150 psi. Butterfly valves shall\nbe one of the following types: Mueller, Lineseal III and XPII (sizes up to 48\ninches), Pratt, Triton XR-70 (sizes 24 inches to 72 inches), or K-Flo 500 Series\n(sizes up to 20 inches); unless a butterfly valve equivalent in design and\ncomposition to these types has been approved by the Director.\n(b) Discs shall be cast or ductile iron with stainless steel, type 304, either stub or one\npiece shafts. Discs shall be secured to shafts by means of solid, smooth sided,\nstainless steel or monel pins or dowel pins. Each taper pin or dowel pin shall\nextend through or shall wedge against the side of the shaft and shall be\nmechanically secured in place. The use of bolts, setscrews, knurled or fluted\ndowel pins, expansion pins, roll pins spring pins, or other devices in lieu of the\npins specified herein will not be acceptable.\n(c) Shaft bearings shall be the bushing type of nylon or Teflon. Thrust bearings that\nare directly exposed to line liquid and that consist of a metal bearing surface in\nrubbing contact with an opposing metal bearing surface will not be acceptable.\nShaft seals may be rubber ring or chevron packing.\n(d) Seats shall be rubber vulcanized to the body and designed to provide bubble tight\nshutoff with mating surface of Type 304 or 316 stainless steel or monel mounted\non the discs. Valve seat configurations that rely on the mating pipe flange to\nhold the seat in position in the valve body will not be acceptable.\n(e) The valve operator shall be the traveling-nut type designed for previous stated\nconditions, in an enclosed body, sealed to prevent the entrance of groundwater up\nto the depth of 5 feet above the valve. The operator shall have travel limiting\ndevices to prevent over closing or opening damage to the valve. Valves shall\nopen counterclockwise with the use of a valve key on a 2-inch square operating\nnut. The housing of traveling-nut type actuators shall be fitted with a removable\ncover that shall permit inspection and maintenance of the operating mechanism\nwithout removing the actuator from the valve."
  },
  {
    "corpus": "DCS",
    "chapter": 9,
    "anchor": "9.07(C)",
    "heading": "Execution",
    "page_start": 248,
    "page_end": 248,
    "verbatim": "(1) Handling: All valves and actuators shall be transported and stored in a manner that will\nprotect them from damage.\n(2) Installation: Install valves with the shaft horizontal according to the manufacturer’s\nrecommended installation procedures. Operate all valves from full open to full close\nbefore installation. Check all seats, seat rings, shaft sleeves, disc connections, etc. prior\nto installation.\n(3) Valve Boxes: Install valve boxes over the valve operator with the base section centered\nover the operator nut and resting on well-compacted backfill. The top section shall be set\nto allow equal movement above and below finished grade, with final elevations to be 1/4\ninch below finished grade in roadways and 1 inch to 2 inches above grade outside of\nroadways. The top of base sections shall be placed approximately on line with the\noperator nut at the top of the valve stem, and the entire assembly shall be plumb.\n(4) Tests: Butterfly valve tests shall be done with and as a part of the general tests on the\ncompanion water lines.\n(5) Disinfection: Butterfly valve disinfection shall be done with and as a part of the general\ndisinfection to the companion water line."
  },
  {
    "corpus": "DCS",
    "chapter": 9,
    "anchor": "9.08(A)",
    "heading": "General",
    "page_start": 248,
    "page_end": 248,
    "verbatim": "(1) Scope: This section describes the furnishing and installation of tapping sleeves and\nvalves for potable water service in the pipe diameter size range of 4 inches to 12 inches.\n(2) Quality Assurance\n(a) Manufacturer’s certificates of compliance and installation recommendations shall\nbe provided to the City inspector prior to construction. Installation\nrecommendations shall be followed during construction.\n(b) The manufacturer of tapping sleeves and valves shall be experienced in their\ndesign and construction, shall be regularly engaged in their manufacture, and\nshall have produced tapping sleeves and valves of the sizes specified herein that\nhave given successful service for a period of at least 5 years."
  },
  {
    "corpus": "DCS",
    "chapter": 9,
    "anchor": "9.08(B)",
    "heading": "Materials",
    "page_start": 249,
    "page_end": 249,
    "verbatim": "(1) General\n(a) All tapping sleeves shall be constructed of stainless steel that meets or\nexceeds the requirements of ASTM A240 Type 304 UNS designated\nS30400. Tapping sleeves shall be “Romac Industries” SST, “Mueller” H-\n304L, “Ford” FTSS, “JCM” 432, or a tapping sleeve of equivalent design,\nmaterial, and rating approved by the Director.\n(b) Extension stems, valve boxes, and special wrenches and keys shall be as\nspecified in Section 9.06(B), “Materials,” of these Standards.\n(2) Flanges: Flanges shall be fabricated from steel plate, and all dimensions shall conform\nto AWWA Standard C207, Class D. Flanges shall be machined to a flat rate with finish\nof 250 micro inches or machined to a flat surface with a serrated finish in accordance\nwith AWWA Standard C207. In addition, the machined face shall also be recessed for\ntapping valves in accordance with the MSS Standard SP-60.\n(3) Gaskets: Gaskets shall be compounded from new materials, and the shape and cross-\nsection of the gasket shall provide adequate seal for the design pressure. Gaskets shall be\nshop glued to the groove provided in the body section.\n(4) Fasteners: Bolts and hex nuts shall be stainless steel or an approved equivalent for\ncorrosion control.\n(5) Testing Outlet: A 3/4 inch NPT by welded coupling shall be attached to the outlet\nnozzle of each tapping sleeve assembly, complete with a 3/4 inch square head pipe plug.\n(6) Tapping Valves: With the exception of the valve ends and other modifications necessary\nfor tapping service, tapping valves shall be as specified in Section 9.06(B), “Materials,”\nof these Standards. Each tapping valve shall be provided with a flanged inlet end\ndesigned, faced and drilled for attachment to the outlet flange of the tapping sleeve; an\noutlet end provided with a tapping flange for attachment of a standard drilling machine;\nand a mechanical joint bell end for connection of the branch main. The size of the\nwaterway shall include the appropriate clearance for the diameter of the tapping machine\ncutter recommended by the valve manufacturer. Tapping valves shall be Mueller “No.\nH-667\" or equal.\n(7) Painting: All ferrous internal and external surfaces of the valves shall be epoxy coated in\nconformance with AWWA C116-03, Protective Fusion Bonded Epoxy Coatings for the\nInterior and Exterior Surfaces of Ductile Iron and Gray Iron Fittings, and C550-05,\nProtective Interior Coatings for Valves and Hydrants. The coating shall be a two-part\nthermosetting epoxy suitable for field over coating and for touch-up with the same\ncoating material without special surface preparation. The supplier shall furnish detailed\nperformance tests of adhesion, hardness, and abrasion resistance of the furnished coatings\nwhen requested by the City. The coating shall have a successful record of performance in\nvalves, pipe, or other fittings for a minimum of ten years."
  },
  {
    "corpus": "DCS",
    "chapter": 9,
    "anchor": "9.08(C)",
    "heading": "Execution",
    "page_start": 249,
    "page_end": 250,
    "verbatim": "(1) Tapping Valves: Install tapping valves in the lines as indicated on the drawings, and set\nplumb on a firm base. All foreign matter shall be removed from the valve interior prior\nto installation. Valves shall be securely bolted to the tapping sleeve in accordance with\nthe manufacturer’s instructions using the fasteners specified in Subsection 9.08(B)(4) of\nthese Standards.\n(2) Tests: Valve tests shall be done with and as a part of the general tests on the companion\nwaterlines.\n(3) Disinfection: Valve disinfection shall be done with and as a part of the general\ndisinfection to the companion waterline."
  },
  {
    "corpus": "DCS",
    "chapter": 9,
    "anchor": "9.09(A)",
    "heading": "General",
    "page_start": 250,
    "page_end": 250,
    "verbatim": "(1) Scope: This section describes the furnishing and installation of fire hydrants for potable\nwater service.\n(2) Quality Assurance\n(a) Manufacturer’s certificates of compliance and installation recommendations shall\nbe provided to the City inspector prior to construction. Installation\nrecommendations shall be followed during construction.\n(b) All valves shall be tested in accordance with Section 5.1 of AWWA C502.\nCertified copies of the results of all tests, together with an affidavit of compliance\nshall be provided to the City inspector prior to construction."
  },
  {
    "corpus": "DCS",
    "chapter": 9,
    "anchor": "9.09(B)",
    "heading": "Materials",
    "page_start": 250,
    "page_end": 250,
    "verbatim": "Fire hydrants shall be “Mueller” Super Centurion 250 A-423 or “CLOW” Medallion 395\" (the\n“CLOW” Medallion shall be a higher-pressure rating with chain tagged \"heavy duty\"), with\nmechanical joint bottom connection and meet the following requirements:\n(1) Inlet Pipe: 6-inch, mechanical joint inlet shoe and accessories.\n(2) Trench Depth: 4-1/2 feet cover (Note: standard shipping depth is 5.0”).\n(3) Operating Nut: 1-1/2-inch Pentagon National Standard Threads.\n(4) Open: Left (CCW).\n(5) Connection: Two 2-1/2-inch hose nozzles and one 5-1/4-inch pumper nozzle.\n(6) Threads: National Standard Hose Threads.\n(7) Pressure: 150 psi working pressure, 300 psi pressure.\n(8) Break-Off Flange: Hydrants shall be provided with traffic break-off flange.\n(9) Mechanical Joint Bolts and Nuts: The mechanical joint bolts and nuts shall be anti-\ngalling coated stainless steel, “NSS” Cor-Blue, or an equivalent in design, material, and\nspecifications.\n(10) Shoe Nuts and Bolts: Shoe nuts and bolts shall be corrosion resistant stainless steel,\nGrade 304.\n(11) Color: Color shall be Rustoleum No. 831 “restful green” or KWAL “hydrant green”\nexcept for bonnet, weather caps and nozzle caps, which must be Rustoleum No. 2766\n“reflectorized white.”\n(12) Spares: A set of spare break-off parts shall be furnished."
  },
  {
    "corpus": "DCS",
    "chapter": 9,
    "anchor": "9.09(C)",
    "heading": "Execution",
    "page_start": 251,
    "page_end": 251,
    "verbatim": "(1) Hydrants: Where applicable, hydrants shall be installed with pumper outlet facing the\nadjacent roadway or parking area. Set hydrants at such elevations that the connecting\npipe shall drain to the main with a grade of not less than 1 percent, and upon a concrete\nfoundation not less than 6 inches thick and 18 inches square. The centerline of nozzles\nshall be at least 18 inches above finished grade. Firmly block the back of the hydrant\nopposite the pipe connection with a concrete thrust block braced against the vertical face\nof the trench to prevent the hydrant from blowing off the line.\n(2) Drainage Aggregate and Backfill: Place not less than 1/3 cubic-yard of approved clean\ngravel or crushed rock around the base of each hydrant and 12 inches over the top of the\nsupply pipe to insure drainage. A layer of 30-pound asphalt-saturated felt paper or heavy\nvinyl sheet shall be placed over gravel to keep backfill material from sifting into gravel.\nThoroughly compact the backfill around hydrants, to the grade line, in an approved\nmanner.\n(3) Operations Check: Clean hydrant interiors of all foreign matter before installation.\nStuffing boxes shall be tightened and the hydrant inspected in opened and closed\npositions to see that all parts are in working condition.\n(4) General: Hydrants shall be tagged “out-of-service” until the water system is operational.\nIt is the responsibility of the contractor to notify Boulder Police Communications\nregarding the location of the tagged hydrants."
  },
  {
    "corpus": "DCS",
    "chapter": 9,
    "anchor": "9.10(A)",
    "heading": "General",
    "page_start": 251,
    "page_end": 251,
    "verbatim": "(1) Scope: This section describes the furnishing and installation of combination air valves\nfor potable water service.\n(2) Quality Assurance: Manufacturer’s certificates of compliance and installation\nrecommendations shall be provided to the City inspector prior to construction.\nInstallation recommendations shall be followed during construction."
  },
  {
    "corpus": "DCS",
    "chapter": 9,
    "anchor": "9.10(B)",
    "heading": "Materials",
    "page_start": 251,
    "page_end": 252,
    "verbatim": "(1) Manholes: Refer to Section 9.16, “Manholes and Inlets,” of these Standards.\n(2) Combination Air Valve: The valve shall be a 2-inch combination air release vacuum\nvalve, “Vent-O-Mat” Series 050 RB X 25 2 1, or approved equivalent in design, material,\nand specifications. The combination air valve shall be provided with a 2-inch diameter\nhand wheel operated gate valve.\n(3) Hose Gate Valve: A 3/4-inch hose gate valve is to be installed in the air release valve\nmanhole. The valve shall have a bronze body, threaded end, solid wedge, union bonnet,\ninside screw rising stem gate valve. These valves shall be “Powell” 375 HS. Each hose\ngate valve shall be equipped with a brass cap and chain.\n(4) Ball Valve: Ball valves shall be of bronze or brass construction with two-piece end entry\nbody, bronze or brass ball, Teflon or Viton stem seal, reinforced Teflon seats and thrust\nwasher, a removable operating lever, and threaded ends. Valves shall be rated not less\nthan 500 psi non-shock cold WOG and shall be drip-tight in both directions. Valves shall\nbe “Conbraco Industries” Apollo 70-100 Series, “Powell” Fig 4210T, or “Stockham” S-\n216.\n(5) Corporation Stop: A corporation stop shall be as referenced in Subsection 9.05(B)(3), of\nthese Standards.\n(6) Insulators: Insulators shall be as referenced in Subsection 9.05(B)(6), of these\nStandards."
  },
  {
    "corpus": "DCS",
    "chapter": 9,
    "anchor": "9.10(C)",
    "heading": "Execution",
    "page_start": 252,
    "page_end": 252,
    "verbatim": "(1) Installation: Install valve, manhole, and appurtenances as indicated on Drawing No.\n5.22, in Chapter 11, “Technical Drawings,” of these Standards, and in accordance with\napplicable provisions of the related sections.\n(2) Tests: Valve tests shall done be with and as a part of the general tests on the companion\nwaterlines.\n(3) Disinfection: Valve disinfection shall be done with and as a part of the general\ndisinfection to the companion waterlines."
  },
  {
    "corpus": "DCS",
    "chapter": 9,
    "anchor": "9.11(A)",
    "heading": "General",
    "page_start": 252,
    "page_end": 252,
    "verbatim": "(1) Scope: This section describes the furnishing and installation of pipeline fittings for\npotable water service.\n(2) Quality Assurance: Manufacturer’s certificates of compliance and installation\nrecommendations shall be provided to the City inspector prior to construction.\nInstallation recommendations shall be followed during construction."
  },
  {
    "corpus": "DCS",
    "chapter": 9,
    "anchor": "9.11(B)",
    "heading": "Materials",
    "page_start": 252,
    "page_end": 253,
    "verbatim": "(1) Gray or Ductile Iron: Fittings shall be made from gray iron or ductile iron and\nmanufactured in accordance with AWWA C110-08, Ductile Iron and Gray Iron Fittings,\nor AWWA C153-06, Ductile Iron Compact Fittings.\n(2) Rubber Gasket Joints: Fittings shall be furnished with rubber gasket joints in\naccordance with AWWA C111-07, Rubber Gasket Joints for Ductile Iron Pressure Pipe\nand Fittings.\n(3) Design: Fittings shall be rated for a design working pressure of 350 psi pressure rating\nand shall conform to the dimensions and weights shown in the tables of the AWWA\nstandards referenced in this Section 9.11(B) of these Standards.\n(4) Certification: The manufacturer shall prepare a certified statement that the inspection\nand all specified tests have been performed and the results thereof comply with the\nrequirements of the applicable AWWA standard(s) specified in Section 9.11(B) of these\nStandards. The contractor shall cause a copy of the certification to be sent to the City\nupon request.\n(5) Ductile Iron Flanged Fittings: Ductile iron flanged fittings shall be manufactured in\naccordance with the following:\n(a) Integrally cast flange fittings: AWWA C110-08, Ductile Iron and Gray Iron\nFittings.\n(b) Threated flange fittings: AWWA C115, Flanged Ductile Iron Pipe with Ductile\nIron or Gray Iron Threaded Flanges.\n(c) Ductile iron flanged fittings shall be rated for 250 psi working pressure and shall\nbe installed with special gaskets that achieve 350 psi working pressure.\n(6) 4 Through 6 Inch Fittings: 4 through 16-inch diameter fittings shall be furnished with a\nfusion bonded epoxy inside and out, with a standard thickness as defined in AWWA\nC116-03, Protective Fusion Bonded Epoxy Coatings for the Interior and Exterior\nSurfaces of Ductile Iron and Gray Iron Fittings. The Director may waive the requirement\nfor fusion bonded epoxy on fittings if the Director finds that specific fittings are not\navailable.\n(7) Bolts and Nuts: Fittings shall be furnished with tee-head mechanical joint bolts and\nhexagon nuts, fabricated from corrosion resistant high strength, low alloy steel such as\n\"Cor-Ten\" or “Blue Bolts.”\n(8) Connection fitting: Mechanical joint anchoring fittings (swivel) shall also be used.\nInfact Corporation’s “Foster Adaptor” may also be used to connect between mechanical\njoint fittings, valves and hydrant connections."
  },
  {
    "corpus": "DCS",
    "chapter": 9,
    "anchor": "9.12(A)",
    "heading": "Scope",
    "page_start": 253,
    "page_end": 253,
    "verbatim": "This section describes the disinfecting of all portions of the potable water system, including\nburied piping, valves, hydrants, and any portion of the existing connecting system that might have\nbecome contaminated during construction activities, and also any temporary water service piping\nused during construction."
  },
  {
    "corpus": "DCS",
    "chapter": 9,
    "anchor": "9.12(B)",
    "heading": "Materials",
    "page_start": 253,
    "page_end": 253,
    "verbatim": "(1) Chlorinating Material: The chlorinating material shall either be a hypochlorite solution,\ntablets or granules.\n(2) Tablet Attachment: The hypochlorite tablets shall be fastened to the top of the pipe\nusing Permatex No. 1."
  },
  {
    "corpus": "DCS",
    "chapter": 9,
    "anchor": "9.12(C)",
    "heading": "Execution",
    "page_start": 253,
    "page_end": 254,
    "verbatim": "(1) Disinfection\n(a) Care shall be taken to prevent contaminating materials from entering the water\nmains during construction or repair. Such materials that may accidentally enter\nthe main shall be removed by flushing. This flushing shall be done prior to\ndisinfection unless the tablet method of disinfection is used. If, in the opinion of\nthe Director, the contaminated material that has entered cannot be removed by\nflushing, the interior of the pipe shall be cleaned by mechanical means and then\nswabbed with a 1 percent hypochlorite solution.\n(b) Upon completion of the water pipelines, all new pipe, valves, hydrants, etc. shall\nbe thoroughly flushed and disinfected, using a continuous-feed method of\nhypochlorite and water mixture or hypochlorite tablets or granules in accordance\nwith AWWA Standard C-651, latest revision.\n(c) The chlorinating material shall be introduced into the water lines and distribution\nsystems in a manner approved by the Director. After a contact period of not less\nthan 24 hours, the treated water in the lines shall contain not less than 10 mg per\nliter chlorine using the continuous-feed method or 25 mg per l chlorine using the\ntablet or granular method throughout the length of the line. The system shall be\nflushed after successful completion of disinfection with clean water until the\nresidual chlorine content is no more than 1.0 mg per liter. All valves in lines\nbeing disinfected, except those being used as bulkheads, shall be opened and\nclosed several times during the contact period. During flushing and disinfection\nthe contractor shall make sure that none of the disinfection solution enters any\nexisting water main.\n(d) Flushing shall be done with a flushing velocity of at least 2 ½ feet per second.\nThe contractor shall provide all fittings required to flush the line. Flushing will\nbe accomplished in such a manner that no erosion will occur and there will be no\ndamage to street, fish, animals, plants or other property.\n(2) Bacteriological Examination: After the system has been thoroughly flushed and before\nthe new water line is connected to the distribution system, samples shall be taken from\nrepresentative points in the system, at intervals of 1200 feet, in sterile bottles treated with\nsodium thiosulfate. Labeled samples shall be submitted to the City Drinking Water\nProgram staff, or designated certified laboratory, for bacteriological examination.\nSubmitted samples shall meet all City and State bacteriological standards, showing the\nabsence of both coliform and heterotrophic bacterial growths. If the initial disinfection\nfails to produce satisfactory bacteriological results, the new main shall be reflushed and\nresampled. If check samples also fail to produce acceptable results, the main shall be\nrechlorinated by the continuous feed or slug method until satisfactory results are\nobtained.\n(3) Disposal of Solution: Following testing, the solution and flushing water shall be\ndisposed of by the contractor into the nearest sanitary sewer line. The solution and\nflushing water shall not be dumped into any lakes, streams, waterways, irrigation ditches\nor stormwater drainage systems. If wasted water cannot be safely discharged into a\nsanitary sewer system, and then a reducing agent shall be applied to the wasted water to\nthoroughly neutralize the chlorine residual remaining in the water."
  },
  {
    "corpus": "DCS",
    "chapter": 9,
    "anchor": "9.13(A)",
    "heading": "General",
    "page_start": 254,
    "page_end": 254,
    "verbatim": "This section describes the testing of all water pipe including water mains, fire lines and services."
  },
  {
    "corpus": "DCS",
    "chapter": 9,
    "anchor": "9.13(B)",
    "heading": "Materials",
    "page_start": 254,
    "page_end": 254,
    "verbatim": "The contractor shall provide all necessary test equipment including test pumps, pipe, connectors,\nmeters, gauges, instruments, and other equipment required. Pressure gauges used shall be\ngraduated in increments no more than 5 psi and shall have a range of approximately twice the test\npressure. Gauges meters and other instruments shall be calibrated prior to testing."
  },
  {
    "corpus": "DCS",
    "chapter": 9,
    "anchor": "9.13(C)",
    "heading": "Execution",
    "page_start": 255,
    "page_end": 256,
    "verbatim": "(1) Notification and Witness\n(a) The contractor shall notify the Director of all tests at least 48 hours prior to\ntesting so that the Director can witness the tests.\n(b) The pipe may be subjected to hydrostatic pressure and inspected and tested for\nleakage at any convenient time after the trench has been partially backfilled,\nexcept at the joints, or backfilled as permitted by the Director. Where any\nsection is provided with concrete thrust blocks, the pressure test shall not be\nmade until at least 2 days have elapsed after the concrete was installed.\n(2) Pressure Test\n(a) All new pipe shall be pressure tested prior to connection to the existing system.\nAll pipe shall be tested at a pressure of 150 psi at the lowest point in each section\nor 1½ times the working pressure, whichever is greater.\n(b) Prior to testing, all equipment that would be damaged by the test pressure shall\nbe removed. This equipment shall be replaced in the system after testing is\ncomplete. All pipe and appurtenances shall be backfilled except for joints unless\notherwise permitted by the Director.\n(c) The contractor shall slowly fill the pipe with water prior to testing and remove all\nair from the piping system. Each valved section, unless otherwise directed by the\nDirector, shall be tested prior to connection to the existing system. The duration\nof each pressure test shall be at least 2 continuous hours. Test time will be\naccrued only while full test pressure is on the system. All water used in testing\nthe pipelines shall be provided by the contractor from a potable water source.\n(d) The specified test pressure shall be applied by means of a pump connected to the\npipe in a manner satisfactory to the Director. The contractor shall furnish all\nnecessary labor, equipment, and connection corporation stops to the pipeline to\nperform the test.\n(e) No testing shall be permitted against valves or fittings that are part of the existing\nsystem unless specifically approved by the Director. All exposed pipes, fittings,\nvalves, hydrants, and joints will be carefully examined during the test. Any\ncracked or defective pipe, fittings, valves, or hydrants discovered during the\npressure test shall be removed and replaced by the contractor with sound\nmaterial. The test shall be repeated until the test is satisfactory to the Director.\n(3) Leakage Test\n(a) A leakage test shall be conducted after the pressure test has been completed,\nunless the pressure test indicates that there are no leaks. The contractor shall\nfurnish the pump, pipe, connections, meters and all other necessary apparatus,\nand shall furnish all necessary assistance to conduct the test. The duration of\neach leakage test shall be two hours, and, during the test, the main shall be\nsubjected to a hydrostatic pressure specified.\n(b) No pipeline installation will be accepted until the leakage is less than the amount\ncomputed by the following formula:\nL = SD(P)0.5\n133,200\nWhere: L = Allowable Leakage (Gallons Per Hour)\nS = Tested Length of Pipe (Feet)\nD = Nominal Diameter of Pipe (Inches)\nP = Average Test Pressure During the Test (psi)\n(c) The contractor shall, at their own expense, locate and repair the points of leakage\nuntil the leakage is within the specified allowance."
  },
  {
    "corpus": "DCS",
    "chapter": 9,
    "anchor": "9.14(A)",
    "heading": "General",
    "page_start": 256,
    "page_end": 256,
    "verbatim": "(1) Scope: This section describes the furnishing and installation of polyvinyl chloride (PVC)\nnon-pressure pipe and appurtenances for storm sewer mains, sanitary sewer mains and\nsewer services in the pipe diameter size range of 4inches to 15inches.\n(2) Quality Assurance: Manufacturer’s certificates of compliance and installation\nrecommendations shall be provided to the City inspector prior to construction.\nInstallation recommendations shall be followed during construction."
  },
  {
    "corpus": "DCS",
    "chapter": 9,
    "anchor": "9.14(B)",
    "heading": "Materials",
    "page_start": 256,
    "page_end": 257,
    "verbatim": "(1) PVC Non-pressure Pipe\n(a) PVC non-pressure pipe shall be type PSM polyvinyl chloride (PVC) having a cell\nclassification of 12454 or 12454 or 13364 (with a minimum tensile modules of\n500,000 psi) as defined in ASTM D1784. All PVC pipe and fittings shall meet\nor exceed all of the material requirements of ASTM D3034 and thickness\nrequirements of SDR 35.\n(b) Provisions must be made for contraction and expansion at each joint with a\nrubber ring and integral thickened bell as part of each joint. Gaskets shall\nconform to ASTM F477. Pipe shall be supplied in laying lengths of 19-1/2 to 20\nfeet. All pipe and fittings shall be assembled with a non-toxic lubricant. Each\nlength of pipe and all fittings shall have marked on the exterior the following:\n(i) Manufacturer’s Name or Trademark;\n(ii) Nominal Pipe Size;\n(iii) PVC Cell Classification (e.g. 12454-B);\n(iv) Legend - Type PSM SDR-35 Sewer Pipe; and\n(v) ASTM - D3034.\n(c) All fittings and plugs to be used with the PVC pipe shall be those manufactured\nby the manufacturer of the pipe. Each special fitting shall be a completely\nmanufactured unit with either bells or spigots on each connection that are an\nexact duplication of the bells and spigots on the pipeline. Fittings with any other\ntype of connections will not be accepted.\n(2) Plugs: Plugs shall be specifically manufactured for the pipelines where they are to be\ninstalled. The plug shall be constructed of a material approved by the Director and shall\nprovide a permanent watertight installation.\n(3) Couplings\n(a) Couplings shall be used only where shown on the approved drawings or where\napproved in writing by the Director. The contractor shall provide a description of\nan exact location of any couplings used.\n(b) Flexible couplings shall consist of a rubber gasket or boot with a stainless steel\nshield and tightening bands. Couplings shall be ASTM C1173 Type B couplings\nand shall be “Fernco Strong Back” or an approved equivalent.\n(4) Grout\n(a) Grout shall conform to the specifications defined in Section 9.16(B)(5). The\ncontractor may substitute a two-component, 100 percent solids epoxy resin for\nthe specified grout.\n(b) Grout used for sealing service connections shall be a 2-component, waterproof\nepoxy grout specifically manufactured for this application. The grout shall\nadhere to any of the dissimilar materials.\n(5) Sealants: Sealants used on manholes or pipe connections shall be equal to\nSIKAFLEX-la, a one component polyurethane base, elastomeric sealant. When required\ndue to moisture or immersion, provide SIKAFLEX 429 or an equivalent primer for\napplication onto the substrate according to manufacturer’s recommendation."
  },
  {
    "corpus": "DCS",
    "chapter": 9,
    "anchor": "9.14(C)",
    "heading": "Execution",
    "page_start": 257,
    "page_end": 259,
    "verbatim": "(1) General\n(a) Each pipe length and fitting interior, interior surface of bells, and exterior surface\nof spigots shall be cleaned of all foreign material before placement in the trench\nand shall be kept clean at all times thereafter. Each item shall also be examined\nfor cracks and other defects before installation.\n(b) Pipe shall be cut, only whenever necessary, to conform to location of manholes\nor connections. All cuts shall be straight, true, and at right angles to the axis of\nthe pipe. The cutting process shall leave a smooth end without damaging the\npipe. All burrs shall be removed from the ends of cut pipe, and the end lightly\nrasped or filed. All tools used in cutting pipe will be subject to the Director’s\napproval.\n(c) Pipe laying shall proceed with the spigot ends of pipe pointing in the direction of\nthe flow, unless otherwise approved by the Director. Each pipe length shall be\nlaid true to line and grade in such manner as to form a close concentric joint with\nthe adjoining pipe and to prevent sudden offsets to the flow line. Pipe shall be\nlaid in a dewatered trench and shall not be used for draining water from the\ntrench. Do not lay pipe when trenches or weather conditions are unsuitable for\nsuch work.\n(d) Whenever the pipe is left unattended or pipe laying is not in progress, temporary\nplugs shall be installed at all openings. Temporary plugs shall be watertight and\nof such design as to prevent debris and animals from entering the pipe. All\ntemporary plugs will be subject to approval by the Director.\n(e) The contractor shall install the materials in accordance with the manufacturer’s\nrecommendations. If there is a conflict between the methods prescribed in the\napproved plans and the manufacturer’s instructions, the contractor shall obtain\nresolution from the Director, before proceeding with the work.\n(2) Pipe Installation\n(a) Pipe Laying: No deflection in the joints shall be allowed. All pipe shall be fully\nsupported along the full length of pipe barrel without support by the bell\nmounding.\n(b) Pipe Joints\n(i) The outside of the spigot and the inside of the bell shall be thoroughly\nwiped clean. Set the rubber ring in the bell with the marked edge facing\ntoward the end of the bell. Lubricate the spigot end using a thin film of\nthe manufacturer-supplied lubricant. Push the pipe spigot into the bell.\nPosition the completed joint so that the mark on the pipe end is in line\nwith the end of the bell.\n(ii) Bevel the end of cut pipe with a beveling tool after the pipe is field cut.\nPlace a clearly visible position mark at the correct distance from the end\nof the field-cut pipe.\n(3) Connection of Pipe to Concrete Manhole Base\n(a) The pipe shall be encased in the concrete poured for the manhole base as detailed\nin Drawing No. 6.01, “Standard Sewer Manhole,” in Chapter 11, “Technical\nDrawings,” in these Standards. Special provisions shall be made for water\ntightness of the connection.\n(b) The exterior circumference of the pipe where encased in concrete for water\ntightness shall be uniformly roughened or scarified by sanding with coarse\nsandpaper or emery cloth for at least 6 inches encased length.\n(c) Additionally, gasket as specified elsewhere shall be stretched onto the pipe to\nform a weep ring where encased in concrete. Any alteration to the above\nspecified methods for pipe connection to concrete shall be submitted to the\nDirector for approval.\n(4) Grouting\n(a) Any opening between the manhole wall and pipe made during construction shall\nbe closed and sealed with watertight grout. The opening shall be of sufficient size\nto accommodate the pipe, “O” rings, and grout. The grout shall extend no less\nthan the full width of the manhole barrel.\n(b) Channels that have been cut into concrete bases shall be smoothed to the\nspecified contour with grout. The grout shall extend no less than the full width of\nthe manhole barrel.\n(5) Temporary Plugs: Where required on construction plans and at the end of each sewer\nservice stub out, the pipe shall be sealed with a removable plug. Plugs shall be\nspecifically manufactured for the pipelines where they are to be installed. The plug shall\nbe constructed of a material approved by the Director and shall provide a permanent\nwatertight installation without permanently sealing the joint.\n(6) Sewer Services: The general location of the sewer service lines is detailed in Drawing\nNo. 6.06, “Sewer Service Line,” in Chapter 11, “Technical Drawings,” in these\nStandards. Actual locations of the service lines shall be determined by the approved\nconstruction plans and in the field by the Director. The contractor shall notify the\nDirector prior to constructing each sewer main so that the Director may have adequate\ntime to determine the final location of each service tee or wye fitting to be installed in the\nsewer main. Failure of the contractor to properly notify the Director as noted above may\nresult in the contractor’s removal of any portion of the sewer main that is necessary to\ninstall the fittings in their proper location as determined by the Director.\n(a) The contractor will be allowed to tap and install a service saddle to new sewer\nmains only at those locations approved by the Director. Connections onto sewer\nmains shall be made only by boring or drilling with equipment designed for this\npurpose. Connections shall not be made by impact equipment. The contractor\nshall request, in writing, Director approval of methods and equipment proposed\nto be used for performing connections.\n(b) The contractor shall remove from the sewer main all debris created by making\nconnections before the service line is connected.\n(c) Service line saddle connections shall be attached to the sewer main with an\nepoxy-bonding agent. Where the sewer main has been lined, the original sewer\nmain shall be removed and the saddle shall be attached directly to the liner. The\nbonding agent shall be applied to a clean, dry surface. The connection shall\nremain dry until the bonding material has set, depending upon environmental\nconditions. Backfill around the connection shall not be attempted until the\nmaterial has hardened and been accepted by the Director.\n(d) At the end of all sewer services, the contractor shall provide plugs and furnish\nand set two marker posts. One marker post shall be buried at least 3 feet and\nshall extend at least 2 feet above the ground surface and shall have a piece of\ngreen flagging at the top or be painted green. The second marker shall extend\nfrom the end of the service to 18 inches below the existing surface. The marker\nposts shall be wood 2 x 4, 4 x 4 or #4 rebar.\n(7) Backfilling and Restoring Surface Conditions: Shall be as specified in Section 9.02,\n“Excavation and Trenching,” of these Standards.\n(8) Testing: Testing of PVC non-pressure pipe shall be as specified in Section 9.17, “Testing\nof Gravity Sewer Pipelines and Manholes,” of these Standards."
  },
  {
    "corpus": "DCS",
    "chapter": 9,
    "anchor": "9.15(A)",
    "heading": "General",
    "page_start": 259,
    "page_end": 260,
    "verbatim": "(1) Scope: This section describes the furnishing and installation of reinforced concrete pipe\nand appurtenances for culverts and storm drains in the pipe diameter size range of 12\ninches to 144 inches. Reinforced concrete pipe shall not be used for sanitary sewer mains.\n(2) Quality Assurance:\n(a) Manufacturer’s certificates of compliance and installation recommendations shall\nbe provided to the City inspector prior to construction. Installation\nrecommendations shall be followed during construction.\n(b) The pipe will be tested by the manufacturer based on the three-edge bearing test\nfor both the 0.01 inch crack and the ultimate strength as set forth in ASTM C-\n497. The pipe shall be tested at the manufacturer’s plant. Not more than 1\npercent of the number of pipe lengths, but no fewer than two pipes, for each size\nof pipe, will be tested. The contractor shall provide copies of the test results to\nthe Director for approval. The Director may select pieces to be tested."
  },
  {
    "corpus": "DCS",
    "chapter": 9,
    "anchor": "9.15(B)",
    "heading": "Materials",
    "page_start": 260,
    "page_end": 261,
    "verbatim": "(1) Reinforced Concrete Pipe\n(a) The reinforced concrete pipe shall comply with the requirements of ASTM C76.\nThe pipe shall be Class III unless noted otherwise on the approved construction\nplans. The cement for the pipe shall conform to the requirements set forth in\nASTM 150 and shall be type II and shall have a minimum compressive strength\nof 4,000 psi. All wall thicknesses shall be those established in “Wall B” in table\n3, of said C76 specification, and the reinforcement shall be shown in the same\n“Wall B.” Each section, or “stick”, of pipe shall be 7 feet-6 inches or greater in\nlength.\n(b) No elliptical reinforcement will be permitted except for any elliptical reinforced\nconcrete pipe designated on the construction plans.\n(c) Lifting holes will not be permitted in any of the pipe. The following shall be\nclearly marked on the exterior surface of the pipe:\n(i) ASTM Specification;\n(ii) Date of manufacture;\n(iii) Class and size; and\n(iv) Name or trademark of manufacturer.\n(d) The joint design shall be tongue and groove, or bell and spigot. Joints for the\ncircular reinforced concrete pipe shall be all rubber gasket conforming to ASTM\nC-443, latest revision. The gasket shall be attached to the spigot of the pipe and\nshall make the joint flexible and watertight. The contractor may use butyl mastic\njoint sealant in rope or trowel applied form in lieu of rubber gaskets for circular\npipe if approved in writing by the Director. For all non-circular pipe and\nculverts, butyl mastic joint sealant may be used. The contractor shall submit test\nresults and material specifications on the sealant to the Director before the\nDirector gives written approval of its use. This sealant shall be made specifically\nfor permanently sealing joints in tongue and groove concrete sewer pipe, must\nadhere tightly to the pipe surface, and form a tight flexible joint. The gaskets or\nsealants shall be installed as directed by the manufacturer of the pipe.\n(e) Flared end sections, bends and tees shall comply with the requirements of ASTM\nC76 and shall be the same class and shall have the same joint design as the pipe\ndescribed above.\n(f) Visual inspections of all materials shall be made at the job site, and pipe will be\nrejected on account of any deficiencies covered by ASTM Specification\nDesignation C76 or on account of the following:\n(i) Porous spots, inside or outside, having a greater area than 10 square\ninches and a depth of more than 1/4 inch;\n(ii) Patched or repair of porous spots or other defects that are not approved\nby the Director; or\n(iii) Exposure of reinforcement that indicates the reinforcement has been\nreplaced."
  },
  {
    "corpus": "DCS",
    "chapter": 9,
    "anchor": "9.15(C)",
    "heading": "Execution",
    "page_start": 261,
    "page_end": 262,
    "verbatim": "(1) Laying Pipe\n(a) All materials shall be carefully lowered into the trench piece-by-piece by means\nof a derrick, ropes or other suitable tools or equipment, in such a manner as to\nprevent damage. Under no circumstances shall materials be dropped or dumped\ninto the trench. All pipe shall be inspected for defects prior to installation. Any\ndefective, damaged or unsound pipe shall be rejected.\n(b) All foreign matter or dirt shall be removed from the inside of the pipe and fittings\nbefore the pipe is lowered into its position in the trench. Every precaution shall\nbe taken to prevent foreign material from entering the pipe while it is being\nplaced in the trench. If the pipe-laying crew is unable to place the pipe into the\ntrench without getting foreign matter or dirt into it, the Director may require that,\nbefore lowering the pipe into the trench, a heavy, tightly woven canvas bag of\nsuitable size be placed over each end and left there until the connection is to be\nmade to the adjacent pipes.\n(c) An approved snug-fitting stopper or plug shall be installed in each pipe\nimmediately after it is laid and prior to any further excavating, or backfilling. All\nopenings along the line of the main shall be securely closed as directed and, in\nthe suspension of work at any time, stoppers shall be placed to prevent dirt or\nother substances from entering the main. During laying operations, no debris,\ntools, clothing or other materials shall be placed in the pipe.\n(d) Pipes shall be laid to a true line and at uniform rates of grade between manholes\nas shown on the approved construction plans. Fine grading to the bottom of the\nbarrel shall proceed ahead of the pipe laying. The grade shall be accurately\nestablished for each joint by laser beam, or other means approved in writing by\nthe Director. The laser beam shall be checked with a level each time it is moved\nand each day before construction proceeds, and thereafter as required to assure\nthat it is set at the correct alignment. If any errors of grade are observed, pipe\nlaying shall stop until the grade is corrected.\n(e) Pipe laying shall proceed upgrade with the spigot ends pointed in the direction of\nflow. No pipe shall be laid in water or when the trench conditions are unsuitable\nfor such work. The contractor shall make all connections of pipe to the manholes\nthat have previously been constructed. When connecting to existing sewers, the\ncontractor shall take every precaution necessary to prevent dirt or debris from\nentering the existing lines.\n(f) Bedding shall be placed under and on both sides of the pipe as each length of\nsewer pipe is installed.\n(2) Joining Pipe\n(a) Use a method of joining pipe sections that ensures that ends are fully entered and\ninner surfaces are flush and even. The equipment used to force the joints\ntogether must be adequate enough to overcome the gasket pressure involved.\n(b) Just prior to joining the pipes, the ends of the pipe shall be thoroughly cleaned to\nremove all foreign substances that may have adhered to the pipe surface. All\ndust and dirt shall be removed with a clean rag. A lubricating solution that is not\ninjurious to the gasket or concrete, such as flax soap or water glass, shall be\nliberally applied to the gasket groove and to the entire surface of the bell ring.\nFollowing this operation, a thin film of lubricant shall be applied to the gasket\nthat shall then be snapped into place in the groove, after which a small diameter\nsmooth steel rod shall be inserted between the gasket and groove and run\ncompletely around the gasket to equalize the gasket tension.\n(c) In the event that any foreign matter becomes imbedded in the lubricant, or the\nlubricant becomes contaminated by water or other substances before the joint is\nstarted, the area affected shall be re-cleaned and new lubricant shall be applied.\n(d) The pipe being jointed shall be carefully moved into position, be line and grade\nchecked, and as the spigot end is started into the bell of the section previously\nlaid, the gasket position shall be checked to ensure uniform entry into the bell at\nall points.\n(3) Testing and Flushing Pipe\n(a) Prior to acceptance of each section of storm sewer line, the contractor shall jet\nclean all sewers up through 18 inches in diameter. Larger storm sewers shall be\ncleaned by other appropriate methods approved by the Director. All dirt and\ndebris shall be prevented from entering the existing storm sewer system by\nmeans of watertight plugs or other suitable methods.\n(b) If the Director finds it necessary to clean the mains immediately after\nconstruction by rodding, jetting, or both, the Director shall assess the contractor\nfor the cleaning at a set per foot charge with a minimum dollar amount.\n(c) The Director will televise all mains as part of public inspection, and will bill the\ncontractor for the televising at a set per foot charge with a minimum dollar\namount. Any defects found during the televising shall be repaired by the\ncontractor, in a manner approved by the Director.\n(d) Any visible infiltration, that the Director finds to be the result of poor installation\nof the specified materials, shall be repaired by the contractor in a manner\napproved by the Director before the work will be accepted.\n(e) Before acceptance of the work, the Director will survey the manhole invert and\nsurface elevations. Any inverts or surface elevations not meeting the approved\ndesign in the construction plans shall not be approved and shall be redone to the\nsatisfaction of the Director.\n(f) Upon completion of construction, the Director will carefully inspect all sewers\nand appurtenances. Any unsatisfactory work shall be removed and replaced by\nthe contractor in a proper manner. The invert of sewer and manholes shall be left\nsmooth, clean, and free from any obstructions throughout the entire line.\nManhole rings and covers must be raised to finished grade before final\nacceptance of the sewer.\n(g) For sanitary sewers, testing shall be as specified in Section 9.17, “Testing of\nGravity Sewer Pipelines and Manholes,” of these Standards."
  },
  {
    "corpus": "DCS",
    "chapter": 9,
    "anchor": "9.16(A)",
    "heading": "General",
    "page_start": 263,
    "page_end": 263,
    "verbatim": "(1) Scope: This section describes the furnishing and installation of precast concrete\nmanholes, storm sewer inlets and appurtenances.\n(2) Quality Assurance: Manufacturer’s certificates of compliance and installation\nrecommendations shall be provided to the City inspector prior to construction.\nInstallation recommendations shall be followed during construction."
  },
  {
    "corpus": "DCS",
    "chapter": 9,
    "anchor": "9.16(B)",
    "heading": "Materials",
    "page_start": 263,
    "page_end": 264,
    "verbatim": "(1) General\n(a) Manholes shall be constructed of precast concrete riser sections, in accordance\nwith Drawing No. 6.01, “Standard Sewer Manhole,” in Chapter 11, “Technical\nDrawings,” of these Standards. The concrete sections shall conform to ASTM\nC478. The top section required for change of diameter shall be concentric cone\nor flat slab. Invert channel shall be smooth and semicircular in shape conforming\nto the inside of the adjacent sewer section. The minimum internal diameter of\nthe manhole barrel shall be in Table 9-6, “Required Manhole Diameters,” for all\nmanhole installations:\nTable 9-6: Required Manhole Diameters\nPipe Size (Diameter) Inner Manhole Section Diameter\n18 Inches (and Smaller) 4 Feet\n21 - 36 Inches 5 Feet\n42 - 48 Inches 6 Feet\n54 Inches (and Larger) Special Detail\n(b) The minimum internal diameter of the manhole barrel may also be determined by\nthe number and size of pipes junctioning at a manhole. In such cases, the\nDirector may modify the minimum internal diameter of the manhole barrel as\nrequired.\n(c) To bring the manhole cover to the correct elevation, the adjustment section of\neach manhole shall be constructed of brick that is sound and true in shape and\nsize and shall be Grade S-W from clay or shale. Precast concrete grade\nadjustment rings may be substituted for the brick. These rings shall be not less\nthan 6 inches wide and furnished in heights to allow for 1-inch adjustment. Total\nadjustment height, with grade rings or bricks, shall not exceed 12 inches.\n(2) Joints: Precast manhole and inlet joints shall be made watertight with RUB’R-NEK,\nKent Seal No. 2, or LO-MOD GEL material, or approved equivalent. The diameter of\ngasket shall be as recommended by the manufacturer.\n(3) Frame and Cover: Manhole frames and covers shall be of heavy duty traffic lids,\nColorado Springs pattern, round base, 22-1/8 inch opening lids 1 inch thick, non-locking\ntype with frame and cover weighing approximately 327 pounds. The cover and frame\nseat shall be machine finished to prevent any rocking of the cover in its associated frame.\nThe cover shall have the word “SEWER” for sanitary sewer manholes, or “STORM\nSEWER” for storm sewer manholes clearly cast on the surface. Covers for other utility\nmanholes shall also be marked with the appropriate utility designation. Frames and\ncovers shall be CASTINGS, INC. MH 310 COVER B, or approved equivalent.\n(4) Manhole Steps: Manhole steps shall be built into and thoroughly anchored to the\nmanhole walls at time of fabrication and shall be positioned as shown on the approved\nconstruction plans, and in accordance with the technical drawings in Chapter 11,\n“Technical Drawings,” of these Standards. The steps shall be made of polypropylene\ncoated reinforcing steel.\n(5) Grout: Grout shall be “non-shrink” type with aluminum filings; grout with iron filings is\nnot acceptable. Grout shall be “Five Star Grout,” “Embeco Grout” or equivalent.\n(6) Concrete: Concrete for cast-in-place manhole bases shall have a 28-day compressive\nstrength of not less than 3,000 psi. The maximum water content shall be 0.5 pounds of\nwater per pound of cement. Entrained and entrapped air shall be between 4 and 9\npercent. All reinforcement shall be standard deformed reinforcement conforming to the\nrequirements set forth in ASTM, A615, Grade 60.\n(7) Inlets: Inlets shall be constructed of reinforced concrete and shall conform to the\ndimensions and specifications as set forth for Type “R” Curb Inlets in Chapter 11,\n“Technical Drawings,” of these Standards, and CDOT’s M & S Standards. Inlet steps\nshall be built into and thoroughly anchored to the walls at the time of inlet construction.\nThese steps shall conform to the requirements for manhole steps and shall be positioned\nas shown on the technical drawings."
  },
  {
    "corpus": "DCS",
    "chapter": 9,
    "anchor": "9.16(C)",
    "heading": "Execution",
    "page_start": 264,
    "page_end": 265,
    "verbatim": "(1) Construction of Manholes\n(a) Concrete bases shall be poured on undisturbed ground. Pipe sections shall be\nflush on the inside of the structural wall (except as noted below) and project\noutside sufficiently for proper connection to the next pipe section. All pipelines\ninto a manhole shall have a joint located no more than 12 inches from the\nexterior wall. Where incoming pipes enter a storm drain manhole at an elevation\n3 feet or greater above the base, the incoming pipe shall project 2 inches inside\nthe manhole. All annular spaces around the pipe opening shall be grouted.\n(b) For all precast manhole bases, the ground surface below precast concrete bases\nshall be excavated 6 inches below the elevation of the bottom of the base and\nbackfilled with bedding material, meeting the requirements of Subsection\n9.02(B) of these Standards. The bedding material shall be carefully leveled and\nsmoothed as to give uniform support to the precast base over its entire area.\n(c) The invert channels of manholes shall be constructed in accordance with the\nDrawing No. 6.03, “Manhole Invert,” in Chapter 11, “Technical Drawings,” of\nthese Standards. They shall be smooth and semicircular in shape, conforming to\nthe inside of the incoming and outgoing sewer pipelines. Changes in direction of\nflow shall be made with a smooth curve of as large a radius as the size of the\nmanhole will permit. Where differences of 24 inches or less in invert elevations\nare called for, sloped flow channels shall be formed so the water does not\nundergo a vertical drop. A drop manhole shall be installed where the specified\ndistance in the manhole inverts exceeds 24 inches. The inlet channels may be\nformed directly in the concrete of the manhole base. The floor of the manhole\noutside of the channel shall be smooth and shall slope towards the channel not\nless than 1 inch per foot nor more than 2 inches per foot. The manhole covers\nshall be set with a final elevation of 1/4 inch below the finished grade in\nroadways and 1 to 2 inches above grade outside of roadways. When a manhole is\nlocated in the pavement area, it shall not be constructed to final grade until the\npavement has been completed, unless directed otherwise by the Director.\n(d) Install joint material per manufacturer’s instructions so that no voids are present.\nGrout all joints inside and outside after manhole assembly is completed.\n(e) Gaskets for connecting PVC pipe to manhole sections shall be specifically\nmanufactured for that purpose. The gasket shall provide for at least five bearing\npoints on the pipe surface. The interior circumference of the gasket shall be\napproximately 5 percent less than the exterior circumference of the pipe. The\ngasket shall be as manufactured by Hamilton Kent Mfg. Co. of Kent, Ohio, or\napproved equivalent. All annular spaces around pipe openings must be grouted.\n(f) Stubs shall be provided at manholes when indicated on the construction plans.\nSuch stubs shall be sealed with a removable plug. Plugs shall be specifically\nmanufactured for the pipelines where they are to be installed. The plug shall be\nconstructed of a material approved by the Director and shall provide a permanent\nwatertight installation.\n(2) Adjusting Manhole Tops: When grade adjustment of an existing structure is specified,\nremove frames and covers and reconstruct as required. Reset cleaned frames at the\nindicated elevation. Prior to final acceptance, clean structures of accumulations of silt,\ndebris, or foreign matter.\n(3) Testing Manholes: Refer to Section 9.17, “Testing of Gravity Sewer Pipelines and\nManholes,” of these Standards."
  },
  {
    "corpus": "DCS",
    "chapter": 9,
    "anchor": "9.17(A)",
    "heading": "General",
    "page_start": 265,
    "page_end": 265,
    "verbatim": "This section describes the testing of gravity sewer pipelines and manholes including sanitary\nsewers and storm drains."
  },
  {
    "corpus": "DCS",
    "chapter": 9,
    "anchor": "9.17(B)",
    "heading": "Materials",
    "page_start": 265,
    "page_end": 265,
    "verbatim": "The contractor shall provide all equipment and material specifically designed for the testing\nspecified in this section."
  },
  {
    "corpus": "DCS",
    "chapter": 9,
    "anchor": "9.17(C)",
    "heading": "Execution",
    "page_start": 265,
    "page_end": 267,
    "verbatim": "(1) Notification and Witness: The contractor shall notify the Director of all tests at least 48\nhours prior to testing so that the Director can witness the tests.\n(2) When to Test: The pipe shall be tested for leakage after the pipe has been installed and\nthe trench has been partially backfilled, except at the joints, or backfilled as permitted by\nthe Director.\n(3) Testing Procedures\n(a) General: All sanitary sewer mains and appurtenances shall be cleaned, tested,\nand PACP TV inspected after backfill operations have been completed. The\ncontractor shall furnish all labor, materials, tools, and equipment necessary to\nclean the pipe and appurtenances, perform the tests and all work incidental\nthereto. Any damages to the pipeline caused by cleaning or testing operations\nshall be repaired or replaced by the contractor\n(b) Alignment and Grade: Gravity sewer pipelines will be checked by the Director\nto determine whether any displacement of the pipe has occurred after the trench\nhas been bedded. The maximum vertical deflection allowed for PVC pipe is five\npercent. The City may require the contractor to perform deflection tests of the\npipe before acceptance. Optional devices for testing include calibrated television,\nphotography, properly sized go-no-go mandrel, sewer ball, or deflectometer. The\nmethod used shall be approved by the City. To ensure accurate testing, the line\nshall be thoroughly cleaned prior to testing.\n(4) Air Tests\n(a) Air testing of sanitary sewer pipes shall be done on all sections of pipe between\nmanholes. The pipe shall be cleaned and may be wetted before air testing. The\nsection of pipeline being tested shall be plugged at each manhole with pneumatic\nballs.\n(b) Low-pressure air shall be introduced into the plugged line until an internal\npressure of 4 psig greater than the average backpressure of any ground water\npressure that may submerge the pipe would cause. At least 2 minutes shall pass\nto allow air temperature to stabilize before the test time is started.\n(c) No pipeline installation will be accepted if the pressure drops 0.5 psig or more\nduring the time and for the length of pipe shown in Table 9-7, “Specifications for\nAir Testing of Sanitary Sewer Pipes,” of these Standards:\n(d) If the pipeline installation fails the air test, repairs shall be made and the pipe\nshall be retested until it passes the air test.\n(5) Deflection\n(a) All PVC non-pressure pipes shall be tested for vertical deflection after placement\nand compaction of backfill. The maximum deflection allowed is 5 percent.\n(b) Method of testing shall be by calibrated television, photography, properly sized\ngo-no-go mandrel, sewer ball, or deflectometer. The method used shall be\napproved by the Director. Any and all pipe with vertical defection greater than\nthe allowable shall be excavated, and removed from the pipeline, replaced,\nbackfilled and compacted as specified, and retested at the contractor’s expense.\nTable 9-7: Specifications for Air Testing of Sanitary Sewer Pipes\nPipe Diameter Minimum Test Time for Maximum Pipe Length Minimum Test Time for\n(Inches) Pipe Lengths up to Lengths for Minimum Time Pipe Lengths Greater than\nin Column 3 (min:sec) Testing in Column 2 Column 3 (Seconds)\n(Feet)\n4 1:53 597 0.190 x Pipe Length (Feet)\n2:50 398 0.427 x Pipe Length (Feet)\n8 3:47 298 0.760 x Pipe Length (Feet)\n10 4:43 239 1.187 x Pipe Length (Feet)\n12 5:40 199 1.709 x Pipe Length (Feet)\n15 7:05 159 2.671 x Pipe Length (Feet)\n(6) Television\n(a) Following completion of sewer line work, the contractor shall perform and\nsupply the City with a PACP TV inspection report and digital video of the sewer.\nTV inspections shall be performed by a PACP certified inspector. Prior to\nperforming the TV inspection, the sewer improvements must be complete,\naccessible, and cleaned using pressurized water sufficient to allow for a detailed\ninspection. The City will not accept inspections for lines that have not been\ncleaned.\n(b) Following TV inspections and any necessary repairs that the contractor may have\nidentified, the City will review the inspection data. If the condition of the pipe is\ndetermined to be free of structural defects, deflections, debris, defects in pipe\nmaterial, and other installation errors, the work will be eligible for acceptance."
  },
  {
    "corpus": "DCS",
    "chapter": 9,
    "anchor": "9.17(D)",
    "heading": "Sanitary Sewer Manholes",
    "page_start": 267,
    "page_end": 268,
    "verbatim": "(1) General\n(a) During the construction of the manholes, the contractor shall, in accordance with\ngood construction practice, insure that no earth, sand, rocks or other foreign\nmaterial exists on the joint surfaces during assembly of the sections. The\nDirector shall check each manhole to determine whether the manhole fulfills the\nrequirements of the construction plans and these Standards.\n(b) The Director shall visually check each manhole, both exterior and interior, for\nflaws, cracks, holes, or other inadequacies that might affect the operation or\nwatertight integrity of the manhole. Should any inadequacies be found, any\nrepairs deemed necessary by the Director shall be made by the contractor.\n(c) Exfiltration tests as specified above shall be performed on all sanitary sewer\nmanholes.\n(2) Vacuum Testing: When required by the Director, sanitary sewer manholes shall be\nvacuum tested with the following procedure:\n(a) Each manhole shall be tested immediately after assembly and prior to backfilling.\n(b) All lift holes shall be plugged with an approved non-shrink grout.\n(c) No grout will be placed in the horizontal joints before testing.\n(d) All pipes entering the manhole shall be plugged, taking care to securely brace the\nplugs from being drawn into the manhole.\n(e) The test head shall be placed at the inside of the top of the cone section and the\nseal inflated in accordance with the manufacturer’s recommendation.\n(f) A vacuum of 10 inches of mercury shall be drawn and the vacuum pump shut off.\nWith the valves closed, the time shall be measured for the vacuum drop to 9\ninches. The manhole shall pass if the time is greater than 60 seconds for one 48\ninch diameter manhole, 75 seconds for 60 inches, and 90 seconds for 72 inches.\n(g) If the manhole fails the initial test, necessary repairs shall be made with a non-\nshrink grout while the vacuum is still being drawn. Retesting shall proceed until\na satisfactory test is obtained."
  },
  {
    "corpus": "DCS",
    "chapter": 9,
    "anchor": "9.18(A)",
    "heading": "General",
    "page_start": 268,
    "page_end": 268,
    "verbatim": "(1) Scope: This section describes the furnishing and installation of corrugated metal pipe\nand appurtenances for drainage culverts in the pipe diameter size range of 12 to 54\ninches.\n(2) Quality Assurance: Manufacturer’s certificates of compliance and installation\nrecommendations shall be provided to the City inspector prior to construction.\nInstallation recommendations shall be followed during construction."
  },
  {
    "corpus": "DCS",
    "chapter": 9,
    "anchor": "9.18(B)",
    "heading": "Materials",
    "page_start": 268,
    "page_end": 269,
    "verbatim": "(1) Corrugated Metal Pipe\n(a) Pipe shall be fabricated from zinc-coated (galvanized) iron or steel sheets\nconforming to AASHTO M-218 except as modified herein. The diameter or\nspan by rise dimensions indicated on the drawings shall mean the nominal inside\ndimensions of the conduit. The widths of the laps and depths or corrugations\nshall be as specified in AASHTO M-36. The pipe shall have the following\nminimum gauge (specified thickness) for the sizes shown in Table 9-8,\n“Corrugated Base Metal Specifications,” of these Standards:\nTable 9-8: Corrugated Base Metal Specifications\nDiameter (Inches) Gauge Number Specified Galvanized Specified Galvanized\nThickness (Inches) Thickness (Inches)\n21 and Smaller 16 0.064 0.0598\n24 14 0.079 0.0747\n30 - 54 12 0.109 0.1046\n(2) Dimpled Coupling Bands: The dimpled coupling bands shall be the same thickness as\nthat used for the pipe and shall be at least 12 inches wide. The dimples shall conform\nsubstantially to the shape and depth of pipe corrugations and shall be in circumferential\nrows. Each row shall contain dimples so spaced as to effectively engage all corrugations\nof the pipe ends. All bands shall have at least two zinc coated bolts per connection,\nconforming to ASTM A 307, grade A, electroplated in accordance with ASTM A 164,\nType RS, not less than ½ inch in diameter. The bands shall have end connection angles,\nconforming to ASTM A 36, zinc-coated in accordance to ASTM A 153, not less than 2\ninches by 2 inches by 3/16 inch by 11 inches, adequately fastened to the band.\n(3) Fittings (Including Flared End Sections) and Specials: Fittings and specials shall be\nof the same material, coating, and wall thickness, including the same structural qualities,\nas the adjoining pipe. Steel flared end sections shall be furnished complete with field-\nbolted toe plates.\n(4) Repair of Damaged Spelter Coatings: Units such as tees, angles or bends on which the\nspelter coating has been burned by flame cutting and gas or arc welding, or otherwise\ndamaged in fabrication or shipping, shall be wire-brushed and painted with two coats of\nHaltz-Rust HR-54-53 or equal conforming to Federal Specification and Standards, TT-P-\n641, or as otherwise approved by the Director. Culverts, pipes, fittings, specials, etc., on\nwhich the spelter coating has been bruised or broken either in the shop or in shipping, or\nthat shows defective workmanship, will be rejected."
  },
  {
    "corpus": "DCS",
    "chapter": 9,
    "anchor": "9.18(C)",
    "heading": "Execution",
    "page_start": 269,
    "page_end": 270,
    "verbatim": "Installation of corrugated steel pipe is considered to be a flexible conduit and, therefore, special\ncare must be taken during the bedding and backfilling operations. Installation and backfilling\noperations shall be in accordance with the recommended practices set forth in the “Handbook of\nSteel Drainage and Highway Construction Projects,” published by the American Iron and Steel\nInstitute.\n(1) Bedding\n(a) All pipe shall be bedded with an approved granular bedding material. The pipe\nshall be bedded true to line and grade with uniform and continuous support from\na firm base. Blocking shall not be used to bring the pipe to grade.\n(b) The bedding material shall be placed evenly on both sides of the pipe to a point\n12 inches above the top of the pipe. Special care shall be taken to insure that all\nvoids are filled beneath the pipe haunch and that the bedding material is properly\nplaced and compacted to provide lateral restraint. The trench sidewall shall be\nadequately braced, shored or sheeted as necessary to stabilize the trench walls.\nThe trench shall not be any wider than necessary for proper installation, and pipe\njointing. The bedding material shall be placed under haunches and around the\npipe alternately in 6-inch layers on both sides of the pipe to permit thorough\nconsolidation of the bedding material. This material is placed alternately to keep\nit at the same elevation on both sides of the pipe at all times.\n(2) Backfilling: After the pipe has been properly installed and bedded, the remaining trench\nexcavation shall be restored as set forth in Section 8-5-12, “Standards for Repairs and\nRestoration of Pavement or Sidewalks,” B.R.C. 1981. Pipe installed outside of public\nrights-of-way where no pavement is impacted may be backfilled in the following manner.\nThe backfill shall be placed in 8 inch loose lifts and compacted to 90 percent Standard\nProctor density (AASHTO T-180) with mechanical hand tampers, for the first 2 feet. At\nleast 4 feet of cover over the top of pipe shall be provided before the use of wheel-\nmounted mechanical tampers (free drop hammer), hydraulic tampers, (Hydraulic ram\nhammers) or other heavy tamping equipment will be permitted. Puddling or jetting will\nnot be allowed.\n(3) Removal of Trench Protection: Extreme care shall be taken in the removal of cribbing,\nshoring, sheeting, etc., so as not to disturb previously constructed foundation, bedding\nand initial backfill. If it was necessary to place or drive sheeting or other trench\nprotection below the top of the pipe, the sheeting, shoring, etc., shall be cut off at a point\n1 foot above the pipe and the remaining material shall be left in place. Removal of this\nportion could seriously jeopardize the side support necessary for “flexible conduits” and\ncreate excessive lateral soils pressures and pipe deflections.\n(4) Protection of Conduit During Construction: Maximum supporting strength in flexible\nconduits does not develop until the fill consolidates. Therefore, excessive concentrated\nloads or heavy equipment on top of or along side if the pipe shall be avoided."
  },
  {
    "corpus": "DCS",
    "chapter": 9,
    "anchor": "9.19(A)",
    "heading": "General",
    "page_start": 270,
    "page_end": 270,
    "verbatim": "(1) Scope: This section describes the reconstruction of pipelines and conduits by the\ninstallation of a resin-impregnated flexible tube that is inserted into the original non-\npressure conduit.\n(2) Quality Assurance: Manufacturer’s certificates of compliance and installation\nrecommendations shall be provided to the City inspector prior to construction.\nInstallation recommendations shall be followed during construction."
  },
  {
    "corpus": "DCS",
    "chapter": 9,
    "anchor": "9.19(B)",
    "heading": "Materials",
    "page_start": 270,
    "page_end": 271,
    "verbatim": "(1) Resin-Impregnated Tube\n(a) The tube shall meet the requirements of ASTM F1216 and shall have a uniform\nthickness that, when compressed at installation pressures, will equal the specified\nnominal tube thickness, with a -5 percent manufacturing tolerance. The tube\nshall be fabricated to a size that when installed will tightly fit the internal\ncircumference and length of the original pipe. Allowance should be made for\ncircumferential stretching during insertion. The minimum length shall be that\ndeemed necessary by the contractor to effectively span the distance between\nrespective access points unless otherwise specified. The contractor shall verify\nthe lengths and diameters in the field before fabricating the tube. Individual\ninsertion runs can be made over one or more manhole sections as determined in\nthe field by the contractor. The maximum allowed insertion run is 1,200 feet.\nIntermediate manholes will be reopened as directed by the Director.\n(b) The outside layer of the tube (before insertion) shall be translucent plastic coated\nwith a flexible material that clearly allows inspection of the resin impregnation\n(wet-out) procedure. The translucent plastic coating on the tube will allow visual\nproof that the resin has wet-out the entire tube and that there are no dry areas. A\nvacuum shall be used to ensure the resin fills all dry areas. The plastic coating\nshall not be subject to delamination after curing of the CIPP.\n(c) The tube shall be homogenous across the entire wall thickness containing no\nintermediate or encapsulated elastomeric layers. No materials will be allowed in\nthe tube that is subject to delamination of the cured CIPP.\n(2) Resin: The resin system shall meet the requirements of ASTM F1216.\n(3) Structural Requirements\n(a) The CIPP wall thickness will be measured in accordance with the applicable\nsections of ASTM Test Method D2122. Sufficient readings, at least eight, will\nbe made to ensure that the minimum thickness has been determined. A\ncylindrical anvil tubing micrometer accurate to +0.02mm (+0.001 in) will be\nused. The minimum wall thickness at any cross section shall meet or exceed\nthose shown on the proposal forms and the approved plans, with the allowable\nminus five (-5) percent tolerance. The wall thickness tests will be performed by\na Certified Independent Laboratory, approved by the Director. All costs, for\ntesting, shall be borne by the contractor.\n(b) The layers of the CIPP shall be uniformly bonded. It shall not be possible to\nseparate any two layers with a probe or point of a knife blade so that the layers\nseparate cleanly of the probe or knife blade moves freely between the layers, nor\nshall separation of any layers occur during testing performed under the\nrequirements of this specification.\n(c) The cured pipe material (CIPP) shall conform to the minimum structural\nstandards, as follows:\n(i) Flexural Stress (ASTM D-790) 4,500 psi\n(ii) Modulus of Elasticity (ASTM D-790) 250,000 psi\n(d) The liner shall be designed assuming a fully deteriorated host pipe."
  },
  {
    "corpus": "DCS",
    "chapter": 9,
    "anchor": "9.19(C)",
    "heading": "Execution",
    "page_start": 271,
    "page_end": 273,
    "verbatim": "(1) Cleaning\n(a) The contractor shall be required to remove all internal debris from the line by use\nof water jet equipment prior to inserting the CIPP tube. The cleaning operation\nshall remove any and all debris so that each joint of pipe can be thoroughly\ninspected and successfully reconstructed.\n(b) All sludge, dirt, sand, rocks, grease and other solid or semi-solid material\nresulting from the cleaning operation shall be removed at the downstream\nmanhole of the section being cleaned. Passing material from one manhole to\nanother will not be permitted.\n(c) All such debris resulting from the cleaning operations shall be removed from the\nsite and disposed of in the proper manner. The contractor shall bear all costs\nassociated with testing of debris and proper dumping. Dumping of the debris\nshall be in accordance with all local, state, and federal regulations.\n(d) All debris shall be removed from the downstream manhole and the site no less\noften than at the end of each workday. The contractor shall leave no debris\nunattended at the site. Under no circumstances will the contractor be allowed to\naccumulate debris beyond the stated time. In the event the contractor has not\nremoved the debris generated by the cleaning operation, the contractor will not\nbe allowed to proceed with the work until the debris is properly removed.\n(e) During all sewer cleaning operations, satisfactory precautions shall be taken to\nprotect the sewer lines from damage that might occur by improper use of\ncleaning equipment. Precautions shall be taken to ensure that the cleaning\noperation will not cause any damage or flooding to public or private property\nbeing served by the section of sewer line being cleaned. The contractor shall\nbear all costs associated with any flooding or damage to basements or structures.\n(2) Bypassing Flows: The contractor shall provide for flows around the section(s) of pipe\ndesignated for rehabilitation. The bypass shall be made by plugging the line at an\nexisting upstream manhole or adjacent system. The pump and bypass lines shall be of\nadequate capacity and size to handle the flow. Bypassing includes any main lines and\nservice lines, street gutters or open excavations. Any spills that occur must be\nimmediately cleaned and the affected area disinfected.\n(3) Inspection of Pipelines: Inspections of pipelines shall be performed by trained personnel\nexperienced in locating breaks, obstacles and service connections by closed circuit\ntelevision. The inspection of pipelines is also to determine active service connections and\nthe addresses that they serve. The interior of the pipe shall be carefully inspected to\ndetermine the location of any conditions that may prevent proper installation of the CIPP\ninto the pipeline and it shall be noted so these conditions can be corrected. The\ncontractor shall perform and supply the City with a PACP TV inspection report and\ndigital video of the sewer prior to and after installation of the CIPP lining.\n(4) Line Obstructions: It shall be the responsibility of the contractor to clear the line of\nobstructions such as solids and roots that will prevent the insertion of the CIPP. If pre-\ninstallation inspection reveals an obstruction such as a protruding service connection,\ndropped joint, or a collapse that will prevent the inversion process, and it cannot be\nremoved by conventional cleaning equipment, then the contractor shall repair the\nexcavation to uncover and remove or repair the obstruction. Such excavation shall be\napproved in writing by the Director prior to the commencement of the work.\n(5) CIPP Installation\n(a) CIPP installation shall be in accordance with ASTM F1216, Section 7, with the\nadditional following requirements. The resin shall be cured by circulating hot\nwater within the tube. After curing, the finished pipe (CIPP) shall be continuous\nand tight fitting.\n(b) The contractor, and the Director, shall designate a location where the tube will be\nimpregnated with resin prior to installation, in order that an inspection can be\nmade to determine proper materials and procedures. A resin and catalyst system\ncompatible with the requirements of this method shall be used.\n(c) The heat source shall be fitted with suitable monitors to gauge the temperature of\nthe incoming and outgoing heat supply. Another such gauge shall be placed at\nthe remote manhole to determine the temperature at that location during the cure.\nIf air pressure and steam are used with styrene based resins, the compressed\natmosphere shall be monitored with a safety gas detector to ensure that it does\nnot reach the explosive limit.\n(d) The finished CIPP shall be continuous over the entire length of an insertion run\nbetween two manholes and be free, as commercially practicable, from visual\ndefects such as foreign inclusions, dry spots, pinholes, and delamination. It shall\nalso meet the leakage/pressure test requirements specified below (water\ntightness).\n(e) Before the insertion process begins, the minimum pressure required to hold the\ntube tight against the existing conduit and the maximum allowable pressure so as\nnot to damage the tube shall be provided by the tube manufacturer, and it will be\nthe contractor’s responsibility to obtain and submit this information to the\nDirector. Once the insertion has started, the pressure shall be maintained\nbetween the minimum and maximum pressures until the operation has been\ncompleted. If air pressure is used for inversion, the equipment shall be fitted\nwith a pressure gauge accurate to 0.01 psi. Should the pressure deviate from\nwithin the range of minimum and maximum pressures, the installed tube will be\nrejected and the contractor will remove and dispose of the tube, at their expense.\n(f) Before the curing process begins, the pressure required to hold the flexible tube\ntight against the host pipe shall be provided by the tube manufacturer and\nsubmitted to the Director prior to any inversion process. Once the cure has\nstarted and dimpling for laterals is completed, the required pressure shall be\nmaintained until the cure is complete. Should the pressure deviate more than 1\npsi (2.3 feet of water) from the required pressure during the critical curing period,\nthe tube will be rejected and the contractor will be responsible for its removal and\ndisposal and replacement with new CIPP at, at their expense. A complete log of\nthe pressures shall be maintained on site and shall be offered to the Director after\neach inversion.\n(6) Sealing at Manholes: A hydrophilic end seal shall be installed at the upstream and\ndownstream manholes prior to installation of the CIPP liner. The end seals shall be LMK\nInsignia End Seals or equivalent.\n(7) Service Connections\n(a) After the curing of the CIPP is completed, the contractor shall restore the existing\nactive service connections and branch connections. The connections shall be\nreopened without excavation, and in the case of non-man entry pipes, from the\ninterior of the pipeline utilizing a remotely controlled cutting device, monitored\nby a closed circuit television camera, that re-establishes them to not less than 95\npercent capacity, while conforming to the shape of the existing opening. All\nreinstated openings shall be smoothed by brushing with a wire brush.\n(b) The contractor shall verify the possession of at least two complete cutting devices\nin good working order before each insertion.\n(c) If excavations for the purpose of re-opening connections are required, the\ncontractor will be responsible for all costs and liability associated with such\nexcavation and restoration work.\n(d) No service connection shall remain out of service for more than 24 hours at a\ntime unless the contractor has provided temporary facilities or other appropriate\naccommodations for the affected service.\n(8) Testing: CIPP samples shall be prepared and tested in accordance with ASTM F1216,\nSection 8.1, using both methods 8.1.1 and 8.1.2 if so required by the Director. The test\nwill be performed by a Certified Independent Laboratory, approved by the City. Tests\nresults shall be submitted to the Director. Costs of the tests are considered to be\nincidental to the project.\n(9) Visual Inspection: Visual inspection of the CIPP shall be in accordance with ASTM\nF1216, Section 8.4. The contractor shall perform and supply the City with a PACP TV\ninspection report and digital video of the sewer prior to and after installation of the CIPP\nlining."
  },
  {
    "corpus": "DCS",
    "chapter": 9,
    "anchor": "9.20(A)",
    "heading": "General",
    "page_start": 273,
    "page_end": 274,
    "verbatim": "(1) Scope: This section describes the reconstruction of pipelines and conduits by which a\nbursting unit splits the existing pipe while simultaneously installing a new polyethylene\npipe of the same size or larger where the old pipe existed.\n(2) Quality Assurance: Manufacturer’s certificates of compliance and installation\nrecommendations shall be provided to the City inspector prior to construction.\nInstallation recommendations shall be followed during construction."
  },
  {
    "corpus": "DCS",
    "chapter": 9,
    "anchor": "9.20(B)",
    "heading": "Materials",
    "page_start": 274,
    "page_end": 274,
    "verbatim": "(1) Polyethylene Plastic Pipe: The pipe shall be high density polyethylene pipe and meet\nthe applicable requirements of ASTM F714 Polyethylene (PE) Plastic Pipe (SDR-PR).\nSizes of the insertions to be used shall be such to renew the pipe to its original or greater\nflow capacity. The pipe shall be homogenous throughout and shall be free of visible\ncracks, holes, foreign material, blisters, or other deleterious faults.\n(2) Dimension Ratios: The polyethylene pipe shall meet or exceed the thickness\nrequirement of SDR 17."
  },
  {
    "corpus": "DCS",
    "chapter": 9,
    "anchor": "9.20(C)",
    "heading": "Execution",
    "page_start": 274,
    "page_end": 274,
    "verbatim": "(1) Bypassing Flows: The contractor shall provide for flow around the section(s) of pipe\ndesignated for reconstruction. The bypass shall be made by plugging the line at an\nexisting upstream manhole or adjacent system. The pump and bypass lines shall be of\nadequate capacity and size to handle the flow. Bypassing includes any main lines and\nservice lines, street gutters or open excavations. Any spills that occur must be\nimmediately cleaned and the affected area disinfected.\n(2) Inspection: Inspection of work shall be in accordance with Section 9.17, “Testing of\nGravity Sewer Pipelines and Manholes,” of these Standards.\n(3) Equipment: The pipe bursting tool shall be designed and manufactured to force its way\nthrough existing pipe material by fragmenting the pipe and compressing the old pipe\nsections into the surrounding soil as it progresses. The bursting unit shall be pneumatic\nand shall generate sufficient force to burst and compact the existing pipeline. The\nbursting tool shall be selected in accordance with the manufacturer’s recommendations to\nmeet the project specific requirements for the type and size of pipe being burst and\nupsized if specified. The pipe bursting tool shall be pulled through the sewer by a winch\nlocated at the receiver pit. The bursting unit shall pull the polyethylene pipe with it as it\nmoves forward."
  },
  {
    "corpus": "DCS",
    "chapter": 9,
    "anchor": "9.21",
    "heading": "Telecommunication or Cable System Standards",
    "page_start": 274,
    "page_end": 274,
    "verbatim": "The installation and construction of telecommunication or cable systems shall comply with the\nrequirements as set forth in Chapter 11-6, “Boulder Cable Code,” B.R.C. 1981, and these\nStandards."
  },
  {
    "corpus": "DCS",
    "chapter": 9,
    "anchor": "9.21(A)",
    "heading": "General",
    "page_start": 274,
    "page_end": 275,
    "verbatim": "(1) Applicable National Standards: All telecommunications and cable system construction\nshall conform to the requirements of the following standards:\n(a) American National Standards Institute, Inc. (ANSI), Electronic Industries\nAssociation (EIA), and Telecommunications Institute of America (TIA)\nStandards: EIA/TIA Standards Proposal No. 2840-A, Proposed Revision of\nEIA/TIA-568 (if approved to be published as EIA/TIA-568-A), EIA/TIA-569\nCommercial Building Standard for Telecommunications Pathways and Spaces,\nand TIA/EIA-607 Commercial Building Grounding and Bonding Requirements\nfor Telecommunications.\n(b) National Electrical Safety Code (NESC) C2-1993, published by the Institute of\nElectrical and Electronics Engineers (IEEE), Inc.\n(c) National Electrical Code (NEC), published by the National Fire Protection\nAssociation (NFPA).\n(d) Federal Communications Commission.\n(e) Colorado Public Utilities Commission.\n(f) Williams-Steiger Occupational Safety and Health Act (OSHA).\n(2) Construction Plans Required: Detailed construction plans, as outlined in Chapter 1,\n“General Requirements,” of these Standards, showing the specific underground and/or\naerial cable routing and associated conduit, manhole and/or pole locations and\nspecifications, shall be submitted to the Director’s office for review and approval.\n(3) Protection of Systems: All systems shall be protected from washouts, floods, unstable\nsoil, landslides, or other hazards that may cause the facility to move or fail."
  },
  {
    "corpus": "DCS",
    "chapter": 9,
    "anchor": "9.21(B)",
    "heading": "Underground Facilities",
    "page_start": 275,
    "page_end": 276,
    "verbatim": "(1) Cable Protection\n(a) All buried telecommunications cable, shall be installed in conduit, PVC Schedule\n40 or equivalent. Cable placement by means of direct plow-in will not be allowed\nwithin the City’s rights-of-way.\n(b) Major conduit duct banks (more than 4 conduits) and those comprising a portion\nof the City’s telecommunications conduit backbone infrastructure shall be\nencased in concrete with a minimum strength of 2000 psi. When encased in\nconcrete, conduit may be PVC Type EB, DB or equivalent. The concrete\nencasement shall have a minimum thickness of 4 inches around the entire conduit\nor duct bank.\n(c) Multiple duct systems shall have spacers installed at intervals to allow the\nconcrete mix encasement throughout the entire duct structure.\n(d) Conduit placed by directional bore method will be allowed subject to approval by\nthe Director.\n(2) Depth of Cover: The minimum depth of cover over the conduit shall be 30 inches.\n(3) Trench Specifications - Roadway and Other Paved Surfaces\n(a) All trenches shall be open cut unless otherwise permitted by the City.\n(b) Trenches shall have a minimum width of 10 inches.\n(c) Trench backfill and surface restoration shall comply with the standards as set\nforth in Section 8-5-12, “Standards for Repairs and Restoration of Pavement and\nSidewalks,” B.R.C. 1981.\n(4) Trench Specifications - Landscaped Areas\n(a) All trenches shall be open cut unless otherwise permitted by the City.\n(b) Trenches shall have a minimum width of 10 inches.\n(c) Trenches shall be backfilled and compacted to at least 90 percent of maximum\ndensity at optimum moisture content as determined by ASTM D698.\n(d) The City shall be contacted if there is any question whether or not the proposed\nwork will cause any damage to trees shrubs or other landscaping or if\nconstruction is within 5 feet of a tree.\n(5) Alternative Installation Methods: Boring methods may be allowed by the Director if\nthe Director finds that these methods are advantageous to the City or if open trench\nmethods are impractical.\n(6) Joint Use Trench Requirements\n(a) Joint trenching operations require advanced planning and coordination with the\nutilities involved.\n(b) Vertical and horizontal separations between telecommunications or cable systems\nand other facilities shall be maintained as required by NESC Section 32,\nUnderground Conduit Systems. Conduit systems for telecommunications and\ncable systems shall be separated from conduit systems for power supply systems\nby:\n(i) 3 inches of concrete,\n(ii) 4 inches of masonry, or\n(iii) 12 inches of well-tamped earth.\n(7) Warning Tape: A cable warning tape shall be placed 12 to 18 inches above the conduit\nin the trench.\n(8) Manholes\n(a) All cavities required for cable pulling purposes shall be constructed as load\nbearing manholes or handholes. Handholes shall not be placed in any traveled\nlane, road shoulders, sidewalk, multi-use path, or bike lane.\n(b) Manholes or handholes shall be placed at maximum 1,200 feet intervals. In no\ncase shall conduit bend radius exceed 180 degrees between manholes. Manholes\nshall be installed at each street intersection at a minimum. Manholes shall be\nrectangular: 6 feet wide by 7 feet long by 4 feet deep; or circular 4 feet diameter\nwith a nominal depth of 4 feet minimum.\n(c) Manholes or handholes shall be installed flush or ¼” below the surrounding\ngrade."
  },
  {
    "corpus": "DCS",
    "chapter": 9,
    "anchor": "9.21(C)",
    "heading": "Aboveground Facilities",
    "page_start": 276,
    "page_end": 278,
    "verbatim": "(1) Facility Protection: All aboveground facilities shall be protected from accidental\ndamage by vehicular traffic impacts or similar causes either by being located a safe\ndistance away from traffic or by structural barricades.\n(2) Obstruction to Traffic Prohibited: All aboveground facilities shall be located so as not\nto cause unnecessary obstruction to pedestrian and vehicular traffic.\n(3) Clearances: All aboveground telecommunications facility construction shall conform\nwith the minimum clearances as specified in Section 23 of the NESC.\n(a) Cables shall maintain the following minimum clearances between any adjacent or\ncrossing power cables under all conditions of cable loading:\n(i) Horizontal clearances shall be at least 5 feet from power cables at a\npotential of up to 129 kV, and at least 5 feet plus 0.4 inches per kV over\n129 kV from power cables exceeding a potential of 129 kV.\n(ii) Vertical clearances shall be at least 4 feet from power cables at a\npotential of up to 750 V, at least 6 feet from power cables at a potential\nof 750 V to 22 kV, at least 6 feet plus 0.4 inches per kV over 22 kV from\npower cables at a potential between 22 kV and 470 kV. Vertical\nclearances shall comply with NESC Rule 233C3 for minimum clearance\nfrom cables at a potential greater than 470 kV.\n(b) Cables, poles, and stubs shall maintain the following minimum clearances from\npower conductors, power poles and other objects:\n(i) Poles shall have a minimum clearance of 4 feet from fire hydrants, signal\npedestals, and call boxes.\n(ii) Cables shall have a minimum horizontal clearance from power poles in\nno wind conditions.\n(iii) Poles and stubs shall have a minimum horizontal clearance of 5 feet in\nno wind condition from power wires up to 50 kV.\n(c) Poles shall have a minimum separation of at least 2 feet from the street side of\nthe curb to the nearest part of the pole and shall be located a sufficient distance\nfrom the street side of the curb to avoid contact with ordinary vehicles using the\nroad.\n(d) Poles shall have at least 12 feet horizontal clearance from the nearest rail to the\nnearest part of the pole.\n(e) Cables shall have at least 2 feet vertical clearance from Police and Fire Alarm\nfacilities.\n(f) Cables shall have at least 3 feet clearance in all directions from signs, chimneys,\ntanks, and other installations.\n(g) Cables shall maintain the following minimum vertical clearances as measured\nfrom the lowest point of the cable when crossing the following objects:\n(i) Roads, Streets, and all areas subject to truck traffic: 18 feet.\n(ii) Alleys, Driveways, and Parking Lots: 18 feet.\n(iii) Railroad tracks: 28 feet.\n(iv) Roofs, not accessible: 4 feet.\n(v) Spaces and Ways, accessible to pedestrians only: 12 feet.\n(vi) Roofs, accessible to vehicular traffic, but not trucks: 12 feet.\n(h) Cables shall maintain a minimum vertical clearances of 16 feet as measured from\nthe lowest point of the cable when running alongside but not overhanging roads,\nstreets, or alleys.\n(i) A minimum vertical clearance of 40 inches shall be maintained between\ntelecommunications cables and power cables at the attachment points on joint use\npoles."
  },
  {
    "corpus": "DCS",
    "chapter": 9,
    "anchor": "9.22",
    "heading": "Electric Power Facility Standards",
    "page_start": 278,
    "page_end": 278,
    "verbatim": "The following standards shall apply to all electric power related facilities constructed within the\nCity’s public rights-of-way or easements."
  },
  {
    "corpus": "DCS",
    "chapter": 9,
    "anchor": "9.22(A)",
    "heading": "General",
    "page_start": 278,
    "page_end": 278,
    "verbatim": "(1) Undergrounding Required: All electric power facilities constructed in the City’s public\nrights-of-way or easements shall be underground unless otherwise permitted by franchise\nor the Director.\n(2) National Standards: All electric power facility construction shall conform to the\nrequirements of the following standards:\n(a) 1993 National Electrical Safety Code (NESC) C2-1993, published by the\nInstitute of Electrical and Electronics Engineers (IEEE), Inc.\n(b) National Electrical Code (NEC), published by the National Fire Protection\nAssociation (NFPA).\n(c) Colorado Public Utilities Commission.\n(d) Williams-Steiger Occupational Safety and Health Act (OSHA).\n(3) Construction Plans Required: Detailed construction plans, as outlined in Chapter 1,\n“General Requirements,” of these Standards, showing the specific underground and/or\naerial cable routing and associated conduit, manhole and/or pole locations and\nspecifications, shall be submitted to the Director for review and approval.\n(4) Protection of Facilities: All facilities must be protected from washouts, floods, unstable\nsoil, landslides, or other hazards that may cause the facility to move or fail."
  },
  {
    "corpus": "DCS",
    "chapter": 9,
    "anchor": "9.22(B)",
    "heading": "Underground Facilities",
    "page_start": 278,
    "page_end": 279,
    "verbatim": "(1) Underground Cable Protection\n(a) All primary circuits (greater than 600 volts) located under concrete road surfaces,\nwhere circuit density is high, and in all arterial roads shall be installed in conduit,\n4 inch minimum diameter, PVC Type EB, DB or equivalent. All conduit joints\nshall be solvent welded. The conduit shall be encased in concrete with a\nminimum strength of 2000 psi and have a minimum thickness of 4 inches around\nthe entire conduit or duct bank.\n(b) All secondary circuits (600 volts or less) supplying services larger than 800\namperes shall be installed in conduit, 2-inch minimum diameter, PVC Type EB,\nDB or equivalent. All conduit joints shall be solvent welded. The conduit shall\nbe encased in concrete with a minimum strength of 2000 psi and have a\nminimum thickness of 4 inches around the entire conduit or duct bank.\n(c) Multiple duct bank systems shall have spacers installed at intervals to allow the\nconcrete mix encasement throughout the entire duct structure.\n(2) Depth of Cover\n(a) The minimum depth of cover over primary circuits (greater than 600 volts) shall\nbe 42 inches.\n(b) The minimum depth of cover over secondary circuits shall be 30 inches (600\nvolts or less).\n(c) The minimum depth of cover over circuits for street lighting and signals shall be\n18 inches.\n(3) Trench Specifications - Roadways and Other Paved Surfaces\n(a) All trenches shall be open cut unless otherwise permitted by the Director.\n(b) Trenches shall have a minimum width of 10 inches.\n(c) Trench backfill and surface restoration shall comply with the standards as set\nforth in Section 8-5-12, “Standards for Repairs and Restoration of Pavement and\nSidewalks,” B.R.C. 1981.\n(4) Trench Specifications - Landscaped Areas\n(a) All trenches shall be open cut unless otherwise permitted by the Director.\n(b) Trenches shall have a minimum width of 10 inches.\n(c) Trenches shall be backfilled and compacted to at least 90 percent of maximum\ndensity at optimum moisture content as determined by ASTM D698.\n(d) The City shall be contacted if there is any question whether or not the proposed\nwork will cause any damage to trees, shrubs or other landscaping or if\nconstruction is within 5 feet of a tree.\n(5) Alternative Installation Methods: Boring methods may be allowed by the Director if\nthe Director finds that these methods are advantageous to the City or if open trench\nmethods are impractical.\n(6) Joint Use Trench Requirements\n(a) Joint trenching operations require advanced planning and coordination with the\nutilities involved.\n(b) Vertical and horizontal separations between electric power facilities and other\nfacilities shall be maintained as required by the NESC section 32 Underground\nConduit Systems.\n(7) Warning Tape: A cable warning tape shall be placed 12 to 18 inches above the conduit\nor cable in the trench.\n(8) Manholes: All cavities required for cable pulling purposes shall be constructed as load\nbearing manholes or handholes. Handholes shall not be placed in any traveled lane\nincluding road shoulders, sidewalks, multi-use paths, or bike lanes."
  },
  {
    "corpus": "DCS",
    "chapter": 9,
    "anchor": "9.22(C)",
    "heading": "Aboveground Facilities",
    "page_start": 279,
    "page_end": 280,
    "verbatim": "(1) General\n(a) All aboveground facilities shall be protected from accidental damage by\nvehicular traffic impacts or similar causes either by being located a safe distance\naway from traffic or by structural barricades.\n(b) All aboveground facilities shall be located so as not to cause unnecessary\nobstruction to pedestrian and vehicular traffic.\n(2) Clearances: The minimum overhead transverse clearance shall conform to National\nElectrical Safety Code Standards, but shall not be less than 18 feet measured from the\nhighest point of the road prism to the bottom of the cable."
  },
  {
    "corpus": "DCS",
    "chapter": 9,
    "anchor": "9.23",
    "heading": "Gas Distribution Facility Standards",
    "page_start": 280,
    "page_end": 280,
    "verbatim": "The following standards shall apply to all gas distribution related facilities constructed within the\nCity’s public rights-of-way or easements."
  },
  {
    "corpus": "DCS",
    "chapter": 9,
    "anchor": "9.23(A)",
    "heading": "General",
    "page_start": 280,
    "page_end": 280,
    "verbatim": "(1) Undergrounding Required: All gas distribution facilities constructed in the City’s\npublic rights-of-way or easements shall be underground unless otherwise permitted by\nfranchise or the Director.\n(2) National Standards: All gas distribution facility construction shall conform to the\nrequirements of the following standards:\n(a) Minimum Federal Safety Standards for Natural Gas Pipelines in the Code of\nFederal regulations 49 Part 192.\n(b) Colorado Public Utilities Commission.\n(c) Williams-Steiger Occupational Safety and Health Act (OSHA).\n(3) Construction Plans Required: Detailed construction plans, as outlined in Chapter 1,\n“General Requirements,” of these Standards, showing the specific gas distribution line\nand appurtenances locations and specifications, shall be submitted to the Director for\nreview and approval.\n(4) Protection of Facilities: All facilities must be protected from washouts, floods, unstable\nsoil, landslides, or other hazards that may cause the facility to move or fail."
  },
  {
    "corpus": "DCS",
    "chapter": 9,
    "anchor": "9.23(B)",
    "heading": "Underground Facilities",
    "page_start": 280,
    "page_end": 281,
    "verbatim": "(1) Materials\n(a) Steel or plastic material shall be used for the gas distribution pipe.\n(b) All plastic pipe must be installed below ground level.\n(2) Depth of Cover\n(a) Depth of cover shall be measured from the final grade to the top of the pipe.\n(b) Minimum depth of cover for shall be 36 inches for transmission lines and 30\ninches for distribution lines.\n(c) Minimum depth of cover for service lines shall be 24 inches.\n(d) Transmission and distribution lines installed under streams and ditches must have\nminimum cover of 48 inches.\n(3) Trench Specifications - Roadways and Other Paved Surfaces\n(a) All trenches shall be open cut unless otherwise permitted by the Director.\n(b) Trenches shall have a minimum width of 10 inches.\n(c) Trench backfill and surface restoration shall comply with the standards as set\nforth in Section 8-5-12, “Standards for Repairs and Restoration of Pavement and\nSidewalks,” B.R.C. 1981.\n(4) Trench Specifications - Landscaped Areas\n(a) All trenches shall be open cut unless otherwise permitted by the Director.\n(b) Trenches shall be have a minimum width of 10 inches.\n(c) Trenches shall be backfilled and compacted to at least 90 percent of maximum\ndensity at optimum moisture content as determined by ASTM D698.\n(d) The City shall be contacted if there is any question whether or not the proposed\nwork will cause any damage to trees, shrubs or other landscaping or if\nconstruction is within 5 feet of a tree.\n(5) Alternative Installation Methods: Boring methods may be allowed by the Director if\nthe Director finds that these methods are advantageous to the City or if open trench\nmethods are impractical.\n(6) Joint Use Trench Requirements\n(a) Joint trenching operations require advanced planning and coordination with the\nutilities involved.\n(b) Vertical and horizontal separations between gas distribution facilities and other\nfacilities shall be 6 inches minimum.\n(7) Warning Tape: A cable warning tape shall be placed 12 to 18 inches above the conduit\nin the trench.\n(8) Components\n(a) Transmission line valves shall be installed in boxes or be otherwise readily\naccessible.\n(b) Transmission line pressure relief and pressure limiting devices shall be installed\nin underground vaults, unless aboveground installation is permitted by the\nDirector.\n(c) All service lines shall be equipped with shutoff valves.\n(d) An electrically conductive tracer wire shall be installed with all plastic and non-\nconductive pipes.\n(9) Casing Pipe: Gas pipe shall be installed in casings under all highways. Casing pipe shall\nbe steel pipe with a wall thickness of 1/4 inch minimum extending at least 5 feet beyond\nthe limits of any highway improvements.\n(10) Corrosion Protection\n(a) All pipes susceptible to corrosion shall be cathodically protected and have a\nprotective coating.\n(b) All corrosion susceptible pipes must also be electrically isolated from other\nmetallic structures."
  },
  {
    "corpus": "DCS",
    "chapter": 9,
    "anchor": "9.23(C)",
    "heading": "Testing Requirements",
    "page_start": 282,
    "page_end": 282,
    "verbatim": "All newly constructed pipes shall be tested prior to placing the line in service. No pipe shall be\nplaced in service, or returned to service, with leaks or without adequate corrosion protection.\n(1) Pressure Testing: All pipes shall be pressure tested for leakage as described in CFR 49\npart 192. In order to establish the maximum allowable operating pressure (MAOP), pipes\nshall be tested at 1-1/2 times the MAOP.\n(2) Corrosion Control Testing: Corrosion control devices shall be tested whenever the pipe\nis exposed for maintenance or repair. Additionally, all corrosion control devices must be\ntested at least once each calendar year.\n(3) Records Retention: Records of the testing shall be maintained for the life of the pipe."
  },
  {
    "corpus": "DCS",
    "chapter": 9,
    "anchor": "9.23(D)",
    "heading": "Aboveground Facilities",
    "page_start": 282,
    "page_end": 283,
    "verbatim": "(1) Facility Protection: All aboveground facilities shall be protected from accidental\ndamage by vehicular traffic impacts or similar causes either by being located a safe\ndistance away from traffic or by structural barricades.\n(2) Traffic Obstruction Prohibited: All aboveground facilities shall be located so as not to\ncause unnecessary obstruction to pedestrian and vehicular traffic.\nCITY OF BOULDER\nDESIGN AND CONSTRUCTION STANDARDS"
  }
]