[
  {
    "corpus": "DCS",
    "chapter": 4,
    "anchor": "4.01(A)",
    "heading": "Intent",
    "page_start": 112,
    "page_end": 112,
    "verbatim": "The General Utilities Design Standards are intended to provide for an integrated public utilities\nsystem for all public utilities, including water, wastewater, storm drainage, gas, electric and\ntelecommunications systems."
  },
  {
    "corpus": "DCS",
    "chapter": 4,
    "anchor": "4.01(B)",
    "heading": "Utilities Master Plans",
    "page_start": 112,
    "page_end": 112,
    "verbatim": "All improvements proposed to the City’s public utilities system shall conform with the goals,\npolicies, and standards adopted in the Water Utility Master Plan, Wastewater Utility Master Plan,\nand Comprehensive Flood and Stormwater Master Plan."
  },
  {
    "corpus": "DCS",
    "chapter": 4,
    "anchor": "4.01(C)",
    "heading": "Reference Standards",
    "page_start": 112,
    "page_end": 112,
    "verbatim": "Where not specified in these Standards or the B.R.C. 1981, to protect the public health, safety,\nand welfare, the Director of Public Works will specify the standards to be applied to the design\nand construction of public utilities improvements and may refer to one or more of the references\nlisted in the References Section of these Standards."
  },
  {
    "corpus": "DCS",
    "chapter": 4,
    "anchor": "4.02(A)",
    "heading": "Required",
    "page_start": 112,
    "page_end": 112,
    "verbatim": "The Director of Public Works may require the preparation of a Utility Connection Plan in order to\nassess the feasibility of providing utility service to any project or development and identify\nimpacts of any development application on the existing and planned public utility systems. A\nUtility Connection Plan may be prepared in lieu of a Utility Plan for projects or developments\nthat meet all of the standards below:\n(1) City utilities required to serve the site are located directly adjacent to the subject\nproperty.\n(2) No extension, enlargement, or improvement of public mains is required to serve the site.\n(3) No change in use is proposed which may alter the utility needs of the site."
  },
  {
    "corpus": "DCS",
    "chapter": 4,
    "anchor": "4.02(B)",
    "heading": "Plan Requirements",
    "page_start": 112,
    "page_end": 113,
    "verbatim": "The Utility Connection Plan shall include the following project or development information:\n(1) Title Block: Include the label “Utility Connection Plan” and name of project or\ndevelopment application, and the original preparation date and dates of any revisions.\n(2) Site Location Data: Include vicinity map and north arrow,\n(3) Drawing Scale: The drawing scale shall be between 1 inch equals 20 feet and 1 inch\nequals 100 feet, placed on the minimum number of plan sheets possible.\n(4) Property and Street Information: Include the location of existing and proposed lot\nlines, block and lot numbers, and street names.\n(5) Construction Note: Include the statement that “Utilities shall comply with the City of\nBoulder Design and Construction Standards.”\n(6) Existing and Proposed Utilities: Include the location, type and size of all existing and\nproposed utilities mains and service lines. Utilities to be identified include without\nlimitation: water, wastewater, storm drainage, flood control, gas, electric,\ntelecommunications, drainageways, and irrigation ditches within and adjacent to the\nproject or development site. Include and assign identification numbers to all existing and\nproposed manholes, inlets, fire hydrants, meter settings and pits, and provide “direction\nof flow” arrows on gravity pipelines.\n(7) Easements and Rights-of-Way: Include the location, dimensions, and dedication type\nof all existing and proposed easements and rights-of-way for all utilities improvements.\nIf available, reference existing easements to appropriate recorded film and reception\nnumbers.\n(8) Structures and Trees: Include the location and dimensions of all existing and proposed\nstructures, including without limitation buildings and fences, trees 1½ inch caliper or\ngreater, and major landscape features.\n(9) Floodplain: Delineate any 100-year floodplain boundaries that impact the project or\ndevelopment site and identify the floodplain designation, base flood elevations and\nfloodplain mapping source used to determine the floodplain.\n(10) Storm Water Plan Combination: The Director may approve a combined “Utility\nConnection and Storm Water Plan,” reflecting storm water design information, prepared\nin compliance with the requirements outlined in Chapter 7, “Storm Water Design,” of\nthese Standards.\n(11) Applications for Annexation or Out-of-City Utility Service for a single family residential\ndwelling may provide the required information on a scaled Improvement Location\nCertificate or Improvement Survey Plat."
  },
  {
    "corpus": "DCS",
    "chapter": 4,
    "anchor": "4.03(A)",
    "heading": "Required",
    "page_start": 113,
    "page_end": 113,
    "verbatim": "The Director may require an applicant to submit a Utility Plan as a condition of any development\napplication in order to adequately assess the availability of utility service and impacts of any\ndevelopment application on the existing and planned public utility systems. The Utility Plan shall\nprovide an overview of the proposed project or development application and identify whether the\nproposal is:\n(1) Eligible for utility service and has access to available public utility systems.\n(2) Consistent with current Utilities Master Plans, meets the minimum design standards for\nsystem layout, and is compatible with and allows for the perpetuation of the existing\nutility systems.\n(3) Located within any mapped 100-year floodplain."
  },
  {
    "corpus": "DCS",
    "chapter": 4,
    "anchor": "4.03(B)",
    "heading": "Plan Requirements",
    "page_start": 113,
    "page_end": 114,
    "verbatim": "The Utility Plan shall include the following project or development information:\n(1) Title Block: Include the label “Utility Plan” and name of project or development\napplication, and the original preparation date and dates of any revisions.\n(2) Site Location Data: Include vicinity map, north arrow, relationship of the property to\nrange, township, and section lines.\n(3) Survey Information: Include the elevation and location of City-recognized benchmarks\nwith reference to local, USGS and NGVD data.\n(4) Drawing Scale: The drawing scale shall be between 1 inch equals 20 feet and 1 inch\nequals 100 feet, placed on the minimum number of plan sheets possible.\n(5) Property and Street Information: Include the location of existing and proposed lot\nlines, block and lot numbers, and street names.\n(6) Construction Note: Include the statement that “Utilities shall comply with the City of\nBoulder Design and Construction Standards.”\n(7) Existing and Proposed Utilities: Include the location, type and size of all existing and\nproposed utilities mains and service lines. Utilities to be identified include without\nlimitation: water, wastewater, storm drainage, flood control, gas, electric,\ntelecommunications, drainageways, and irrigation ditches within and adjacent to the\nproject or development site. The locations of existing underground utility mains and\nservice lines and the invert and surface grade elevations of all manholes, inlets and\nculverts shall be field verified to the Director’s satisfaction (by “pothole” excavations, if\nnecessary) and accurately delineated and dimensioned. Include and assign identification\nnumbers to all existing and proposed manholes, inlets, fire hydrants, valves, pipe lengths,\nmeter settings and pits, and provide “direction of flow” arrows on gravity pipelines.\nProposed invert and surface grade elevations shall be provided for all proposed manholes,\ninlets and culverts.\n(8) Site Topography: Include existing and proposed contour lines showing at least 2-foot\ncontour intervals, and reflecting spot elevations at various locations, “cut and fill” areas,\nand surface drainage systems.\n(9) Easements and Rights-of-Way: Include the location, dimensions, and dedication type\nof all existing and proposed easements and rights-of-way for all utilities improvements.\nIf available, reference existing easements to appropriate recorded film and reception\nnumbers.\n(10) Structures and Trees: Include the location and dimensions of all existing and proposed\nstructures, including without limitation buildings and fences, trees 1½ inch caliper or\ngreater, and major landscape features.\n(11) Maintenance Access: Include the location and dimensions for existing and proposed\n“all-weather” maintenance access drives for 14-ton maintenance equipment to reach\nmanholes and inlets not located in existing or proposed streets.\n(12) Floodplain: Delineate any 100-year floodplain boundaries that impact the project or\ndevelopment site and identify the floodplain designation, base flood elevations and\nfloodplain mapping source used to determine the floodplain.\n(13) Storm Water Plan Combination: The Director may approve a combined “Utility and\nStorm Water Plan,” reflecting storm water design information, prepared in compliance\nwith the requirements outlined in Chapter 7, “Storm Water Design,” of these Standards."
  },
  {
    "corpus": "DCS",
    "chapter": 4,
    "anchor": "4.03(C)",
    "heading": "Utility Plan Approvals",
    "page_start": 114,
    "page_end": 115,
    "verbatim": "(1) The Utility Plan shall reflect proposed utility infrastructure and utility service to\ndevelopment applications and may serve as the basis for approving site review and\npreliminary subdivision proposals.\n(2) A final version of the Utility Plan shall be included in all Construction Plans proposing\nthe construction of utility infrastructure to reflect overall system layout and design\nconfigurations.\n(3) The Utility Plan may serve as the Construction Plan under the following conditions:\n(a) The proposed utility improvements include only private service line (water,\nwastewater, or storm sewer) or fire line connections to individual properties.\n(b) The proposed utility improvements include only water main extensions or fire\nhydrant runs on individual properties.\n(c) Standard construction notes are included on the Utility Plan, and no other\nConstruction Plans for other public improvements are required.\n(4) The Director may waive the requirement that the Utility Plan be prepared by an Engineer\nfor development applications that include only private utility (water, wastewater and\nstorm drainage) service lines or fire lines to individual properties."
  },
  {
    "corpus": "DCS",
    "chapter": 4,
    "anchor": "4.04(A)",
    "heading": "General",
    "page_start": 115,
    "page_end": 115,
    "verbatim": "(1) All City-operated public utilities, including without limitation, water, wastewater and\nstorm drainage systems, shall be located within public rights-of-way or public utility\neasements.\n(2) Public utility easements shall be at least 25 feet wide. Wider easements may be required\nwhere the depth of a utility, or number of utilities occupying the easement, requires\nadditional width to satisfy standards for utility separations, trenching excavations, or\nadequate maintenance access.\n(3) Public utility easements shall provide a minimum parallel separation of 6 feet between\nthe edge of any utility line and the easement boundary.\n(4) Public utility easements are to be placed longitudinally along one side of any property\nline in a manner that no portion of any easement falls on both sides of a parallel property\nline.\n(5) Structures and landscaping proposed in public utility easements shall comply with the\nstandards as set forth in Chapter 8-5, “Work in the Public Right-of-Way and Public\nEasements,” and Chapter 8-6, “Public Right-of-Way and Easement Encroachments,\nRevocable Permits, Leases, and Vacations,” B.R.C. 1981.\n(6) The Director may allow water service taps from water mains in easements only if free\nand unobstructed vehicle access is permanently guaranteed for all-weather water meter\nreading, valve access, and maintenance. Where the Director allowed a service tap from a\nwater main in an easement, the property owners shall ensure all city owned and\nmaintained utilities are accessible and surface features such as valve covers, manholes,\nand meter pits are visible and not covered by landscape materials, concrete or asphalt.\nProposals will be reviewed on a case-by-case basis and are subject to prior approval by\nthe Director."
  },
  {
    "corpus": "DCS",
    "chapter": 4,
    "anchor": "4.04(B)",
    "heading": "Easements Crossing Single-Family Residential Lots",
    "page_start": 115,
    "page_end": 116,
    "verbatim": "Public utility easements crossing single-family residential lots may be allowed only for the\nfollowing:\n(1) Completing required water system looping in cul-de-sac type applications where water\nmains would otherwise dead-end.\n(2) Installation of fire hydrants.\n(3) Continuing a wastewater main that would otherwise dead-end in cul-de-sac type\napplications.\n(4) Conveying storm water drainage and overflows from back-draining cul-de-sac or street\nsump type applications."
  },
  {
    "corpus": "DCS",
    "chapter": 4,
    "anchor": "4.05",
    "heading": "Pipe Strength",
    "page_start": 116,
    "page_end": 116,
    "verbatim": "All utility pipe shall be of adequate strength to support the trench and AASHTO HS-20 highway\nloadings."
  },
  {
    "corpus": "DCS",
    "chapter": 4,
    "anchor": "4.06(A)",
    "heading": "Parallel (Horizontal) Separation",
    "page_start": 116,
    "page_end": 116,
    "verbatim": "Parallel separations between utility mains and services to provide for adequate trench excavations\nand maintenance operations shall be as follows. All distances are measured from outside of pipe\nto outside of pipe:\nTable 4-1: Utility Separation Requirements\nElectric, Telecommunications,\nWater Sewer Storm\nand/or Gas\nWater 10-ft 5-ft 5-ft\nSewer 10-ft 10-ft 10-ft\nStorm 5-ft 10-ft 5-ft\nElectric, 5-ft 10-ft 5-ft 18-inches\nTelecommunications,\nand/or Gas"
  },
  {
    "corpus": "DCS",
    "chapter": 4,
    "anchor": "4.06(B)",
    "heading": "Pipe Crossings (Vertical) Separation",
    "page_start": 116,
    "page_end": 116,
    "verbatim": "(1) The minimum vertical separation between water and wastewater line crossings, as\nmeasured outside of pipe to outside of pipe, shall be 18 inches. The water line shall be\nconstructed above the wastewater line.\n(2) The minimum vertical separation between water and storm drainage line crossings shall\nbe 18 inches, measured from outside of pipe to outside of pipe.\n(3) The minimum vertical separation between wastewater and storm drainage line crossings,\nas measured outside of pipe to outside of pipe, shall be 6 inches. In addition, the\nfollowing applies:\n(a) If the storm drainage line is constructed below the wastewater line, pressure-class\npipe will be required for both utility lines to prevent possible wastewater\ncontamination of storm drainage.\n(b) If the vertical separation between the wastewater and storm drainage line is less\nthan 18 inches, structural support will be required, subject to the Director’s\napproval.\n(4) The minimum vertical separation between City public utility pipelines or conduits and all\ngas, electric, and telecommunications utilities shall be 12 inches."
  },
  {
    "corpus": "DCS",
    "chapter": 4,
    "anchor": "4.06(C)",
    "heading": "Drainageway and Irrigation Ditch Crossings",
    "page_start": 117,
    "page_end": 117,
    "verbatim": "Utility crossings of natural and improved drainageways and irrigation ditches listed in Table 4-2,\n“Local Drainageways and Irrigation Ditches,” shall meet the following conditions:\n(1) Water Main Crossings: The water main shall be placed at least 4.5 feet below the\ninvert of the drainageway or irrigation ditch and shall be placed in a steel sleeve in\nconformance with the applicable standard drawings in Chapter 11, “Technical Drawings”\nof these Standards.\n(2) Wastewater and Storm Drainage Main Crossings\n(a) The wastewater or storm drainage main shall be placed at least 3 feet below the\ninvert of an open drainageway or irrigation ditch or at least 18 inches below the\ninvert of a drainageway or irrigation ditch culvert, and the main shall be placed in\na steel sleeve in conformance with the applicable standard drawings in Chapter\n11, “Technical Drawings,” of these Standards.\n(b) In open drainageway or irrigation ditch crossings, the Director may allow the\nwastewater or storm drainage main to be encased in concrete instead of\nplacement in a steel sleeve, and the concrete encasement shall conform with the\napplicable standard drawings in Chapter 11, “Technical Drawings,” of these\nStandards.\n(c) When a drop manhole is used to obtain the required vertical separation for a\ndrainageway or irrigation ditch crossing, the drop manhole shall be located at\nleast 20 feet from the end of a steel sleeve.\n(3) Other Utility Line Crossings\n(a) Other utility lines, including without limitation, gas, electric, and\ntelecommunications lines, shall be placed at least 30 inches below the invert of a\ndrainageway or irrigation ditch.\n(b) Other utility lines shall be placed in a Schedule-40 steel casing, extending\nhorizontally at least 10 feet beyond each side of the drainageway or irrigation\nditch, measured from top of bank to top of bank.\nTable 4-2: Local Drainageways and Irrigation Ditches\nAnderson Ditch Elmer’s Two Mile Creek Skunk Canyon Creek\nBear Canyon Creek Farmer’s Ditch South Boulder Creek\nBluebell Creek Fourmile Canyon Creek Sunshine Creek\nBoulder Creek Goose Creek Two Mile Canyon Creek\nBoulder and Whiterock Ditch Gregory Creek Viele Channel\nBoulder and Left Hand Ditch Howard Ditch Wellman Canal\nDry Creek King’s Gulch Wonderland Creek\nDry Creek #2 New Anderson Ditch\nDry Creek #2 Ditch North Boulder Farmer’s Ditch"
  },
  {
    "corpus": "DCS",
    "chapter": 4,
    "anchor": "4.06(D)",
    "heading": "Separation of Utilities from Trees",
    "page_start": 117,
    "page_end": 118,
    "verbatim": "Trees proposed to be planted in public utility easements and rights-of-way shall be located at least\n10 feet away from existing and proposed utilities and shall not block vehicle access along the\neasement. All utility construction near existing trees shall abide by the tree protection\nrequirements specified in Chapter 3, “Streetscape Design,” of these Standards."
  },
  {
    "corpus": "DCS",
    "chapter": 4,
    "anchor": "4.06(E)",
    "heading": "Special Conditions for the Separation of Utilities",
    "page_start": 118,
    "page_end": 119,
    "verbatim": "If the required horizontal or vertical separation of utilities cannot be obtained as required in this\nsection, the Director may apply special conditions to the design of utilities separations, to ensure\nthe safety, protection and integrity of the utility system, as follows:\n(1) Parallel Separation\n(a) If 10 feet of parallel separation between water and wastewater lines cannot be\nobtained, the wastewater line may be laid closer to the water line, provided the\nfollowing conditions exist:\n(i) The wastewater line is constructed of pressure-class pipe, in\nconformance with these Standards, until the required horizontal\nseparation is obtained, and\n(ii) The water line is located at least 18 inches above the wastewater line, as\nmeasured from the top of the wastewater pipe to bottom of the water\npipe.\n(b) If 5 feet of parallel separation between water and storm drainage lines cannot be\nobtained, the storm drainage line may be laid closer to the water line, provided\nthe storm drainage line is constructed of pressure-class pipe, in conformance with\nthese Standards, until the required horizontal separation is obtained. The storm\ndrainage line does not need to be pressure tested.\n(2) Crossings Separation\n(a) If 18 inches of vertical separation between either water and wastewater line\ncrossings, or water and storm drainage line crossings, cannot be obtained, the\nwastewater or storm drainage line shall be constructed of pressure-class pipe, in\nconformance with these Standards, for at least 10 feet beyond each side of the\nwater line crossing. This distance shall be measured along the wastewater or\nstorm drainage line from the center of the water line. The storm drainage line\ndoes not need to be pressure tested.\n(b) If the water line cannot be constructed above the wastewater line at water and\nwastewater line crossings, the wastewater line shall be constructed of pressure-\nclass pipe, in conformance with these Standards, for at least 10 feet beyond each\nside of the water line crossing. This distance shall be measured along the\nwastewater line from the center of the water line.\n(c) If either 18 inches of vertical separation between water and wastewater line\ncrossings, and water and storm drainage line crossings, or 6 inches of vertical\nseparation between wastewater and storm drainage line crossings cannot be\nobtained, special structural support shall be required to prevent settlement and\npotential pipe damage at the crossing. Structural support design shall be subject\nto the Director’s approval.\n(3) Pressure-Class Pipe for Crossings: When pressure-class pipe is required to satisfy the\nrequirements prescribed in this section, the following will apply:\n(a) Pipe materials and quality shall be suitable for water main construction in\naccordance with specifications prescribed in these Standards.\n(b) Individual pipe sections shall be at least 18 feet long and placed at the crossing so\nthat the ends are located 9 feet beyond each side of the water line crossing.\n(c) The inside diameter of the pressure-class crossing pipe shall be of equal size or\nnearest diameter larger than the non-pressure-class wastewater or storm drainage\npipe inside diameter for the length until the required separation between utilities\nis obtained. Pressure-class pipe installations shall include watertight transition\ncouplings.\n(d) Both the water and wastewater lines shall be pressure tested."
  },
  {
    "corpus": "DCS",
    "chapter": 4,
    "anchor": "4.07",
    "heading": "Undergrounding of Utilities",
    "page_start": 119,
    "page_end": 119,
    "verbatim": "New, replacement, or relocated electrical utilities and telecommunication and cable television\nsystems shall be installed underground as set forth in Section 9-12-12, “Standards for Lots and\nPublic Improvements,” B.R.C. 1981."
  },
  {
    "corpus": "DCS",
    "chapter": 4,
    "anchor": "4.08(A)",
    "heading": "General",
    "page_start": 119,
    "page_end": 119,
    "verbatim": "Inactivity, damage, age of materials, redevelopment, or changes in service requirements for the\npremises may require repair, removal or abandonment of a utilities service line or stub-in.\nRepair, removal and abandonment of a utilities service line or stub-in shall comply with the\nstandards of this section."
  },
  {
    "corpus": "DCS",
    "chapter": 4,
    "anchor": "4.08(B)",
    "heading": "Abandonment",
    "page_start": 119,
    "page_end": 119,
    "verbatim": "An abandoned service line shall be disconnected at the corporation with the main."
  },
  {
    "corpus": "DCS",
    "chapter": 4,
    "anchor": "4.08(C)",
    "heading": "Witnessing",
    "page_start": 119,
    "page_end": 119,
    "verbatim": "Service line abandonments and repairs shall be witnessed by City inspection staff."
  },
  {
    "corpus": "DCS",
    "chapter": 4,
    "anchor": "4.08(D)",
    "heading": "Tap Upgrade",
    "page_start": 119,
    "page_end": 119,
    "verbatim": "When an existing service line must be upgraded, the existing main tap shall be upsized and re-\nused wherever possible."
  },
  {
    "corpus": "DCS",
    "chapter": 4,
    "anchor": "4.08(E)",
    "heading": "Water Services",
    "page_start": 119,
    "page_end": 120,
    "verbatim": "When a water service line is abandoned or repaired, the following will apply:\n(1) Services 2 Inches and Smaller: For a water service line that is a 2-inch line or smaller,\nthe water service connection shall be excavated where the corporation stop is inserted\ninto the water main. The corporation stop shall be closed, the service tubing or piping\nshall be removed from the corporation stop, and a section of the water service line at least\n12 inches long shall be cut off. A plug or cap shall be placed on the corporation stop to\nprevent leakage. If the service line has a meter, the meter shall be returned to the City for\nfinal testing and reading. The meter pit/vault, if present, shall be removed in its entirety,\nor, if left in place, shall be cut off at least 18 inches below finished grade and filled with\nsand or other fill material. If the corporation stop is leaky or corroded, the corporation\nstop shall be removed and a “Ford” FS1 repair sleeve or an equivalent sleeve, approved\nby the Director, shall be installed while the main is shut off.\n(2) Services Larger than 2 Inches: For a water service line that is larger than 2 inches, the\nwater service connection shall be excavated over the service tee on the water main. The\ntapping valve shall be closed, a length of service pipe at least 12 inches long shall be\nremoved, and the tapping valve shall be plugged or capped. The valve box shall be\nremoved in its entirety or, if left in place, shall be cut off at least 18 inches below finished\ngrade and filled with granular pipe bedding material (squeegee) as specified in Chapter 9,\n“Utilities Standards,” of these Standards. If the service line has a meter, the meter shall be\nreturned to the City for final testing and reading. The meter vault, if present, may be\nremoved in its entirety, or abandoned in place by filling it with sand or granular pipe\nbedding material (squeegee) as specified in Chapter 9, “Utilities Standards,” of these\nStandards. If practicable, the manhole shall be cut off at least 18 inches below grade. In\nthe event a wet tapped valve is leaky or corroded, the valve shall be removed and a\n“Ford” FS1 repair sleeve or an equivalent sleeve, approved by the Director, shall be\ninstalled while the main is shut off. Valves on tees that are leaky or corroded shall be\nremoved and replaced with a blind flange.\n(3) Copper Lines: Water service line repairs and connections on copper lines may use flare\nto flare or grip-tite compression fittings as specified in Chapter 9, “Utilities Standards,”\nof these Standards."
  },
  {
    "corpus": "DCS",
    "chapter": 4,
    "anchor": "4.08(F)",
    "heading": "Sewer Services",
    "page_start": 120,
    "page_end": 121,
    "verbatim": "When a sewer service line is abandoned or repaired, the following will apply:\n(1) Abandonment: A sewer service line shall be abandoned by excavation of the connection\nwith the main, removal of the section of main with the connection tap, and replacement\nof that section of the main with PVC non-pressure pipe and couplings as specified in\nChapter 9, “Utilities Standards,” of these Standards. Manhole taps may be plugged at the\nmanhole with the service line left intact.\n(2) Repair: Sewer service line repairs that require the coupling of two pipe sections to create\na joint shall use couplings for non-pressure pipe as specified in Chapter 9, “Utilities\nStandards,” of these Standards.\nCITY OF BOULDER\nDESIGN AND CONSTRUCTION STANDARDS"
  }
]