[
  {
    "corpus": "DCS",
    "chapter": 7,
    "anchor": "7.18",
    "heading": "POST-CONSTRUCTION STORMWATER QUALITY INSPECTION AND MAINTENANCE",
    "page_start": 9,
    "page_end": 9,
    "verbatim": "REQUIREMENTS .......................................................................................................................... 7-47\n(A) Applicability ................................................................................................................................. 7-47\n(B) Inspection and Maintenance Requirements for SCMs ................................................................. 7-47\n(C) Inspection and Maintenance Guide .............................................................................................. 7-48"
  },
  {
    "corpus": "DCS",
    "chapter": 7,
    "anchor": "7.18",
    "heading": "POST-CONSTRUCTION STORMWATER QUALITY INSPECTION AND MAINTENANCE",
    "page_start": 154,
    "page_end": 154,
    "verbatim": "REQUIREMENTS ...................................................................................................................................... 47\n(A) APPLICABILITY .......................................................................................................................................... 47\n(B) INSPECTION AND MAINTENANCE REQUIREMENTS FOR SCMS ................................................................... 47\n(C) INSPECTION AND MAINTENANCE GUIDE .................................................................................................... 48\nLIST OF TABLES\nNumber Page\nTable 7-1: Design Storm Frequencies ......................................................................................................................... 13\nTable 7-2: Manning’s “n” for Storm Sewers .............................................................................................................. 19\nTable 7-3: Required Manhole Sizes ............................................................................................................................ 21\nTable 7-4: Standard Inlets ........................................................................................................................................... 22\nTable 7-5: Allowable Street Drainage Encroachment .................................................................................................. 23\nTable 7-6: Allowable Cross Street Flow ...................................................................................................................... 24\nTable 7-7: Treatment Approach Selection Criteria ...................................................................................................... 40\nTable 7-8: Required Inspection Frequency by SCM Type .......................................................................................... 48\nLIST OF FIGURES\nNumber Page\nFigure 7-1: Water Quality Treatment Approach Hierarchy ........................................................................................ 40"
  },
  {
    "corpus": "DCS",
    "chapter": 7,
    "anchor": "7.01(A)",
    "heading": "Intent",
    "page_start": 156,
    "page_end": 156,
    "verbatim": "The Stormwater Design Standards are intended to provide for a comprehensive and integrated\nstormwater utility system to convey and manage stormwaters in order to mitigate safety hazards\nand minimize property losses and disruption due to heavy storm runoff and flooding, maintain\ntravel on public streets during storm events, enhance water quality of storm runoff by mitigating\nerosion, sediment and pollutant transport, control and manage increased runoff due to local\ndevelopment, establish effective long-term management of natural drainageways, and provide for\nongoing and emergency maintenance of public stormwater systems. These standards are intended\nto prevent pollution and degradation of state waters.\nThe City is an operator of a Phase II Municipal Separate Storm Sewer System (MS4) and is\nrequired by the State of Colorado to hold a permit to discharge stormwater from its municipal\nseparate storm sewer system to the waters of the State. The Stormwater Design Standards\nestablish standards implementing the requirements of the MS4 Permit and Chapter 11-5,\n“Stormwater and Flood Management Utility,” B.R.C. 1981."
  },
  {
    "corpus": "DCS",
    "chapter": 7,
    "anchor": "7.01(B)",
    "heading": "Comprehensive Flood and Stormwater and Greenways Master Plans",
    "page_start": 156,
    "page_end": 156,
    "verbatim": "All improvements proposed to the City’s stormwater system shall conform with the goals, policies,\nand standards outlined in adopted Comprehensive Flood and Stormwater and Greenways Master\nPlans."
  },
  {
    "corpus": "DCS",
    "chapter": 7,
    "anchor": "7.01(C)",
    "heading": "Reference Standards",
    "page_start": 156,
    "page_end": 156,
    "verbatim": "Where not specified in these Standards or the B.R.C. 1981, to protect the public health, safety, and\nwelfare, the Director will specify the standards to be applied to the design and construction of\nstormwater improvements and may refer to one or more of the references listed in the References\nSection of these Standards."
  },
  {
    "corpus": "DCS",
    "chapter": 7,
    "anchor": "7.01(D)",
    "heading": "Floodplains",
    "page_start": 156,
    "page_end": 156,
    "verbatim": "Where improvements are proposed within a designated 100-year floodplain, as defined on the\ncurrent FEMA Flood Insurance Rate Map (FIRM) or floodplain mapping adopted by the City, an\napplicant for construction approval shall satisfy and comply with all applicable regulations and\nrequirements as set forth in Chapter 9-3, “Overlay Districts,” B.R.C. 1981."
  },
  {
    "corpus": "DCS",
    "chapter": 7,
    "anchor": "7.01(E)",
    "heading": "Stormwater Quality and Erosion Control",
    "page_start": 156,
    "page_end": 156,
    "verbatim": "The USDCM, Volume 3, “Best Management Practices,” “Colorado Department of Transportation\nM-Standards, and/or City of Boulder, “Wetlands Protection Program Best Management Practices”\nmanual shall be applied to address stormwater quality management and erosion control for all\nproposed projects and developments. An applicant for construction or development approval shall\nalso satisfy and comply with all applicable regulations and requirements as set forth in Chapter 11-\n5, “Stormwater and Flood Management Utility,” B.R.C. 1981. All stormwater reports and plans\nshall include necessary analyses, mitigation measures, and improvements needed to meet these\nstormwater quality and erosion control standards."
  },
  {
    "corpus": "DCS",
    "chapter": 7,
    "anchor": "7.01(F)",
    "heading": "Wetlands Protection",
    "page_start": 157,
    "page_end": 157,
    "verbatim": "Where improvements are proposed within a delineated wetland or wetland buffer area, as defined\nunder the City’s wetland protection ordinance, an applicant for construction approval shall satisfy\nand comply with all applicable regulations and requirements as set forth in Section 9-3-9, “Stream,\nWetlands, and Water Body Protection,” B.R.C. 1981, including any necessary identification,\nanalyses, avoidance and mitigation measures, and improvements needed to address wetlands\nprotection requirements."
  },
  {
    "corpus": "DCS",
    "chapter": 7,
    "anchor": "7.01(G)",
    "heading": "Streets",
    "page_start": 157,
    "page_end": 157,
    "verbatim": "The primary function of streets is for safe traffic movement; therefore, streets shall be designed\nand constructed to accommodate runoff and convey it to downstream drainage facilities in order to\nminimize its interference with traffic. When the stormwater runoff accumulation in the street\nexceeds allowable limits, storm sewers or other drainage facilities are required to collect and\nconvey the excess runoff."
  },
  {
    "corpus": "DCS",
    "chapter": 7,
    "anchor": "7.01(H)",
    "heading": "Irrigation Ditches and Laterals",
    "page_start": 157,
    "page_end": 157,
    "verbatim": "Where a project or development is proposed adjacent to or impacts an existing irrigation ditch, an\napplicant for construction approval shall meet the following standards:\n(1) No storm runoff shall be conveyed into an irrigation ditch or lateral without written\napproval and permission from the affected irrigation ditch company or lateral owner.\n(2) An adequate right-of-way or drainage easement for maintaining the affected irrigation\nditch shall be dedicated to the City.\n(3) The irrigation ditch or lateral shall not be relocated, modified, or altered without written\napproval and permission from the affected irrigation ditch company or lateral owner.\n(4) The irrigation ditch or lateral shall not be used for the following purposes:\n(a) Basin boundaries to eliminate the contribution of the upper basin area in the\nevaluation of runoff conditions. Irrigation ditches shall not be assumed to\nintercept stormwater runoff.\n(b) Outfall points for new development where runoff into irrigation ditches and\nlaterals has increased in flow rate or volume, or where historic runoff conditions\nhave been changed, without written approval and permission from the affected\nirrigation ditch company or lateral owner."
  },
  {
    "corpus": "DCS",
    "chapter": 7,
    "anchor": "7.01(I)",
    "heading": "Multiple Functions of Major Drainageways",
    "page_start": 157,
    "page_end": 157,
    "verbatim": "Boulder Creek’s numerous tributaries are part of a comprehensive natural open drainageway\nsystem. These drainageways provide open corridors and serve multiple functions, including\nwithout limitation, stormwater drainage and flood conveyance, wetlands and water quality\nenhancement, environmental protection and preservation, open space and wildlife areas, and\nrecreational activities and trail corridors. Stormwater improvements impacting these drainageways\nshall be designed and constructed to respect, restore and enhance these functions in order to\nmaintain the creek corridor ecology, environment and aesthetic value of such drainageways."
  },
  {
    "corpus": "DCS",
    "chapter": 7,
    "anchor": "7.01(J)",
    "heading": "Definitions",
    "page_start": 157,
    "page_end": 159,
    "verbatim": "The words defined in this subsection and used in this Chapter have the meanings established in\nthis section unless the context clearly indicates otherwise:\nApplicable development site means (1) any new development or redevelopment site resulting in land\ndisturbance of greater than or equal to one acre, including a site that is less than one acre that is part of a larger\ncommon plan of development or sale that would disturb or has disturbed one acre or more, or (2) any\ndevelopment site for which a stormwater detention pond is required under these Standards.\nCommon plan of development or sale means a plan or sale where multiple separate and distinct\nconstruction activities may be taking place at different times on different schedules in a contiguous area, within\n1/4 mile, but remain related through such plan or sale.\nConstruction activity means an activity that disturbs the ground surface and associated activities that\ninclude, without limitation clearing, grading, excavation, demolition, installation of new or improved haul\nroads and access roads, staging areas, stockpiling of fill materials, and borrow areas. Activities from initial\nground breaking through final stabilization are construction activities regardless of ownership. Construction\nactivities do not include routine maintenance to maintain the original line and grade, hydraulic capacity, or\noriginal purpose of a facility. Activities to conduct repairs that are not part of routine maintenance, activities\nfor replacement, and activities for repaving where underlying or surrounding soil is exposed, cleared, graded,\nor excavated are all construction activities for the purposes of this chapter.\nControl measure means an activity, practice, or structural control used to prevent or reduce the\ndischarge of pollutants to waters of the State. The two categories of control measures are:\nControl measure for post-construction stormwater quality, also referred to as a\nstormwater control measure (SCM), means a permanent device, practice, or method for\nremoving, reducing, retarding, or preventing targeted stormwater runoff constituents,\npollutants, and contaminants from reaching receiving waters.\nControl measures for erosion and sediment control means a device, practice, or\nmethod implemented on a construction site to remove, reduce, retard, or prevent pollutants\nor pollutant-laden water from discharging off the site. These control measures may be\nstructural (e.g., wattles/sediment control logs, silt fences, earthen dikes, drainage swales,\nsediment traps, subsurface drains, pipe slope drains, inlet protection, outlet protection,\ngabions, sediment basins, temporary vegetation, permanent vegetation, mulching,\ngeotextiles, sod stabilization, slope roughening, maintaining existing vegetation,\nprotection of trees, and preservation of mature vegetation) or non-structural (e.g.,\nschedules of activities, prohibitions of practices, pollution prevention and educational\npractices, and maintenance procedures).\nDetention pond means a structural control intended to store increased runoff from developed\nproperty and release this runoff at the historic rate that existed prior to development or redevelopment.\nLID technique means low impact development technique.\nLow Impact Development (LID) technique means a non-structural land development planning and\nsite layout strategy intended to reduce stormwater volume, peak discharge, and pollutant load.\nMS4 Permit means the Municipal Separate Storm Sewer System Phase II discharge permit issued\nby the Colorado Department of Public Health and Environment pursuant to Regulation 61, Colorado\nPermit Discharge System, 5 CCR 1002-61, and the Colorado Water Quality Control Act, C.R.S.§ 25-8-\n101, et seq., as that permit may be amended in the future.\nNew development means a vegetative or non-vegetative change in the existing land surface, including\nwithout limitation construction activities, compaction associated with stabilization of structures, road\nconstruction, construction or installation of a building or other structure, and creation of impervious surfaces,\nand land subdivision for a site that does not meet the definition of redevelopment.\nReceiving Pervious Area (RPA) means a vegetated pervious area that receives stormwater from an\nimpervious area, thus un-connecting the impervious area from directly discharging stormwater to a local\nstream, lake, or to the public stormwater utility system.\nRedevelopment means the creation or addition of impervious area or paved surface on a site that is\nalready substantially developed with 35% or more existing imperviousness, including without limitation\nexpansion of a building footprint, addition or replacement of a structure, structural development, and\nconstruction or replacement of paved surface area.\nStormwater utility system means the municipal storm sewer system that includes without limitation\nthe conveyance or system of conveyances (including roads with drainage systems, municipal streets, catch\nbasins, curbs, gutters, ditches, human-made channels, or storm drains) that discharge to state waters and is\nowned or operated by the City and designed or used for collecting or conveying stormwater, and is not a\ncombined sewer or part of a publicly owned treatment works.\nStormwater Quality Design Standard means a performance metric from the MS4 Permit that must\nbe demonstrated to be achieved to document compliance with City of Boulder stormwater requirements for\napplicable development sites. Stormwater Quality Design Standards are volume reduction, Water Quality\nCapture Volume (WQCV), pollutant removal, and constrained redevelopment site standards, as defined in\nSubsection 7.16(D).\nTreatment area means a single drainage basin or group of drainage basins for which a proposed\ndesign completely satisfies a single Stormwater Quality Design Standard.\nUnconnected Impervious Area (UIA) means an impervious area that discharges to a RPA and,\ntherefore, does not discharge directly to a local stream, lake, or the stormwater utility system.\nWater Quality Capture Volume (WQCV) means the volume equivalent to the runoff from an 80th\npercentile storm, meaning that 80 percent of the most frequently occurring storms are fully captured and\ntreated and larger events are partially treated."
  },
  {
    "corpus": "DCS",
    "chapter": 7,
    "anchor": "7.02(A)",
    "heading": "General",
    "page_start": 159,
    "page_end": 160,
    "verbatim": "(1) If a project is determined to be of sufficient size or complexity, the Director may require\nthe preparation of a Conceptual Drainage Report and Stormwater Plan by the Engineer to\nassess feasibility of stormwater utility system improvements. The purpose of the\nConceptual Drainage Report and Stormwater Plan shall be to demonstrate that required\nstormwater utility system facilities can be accommodated on the development site and to\nidentify and plan for impacts to neighboring properties and stormwater utility systems.\n(2) The Director reviews Conceptual Drainage Reports and Stormwater Plans for local-level\npurposes, including conformance with these Standards pertaining to stormwater utility\nsystems.\n(3) Measured or calculated parameters provided in all submitted Conceptual Drainage Reports\nand Stormwater Plans shall be reported using the English System of Measurement unless\nMetric System units are the standard expression for the parameter.\n(a) Land or surface area shall be reported in square feet (ft2, sf, or sq.ft.) for projects\nhaving a land disturbance area less than one acre and shall be reported to the\nnearest tenth of an acre (acre or ac.) for projects having a land disturbance of one\nacre or greater.\n(b) Water volume shall be provided in cubic feet (ft3 or cu.ft.).\n(c) Soil volume shall be provided in cubic yards (yd3 or cu.yd.).\n(d) Water discharge (also stated as flow rate or flow) shall be provided in cubic feet\nper second (ft3/s or cfs).\n(e) Infiltration rate shall be reported in inches per hour (in/hr)."
  },
  {
    "corpus": "DCS",
    "chapter": 7,
    "anchor": "7.02(B)",
    "heading": "Conceptual Drainage Report",
    "page_start": 160,
    "page_end": 160,
    "verbatim": "The Conceptual Drainage Report shall provide a response for each of the elements listed in the\nPreliminary Drainage Report narrative requirements, as set forth in Subsection 7.03(B) of these\nStandards, or if more data is necessary identify the data collection efforts necessary to complete the\nPreliminary Drainage Report."
  },
  {
    "corpus": "DCS",
    "chapter": 7,
    "anchor": "7.02(C)",
    "heading": "Conceptual Stormwater Plan",
    "page_start": 160,
    "page_end": 160,
    "verbatim": "The Conceptual Stormwater Plan shall address each of the elements listed in the Preliminary\nStormwater Plan requirements, sufficient to provide an overall drainage plan, as set forth in\nSubsection 7.03(C) of these Standards, or if more data is necessary identify the data collection\nefforts necessary to complete the Preliminary Stormwater Plan."
  },
  {
    "corpus": "DCS",
    "chapter": 7,
    "anchor": "7.03(A)",
    "heading": "General",
    "page_start": 160,
    "page_end": 160,
    "verbatim": "(1) The Director may require the preparation of a Preliminary Drainage Report and\nStormwater Plan by the Engineer. The Preliminary Drainage Report and Stormwater Plan\nwill be used to assess the impacts and public improvement needs of any proposed project\nor development site. Approval of the Preliminary Drainage Report and Stormwater Plan\nshall not be construed as approval of specific design details.\n(2) The Director reviews Preliminary Drainage Reports and Stormwater Plans for local-level\npurposes, including conformance with these Standards pertaining to stormwater utility\nsystems.\n(3) Measured or calculated parameters provided with the Preliminary Drainage Report and\nStormwater Plan shall be consistent with Subsection 7.02(A)(3) of these Standards."
  },
  {
    "corpus": "DCS",
    "chapter": 7,
    "anchor": "7.03(B)",
    "heading": "Preliminary Drainage Report",
    "page_start": 160,
    "page_end": 163,
    "verbatim": "The Preliminary Drainage Report shall define the proposed development site, describe existing\nconditions, and propose needed stormwater facilities to meet the requirements of these Standards.\nThe Preliminary Drainage Report shall include, at a minimum, narratives addressing the items\nlisted in this subsection except for those items not applicable to the proposed development site.\nThe Preliminary Drainage Report shall include visual representations and/or refer to the\nPreliminary Stormwater Plan sheet with the corresponding content (see Subsection 7.03(C) of\nthese Standards for Preliminary Stormwater Plan requirements). The Preliminary Drainage Report\nnarrative shall include the following information:\n(1) Cover Page: Provide a cover page that includes the site name, site address, submittal and\nrevision dates as applicable, site owner, and preparing Engineer.\n(2) Site Description\n(a) Site Location Description\n(i) County, city, township, range, section, and ¼ section.\n(ii) Site vicinity and legal boundaries map.\n(iii) Adjacent developments and associated land use.\n(iv) Roadways located within or adjacent to the site.\n(b) Property Description\n(i) Site area and proposed area of disturbance in acres.\n(ii) Existing and proposed site use.\n(iii) Land surface (vegetation type, topography, slope, buildings, etc.)\n(iv) Easements within or adjacent to the site.\n(c) Drainage Description\n(i) Major and minor drainageways.\n(ii) Natural drainage features (e.g., streams, lakes, ponds, wetlands, and\nbuffer areas).\n(iii) Irrigation ditches.\n(iv) Regulatory floodplain extents.\n(v) Known drainage issues.\n(vi) Hydrologic soil group map and description.\n(vii) Geotechnical and groundwater site investigation results.\n(viii) Preliminary Infiltration Feasibility Screening results and map (see\nSubsection 7.16(A) of these Standards).\n(3) Drainage Basin Description\n(a) Major Drainage Basin\n(i) General description of major drainage basin characteristics and flow\npatterns.\n(ii) Flow conveyance from site to receiving major drainageway.\n(iii) Reference to all applicable planning studies for the major drainageway\nand, if applicable, describe requirements of these plans for the\ndevelopment site.\n(iv) Impact of site development on upstream and downstream properties.\n(v) Impact of site development on downstream natural and constructed\nopen channels and piped stormwater utility systems and the measures\nproposed to reduce or eliminate those impacts.\n(b) Site Drainage Basin(s)\n(i) Existing and proposed basin and sub-basin characteristics for the site,\nincluding land cover, area, flow patterns, and discharge points for each\nbasin/sub-basin.\n(ii) Acceptance and conveyance of off-site stormwater into and through the\nproposed development site.\n(iii) Overview of all existing and proposed conveyance, detention, and water\nquality facilities, including rationale, for each basin/sub-basin.\n(4) Drainage Design Criteria\n(a) Regulation Applicability\n(i) Detention requirements (see Section 7.12 of these Standards).\n(ii) Construction stormwater management requirements (see Section 7.13\nof these Standards).\n(iii) Post-construction stormwater quality requirements (see Section 7.15 of\nthese Standards).\n(iv) Stream, Wetland, and Waterbody Protection Requirements as set forth\nin Chapter 9-3, “Overlay Districts,” B.R.C. 1981.\n(v) Other applicable criteria and permits.\n(b) Site Planning and Constraints\n(i) Description of previous drainage studies or master plans for the site and\nadjacent areas and influence on proposed stormwater utility system\ndesign.\n(ii) Description of site constraints caused by structures, utilities, etc. and\ninfluence on proposed stormwater utility system design.\n(iii) Description of Low Impact Development (LID) techniques utilized for\nstormwater management with reference to completed form(s) as\nprovided by the Director and included as an appendix (see Section 7.14\nof these Standards).\n(c) Hydrologic and Hydraulic Criteria\n(i) Design storm(s).\n(ii) Runoff calculation methods.\n(iii) Detention storage and discharge calculation method.\n(iv) Velocity and capacity calculation method(s) for inlets and conveyances.\n(v) Water surface profile and hydraulic grade line (HGL) calculation\nmethods.\n(d) Post-Construction Stormwater Quality Criteria\n(i) Selected treatment approach and design standards (see Section 7.16 of\nthese Standards).\n(5) Stream, Wetland, and Waterbody Impacts\n(a) Description of floodplain impacts.\n(b) Required modification studies.\n(6) Stormwater Conveyance Design\n(a) Description of proposed conveyance system.\n(b) Conveyance path to major drainageway and capacity evaluation.\n(7) Detention and Post-Construction Stormwater Quality Design\n(a) Description of each proposed facility (identifier, type, drainage area, size,\ntreatment volumes, components, and function).\n(b) Description of design compliance with detention and post-construction\nstormwater quality requirements with reference to completed form(s) as\nprovided by the Director and included as an appendix (see Section 7.15 of these\nStandards).\n(8) Conclusions\n(a) Drainage plan effectiveness.\n(b) Compliance with requirements.\n(c) Exclusions and variances.\n(9) References: Reference all standards, criteria, guidance documents, master plans, and\ntechnical reports used.\n(10) Appendices\n(a) Completed form(s) documenting post-construction water quality compliance\n(Section 7.15 of these Standards).\n(b) Completed form(s) documenting low impact development approaches (Section"
  },
  {
    "corpus": "DCS",
    "chapter": 7,
    "anchor": "7.14(C)",
    "heading": "Preliminary Stormwater Plan",
    "page_start": 163,
    "page_end": 164,
    "verbatim": "The purpose of the Preliminary Stormwater Plan is to provide visual representations of existing\nand proposed site conditions to support the Preliminary Drainage Report narrative. The\nPreliminary Stormwater Plan shall be included with the Preliminary Drainage Report, submitted as\na single PDF document. All Preliminary Stormwater Plan sheets shall be prepared on 24-inch by\n36-inch paper with appropriate scale ranges. The Preliminary Stormwater Plan shall include plan\nsheets addressing, at a minimum, the following items, except for those items not applicable to the\nproposed development site:\n(1) Overall Drainage Plan\n(a) Title block, legend, north arrow, and scale.\n(b) Existing topographic contours.\n(c) Property boundary.\n(d) Major drainage basin boundaries with area, design point, and existing flow rate\nlabels.\n(e) Drainage flow arrows depicting flow patterns to, from, and within the site.\n(f) Existing stormwater detention and water quality facility boundaries.\n(g) Easement boundaries.\n(h) Existing waterways (streams, lakes/ponds, wetlands, and irrigation facilities).\n(i) Land cover (vegetation and impervious surfaces).\n(j) Key map depicting extents of detailed drainage plan sheets.\n(2) Detailed Drainage Plan/s\n(a) Title block, legend, north arrow, and scale (scale range of 1 inch = 20 feet to 1\ninch = 100 feet).\n(b) Existing (screened) and proposed (solid) topographic contours (2 feet max\ninterval).\n(c) Location and elevation of all waterways, regulated buffer areas, and 100-year\nfloodplain.\n(d) Property, right-of-way, and easement boundaries.\n(e) Drainage basin/sub-basin boundaries with area, design point, and flow/release rate\nlabels.\n(f) Proposed outfall points and conveyance facilities to major drainageway with\ndesign point and flow/release rate labels.\n(g) Existing and proposed structure boundaries.\n(h) Existing and proposed stormwater conveyance facilities with size, slope, and\nmaterial designation (storm sewers, culverts, open channels, inlets, and discharge\npoints).\n(i) Existing and proposed stormwater detention and water quality facilities with\ndrainage area, surface area, side slope/wall, and component labels."
  },
  {
    "corpus": "DCS",
    "chapter": 7,
    "anchor": "7.04(A)",
    "heading": "General",
    "page_start": 164,
    "page_end": 164,
    "verbatim": "(1) The Director may require the preparation of a Final Drainage Report and Stormwater Plan\nby the Engineer. The report and plan will be used to assess the impacts and public\nimprovements needs of any proposed project or development site.\n(2) The Director reviews Final Drainage Reports and Stormwater Plans for local-level\npurposes, including conformance with these Standards pertaining to stormwater utility\nsystems.\n(3) Measured or calculated parameters provided with the Final Drainage Report and\nStormwater Plan shall be consistent with Subsection 7.02(A)(3) of these Standards."
  },
  {
    "corpus": "DCS",
    "chapter": 7,
    "anchor": "7.04(B)",
    "heading": "Final Drainage Report",
    "page_start": 164,
    "page_end": 166,
    "verbatim": "The Final Drainage Report shall describe the to-be-constructed drainage conditions for the site.\nThe Final Drainage Report shall include, at a minimum, all required narratives of the Preliminary\nDrainage Report, as set forth in Subsection 7.03(B) of these Standards, and the items listed in this\nsubsection, except for those items not applicable to the proposed development site. The Final\nDrainage Report shall include visual representations and/or refer to the Final Stormwater Plan\n(Subsection 7.04(C) of these Standards) or construction drawings (Subsection 7.04(D) of these\nStandards) with the corresponding content.\nThe Final Drainage Report shall include a cover page, following the format set forth in Subsection\n7.03(B) of these Standards and a certification page with the following statement prepared by a\nProfessional Engineer licensed in the State of Colorado:\nI hereby certify that this Final Drainage Report and Final Stormwater Plan for [Site Name] was\nprepared by me, or under my direct supervision, in accordance with sound engineering practice\nand all applicable state, federal and local regulations, including the provisions of the City of\nBoulder Design and Construction Standards.\nRegistered Professional Engineer (Affix Seal)\nState of Colorado No. ________________________\nThe Final Drainage Report shall include the following information:\n(1) Site Description: Updated narratives for all items listed in Subsection 7.03(B)(2) of these\nStandards.\n(2) Drainage Basin Description: Updated narratives for all items listed in Subsection\n7.03(B)(3) of these Standards.\n(3) Drainage Design Criteria: Updated narratives for all items listed in Subsection\n7.03(B)(4) of these Standards.\n(4) Stream, Wetland, and Waterbody Impacts\n(a) Description of floodplain impacts.\n(b) Required modification studies.\n(c) Applicable permits obtained.\n(5) Stormwater Conveyance Design\n(a) Description of proposed conveyance system.\n(b) Conveyance path to major drainageway and capacity evaluation.\n(c) Storm sewer, culvert, and inlet design (location, size, tributary area, and peak\nflows).\n(d) Open channel design (location, size, tributary area, and peak flows).\n(e) Outfall design (location, peak flows, and energy dissipation).\n(f) Street drainage (see Section 7.10 of these Standards).\n(g) Easement requirements.\n(h) Maintenance requirements.\n(6) Detention and Post-Construction Stormwater Quality Design\n(a) Description of each proposed facility (identifier, type, drainage area, size,\ntreatment volumes, components, and function).\n(b) Description of design compliance with detention and post-construction stormwater\nquality requirements with reference to completed form(s) as provided by the\nDirector and included as an appendix (see Section 7.15).\n(c) Inlet design (description of pretreatment measures and energy dissipation).\n(d) Basin and outlet design (storage volumes and release rates, including overflow\nspillway).\n(e) Description of vegetation coverage and planting plan.\n(f) Description of filter media selection and underdrain configuration.\n(g) Easement requirements.\n(h) Description of maintenance requirements with reference to Inspection and\nMaintenance Guide included as an appendix (see Section 7.18 of these\nStandards).\n(7) Conclusions: Updated narratives for all items listed in Subsection 7.03(B)(8) of these\nStandards.\n(8) References: Updated references for all items listed in Subsection 7.03(B)(9) of these\nStandards.\n(9) Appendices\n(a) Completed form(s) documenting post-construction water quality compliance\n(Section 7.15 of these Standards).\n(b) Completed form(s) documenting low impact development approaches (Section"
  },
  {
    "corpus": "DCS",
    "chapter": 7,
    "anchor": "7.14",
    "heading": "of these Standards).",
    "page_start": 166,
    "page_end": 166,
    "verbatim": "(c) Inspection and Maintenance Guide (Section 7.18 of these Standards).\n(d) Hydrologic calculations.\n(e) Hydraulic calculations.\n(f) Stormwater conveyance calculations.\n(g) Detention and permanent water quality calculations.\n(h) Critical reference information copied to create standalone document."
  },
  {
    "corpus": "DCS",
    "chapter": 7,
    "anchor": "7.14(C)",
    "heading": "Final Stormwater Plan",
    "page_start": 166,
    "page_end": 166,
    "verbatim": "The Final Stormwater Plan shall detail the to-be-constructed drainage conditions for the site and\nfollow the submittal requirements of the Preliminary Stormwater Plan, as set forth in Subsection\n7.03(C) of these Standards.\n(1) Overall Drainage Plan: Updated plan depicting all items listed in Subsection\n7.03(C)(1) of these Standards.\n(2) Detailed Drainage Plan(s): Updated plan(s) depicting all items listed in Subsection\n7.03(C)(2) of these Standards."
  },
  {
    "corpus": "DCS",
    "chapter": 7,
    "anchor": "7.14(D)",
    "heading": "Stormwater Construction Plans and Drawings",
    "page_start": 166,
    "page_end": 166,
    "verbatim": "Construction Plans and Drawings shall be submitted for review in conjunction with the Final\nDrainage Report. Preparation of Construction Plans and Drawings shall be consistent with Section"
  },
  {
    "corpus": "DCS",
    "chapter": 7,
    "anchor": "1.03",
    "heading": "of these Standards. The following elements pertaining to site stormwater design shall, at a",
    "page_start": 167,
    "page_end": 167,
    "verbatim": "minimum, be included in the Construction Plans and Drawings.\n(1) Stormwater Conveyance Construction Drawings\n(a) Plan drawing(s) depicting all proposed storm sewer and open channel\nconveyances following the requirements of Subsection 1.03(E)(2) of these\nStandards.\n(b) Profile drawing(s) depicting all proposed storm sewer and open channel\nconveyances following the requirements of Subsection 1.03(E)(3) of these\nStandards.\n(2) Detention and Post-Construction Stormwater Quality Construction Drawings\n(a) Plan drawing(s) depicting each proposed detention and post-construction\nstormwater quality facility following the requirements of Subsection 1.3(E)(2)\nof these Standards and, at a minimum, the following components, if proposed:\n(i) Inlet and outlet structure locations and energy dissipation measures,\nincluding emergency spillways,\n(ii) Proposed contours for treatment surface area and side slopes/walls,\n(iii) Facility components (e.g. pretreatment, micropool, underdrain, etc.),\nand,\n(iv) Vegetative cover.\n(b) Profile and/or cross-sectional drawing(s) depicting each proposed detention and\npost-construction stormwater quality facility following the requirements of\nSubsection 1.3(E)(3) of these Standards and, at a minimum, the following\ncomponents, if proposed:\n(i) Inlet and outlet structure inverts,\n(ii) Treatment area and side slope/wall surface elevations,\n(iii) Filter media components and depths, and\n(iv) Facility component elevations (e.g. pretreatment, micropool,\nunderdrain, etc.).\n(c) Detail drawing/s depicting each unique detention and post-construction\nstormwater quality facility component following the requirements of Subsection\n1.3(E)(4) of these Standards and, at a minimum for the following components,\nif proposed:\n(i) Pretreatment,\n(ii) Outlet structure,\n(iii) Underdrain, and\n(iv) Other unique components."
  },
  {
    "corpus": "DCS",
    "chapter": 7,
    "anchor": "7.05(A)",
    "heading": "General",
    "page_start": 168,
    "page_end": 168,
    "verbatim": "The methodologies and design standards for determining rainfall and runoff conditions for any\ndevelopment project are based on the standards prescribed in the USDCM, with local revisions as\nprescribed in these Standards."
  },
  {
    "corpus": "DCS",
    "chapter": 7,
    "anchor": "7.05(B)",
    "heading": "Storm Frequency",
    "page_start": 168,
    "page_end": 168,
    "verbatim": "Table 7-1, “Design Storm Frequencies,” indicates initial and major design storm frequencies to be\nused in the stormwater design or any project or development: Table 7-1: Design Storm Frequencies\nLand Use Initial Storm Major Storm\nSingle Family Residential 2 Year 100 Year\nAll Other Uses 5 Year 100 Year\nDetention Ponding Design 10 Year 100 Year"
  },
  {
    "corpus": "DCS",
    "chapter": 7,
    "anchor": "7.05(C)",
    "heading": "Rainfall",
    "page_start": 168,
    "page_end": 168,
    "verbatim": "The rainfall intensities to be used in computing runoff shall be determined using the USDCM,\nVolume 1 and the Boulder station of the NOAA Atlas 14 Point Precipitation Frequency Estimates."
  },
  {
    "corpus": "DCS",
    "chapter": 7,
    "anchor": "7.05(D)",
    "heading": "Runoff",
    "page_start": 168,
    "page_end": 168,
    "verbatim": "(1) CUHP Method: For basins larger than 160 acres, the Colorado Urban Hydrograph\nProcedure (CUHP) method shall be applied in conformance with the USDCM using local\nrainfall conditions.\n(2) Rational Method: For all basins smaller than 160 acres, the rational method, as described\nin the USDCM, shall be used to calculate runoff for both the initial and major storms.\n(3) Runoff Coefficient: The runoff coefficient to be used with the rational method may be\ndetermined based on either zoning/land use classifications or types of surface\nclassifications prescribed in the USDCM. A composite runoff coefficient may be\ncalculated using land areas impacted by specific classifications.\n(4) Intensity: The rainfall intensity used in the rational method shall be calculated per the\nUSDCM using the NOAA Atlas 14 rainfall depth-duration-frequency data."
  },
  {
    "corpus": "DCS",
    "chapter": 7,
    "anchor": "7.06",
    "heading": "Materials and Installation",
    "page_start": 168,
    "page_end": 168,
    "verbatim": "Construction of stormwater-related public improvements shall be in compliance with these Standards.\nAll pipe and structures shall be of adequate strength to support trench and AASHTO HS-20 highway\nloadings. The type of pipe and structures to be installed shall comply with these Standards, and shall\nbe based upon applicable design flows, site conditions, and maintenance requirements."
  },
  {
    "corpus": "DCS",
    "chapter": 7,
    "anchor": "7.07(A)",
    "heading": "General",
    "page_start": 169,
    "page_end": 169,
    "verbatim": "(1) Designated Major Drainageways: The following list identifies designated major\ndrainageways in the City for primary stormwater conveyance:\nDesignated Major Drainageways\nBear Canyon Creek Four Mile Canyon Creek South Boulder Creek\nBluebell Canyon Creek Goose Creek Sunshine Canyon Creek\nBoulder Creek Gregory Canyon Creek Two Mile Canyon Creek\nBoulder Slough King’s Gulch Viele Channel\nElmer’s Two Mile Creek Skunk Canyon Creek Wonderland Creek\nDry Creek Ditch No. 2\n(2) Design Approach: Design of public improvements for local drainageways shall ensure\nopportunities to provide for open conveyance corridors that may serve multiple functions,\nincluding without limitation, stormwater drainage and flood conveyance, wetlands and water\nquality enhancement, environmental protection and preservation, open space and wildlife\nareas, and recreational activities and trail corridors. Stormwater improvements impacting\nlocal drainageways shall be designed and constructed to respect, restore and enhance these\nfunctions in order to maintain a natural ecology, environment and aesthetic value of such\ndrainageways."
  },
  {
    "corpus": "DCS",
    "chapter": 7,
    "anchor": "7.07(B)",
    "heading": "Drainageway Types",
    "page_start": 169,
    "page_end": 171,
    "verbatim": "(1) Definition: Drainageways in the City are defined as natural or artificial channels as follows:\n(a) Natural channels include naturally developed creeks, streams and thalwegs, which\nhave been geologically created through the erosion process over time. Boulder Creek\nis considered a natural channel.\n(b) Artificial channels include those that are designed, constructed, or developed by\nhuman effort. Artificial channels may be unlined or lined (where non-erosive\nconditions for unlined design cannot be met). Artificial channels also include\nirrigation ditches, roadside ditches, and drainage swales.\n(2) Natural Drainageways\n(a) The hydraulic properties of natural drainageways vary along each stream reach and\nare to be maintained in a naturally occurring and environmental form. Natural\ndrainageways typically have mild slopes, are reasonably stable, and are not in a state\nof serious degradation or aggradation.\n(b) Where unstable conditions are created through the introduction of urbanized\nstormwater runoff, which alters the nature of flow peaks and volumes and may cause\nerosion, mitigation measures may be proposed in the natural drainageway to maintain\na stabilized and naturally occurring condition. A detailed analysis will be required\nfor all development proposals affecting natural drainageways in order to identify the\nimpacts of changes in flow characteristics, erosion and sedimentation, wetland losses\nand water quality conditions.\n(c) Analyses of natural drainageways shall be provided for each project or development\napplication affecting the drainageway. When performed, the Engineer is to prepare\ncross sections of the drainageway, define water surface profile for the existing and\nproposed minor and major storm events, investigate the bed and bank material to\ndetermine erosion and sediment transport tendencies, identify impacts on the\nnaturally occurring conditions and ecology and study the bank slope and stream bed\nstability. An analysis shall include engineering calculations to ensure that\nsupercritical flow conditions do not result from proposed project or development\nactivities. Natural channel improvements that would cause supercritical flow\nconditions shall not be permitted.\n(3) Unlined Artificial Drainageways\n(a) Unlined artificial drainageways provide improved channel bottoms that are covered\nwith wetlands, grass, or other vegetation, and may be used where naturally occurring\ndrainageways are not present or as proposed under an adopted stormwater master\nplan. Designs for unlined drainageways shall comply with these Standards and the\nUSDCM.\n(b) Unlined artificial drainageways are to provide conditions for slower flow velocities,\nreduced flow energy, increased flow retardance, and increased channel storage. The\nwetlands, grass, or other vegetation along stream beds and banks are intended to\nstabilize the channel, consolidate the soil mass of the bed, mitigate erosion, and\ncontrol soil particles transport along the drainageway. Design of these improvements\nshall also consider opportunities for accommodating multiple functions along the\ndrainageway, providing for a natural ecology, environment and aesthetic value.\n(c) Structural measures such as rock linings used for revetments, drop structures, scour\naprons, or trickle channels may be approved as a means of controlling erosion for\nunlined artificial drainageways.\n(4) Lined Artificial Channels\n(a) Where conditions for natural or unlined artificial drainageways are not available,\nincluding situations where limited right- of-way, supercritical velocities, or extremely\nerosive conditions exist, lined artificial channels may be constructed, subject to\nconformance with adopted stormwater master plans and the review, discretion, and\napproval of the City. Designs for lined artificial channels shall comply with these\nStandards and the USDCM. Lined artificial channels typically include rock-lined,\ngrouted rip-rap, and concrete-lined stream beds and banks.\n(b) Rock-lined (rip-rapped) or grouted rip-rap channels are generally discouraged but are\nmuch preferred to concrete lined channels. A rock-lined or grouted rip-rap channel\nmay typically be steeper and narrower, due to the higher friction factors of rock, and\nmay include steeper banks or side slopes. The lining shall be capable of withstanding\nall hydraulic and hydrodynamic forces which tend to overtop the bank, deteriorate the\nlining, erode the soil beneath the lining, and erode unlined areas, especially for the\nsupercritical flow conditions. If project constraints suggest the use of a rock-lined or\ngrouted rip-rap channels, the Engineer shall present the justification and design\nconcept to the City for consideration.\n(c) Concrete-lined channels are least desirable and may only be approved under severely\nrestrictive circumstances. The concrete lining shall withstand all hydraulic and\nhydrodynamic forces which tend to overtop the bank, deteriorate the lining, erode the\nsoil beneath the lining, and erode unlined areas, especially for the supercritical flow\nconditions. If project constraints suggest the use of a concrete lined channel, the\nEngineer shall present the justification and design concept, including a discussion of\nnon-concrete-lined alternatives and why they are not feasible, to the City for\nconsideration.\n(5) Roadside Ditches and Drainage Swales: Roadside ditches and drainage swales are open\ndrainage systems that are not part of the major drainageway system and are used to convey\nminor and major stormwater runoff in projects and developments and along rural-type streets.\nThe design of these drainage swales is similar to the design of unlined artificial drainageways\non a reduced scale."
  },
  {
    "corpus": "DCS",
    "chapter": 7,
    "anchor": "7.07(C)",
    "heading": "Drainageway Flow Computation",
    "page_start": 171,
    "page_end": 171,
    "verbatim": "Uniform flow and critical flow computations for drainageways shall be performed in accordance with\nthe USDCM."
  },
  {
    "corpus": "DCS",
    "chapter": 7,
    "anchor": "7.07(D)",
    "heading": "Drainageway Design Standards",
    "page_start": 171,
    "page_end": 173,
    "verbatim": "The design standards for drainageways involve a wide range of options intended to create safe,\nenvironmental, multipurpose, and aesthetic improvements. The following planning, evaluation, and\ndesign standards shall be applied:\n(1) Natural Drainageways\n(a) The drainageway and overbank areas necessary to pass 100-year storm runoff are to\nbe reserved for stormwater purposes.\n(b) Water surface profiles shall be defined to identify floodplain conditions.\n(c) Flood fringe filling along naturally defined drainageways, which reduces\ndrainageway flood storage capacity and increases downstream runoff peaks, is to be\navoided unless approved as part of an adopted City stormwater master plan.\n(d) Roughness factors (n), which are representative of unmaintained channel conditions,\nshall be used for the analysis of water surface profiles and to determine velocity\nlimitations\n(e) The Director may allow the placement of erosion control structures, such as drop\nstructures, check dams, revetments, and scour aprons, where they may be necessary\nto maintain stabilized drainageway conditions, subject to the design requirement that\nthe drainageway conditions remain as near natural as possible.\n(f) Design parameters applicable to artificial drainageways, including without limitation,\nfreeboard height, bed and bank slopes, and curvature, may not necessarily apply to\nnatural drainageways. Significant site planning advantages may be realized by\nmaintaining the natural drainageway, without structured improvements, by allowing\ndrainageway overtopping onto reserved flooding areas designated as open space and\nwetlands and maintaining irregular waterway features that naturally control flow\nconditions, improve water quality, preserve stream ecology and enhance community\nand aesthetic values.\n(2) Unlined Artificial Drainageways: Where not specified in these Standards, the design of\nunlined artificial drainageways shall conform with the USDCM.\n(a) Longitudinal Channel Slopes: Channel slopes are dictated by velocity and Froude\nnumber requirements. Where natural slopes exceed design slopes, drop structures\nshall be provided to maintain design velocities and Froude numbers. Normally, grass\nlined channels will have slopes of 0.2 percent to 0.6 percent.\n(b) Side Slopes: Maximum side slopes shall be no steeper than 4:1, unless specific\ndrainageway conditions warrant steeper side slopes as determined by the Director.\n(c) Depth: Maximum depth of flow, outside of any low flow or trickle channel, shall be\n5 feet. Critical depth shall be determined for both the major and initial storms in\norder to ensure that supercritical flows do not occur.\n(d) Bottom Width: Bottom width shall be consistent with the maximum depth and\nvelocity standards, and shall accommodate low flows and the development of wetland\nand water quality enhancement systems.\n(e) Horizontal Curvature: The center line curvature shall have a design radius twice the\ntop width for design flow conditions, but not less than 50 feet.\n(f) Roughness Coefficient: Meaning’s “n,” as adjusted by channel bottom conditions\noutlined in the USDCM, shall be applied.\n(g) Cross Sections: Drainageway cross-sections may be almost any type suitable to the\nlocation and to the environmental conditions, subject to conformance with these\nStandards. Cross sections simulating naturally occurring drainageway corridors are\nstrongly recommended.\n(h) Channel Bottom: The channel bottom is to be designed to convey low flows and\nenhance water quality in conformance with environmental concerns and regulations.\nAcceptable channel bottoms, subject to City approval for specific site applications,\nmay include without limitation wetlands or natural vegetation and low flow channels\nconveying a minimum 3 percent of the design storm flow.\n(i) Easement/Right-of-Way: The minimum drainageway easement/right of way width\nshall include the bank to bank dimension of the drainageway section, including the\nnormal flow depth and freeboard areas, and adequate maintenance access.\n(j) Maintenance Access: Maintenance access shall be provided along the entire length of\nall major drainageways and shall connect with a public street to allow access by\nmedium and large scale construction and maintenance equipment. An access road\nshall be at least 12 feet wide and designed to adequately support the loads of\nexpected maintenance equipment. The maintenance road may be shared as a\ngreenway trail, subject to approval by the City.\n(k) Water Surface Profiles: Water surface profiles shall be determined for all\ndrainageway designs using standard backwater methods, taking into consideration\nlosses due to velocity changes produced by changing channel sections, drops,\nwaterway openings, or obstructions. The water surface and energy gradient profiles\nshall be shown on the construction plans.\n(3) Lined Artificial Channels: Where allowed by the City, lined artificial channels shall be\ndesigned in accordance with these Standards and the USDCM, including the following:\n(a) Easement/Right-of-Way: The minimum drainageway easement/right of way width\nshall include the bank to bank dimension of the drainageway section, including the\nnormal flow depth and freeboard areas, and adequate maintenance access.\n(b) Maintenance Access: Maintenance access shall be provided along the entire length of\nall major drainageways and shall connect with a public street to allow access by\nmedium and large scale construction and maintenance equipment. An access road\nshall be at least 12 feet wide and designed to adequately support the loads of\nexpected maintenance equipment. The maintenance road may be shared as a\ngreenway trail, subject to approval by the City.\n(c) Water Surface Profiles: Water surface profiles shall be determined for all\ndrainageway designs using standard backwater methods, taking into consideration\nlosses due to velocity changes produced by changing channel sections, drops,\nwaterway openings, or obstructions. The water surface and energy gradient profiles\nshall be shown on the construction plans.\n(4) Roadside Ditches and Drainage Swales: The design of roadside ditches and drainage\nswales is similar to the standards for unlined channels with modifications for application to\nminor storm drainage. The standards are as follows:\n(a) Capacity: Roadside ditches and drainage swales shall have a minimum capacity for\nthe 10-year design storm.\n(b) Flow Velocity: The maximum velocity for the design storm runoff peak is not to\nexceed 5 feet per second. The Froude number shall be less than 0.8.\n(c) Longitudinal Slope: The slope shall be limited by flow velocity of the design storm.\nSwale widening or check drops may be required to control velocities.\n(d) Freeboard: Freeboard above the design flow depth shall be at least 6 inches.\n(e) Curvature: The minimum radius of curvature shall be 25 feet.\n(f) Roughness Coefficient: Manning’s “n,” as adjusted by channel bottom conditions\noutlined in the USDCM, shall be applied.\n(g) Depth: A drainage swale shall be at least 1 foot deep. A maximum depth for\ndrainage swales shall not exceed 5 feet and shall be dictated by the design flow and\ncross-sectional standards.\n(h) Side Slopes: Side slopes shall be no greater than 3:1; however, 4:1 side slopes or\nflatter are recommended for landscaped areas and to enhance water quality.\n(i) Driveway Culverts: Along roadside ditches, driveway culverts shall be sized to pass\nthe design storm flow without overtopping the driveway, having a minimum culvert\ndiameter size of 18 inches in height with at least 6 inches of cover. Flared end\nsections or headwalls with appropriate erosion protection shall be provided. Given\nthe depth constraints along roadside ditches, more than one culvert may be required\nto pass the design flow. Maintenance of all driveway culverts shall be the\nresponsibility of the property owner served by the driveway.\n(j) Discharge Points: Roadside ditches and open drainage swales shall discharge directly\nto the receiving water and shall not discharge to a piped storm sewer system for\nconveyance to the receiving water body. If discharge to a piped storm sewer system\nis necessary, a sediment sump and debris grate shall be provided immediately\nupstream of the discharge point to the storm sewer system. The grate shall be hinged\nto allow for maintenance access.\n(k) Major Drainage Capacity\n(i) The major drainage (100-year storm) capacity of roadside ditches is restricted\nby the maximum flow depth allowed at the street crown or by the ground\nsurface at the edge of the street right-of-way.\n(ii) The major drainage capacity of drainage swales is restricted to the maximum\nflow that can be passed without inundation to and damage of downstream\nproperties."
  },
  {
    "corpus": "DCS",
    "chapter": 7,
    "anchor": "7.07(E)",
    "heading": "Hydraulic Structures",
    "page_start": 174,
    "page_end": 174,
    "verbatim": "(1) Where Required: Hydraulic structures are used in open stormwater systems to control the\nflow of the runoff. The energy associated with flowing water has the potential to create\ndamage to the drainage system, especially in the form of erosion. Hydraulic structures are\nintended to control the energy of stormwater flow and minimize the damage potential of\nstormwater runoff. Typical hydraulic structures may include without limitation the following:\n(a) Channel drop and check structures,\n(b) Rip rap and rock linings,\n(c) Energy dissipaters and stilling basins,\n(d) Channel rundowns,\n(e) Bridges and culverts, and\n(f) Irrigation ditch crossings.\n(2) Design Standards: The standards to be used in the design of hydraulic structures shall be in\naccordance with these Standards and the USDCM."
  },
  {
    "corpus": "DCS",
    "chapter": 7,
    "anchor": "7.08(A)",
    "heading": "System Design",
    "page_start": 174,
    "page_end": 174,
    "verbatim": "(1) Where Required: Storm sewers shall be required when the other parts of the minor\nstormwater system, primarily streets, curbs, gutters, and roadside ditches, no longer have the\ncapacity for additional runoff in the initial storm event.\n(2) Gravity Flow Conditions: Storm sewers shall be designed for gravity (open) flow\nconditions, using a “Manning’s” roughness coefficient from Table 7-2, “Manning’s “n” for\nStorm Sewers.”\nTable 7-2: Manning’s “n” for Storm Sewers\nSewer Type Manning’s “n”\nConcrete 0.015\nPlastic 0.013\nCorrugated Metal 0.013\n(3) Flow Depth: Storm sewers are to be designed to carry peak flows at full pipe depth.\n(4) Pressure Flow Prohibited: Pressurized surcharged or depressed (inverted siphon)\nstormwater mains are prohibited in the City’s stormwater system.\n(5) Continuous Drainage System: All stormwater drainage facilities shall be a component of a\nconnected and continuous drainage system that does not end in a sump condition and does not\ndischarge to irrigation ditches."
  },
  {
    "corpus": "DCS",
    "chapter": 7,
    "anchor": "7.08(B)",
    "heading": "Location",
    "page_start": 174,
    "page_end": 174,
    "verbatim": "All storm sewer mains shall be installed in public rights-of-way or easements, in conformance with\nSection 4.04, “Utilities Easements,” of these Standards."
  },
  {
    "corpus": "DCS",
    "chapter": 7,
    "anchor": "7.08(C)",
    "heading": "Depth",
    "page_start": 175,
    "page_end": 175,
    "verbatim": "The cover for all storm sewer mains shall be at least 18 inches deep, measured from the top of pipe to\nthe final surface grade, and shall be capable of withstanding AASHTO HS-20 highway traffic\nloadings."
  },
  {
    "corpus": "DCS",
    "chapter": 7,
    "anchor": "7.08(D)",
    "heading": "Size",
    "page_start": 175,
    "page_end": 175,
    "verbatim": "Storm sewer mains shall be at least 18 inches in diameter, and storm sewer laterals shall be at least 15\ninches in diameter."
  },
  {
    "corpus": "DCS",
    "chapter": 7,
    "anchor": "7.08(E)",
    "heading": "Slope",
    "page_start": 175,
    "page_end": 175,
    "verbatim": "(1) Minimum and Maximum: Minimum allowable slope shall provide flow velocities of at\nleast 2-feet per second and maximum allowable slope shall provide flow velocities no greater\nthan 10feet per second during peak flow conditions.\n(2) Constant Slope: All storm sewer mains shall be laid at a constant slope between manholes."
  },
  {
    "corpus": "DCS",
    "chapter": 7,
    "anchor": "7.08(F)",
    "heading": "Alignment",
    "page_start": 175,
    "page_end": 175,
    "verbatim": "(1) Straight Alignment: All storm sewer mains shall be laid in a straight alignment between\nmanholes.\n(2) Curvilinear Mains Prohibited: Curvilinear storm sewer mains shall not be allowed."
  },
  {
    "corpus": "DCS",
    "chapter": 7,
    "anchor": "7.08(G)",
    "heading": "Separations and Crossings",
    "page_start": 175,
    "page_end": 175,
    "verbatim": "All collection main separations and crossings of other City utilities shall be designed in compliance\nwith Section 4.06, “Separation of Utilities,” of these Standards."
  },
  {
    "corpus": "DCS",
    "chapter": 7,
    "anchor": "7.08(H)",
    "heading": "Taps",
    "page_start": 175,
    "page_end": 175,
    "verbatim": "All taps approved onto an existing storm sewer main shall be made by the City of Boulder Utilities\nDivision and shall be paid for by the applicant. A manhole shall be provided at all taps 6 inches in\ndiameter or larger. Where taps are made to inlet boxes a manhole is not required."
  },
  {
    "corpus": "DCS",
    "chapter": 7,
    "anchor": "7.08(I)",
    "heading": "Ground Water Barriers",
    "page_start": 175,
    "page_end": 175,
    "verbatim": "(1) Required: Where the possibility exists that ground water may be diverted by the\nconstruction of new storm sewer mains, ground water barriers shall be constructed within the\nstorm sewer main trench to prevent ground water migration or diversion along the main.\n(2) Placement: The Engineer shall determine the location and number of ground water barriers\nthat will be necessary to mitigate any ground water impacts, subject to review and approval\nby the Director. Any necessary support material required to address ground water concerns,\nsuch as soils investigations, engineering calculations and design details, shall be provided by\nthe Engineer."
  },
  {
    "corpus": "DCS",
    "chapter": 7,
    "anchor": "7.08(J)",
    "heading": "Extensions",
    "page_start": 175,
    "page_end": 175,
    "verbatim": "Where required as part of any adopted City master plan or to satisfy stormwater design requirements\nas part of any proposed project or development, storm sewer mains shall be extended downstream to\nthe major drainageway, and upstream to the far edge of the property being served, to ensure\nperpetuation of the stormwater collection system."
  },
  {
    "corpus": "DCS",
    "chapter": 7,
    "anchor": "7.08(K)",
    "heading": "Manholes",
    "page_start": 176,
    "page_end": 176,
    "verbatim": "(1) Location: Manholes shall be provided at each storm sewer main connection with another\nstorm sewer main or lateral line, at all changes in grade, slope, alignment and pipe size, at all\ntap connections 6 inches in diameter or larger, or every 400 feet at a minimum.\n(2) Size\n(a) Table 7-3, “Required Manhole Sizes,” indicates required manhole sizes.\nTable 7-3: Required Manhole Sizes\nSewer Main Diameter Manhole Diameter\n12 - 18 Inches 4 Feet\n21 - 42 Inches 5 Feet\n48 - 54 Inches 6 Feet\n60 Inches and Larger Special Detail\n(b) Special Provisions: Larger manhole diameters or a junction structure may be required\nwhen sewer alignments are not straight through or more than one sewer line passes\nthrough a manhole.\n(3) Maintenance Access: Direct access by maintenance vehicles shall be provided to each\nmanhole. The access drive shall be an all-weather surface, such as asphalt or concrete paving,\nadequate gravel base or turf block, minimum 12 feet in width, and shall be capable of\nsupporting maintenance vehicles weighing up to 14 tons.\n(4) Covers\n(a) Manholes that are not located within a public street, alley or driveway section shall be\ninstalled with a hinged, gasketed, and locking frame and cover assembly. The\nassembly shall be an “East Jordan Iron Works” ERGO or ERGO XL assembly.\n(b) Manholes located within the 100-year floodplain, or in a location where runoff may\naccumulate and pond, shall be installed with a hinged, gasketed, and locking frame\nand cover assembly. The assembly shall be an “East Jordan Iron Works” ERGO or\nERGO XL assembly."
  },
  {
    "corpus": "DCS",
    "chapter": 7,
    "anchor": "7.08(L)",
    "heading": "Hydraulic Design",
    "page_start": 176,
    "page_end": 176,
    "verbatim": "(1) Rational Method: The rational method, as described in the USDCM, shall be used for the\nsizing of storm sewer systems.\n(2) Hydraulic and Energy Grade Line, and Design Losses: Storm sewers shall be designed to\nconvey the initial storm flow peaks without surcharging the sewer, and the final energy grade\nline shall be at or below the proposed ground surface. To ensure that this objective is\nachieved, the hydraulic and energy grade line shall be calculated by accounting for pipe\nfriction losses and pipe form losses as provided in the USDCM."
  },
  {
    "corpus": "DCS",
    "chapter": 7,
    "anchor": "7.09(A)",
    "heading": "Specifications",
    "page_start": 176,
    "page_end": 177,
    "verbatim": "(1) Design: Except as modified in these Standards, storm sewer inlet design shall conform with\nthe standards in the USDCM.\n(2) Required: Storm inlets shall be provided at:\n(a) Areas where street capacity (e.g., allowable design flow spread) would be exceeded\nwithout them,\n(b) At sumps or areas prone to ponding,\n(c) At median breaks (e.g., where traffic turns across the median),\n(d) Upstream of speed mitigation and pedestrian structures that would otherwise cause a\ndamming of stormwater runoff,\n(e) Where nuisance flows would otherwise cross a driving lane, and\n(f) Where curb and gutter ends.\n(3) Inlet Classification: Inlets are classified as a sump or continuous grade condition. Sump\ninlets are inlets located in a low spot or submerged condition. Continuous grade inlets are\ninlets located along a continuous grade curb and gutter section where bypass flows may\noccur, and not in a low point.\n(4) Standard Inlets: Table 7-4, “Standard Inlets,” indicates the standard inlets permitted for use\nin the City.\nTable 7-4: Standard Inlets\nInlet Type Drainage Permitted Use Percentage of Theoretical\nCondition Capacity Allowed\nCurb Opening Inlet - Type “R” Continuous All Curb and Gutter 80% (5 Foot Length)\nGrade or Sump Street Types 85% (10 Foot Length)\n90% (15 Foot Length)\nCombination (Curb Continuous All Curb and Gutter 66%\nOpening/Grated) Inlet Grade or Sump Street Types\nGrated Area Inlet Sump Parking Lots, Alleys 60%\n(5) Reduction Factors: In order to account for inlet capacity reductions caused by debris\nplugging, pavement overlaying, parked vehicles, and other blockage factors, inlet design shall\nbe based on the “percentage of theoretical capacity allowed” as outlined in Table 7-4,\n“Standard Inlets,” in these Standards.\n(6) Inlet Spacing\n(a) Spacing of storm inlets is dependent upon traffic requirements, contributing land use,\nstreet slope and distance to the nearest outfall system. The recommended sizing and\nspacing of the inlets is based upon the interception rate of 70 percent to 80 percent,\nwhich has been found to be more efficient than spacing using 100 percent\ninterception rate.\n(b) Using recommended inlet spacing, only the most downstream inlet is designed to\nintercept 100 percent of the flow. In addition to recommended interception rates,\nconsiderable improvements in overall inlet system efficiency can be achieved if the\ninlets are located in the sumps created by street intersections.\n(7) Inlet Grates: All inlet grates located in a street, alley, parking lot travel lane, bike path, or\nsidewalk shall utilize a vaned grate on the inlet such as the Denver Type 16 inlet."
  },
  {
    "corpus": "DCS",
    "chapter": 7,
    "anchor": "7.10(A)",
    "heading": "Function of Streets in the Drainage System",
    "page_start": 178,
    "page_end": 178,
    "verbatim": "(1) Primary Function of Streets: The primary function of streets is for safe traffic movement;\ntherefore, streets shall be designed and constructed to accommodate runoff and convey it to\ndownstream drainage facilities in order to minimize its interference with traffic. Streets\ntherefore provide an integral part of the stormwater system and are intended to transport local\nstorm runoff within reasonable limits. When the stormwater runoff accumulation in the street\nexceeds allowable limits, storm sewers or other drainage facilities are required to collect and\nconvey the excess runoff.\n(2) Continuous Drainage System: All stormwater drainage facilities for streets shall be a\ncomponent of a connected and continuous drainage system that does not end in a sump\ncondition and does not discharge to irrigation ditches."
  },
  {
    "corpus": "DCS",
    "chapter": 7,
    "anchor": "7.10(B)",
    "heading": "Street Classification and Allowable Runoff Encroachment",
    "page_start": 178,
    "page_end": 178,
    "verbatim": "(1) Street Classification: City streets are classified according to the average daily traffic carried\nand travel routes they provide. Higher category streets, such as arterials and collectors, are\nrequired to provide a greater level of access and through travel for emergency purposes\nduring major storm events than lower category streets.\n(2) Allowable Runoff Encroachment: A stormwater drainage system (storm sewer or open\ndrainageway) shall be provided where the gutter runoff encroachment reaches the limits\noutlined in Table 7-5, “Allowable Street Drainage Encroachment.”\nTable 7-5: Allowable Street Drainage Encroachment\nStreet Classification Minor Storm Maximum Encroachment Major Storm Maximum\nEncroachment\nResidential and Local Streets No curb overtopping. Flow may spread to Depth at flowline shall not\nstreet crown. exceed 18 inches.\nCollector Streets No curb overtopping. A minimum one Depth at flowline shall not\ntravel lane width shall remain free of exceed 18 inches.\ndrainage encroachment.\nArterial Streets No curb overtopping. A minimum two Depth at crown shall not exceed\ntravel lanes width shall remain free of 6 inches. Depth at flowline shall\ndrainage encroachment. not exceed 18 inches.\nFreeways No flow encroachment is allowed. Refer to CDOT Roadway\nDesign Manual\nNOTE: Flow encroachment shall not extend beyond property lines."
  },
  {
    "corpus": "DCS",
    "chapter": 7,
    "anchor": "7.10(C)",
    "heading": "Hydraulic Street Capacity",
    "page_start": 178,
    "page_end": 178,
    "verbatim": "(1) Allowable Capacity - Minor Storm: The allowable minor storm capacity of each street\nsection is to be calculated using the modified Manning's formula as described in the USDCM.\n(2) Allowable Capacity - Major Storm: The allowable street capacity for the major storm shall\nbe calculated using Manning's formula, dividing the street cross section into the pavement\narea and sidewalk/grass area, and computing individual flow contributions. An “n” value of\n0.016 for pavement and 0.035 for the sidewalk/grass area shall be used."
  },
  {
    "corpus": "DCS",
    "chapter": 7,
    "anchor": "7.10(D)",
    "heading": "Cross Street Flow",
    "page_start": 179,
    "page_end": 179,
    "verbatim": "The standards outlined in Table 7-6, “Allowable Cross Street Flow,” of these Standards shall be used\nfor allowable cross-street flow, where flow passes from one side of the street to the other. The\nallowable cross-street flow shall be determined using the methods prescribed in the USDCM.\nTable 7-6: Allowable Cross Street Flow\nStreet Classification Minor Storm Runoff Major Storm Runoff\nResidential and Local Street Maximum Depth of 6 Inches in Maximum Depth of 18 Inches Above\nCross Pan Flowline\nCollector Street Where Allowed, Maximum Depth Maximum Depth of 18 Inches Above\nof 6 Inches in Cross Pan Flowline\nArterial Not Allowed Maximum Depth of 6 Inches Over\nStreet Crown"
  },
  {
    "corpus": "DCS",
    "chapter": 7,
    "anchor": "7.11(A)",
    "heading": "System Design",
    "page_start": 179,
    "page_end": 179,
    "verbatim": "(1) Required: Culverts shall be provided for the conveyance of stormwater runoff under a\nroadway, railroad, driveway, or other crossings of an open drainage system (such as a\ndrainageway or roadside swale). The size, shape, and type of culvert crossings shall be based\non the projected runoff volumes, as well as existing topographic conditions. All culvert\ndesigns are subject to approval by the Director.\n(2) Culvert Types: Typical culvert types include circular, elliptical, or arch pipe sections, and\nreinforced concrete box culverts."
  },
  {
    "corpus": "DCS",
    "chapter": 7,
    "anchor": "7.11(B)",
    "heading": "Hydraulic Design",
    "page_start": 179,
    "page_end": 179,
    "verbatim": "All culverts shall be designed in accordance with the USDCM. All culvert designs are to include an\nanalysis to determine whether inlet or outlet control conditions govern for both major and minor storm\nrunoff conditions."
  },
  {
    "corpus": "DCS",
    "chapter": 7,
    "anchor": "7.11(C)",
    "heading": "Structural Design",
    "page_start": 179,
    "page_end": 179,
    "verbatim": "The structural design of culverts shall conform to accepted structural engineering practices, the\nColorado Department of Transportation design standards and standard specifications, any methods\nand criteria recommended by the manufacturer for a specific culvert type, and for conditions found at\nthe construction site. As a minimum, all culverts shall be designed to withstand an AASHTO HS-20\ntraffic loading."
  },
  {
    "corpus": "DCS",
    "chapter": 7,
    "anchor": "7.11(D)",
    "heading": "Specifications",
    "page_start": 179,
    "page_end": 181,
    "verbatim": "(1) Size\n(a) Culvert design size shall be based upon the following:\n(i) Runoff volumes for the appropriate design storm.\n(ii) Required capacity based on roadway classification and allowable street\novertopping, as prescribed in Section 7.10, “Street Drainage,” of these\nStandards\n(b) Culverts shall be at least 18 inches in diameter or height.\n(2) Inlet and Outlet Sections\n(a) All culverts shall be designed with headwalls and wingwalls, or flared end sections at\nthe inlet and outlet. Flared end sections are allowed only on pipe culverts with\ndiameters of 42 inches (or equivalent) or less.\n(b) Erosion protection such as rip-rap, boulder energy dissipators, or adequate vegetation,\nshall be provided at the inlet or outlet where required to mitigate potential scouring or\nerosive flow conditions. The Engineer shall propose the erosion protection to be\nused, subject to approval by the Director.\n(3) Slope and Velocity\n(a) Culvert slopes shall be designed so that neither silting nor excessive velocities\nresulting in scour can occur. The minimum design velocity for minor storm\nconditions shall be 2 feet per second, to provide for self-cleansing of the culvert.\n(b) The maximum culvert velocity is dictated by the channel conditions at the outlet, and\nthe amount of erosion protection or energy dissipation that can be provided to prevent\nscour or damage.\n(4) Allowable Headwater\n(a) The maximum headwater / diameter (HW/D) ratio for the 100-year design flows shall\nbe 1.5, and 1.0 for the 10-year design flow. These HW/D ratios are to be applied to\nculverts at street crossings and should not be applied to outlets from detention ponds\nor private driveways.\n(b) Ponding above the top of a culvert is not permitted if such ponding could potentially\ncause property or roadway damage, culvert clogging, saturation of critical\nembankments, detrimental debris deposition, erosion, or inundation of existing or\nfuture utilities, structures, or buildings.\n(5) Trash Racks\n(a) The installation of a trash rack over a culvert entrance shall be provided as required\nby the Director where there exists the potential for debris clogging of the culvert or\nwhere there is a safety hazard concern for the possibility of people (especially\nchildren) being carried into the culvert.\n(b) Trash racks shall be designed to maintain adequate culvert hydraulics, considering\nthe potential for debris buildup and blockage which may render the culvert\nineffective. Careful design considerations are to be applied, including without\nlimitation application of the following standards:\n(i) Materials: All trash racks shall be constructed with smooth steep pipe,\nhaving an outside diameter of at least 1 ¼ inches. Trash rack ends and\nbracing shall be constructed with steel angle sections. All trash rack\ncomponents shall have a corrosion protective finish.\n(ii) Design: Trash racks shall be designed without cross-braces, to minimize\ndebris clogging, and be able to withstand the full hydraulic load of a\ncompletely plugged trichroic based on the highest anticipated depth of\nponding. The trash rack shall be hinged and removable for maintenance\npurposes.\n(iii) Bar Spacing: Bar spacing shall provide a maximum clear opening of 6\ninches. The longitudinal slope of the trash rack shall be no steeper than 3:1,\nhorizontal to vertical. The entire trash rack shall have a clear opening at least\nthree times the culvert opening area.\n(c) Hydraulics: Use the following equation to compute hydraulic losses through trash\nracks:\nH =0.11 * (TV/D)2 * (sin A)\nT\nWhere: HT = Head Loss through the Trichroic (feet)\nT = Thickness of Trichroic Bar (inches)\nV = Velocity normal to Trichroic (fps)\nD = Center-to-Center Spacing of Bars (inches)\nA = Angle of Inclination of Trichroic with Horizontal\nThe velocity normal to the trichroic shall be computed considering the rack to be 50\npercent plugged."
  },
  {
    "corpus": "DCS",
    "chapter": 7,
    "anchor": "7.12(A)",
    "heading": "System Design",
    "page_start": 181,
    "page_end": 181,
    "verbatim": "(1) Intent: Detention ponding facilities are intended to store increased runoff from developed\nproperty and release this runoff at the historic rate that existed prior to development or\nredevelopment. By providing detention ponding, increased runoff impacts on downstream\nfacilities may be controlled and minimized to reduce potential damages and the need for\ngreatly expanded stormwater conveyance facilities.\n(2) Requirements: Detention ponding for stormwater shall be provided for all new development\nor redevelopment where the runoff coefficient for the site increased unless one of the\nfollowing conditions are met:\n(a) The project site is a single-family lot or a single-family lot split into two single-family\nlots that is not part of a larger development.\n(b) Runoff for the project site for the initial and major storm events from the entire\ntributary basin can be conveyed directly to the major drainage system without adverse\nimpact on upstream, surrounding, or downstream properties and facilities and\nstormwater detention to meet water quality mitigation measures is not required.\n(3) Maintenance: The property owner shall be responsible for maintaining stormwater detention\nfacilities.\n(4) Easement: All stormwater detention facilities shall be located in a public easement. The\neasement shall grant to the City at a no charge a permanent right to inspect, maintain, and\nreconstruct the stormwater detention facilities. The easement shall be granted on a form\nprovided by the Director. No owner of land or other applicant shall obtain a Final Drainage\nPlan, unless the owner first grants to the City the easement for all stormwater detention\nfacilities. The City shall have no obligation to the property owner to inspect, maintain, or\nreconstruct the stormwater facilities."
  },
  {
    "corpus": "DCS",
    "chapter": 7,
    "anchor": "7.12(B)",
    "heading": "Design Frequency, Hydraulic Design, and Storage Requirements",
    "page_start": 181,
    "page_end": 182,
    "verbatim": "(1) Design Storms: Detention ponds shall be designed in accordance with USDCM, Volume 2,\nChapter 12.\n(2) Storage Volume: The storage volume of runoff to be detained on-site shall be sized to\ncontain 110 percent of the difference between the historic runoff and the initial and major\nstorm runoff, as defined in Table 7-1, projected for the ultimate developed conditions of the\nentire parcel and tributary basin to be developed or redeveloped.\n(3) Undetained Site Releases: On project sites where runoff from portions of the site cannot be\ndetained due to topography or site conditions, free release of runoff may be approved with\ncompensating detention storage design subject to the following conditions:\n(a) Total maximum runoff from the entire parcel and tributary basin to be developed or\nredeveloped shall not exceed the historic runoff,\n(b) Release rates from the detention ponds shall be reduced by the developed runoff rate\nfrom the undetained drainage area,\n(c) The undetained drainage area may not exceed five percent of the entire parcel and\ntributary basin to be developed or redeveloped, and\n(d) The release rate from the undetained area may not exceed 25 percent of the historic\nrelease rate from the entire parcel and tributary basin to be developed or redeveloped."
  },
  {
    "corpus": "DCS",
    "chapter": 7,
    "anchor": "7.12(C)",
    "heading": "Detention Pond Design",
    "page_start": 182,
    "page_end": 182,
    "verbatim": "Except where inconsistent with the requirements in this Subsection 7.12(C), detention pond design\nshall follow all applicable criteria established in the USDCM, Volume 2 and Volume 3.\n(1) Surface Ponding Required: All detention ponds shall be provided as open, surface grade\nimprovements. Underground, enclosed, or roof top detention ponds shall not be permitted\nunless unusual site conditions and adequate detention performance and maintenance\nconditions are approved by the Director.\n(2) Location: Detention ponds shall be located in open, pervious landscaped areas to enhance\nsite drainage and soil percolation, and to improve water quality.\n(3) Side Slopes: Side slopes for detention ponds shall be designed to provide for ease of\nmaintenance and access. Landscaped side slopes are not to exceed 4:1, and vertical or steep\nwalls used as side slopes are to be constructed of durable natural materials, such as rock or\ntimber, with heights no greater than 30 inches to reduce safety hazards.\n(4) Pond Bottoms: Pond bottoms are to be pervious and sloped to prevent the collection of\nstanding water, unless a permanent pond or wetland bottom is provided for water quality\nenhancements. The use of combined water quality and detention facilities shall follow\ncriteria specification provided in the USDCM, Volume 3, Chapter 12 and applicable water\nquality treatment approach criteria as specified in Section 7.17 of these Standards. Hard-lined\ntrickle channels are not to be constructed in detention ponds unless approved by the Director\nto address specific drainage problems or safety and environmental hazards.\n(5) Overflow Release Feature: All detention ponds shall include an overflow release feature to\nspill during storm events larger than the major design storm or when release outlets fail. This\nfeature shall be designed to release overflows in a direction and manner that will not\nadversely affect properties downstream of the detention pond."
  },
  {
    "corpus": "DCS",
    "chapter": 7,
    "anchor": "7.13(A)",
    "heading": "Intent",
    "page_start": 182,
    "page_end": 183,
    "verbatim": "This section implements requirements of Section 11-5-6, “Stormwater Quality Management for Land\nDevelopment,” B.R.C. 1981, for construction activities and sets standards for stormwater\nmanagement plans (SWMP) and erosion control plans, their implementation, and the inspection and\nmaintenance of control measures for erosion and sediment control."
  },
  {
    "corpus": "DCS",
    "chapter": 7,
    "anchor": "7.13(B)",
    "heading": "Stormwater Management Plan Requirements",
    "page_start": 183,
    "page_end": 186,
    "verbatim": "A SWMP shall include a narrative and erosion control plans that identify the construction activities\nand their associated potential pollutant sources and address the selection, installation,\nimplementation, and maintenance of control measures for erosion and sediment control that reduce\nthe potential for the pollutant sources to enter the stormwater utility system or waters of the State.\nControl measures for erosion and sediment control shall prevent pollution and degradation of waters\nof the State. The SWMP shall include and be prepared, updated, and implemented consistent with\nthe following requirements:\n(1) General Standards: Control measures for erosion and sediment control shall be\nconstructed and maintained in accordance with the SWMP, the General Permit for\nStormwater Discharges Associated with Construction Activity issued by the CDPHE, and\nthe USDCM, Volume 3.\n(2) Preparation Standards: The SWMP shall be prepared in accordance with the\nrequirements of the General Permit for Stormwater Discharges Associated with\nConstruction Activity issued by the CDPHE and USDCM, Volume 3. The SWMP shall be\nprepared in accordance with methods, procedures, and practices that are based on scientific\nfacts, reflect best industry practices and standards, are appropriate for the conditions and\npollutant source, and provide appropriate solutions to meet the SWMP requirements of this\nsection, including practice based and numeric effluent limits. The SWMP shall include the\nfollowing elements:\n(a) Protection for adjacent properties (including public right-of-way) from erosion\nand/or sediment deposition.\n(b) Protection for public streets from the deposit of sediment from runoff or vehicles\ntracking mud.\n(c) Stabilization for all disturbed areas as defined in the USDCM and CDPS\nrequirements.\n(d) Protection for all storm sewer inlets from the entry of sediment-laden water.\n(e) Protection from encroachment by construction equipment, vehicles, and foot traffic\ninto stormwater infiltration measures to eliminate the possibility of soil compaction\nand vegetation damage.\n(f) Long-term stability of cut and fill slopes and the successful establishment of\npermanent vegetative cover on exposed soil.\n(g) Selection, installation, implementation, and maintenance of control measures for\nerosion and sediment control.\n(3) Control Measures for Erosion and Sediment Control and Potential Pollutant Sources:\nAll control measures for erosion and sediment control shall meet the following\nrequirements:\n(a) Control measures for erosion and sediment control shall be installed and made\noperational prior to the start of construction activity. The control measures for\nerosion and sediment control shall prevent potential pollutants from leaving the\nconstruction site during each phase of construction and shall be continued through\nfinal stabilization. Structural control measures for erosion and sediment control\nshall be maintained in operational condition through final stabilization.\n(b) Control measures for erosion and sediment control shall be selected, designed,\ninstalled, implemented, and maintained to prevent potential pollutants such as, but\nnot limited to, sediment, construction site waste, trash, discarded building\nmaterials, concrete truck washout, chemicals, sanitary waste, and contaminated\nsoils in discharges to the stormwater utility system from leaving the construction\nsite.\n(c) The SWMP shall address pollutant sources associated with the following activities\n(if part of the construction activity), and control measures for erosion and sediment\ncontrol shall be implemented if the source is determined to be present on the site:\n(i) Land disturbance and soil storage,\n(ii) Vehicle tracking,\n(iii) Loading and unloading operations,\n(iv) Outdoor storage of construction site materials, building materials, fertilizers,\nand chemicals,\n(v) Bulk material storage,\n(vi) Vehicle and equipment maintenance and fueling,\n(vii) Significant dust or particulate-generating processes,\n(viii) Routine maintenance activities involving fertilizers, pesticides, detergents,\nfuels, solvents, and/or oils,\n(ix) Concrete truck/equipment washing, including the concrete truck chute and\nassociated fixtures and equipment,\n(x) Dedicated asphalt and concrete batch plants,\n(xi) Other areas or operations where spills can occur, and\n(xii) Other non-stormwater discharges including construction dewatering not\ncovered under the CDPS General Permit for Construction Dewatering\nDischarges and wash water that may contribute pollutants to the stormwater\nutility system.\n(d) The SWMP shall include control measures for erosion and sediment control detail\ndrawings for both installation and maintenance. Controls measures should be\nconsistent with USDCM, Volume 3 or Colorado Department of Transportation M\n& S (Miscellaneous and Signage) Standard Plans.\n(4) Protection of Control Measures for Post-Construction Water Quality: Requirements\nfor the design and construction of control measures for post-construction water quality are\nprovided in Sections 7.14 through 7.18 of these Standards. The SWMP shall provide\nprovisions to protect the water quality functions of these control measures for post-\nconstruction water quality (SCMs) during construction as listed below:\n(a) Any area consisting of native, un-compacted soil where a SCM will be installed\nshall be protected from vegetation removal and encroachment by heavy equipment,\nvehicles, and foot traffic prior to grading and construction. If the area, prior to\ngrading and construction, consists of previously compacted or fill soil, protection\nfrom encroachment shall be provided after the soil has been amended or otherwise\nrehabilitated into an un-compacted condition to promote infiltration of stormwater.\nMethods and controls for protection of these areas shall be indicated in the SWMP.\n(b) The use of the SCM area for construction or maintenance materials stockpiles or\nfor storage of construction equipment, wastes, or pollutants is prohibited after\nconstruction of the SCM has commenced.\n(5) Erosion Control Plan: The SWMP shall include an Erosion Control Plan. Erosion\nControl Plan drawings shall locate and identify all structural and non-structural control\nmeasures for erosion and sediment control for the proposed construction activities. The\nErosion Control Plan shall be prepared in accordance with the requirements of the General\nPermit for Stormwater Discharges Associated with Construction Activity issued by the\nCDPHE and include the elements listed in form(s) provided by the Director. Erosion\nControl Plans shall include, at a minimum, three site maps illustrating the initial, interim,\nand final phases of construction and their associated control measures for erosion and\nsediment control.\nThe following Standard Notes shall also be included on Erosion Control Plan(s):\n(a) Temporary Erosion Controls: All temporary erosion control measures for erosion\nand sediment control shall be installed before any construction activities take place.\n(b) Sediment Controls: Control measures for erosion and sediment control shall be\nimplemented to prevent the release of sediment from construction sites. Vehicle\ntracking of sediment shall not be allowed to enter the stormwater utility system or\nwaters of the State. Sediment shall not be tracked onto public streets and, if so,\nshall be immediately removed.\n(c) Water Quality Impacts: Stormwater discharges from construction activities shall\nnot cause or threaten to cause pollution, contamination, or degradation of waters of\nthe State.\n(d) Waste Controls. Solid waste, industrial waste, yard waste, and any other pollutants\nor waste on any construction site shall be controlled using control measures. Waste\nand/or recycling containers shall be provided and maintained by the owner or\ncontractor on construction sites where there is the potential for release of waste.\nUncontained waste that may blow, wash, or otherwise be released from the site is\nprohibited. Sanitary waste facilities shall be provided and maintained by the owner\nor contractor.\n(e) Concrete Waste: Ready-mixed concrete, or any materials resulting from the\ncleaning of vehicles or equipment containing or used in transporting or applying it,\nshall be contained with appropriate control measures and ultimately removed for\nproper disposal. Release of these materials is prohibited.\n(f) Chemical Storage: Bulk storage structures for petroleum products and other\nchemicals shall have adequate protection so as to contain all spills and prevent any\nspilled material from entering the stormwater utility system or waters of the State.\n(g) Surface Cover Timing: Cover shall be applied within 14 days to inactive soil\nstockpiles and shall be maintained for stockpiles that are proposed to remain in\nplace longer than 30 calendar days.\n(h) Project Phasing: All earth disturbances shall be designed, constructed, and\ncompleted to limit the exposed area of any disturbed land to the shortest possible\nperiod of time.\n(i) Dust Controls: Techniques shall be used to prevent dust, sediment, or debris from\nblowing off the site.\n(j) Maintenance: Any damage or required maintenance to temporary and permanent\ncontrols measures shall be repaired or replaced as soon as possible, immediately in\nmost cases.\n(k) Removal: All control measures for erosion and sediment control shall be removed\nand disposed within 30 days after final site stabilization is achieved or after the\ntemporary measures are no longer needed, whichever occurs first.\n(l) Responsibility: The erosion control permittee shall be responsible for continued\ncompliance with the requirements of Section 7.13 of the City’s Design and\nConstruction Standards during construction activity on the site."
  },
  {
    "corpus": "DCS",
    "chapter": 7,
    "anchor": "7.13(C)",
    "heading": "Inspection and Maintenance Requirements",
    "page_start": 186,
    "page_end": 186,
    "verbatim": "The erosion control permittee shall be responsible for implementation of the SWMP or, if no SWMP\nis required, the Erosion Control Plan during construction, including inspection and maintenance of the\ncontrol measures for erosion and sediment control in the approved SWMP and/or Erosion Control\nPlan. Prior to commencement of work, the erosion control permittee shall ensure that all general\ncontractors, subcontractors, and utility agencies obtain a copy of and comply with the SWMP\nand/or Erosion Control Plan. The erosion control permittee shall amend the SWMP and/or Erosion\nControl Plan when site conditions change. The erosion control permittee shall keep the SWMP\nand/or Erosion Control Plan on site and shall implement and update the SWMP and/or Erosion\nControl Plan throughout construction and final stabilization of the site in accordance with the\nfollowing requirements:\n(1) If no SWMP is required, the erosion control permittee shall update the Erosion Control\nPlan to show currently implemented control measures for erosion and sediment control and\ninstallation dates.\n(2) If a SWMP is required:\n(a) An initial site inspection by the Director is required prior to commencing\nconstruction.\n(b) The erosion control permittee shall amend the SWMP whenever there is a change\nin design, construction, operation, or maintenance that affects the potential for\ndischarge of pollutants to the stormwater utility system or receiving waters, or if the\nSWMP proves to be ineffective in controlling pollutants in stormwater discharges\nassociated with construction activities.\n(c) The erosion control permittee shall inspect all control measures for erosion and\nsediment control per the frequency outlined in the General Permit for Stormwater\nDischarges Associated with Construction Activity issued by the CDPHE for the\nsite. Inspections of control measures for erosion and sediment control shall be\nconducted by an individual who has successfully completed formal training in\nerosion and sediment control by an organization acceptable to the Director. The\nerosion control permittee shall provide a certification of successful completion of\nsuch training to the Director upon request.\n(d) The erosion control permittee shall maintain records of inspection on site with the\nSWMP. Inspection records shall be available at the site at all times. The erosion\ncontrol permittee shall make the inspection records immediately available to the\nDirector upon request."
  },
  {
    "corpus": "DCS",
    "chapter": 7,
    "anchor": "7.14(A)",
    "heading": "Intent",
    "page_start": 187,
    "page_end": 187,
    "verbatim": "All new development and redevelopment shall reduce pollutant impacts of the development site on\nreceiving waters and reduce or control stormwater volumes by mimicking natural hydraulic conditions\nusing LID techniques. LID techniques seek to minimize impervious areas and protect and create well-\ndraining vegetated areas that promote infiltration and natural hydrologic processes thereby reducing\nstormwater runoff and pollutant quantities."
  },
  {
    "corpus": "DCS",
    "chapter": 7,
    "anchor": "7.14(B)",
    "heading": "Requirements for All Developments",
    "page_start": 187,
    "page_end": 187,
    "verbatim": "(1) LID techniques shall be implemented for all new development and redevelopment\nconsistent with the standards in this section.\n(2) Compliance with the requirement to implement LID techniques, including the investigation\nand analysis of LID techniques and an explanation of the implementation choices made,\nshall be documented in the Preliminary and Final Drainage Reports when such reports are\nrequired. Otherwise, compliance shall be demonstrated in building permit construction\ndocuments, on form(s) as provided by the Director, submitted as part of the building permit\napplication."
  },
  {
    "corpus": "DCS",
    "chapter": 7,
    "anchor": "7.14(C)",
    "heading": "LID Techniques",
    "page_start": 187,
    "page_end": 187,
    "verbatim": "LID techniques shall be chosen and applied following the principles summarized in this subsection.\nAdditional guidance on employing LID techniques is provided in USDCM, Volume 3, Chapter 1.\nThe following LID techniques shall be investigated and implemented to the maximum extent\npracticable:\n(1) Conserve Existing Amenities: Planning efforts shall account for and, where practicable,\npreserve or restore existing site features that naturally retain stormwater on site, including\nvegetated areas, high infiltrating soils, and natural surface drainage patterns, such as\nmeadows and trees.\n(2) Minimize Impacts: Planning efforts shall account for and minimize, where practicable,\nland disturbance, impervious surface addition, and soil compaction. This may include\nremoving unnecessary impervious areas, minimizing driveway and sidewalk widths, and\nsequencing construction to minimize compacted areas.\n(3) Minimize Directly Connected Impervious Areas (MDCIA): Planning efforts shall\naccount for and minimize impervious areas, such as rooftops and pavement, that directly\ndrain to the stormwater utility system or a local stream without prior stormwater control.\nThis may include using or integrating receiving pervious areas into the site landscape, such\nas vegetated swales and buffers. Where practicable, site drainage patterns shall be designed\nto promote sheet flow to vegetated area and roof downspouts shall be disconnected from\ndirect discharge to the storm sewer. Receiving pervious areas shall be designed to slow run-\noff and promote infiltration."
  },
  {
    "corpus": "DCS",
    "chapter": 7,
    "anchor": "7.15(A)",
    "heading": "Intent",
    "page_start": 187,
    "page_end": 188,
    "verbatim": "All new development and redevelopment shall reduce the pollutant impacts of the development site\non receiving waters. All applicable development sites shall implement post-construction stormwater\nquality management practices."
  },
  {
    "corpus": "DCS",
    "chapter": 7,
    "anchor": "7.15(B)",
    "heading": "Applicable Development Sites",
    "page_start": 188,
    "page_end": 189,
    "verbatim": "(1) Applicable Development Site: Applicable development sites are required to implement\ncontrol measures for post-construction stormwater quality in accordance with the\nrequirements of Chapter 11-5, “Stormwater and Flood Management Utility,” B.R.C. 1981,\nand this section, unless the Director has waived the applicable development site\nrequirements pursuant to Subsection 7.15(B)(2) of these Standards.\n(2) Waiver: The Director may waive the requirements for applicable development sites in this\nsection if the applicant demonstrates that the requirement of paragraph (a) of this\nSubsection 7.15(B)(2) is met and that none of the circumstances described in Subsection\n7.15(B)(2)(b)(i) through (vi) exist:\n(a) One or more of the following criteria is met:\n(i) Pavement Management Sites: The project proposes the rehabilitation,\nmaintenance, and reconstruction of roadway pavement, which includes\nroadway resurfacing, mill and overlay, white topping, black topping, curb\nand gutter replacement, concrete panel replacement, and pothole repair.\nThe purpose of the project must be to provide additional years of service\nlife and optimize service and safety. The project must be limited to the\nrepair and replacement of pavement in a manner that does not result in an\nincreased impervious area, and the infrastructure must not substantially\nchange. The types of projects that meet these criteria include day-to-day\nmaintenance activities, rehabilitation, and reconstruction of pavement.\n“Roadways” include roads and bridges that are improved, designed, or\nordinarily used for vehicular travel and contiguous areas improved,\ndesigned, or ordinarily used for pedestrian or bicycle traffic, drainage for\nthe roadway, and/or parking along the roadway. Areas primarily used for\nparking or access to parking are not roadways, and do not meet these\ncriteria;\n(ii) Roadway Redevelopment: The project is the redevelopment of existing\nroadway and the project (1) adds less than one acre of paved area per mile\nof roadway to an existing roadway or (2) does not add more than 8.25 feet\nof paved width at any location to the existing roadway;\n(iii) Existing Roadway Areas: The project is the redevelopment of existing\nroadway where the project does not increase the width of the original\nroadway to two times or more on average. Under this criterion, the\napplicable development site requirements may not be waived for the entire\nroadway project but only for the area of the existing roadway. The area of\nthe added new roadway shall be considered an applicable development\nsite;\n(iv) Aboveground and Underground Utilities: The project is the installation or\nmaintenance of underground utilities or infrastructure that does not\npermanently alter the terrain, ground cover, or drainage patterns from those\npresent prior to the construction activity. The types of projects that meet\nthese criteria include, but are not limited to, activities to install, replace, or\nmaintain utilities under roadways or other paved areas that return the\nsurface to the same condition;\n(v) Large Lot Single Family Residential Projects: The project involves single-\nfamily residential lots greater than or equal to 2.5 acres in size per\ndwelling, with a total lot impervious area of less than 10 percent, and that\nare not part of a common plan of development,\n(vi) Land Disturbance Only Projects: The project involves land disturbance to\nundeveloped land (land with no structures, such as buildings, and no\npavement), and the land will remain undeveloped during and after the\ndisturbance;\n(vii) Stream Stabilization Projects: The project is a stream stabilization project;\nor\n(viii) Sidewalk, Bicycle and Multi-Use Paths: The project adds, modifies, or\nmaintains public sidewalk, bicycle path or multi-use path. Bike lanes that\nare a part of a roadway do not meet this criterion.\n(b) The Director may not waive the requirements for applicable development sites of\nthis section if any of the following circumstances are present:\n(i) Brownfield: The proposed project is located on a site that is considered a\nbrownfield or is otherwise known or believed to have pollutants in the soil\nor on the ground that, if discharged from the property in stormwater or\ngroundwater, may cause harm to the general public or the environment;\n(ii) TMDL: The proposed site will, after development, discharge stormwater to\na waterbody that is included on the most recent State of Colorado\nDepartment of Public Health and Environment §303(d) List of Water-\nQuality-Limited Segments Requiring TMDLs or for which a Total\nMaximum Daily Load (TMDL) is in place;\n(iii) Wetlands: The proposed site will, after development, discharge stormwater\nto a delineated wetland or wetland buffer area as defined in Chapter 9-3,\n“Overlay Districts,” B.R.C. 1981;\n(iv) History: A history of flooding or drainage problems is known to exist in, or\ndownstream of, the drainage basin where the site is located, whether\ndocumented or undocumented;\n(v) Master Plan: A City-approved stormwater master plan indicates a need for\nmore stringent regulation of stormwater in the watershed where the\nproposed project is located in order to avoid, or alleviate, any flood,\ndrainage, or pollution problems; or\n(vi) Exacerbate Problems: There is reason to believe that construction of the\nproposed project may further exacerbate existing flood or drainage\nproblems.\n(c) Evidence supporting the waiver pursuant to the criteria of this section shall be\nprovided on forms provided by the Director. The Director may require additional\ndocumentation to support the waiver request.\n(d) In granting a waiver, the Director may impose specific conditions on the approval of\nthe waiver necessary to ensure that the criteria in this section are, and will remain,\nsatisfied."
  },
  {
    "corpus": "DCS",
    "chapter": 7,
    "anchor": "7.15(C)",
    "heading": "Requirements",
    "page_start": 190,
    "page_end": 191,
    "verbatim": "Applicable development sites are subject to the following requirements:\n(1) Stormwater Quality Design Standard Compliance: Each drainage basin or collection of\ndrainage basins (treatment area) associated with an applicable development site shall meet\none of the following Stormwater Quality Design Standards:\n(a) Runoff Reduction Standard: Control measures for post-construction stormwater\nquality (SCMs) are selected, designed, and constructed to infiltrate into the ground\nwhere site geology permits, evaporate, or evapotranspire a quantity of water equal\nto 60% of what the calculated Water Quality Capture Volume (WQCV) would be\nif all impervious area for the applicable development site discharged without\ninfiltration.\nNone of the treatment area may be excluded when using the Runoff Reduction\nStandard.\n(b) Water Quality Capture Volume Standard: SCMs are selected, designed, and\nconstructed to provide treatment and/or infiltration of the runoff from the entire\ntreatment area for the 80th percentile, 0.6-inch storm event. Evaluation of minimum\ndrain time shall be based on the pollutant removal mechanism and functionality of\nthe SCM(s) implemented. Consideration of drain time shall include maintaining\nvegetation necessary for operation of the SCM (e.g., wetland vegetation).\nUp to 20 percent, not to exceed one acre, of the treatment area may be excluded\nwhen using the WQCV Standard if the Engineer demonstrates that it is not\npracticable to capture runoff or implement a separate SCM before runoff drains to\nan offsite discharge point.\n(c) Pollutant Removal Standard: SCMs are selected, designed, and constructed to\nreduce the event mean concentration of total suspended solids (TSS) to a median\nvalue of 30 milligrams per liter (mg/L) or less from the entire treatment area for the\n80th percentile, 0.6-inch storm event.\nUp to 20 percent, not to exceed one acre, of the treatment area may be excluded\nwhen using the Pollutant Removal Standard if it is demonstrated that it is not\npracticable to capture runoff or implement a separate SCM before runoff drains to\nan offsite discharge point.\n(d) Constrained Redevelopment Site Standard: Applicable development sites having\nan existing impervious area greater than 35 percent and a proposed impervious area\ngreater than 75 percent that can demonstrate the above design standards cannot be\npracticably met shall meet one of the following standards:\n(i) Constrained Runoff Reduction Standard: SCMs are selected, designed, and\nconstructed to infiltrate into the ground where site geology permits,\nevaporate, or evapotranspire a quantity of water equal to 30 percent of\nwhat the calculated WQCV would be if all impervious area for the\napplicable development site discharged without infiltration.\n(ii) Constrained WQCV Standard: SCMs are selected, designed, and\nconstructed to provide treatment and/or infiltration of the runoff from at\nleast 50 percent of the treatment area, including at least 50 percent of the\nimpervious area, for the 80th percentile, 0.6-inch storm event. Evaluation of\nminimum drain time shall be based on the pollutant removal mechanism\nand functionality of the SCM(s) implemented. Consideration of drain time\nshall include maintaining vegetation necessary for operation of the SCM\n(e.g., wetland vegetation).\n(iii) Constrained Pollutant Removal Standard: SCMs are selected, designed,\nand constructed to reduce the event mean concentration of total suspended\nsolids (TSS) to a median value of 30 mg/L or less for at least 50 percent of\nthe treatment area, including at least 50 percent of the impervious area, for\nthe 80th percentile, 0.6-inch storm event.\n(2) Required Treatment Approach: The selection of a required treatment approach shall be\ndetermined considering site constraints and infiltration feasibility following the procedure\nestablished in Section 7.16 of these Standards.\n(3) Compliance Documentation Required: The selected treatment approach and the rationale\nfor such approach selection shall be documented on form(s) as provided by the Director.\nThe form(s) and any supporting data, maps, charts, or calculations shall be provided as part\nof the Preliminary and Final Drainage Reports.\n(4) Pretreatment Required: Pretreatment devices shall be provided for all SCMs to reduce\nthe inflow of trash, debris, and coarse sediment into the SCM. Allowed forms of\npretreatment are grass buffers, grass swales, forebays, and inlet sumps. The Director may\napprove other pretreatment controls if the Director finds the proposed design adequately\nreduces the inflow of trash, debris and coarse sediment into the SCM.\n(5) Irrigation Plan Required: Provisions shall be made to provide water to vegetated SCMs\nafter vegetation installation and in accordance with the Final Drainage Report and as\nneeded to maintain the health of the vegetation. The owner of the SCMs shall be\nresponsible to replace vegetation that is damaged, dead, or otherwise shows signs of poor\nhealth to ensure the proper operation of the control measure. The use of native plants in\nSCMs and other vegetated areas is strongly encouraged as such plants are best suited for\nlocal seasonal and climatic conditions.\n(6) Easement: All SCMs shall be located in a public easement. The easement shall grant to\nthe City at a no charge a permanent right to inspect, maintain, and reconstruct the SCMs.\nThe easement shall be granted on a form provided by the Director. No owner of land or\nother applicant shall obtain a Final Drainage Plan, unless the owner first grants to the City\nthe easement for all SCMs."
  },
  {
    "corpus": "DCS",
    "chapter": 7,
    "anchor": "7.16(A)",
    "heading": "Selection and Design of SCMs",
    "page_start": 191,
    "page_end": 192,
    "verbatim": "The Engineer for an applicable development site shall apply the SCMs that best address pollutants\nof concerns and can be implemented on the development site. Infiltration of rainfall and stormwater\nusing volume reduction/green infrastructure SCMs is the preferred treatment approach because it\nmost closely mimics the natural hydrology of undeveloped land and reduces the volume of\nstormwater that is discharged into the stormwater utility system and to local streams. Therefore,\nnon-structural LID techniques, Receiving Pervious Areas (RPAs), and infiltration-based SCMs\nshall be used to the degree practicable whenever it is determined that infiltration is feasible. In\ncontrast, the removal of pollutants using underground SCMs is the least desirable treatment\napproach due to concerns about the practicality and effectiveness of long-term SCM maintenance\nand the ability of these designs to address pollutants of concern. As a result, the pollutant removal\ndesign standard is only allowed when all other treatment approaches have been demonstrated to not\nbe feasible.\nThis subsection summarizes the required procedure and supporting criteria for the selection and\ndesign of SCMs on applicable development sites, which are established in the following subsections\nof this section:\n(1) Preliminary Infiltration Feasibility Screening: Site conditions shall be documented prior\nto SCM design to support selection of an appropriate water quality treatment approach.\n(2) Treatment Approach Selection: Selection of an appropriate SCM shall be based on the\nfeasibility of onsite infiltration. The required treatment approach is selected based on the\nhierarchy provided in Figure 7-1. The purpose of this hierarchy is to promote the use of\ninfiltration using green infrastructure as the preferred approach to permanent stormwater\nquality management.\n1. Full Infiltration – Volume Reduction Approach\nExample SCMs: Bioretention without underdrain, Grass buffer RPA\n2. Partial Infiltration – WQCV Approach\nExample SCM: Bioretention with underdrain\n3. No Infiltration – WQCV Approach\nExample SCM: Bioretention with underdrain and liner\n4. Alternative Design Approach\nExample SCM: Cartridge Filter System\nFigure 7-1: Water Quality Treatment Approach Hierarchy\n(3) Treatment Approach Design Criteria: Upon selection of a treatment approach, the\nrequired design standard and criteria described in Subsection 7.16(D) of these Standards\nshall be followed to design and document SCM performance.\n(4) Soil and Infiltration Test Requirements: The necessity of soil and infiltration testing is\ndependent on the treatment approach and SCM type. Subsection 7.16.(E) of these\nStandards explains soil and infiltration testing required to satisfy the Treatment Approach\nDesign Criteria."
  },
  {
    "corpus": "DCS",
    "chapter": 7,
    "anchor": "7.16(B)",
    "heading": "Preliminary Infiltration Feasibility Screening",
    "page_start": 192,
    "page_end": 193,
    "verbatim": "The Engineer shall investigate the site conditions to determine the treatment approach and the\nStormwater Quality Design Standards that will be applied to each treatment area. The preliminary\ninfiltration feasibility screening shall be conducted as soon as possible in the design process. The\npreliminary infiltration feasibility screening does not require field infiltration testing, soil borings,\nand other detailed tests; however, if the full infiltration treatment approach is indicated to be\nfeasible through this screening process, additional field testing may be required as described in\nSubsection 7.16(E) of these Standards. The preliminary infiltration feasibility screening shall meet\nthe following requirements:\n(1) Preliminary infiltration feasibility screening shall be conducted for each treatment area\nassociated with the applicable development site prior to development of the Preliminary\nDrainage Report.\n(2) The Engineer shall create hydrologic soil group (HSG) maps for each treatment area. Soil\ngradation assessments or field infiltration testing may be used to confirm HSG mapping or\ndetermine infiltration parameters for fill materials.\n(3) The Engineer shall assess the following limitations to infiltration for each treatment area. If\none of the following factors is determined to limit infiltration feasibility, documentation\nshall be provided with Preliminary and Final Drainage Reports:\n(a) Insufficient hydrologic storage capacity of the underlying soil attributable to\nshallow bedrock, hardpan layer, seasonal high-water table, or similar subsurface\nconditions. Underlying soil conditions are not a limitation for consideration of\nUnconnected Impervious Areas (UIA) to RPA.\n(b) The potential for groundwater contamination resulting from known or suspected\nsoil contamination or from a proposed land use that is incompatible with the use of\ninfiltration practices (e.g., a concrete batch plant or materials storage and loading\nsite) or similar conditions.\n(c) Close proximity of SCM locations to drinking water wells or groundwater\nprotection areas.\n(d) Limited or no suitable area for infiltration attributable to regulatory requirements\nfor the proposed applicable development site, including building set-back or build-\nto requirements; location or area requirements for rights-of-way, parking, and\ndriveways; floodplain regulations; or other state or local regulatory conditions.\n(e) Limited suitable area for infiltration attributable to the location of existing\nstructures, pavement, utilities, or similar features that will remain; contractive or\nexpansive soils in close proximity to buildings; or the location or extent of steep\nslopes, springs, seeps, wetlands, trees, or other natural features that will not or\ncannot be altered as a result of land development.\n(f) Close proximity to historical or archeological sites that could be damaged or\notherwise negatively impacted by infiltration.\n(g) Flooding conditions that can be exacerbated by, or limit the function of, an\ninfiltration-based SCM, including a history of frequent flooding at proposed SCM\nlocations or a history of wet or flooded foundations, crawl spaces, or basements on\nor in close proximity to the applicable development site or its proposed SCM\nlocations, and where these conditions will not be corrected by the proposed project.\n(4) Infiltration feasibility screening results shall be documented in the Preliminary and Final\nDrainage Reports."
  },
  {
    "corpus": "DCS",
    "chapter": 7,
    "anchor": "7.16(C)",
    "heading": "Treatment Approach Selection",
    "page_start": 194,
    "page_end": 195,
    "verbatim": "The treatment approach is the methodology that will be used to design a SCM, or collection of\nSCMs, to meet the required Stormwater Quality Design Standard. Four treatment approaches are\ndescribed in Table 7-7, “Treatment Approach Selection Criteria,” and correspond with criteria\nrequirements presented in Subsection 7.16(D) of these Standards. A single SCM design approach\nshall be initially selected for each treatment area of the applicable development site using the results\nof the preliminary infiltration feasibility screening and the guidelines presented in Table 7-7,\n“Treatment Approach Selection Criteria.” The selection of the treatment approach shall begin at the\ntop of the table (with full infiltration) and proceed to the next level down if either the infiltration\ncapacity or infiltration constraints criteria cannot be met. This process continues until both sets of\ncriteria are met for the treatment area. One treatment approach shall be selected for each applicable\ntreatment area.\nThe Full Infiltration – Volume Reduction approach has two categories depending on the type of\nSCM being evaluated in the drainage basin:\n(1) UIA to RPA: This category is grass swales and grass buffers designed to infiltrate\nstormwater runoff via disconnection of impervious areas. Infiltration capacity for this\ncategory is dependent on identifying UIA:RPA pairs and confirming topsoil suitability.\n(2) Infiltration SCM: This category is bioretention, sand filter, permeable pavement or other\nvolume-based SCMs designed to retain runoff from the treatment area. Infiltration capacity\nfor this category is dependent on confirming the infiltration rate of the underlying in-situ\nsoil.\nTable 7-7: Treatment Approach Selection Criteria\nDesign\nPreliminary Infiltration Feasibility Screening\nStandard\nTreatment Approach Subsection 7.16(B)\nSubsection\n7.15(E)(1) Infiltration Capacity Infiltration Constraints\nA. UIA to RPA\nUIA:RPA pairs have been identified and meet run- Underlying soil, groundwater, and geological\n1. Full Infiltration\non ratio guidelines of USDCM, Volume 3, T-0 conditions have sufficient hydrologic capacity to\n- Volume Reduction Runoff\nVolume Reduction. infiltrate 60% of the WQCV.\nA. UIA to RPA Reduction\nB. Infiltration SCM\nAND\nB. Infiltration SCM\nHSG A or B No other limitations to full infiltration are present\nSubsection 7.16(D)(1)\nin the treatment area.\nOR\nField tests indicates infiltration rate is greater than\none inch per hour.\nUnderlying soil, groundwater, and geological\nHSG C or D\nconditions have sufficient hydrologic capacity to\n2. Partial OR\nsupport infiltration of a portion of the WQCV.\nInfiltration - WQCV WQCV Field tests indicates infiltration rate is less than one\nAND\nSubsection 7.16(D)(2) inch per hour.\nNo other limitations to partial infiltration are\npresent in the treatment area.\n3. No Infiltration -\nUnderlying soil, groundwater, and geological\nWQCV\nWQCV N/A conditions prevent infiltration and require a lined\nSubsection 7.16(D)(3) system.\nPollutant\nPhysical site constraints or risk factors prevent the\nRemoval\n4. Alternative use of Treatment Approaches 1, 2, and 3\nOR\nDesign N/A AND\nConstrained\nSubsection 7.16(D)(4) Alternative approach must be approved by the\nRedevelopment\nDirector.\nSite"
  },
  {
    "corpus": "DCS",
    "chapter": 7,
    "anchor": "7.16(D)",
    "heading": "Treatment Approach Design Criteria",
    "page_start": 196,
    "page_end": 198,
    "verbatim": "The Engineer shall design the SCMs of the selected treatment approach consistent with the\nrequirements of this subsection. Specific types of SCMs are not prescribed for the individual\napproaches. Any applicable SCM may be used, provided it meets the treatment approach\nrequirements stated herein. In addition to these requirements, SCM designs shall follow the\nguidance provided in USDCM, Volume 3.\nFor any of the treatment approaches, a treatment train using a series of SCMs may be used to\nmeet the Stormwater Quality Design Standard for a given treatment area. The series of SCMs\nmust adhere to the requirements of the treatment approach selected for the treatment area and\nmust ultimately, as a group of SCMs, meet the Stormwater Quality Design Standard associated\nwith the treatment approach.\n(1) Full Infiltration – Volume Reduction Approach: Full Infiltration is the preferred\ntreatment approach and is required where feasible. Full infiltration designs retain\nstormwater onsite through the use of RPAs or infiltration SCMs that do not have\nunderdrains. Plugged or capped underdrains may be specified. The following criteria are\napplicable to full infiltration SCM designs:\n(a) Runoff Reduction Design Standard: Treatment areas using the Full Infiltration –\nVolume Reduction Approach shall meet, at a minimum, the requirements of the\nRunoff Reduction Design Standard of Subsection 7.15(C)(1)(a) of these\nStandards.\n(b) Required Sizing Criteria: Preliminary and Final Drainage Reports must\ndocument sizing criteria and achieved volume reduction for each SCM\nfollowing methods specified in USDCM, Volume 3. SCMs must be sized for\nthe full tributary area.\n(i) UIA to RPAs must comply with run-on ratio, topsoil suitability, and other\nrelated criteria as specified in USDCM, Volume 3, T-0 Volume\nReduction.\n(ii) Full infiltration SCMs with a storage component must comply with surface\n(filter) area, geometry, and drain time requirements as specified in the\nUSDCM, Volume 3 for the appropriate SCM type.\n(c) Field Infiltration Tests: Field infiltration tests are mandatory for full infiltration\nSCM designs following the standards in Subsection 7.16(E) of these Standards.\nField infiltration test results must be documented in the Preliminary and Final\nDrainage Reports.\n(d) Minimum Field Infiltration Rate: Full infiltration SCMs require a field\ninfiltration rate measurement equal to one inch per hour or greater. If field\ninfiltration rates are measured to be less than one inch per hour, a partial\ninfiltration/WQCV approach shall be used consistent with the standards in\nSubsection 7.16(D)(2) of these Standards.\n(e) Required Design Factor of Safety: Full infiltration SCMs shall utilize a\nminimum factor of safety of 2 when using the field-measured infiltration rate in\ndrawdown time calculations.\n(2) Partial Infiltration – WQCV Approach: This category of SCMs retains stormwater\non site to the extent practical by using underdrains or rate-controlled outlet structures.\nRPAs may be used as part of a treatment train to partial infiltration SCMs. The\nfollowing criteria are applicable to partial infiltration designs:\n(a) WQCV Design Standard: Treatment areas using the Partial Infiltration –\nWQCV Approach shall meet, at a minimum, the requirements of the WQCV\nDesign Standard in Subsection 7.15(C)(1)(b) of these Standards.\n(b) Required Sizing Criteria; Preliminary and Final Drainage Reports must\ndocument sizing criteria and achieved runoff volume capture for each SCM\nfollowing the methods specified in the USDCM, Volume 3. SCMs must be\nsized for the full tributary area.\n(i) UIA to RPAs must comply with run-on ratio, topsoil suitability, and other\nrelated criteria as specified in USDCM, Volume 3, T-0 Volume\nReduction.\n(ii) Partial infiltration SCMs must comply with surface (filter) area, geometry,\nand drain time requirements as specified in USDCM, Volume 3 for the\nappropriate SCM type. The use of underdrains or rate-controlled outlet\nstructures are required components of partial infiltration designs.\n(c) Field Infiltration Tests: The following field infiltration test requirements are\napplicable to Partial Infiltration – WQCV designs:\n(i) For UIA-to-RPAs, topsoil suitability must be shown with a soil\ngraduation test as specified in Subsection 7.16(E) of these Standards.\n(ii) For partial infiltration SCMs with underdrain or rate-controlled outlet, a\nfield infiltration test is not required except when expressly requested by\nthe Director due to a unique design configuration.\n(3) No Infiltration – WQCV Approach: No infiltration SCMs are lined systems required by\nthe necessity to prevent infiltration due to underlying soil conditions, high groundwater\ntable, or an otherwise immitigable risk as identified during the preliminary Infiltration\nfeasibility screening. The following criteria apply to no infiltration designs:\n(a) WQCV Design Standard: Treatment areas using the No Infiltration – WQCV\nApproach shall meet, at a minimum, the requirements of the WQCV Design\nStandard in Subsection 7.15(C)(1)(b) of these Standards.\n(b) Required Sizing Criteria: Preliminary and Final Drainage Reports must\ndocument sizing criteria and achieved runoff volume capture for each SCM\nfollowing methods specified in USDCM, Volume 3. SCMs must be sized for\nthe full tributary area. No infiltration SCMs must adhere to and document\ncompliance with surface (filter) area, geometry, and drain time requirements as\nspecified in USDCM, Volume 3 for the appropriate SCM type.\n(c) Field Infiltration Tests: Field infiltration tests are not required for no infiltration\nSCMs. Proof of a watertight liner may be requested at the time of installation by\nthe Director based on necessity for risk mitigation.\n(4) Alternative Design Approach: The Director may approve an alternative design\napproach only if the Engineer demonstrates in the Preliminary Drainage Report or a\nletter to the Director that none of the above three treatment approaches are feasible. The\nPreliminary Drainage Report or letter shall explain the alternative design approach. The\nfollowing criteria are applicable to alternative designs:\n(a) Pollutant Removal or Constrained Redevelopment Site Standard. Alternative\ndesigns shall meet one of the following:\n(i) Pollutant Removal Standard in Subsection 7.15(C)(1)(c) of these\nStandards,\n(ii) Constrained Runoff Reduction Standard in Subsection 7.15(C)(1)(d)(i) of\nthese Standards,\n(iii) Constrained WQCV Standard in Subsection 7.15(C)(1)(d)(ii) of these\nStandards, or\n(iv) Constrained Pollutant Removal Standard in Subsection 7.15(C)(1)(d)(iii)\nof these Standards.\n(b) Required Sizing Criteria: Preliminary and Final Drainage Reports must\ndocument sizing criteria and applicable performance metrics for each SCM\nfollowing methods specified in USDCM, Volume 3.\n(i) For pollutant Removal or Constrained Pollutant Removal Standard\ndesigns, the Engineer shall submit TSS reduction metrics applicable to the\nproposed design. The use and reference of third-party testing data is\nrequired when proposing the use of a proprietary device.\n(ii) Constrained Runoff Reduction Standard designs shall adhere to sizing\ncriteria specified in Subsection 7.16(D)(1) of these Standards.\n(iii) Constrained WQCV Standard designs shall adhere to sizing criteria\nspecified in Subsection 7.16(D)(2) of these Standards.\n(c) Field Infiltration Tests: The following field infiltration test requirements apply\nto alternative design approaches:\n(i) Field infiltration tests are not required when using the pollutant removal or\nconstrained site pollutant removal standard.\n(ii) Constrained Runoff Reduction Standard designs shall adhere to field\ninfiltration requirements specified in Subsection 7.16(D)(1) of these\nStandards.\n(iii) Constrained WQCV Standard designs shall adhere to field infiltration\nrequirements specified in Subsection 7.16(D)(2) of these Standards."
  },
  {
    "corpus": "DCS",
    "chapter": 7,
    "anchor": "7.16(E)",
    "heading": "Soil and Infiltration Test Requirements",
    "page_start": 198,
    "page_end": 200,
    "verbatim": "Requirements for field infiltration testing depend on treatment approach and SCM type as\ndetailed in Subsection 7.16(D) of these Standards. Field infiltration tests are required for all full\ninfiltration SCMs with a storage component. For all UIA to RPA areas, the Engineer must show\ntopsoil suitability with a soil gradation test. When preliminary infiltration feasibility screenings\nindicate C or D soils, field infiltration testing is optional to explore feasibility of a full\ninfiltration design. Documentation of field infiltration test results must be submitted in\nPreliminary and Final Drainage Reports.\n(1) UIA to RPA Soil Test Requirement: For all UIA to RPA areas, regardless of HSG,\nonsite topsoil sampling and testing must be conducted to confirm infiltration capacity.\nDetermination of HSG classification based on soil texture analysis shall follow\nspecifications provided in USDCM, Volume 3, T-0 Volume Reduction. At least one soil\ngradation test shall be conducted for each proposed RPA. Proposed topsoil and soil\namendment additions shall follow criteria specified in Chapter 10 of these Standards.\n(a) Post-Construction Soil Tests: Depending on site conditions, the Director may\nrequire soil tests to confirm infiltration capacity and adequacy of soil chemistry\nto support vegetation growth for RPAs after construction is complete. When\nrequired, soil test results shall be provided with the submission of as-built\ndrawings.\n(2) Full Infiltration SCM Field Test Requirements: The following criteria apply to all\nfull infiltration SCMs with a storage component using the Full Infiltration – Volume\nReduction Approach of Subsection 7.16(D)(1) of these Standards:\n(a) Soil Borings: Soil borings aid in interpretation of infiltration test results by\nproviding information on groundwater conditions and soil stratification.\nTherefore, each infiltration test shall be accompanied by a soil boring test to a\ndepth of 10 feet below the lowest planned infiltration elevation (the bottom of\nthe infiltrating SCM). Soil borings performed for a civil site geotechnical\nanalysis that are located within close proximity (less than 50 feet) to the\nfootprint of the SCM may be used. An interpretation of soil boring test results\nwith respect to infiltration shall be provided for each test. This description shall\ninclude an assessment of the anticipated seasonal high-water table based on date\nof soil boring with respect to rainfall patterns, and the presence of hydric soils,\nredoximorphic features, or other indicator of water table variation.\n(b) Allowed Test Methods: Field infiltration tests shall utilize a double-ring\ninfiltrometer or modified Philip Dunne infiltrometer following the specifications\nof ASTM D3385 or ASTM 8152, respectively. Alternative infiltration test\nmethods may only be used with approval by the Director. The use of correlation\nmethods based on soil texture applies only to RPA designs using the T-0\nfactsheet of USDCM, Volume 3. The use of regional soil maps is prohibited for\ninfiltration design or verification purposes.\n(c) Number of Tests Required: At least three infiltration tests shall be conducted for\nevery SCM using the test spacing criteria established below. The Director may\nrequire additional tests for large SCMs, greater than 10,000 square feet, or when\nunique soil or geological conditions are known or suspected at the site.\n(i) Generally, one infiltration test shall be conducted for every 3,000 to\n10,000 square feet of area, depending upon the size of the SCM. Tests\nshall be spaced appropriately to provide sufficient infiltration rate\ninformation across the length and width of the SCM.\n(ii) For small SCMs, at least one test shall be located within the SCM’s\nfootprint. The additional tests can be performed outside the footprint but\nmust be located within 20 feet of the perimeter of the SCM and in soil\nformations that are representative of the conditions within the footprint of\nthe SCM.\n(iii) For SCMs that have an area greater than 10,000 square feet, one\ninfiltration test shall be conducted for every additional 10,000 square feet\nof surface area up to a maximum of five infiltration tests.\n(d) Test Elevation: The elevation of infiltration tests shall be at or below the bottom\n(lowest planned infiltration elevation) of the SCM. SCMs that are designed for\nfull infiltration shall not be placed on fill material without prior infiltration tests\nto confirm full infiltration design feasibility.\n(e) Post-Construction Field Infiltration Tests: The Director may require field\ninfiltration tests to confirm infiltration rates after construction is complete if soil\ncompaction or clogging is known or suspected during construction. When\nrequired field infiltration test information shall be provided with the submission\nof as-built drawings.\n(f) Drainage Report Requirements: The Preliminary and Final Drainage Report\nshall include the following information for each infiltration test performed.\n(i) Test location and elevation;\n(ii) Test method used;\n(iii) Location of soil boring(s) used to aid test interpretation; and\n(iv) Soil boring results and how they were used."
  },
  {
    "corpus": "DCS",
    "chapter": 7,
    "anchor": "7.17(A)",
    "heading": "General",
    "page_start": 200,
    "page_end": 201,
    "verbatim": "(1) Applicable development sites shall receive post-construction approval of the stormwater\nutility system by the Director prior to the issuance of a Certificate of Occupancy\npursuant to a building permit or a Certificate of Completion for a use established\npursuant to a development agreement under Chapter 9-2, “Review Processes,” B.R.C.\n1981. The Director will base approval on the system’s conformance with the approved\nFinal Drainage Report, the requirements of this section, and its readiness for post-\nconstruction operation.\n(2) Post-construction approval of the stormwater utility system shall be granted if the\nfollowing criteria are met:\n(a) The stormwater as-built drawing provided for the applicable development site\ndemonstrates conformance of the constructed stormwater utility system with the\napproved Final Drainage Report and readiness for full post-construction\noperation, and\n(b) The site’s stormwater utility system and all associated SCMs are determined,\nbased on visual inspection by the Director, to be clean; free of sediment, debris,\nand other obstructions; undamaged; and ready for full post-construction\noperation.\nIf these criteria are not met, the Director may require the preparation, submittal,\nand approval of a revised Final Drainage Report and/or corrective actions at the\napplicable development site before granting post-construction approval.\nCorrective actions may include cleaning or repair of the stormwater utility\nsystem, SCMs, or detention ponds, including, but not limited to, the removal of\nsediment, debris, or other obstructions; the removal of construction-related\nwastes or stockpiles; the installation of permanent slope stabilization or energy\ndissipation measures; the removal, replacement, or installation of vegetation;\nand soil amendment or soil media replacement in infiltration-based SCMs.\n(3) Post-construction approval of the stormwater utility system by the Director indicates that\nthe system was constructed in conformance with City requirements, is currently\noperating as expected, and stormwater as-built drawings have been approved. Approval\nalso means that the system must comply with the requirements for post-construction\ninspection and maintenance established in Section 7.18 of these Standards and Chapter\n11-5, “Stormwater and Flood Management Utility,” B.R.C. 1981.\n(4) In no way does post-construction approval imply City ownership, maintenance,\noperation, or any other liability for any accepted, privately-owned, stormwater utility\nsystem, SCM, or detention pond."
  },
  {
    "corpus": "DCS",
    "chapter": 7,
    "anchor": "7.17(B)",
    "heading": "Stormwater As-Built Drawings",
    "page_start": 201,
    "page_end": 201,
    "verbatim": "The preparation of stormwater as-built drawings is required for all applicable development sites\nto document the as-constructed condition of SCMs. The as-built drawings shall indicate where\nthe as-constructed condition differs from the final approved technical drawings following the\nprovisions of Subsection 1.3(G) of these Standards. An engineering certification of elevations\nshall be included as an attachment to the stormwater as-built drawings.\nThe figures and drawings depicting the items listed below shall be included with the as-built\nrequirements in Chapter 1 of these Standards to provide a reference for the information provided\nin the Final Drainage Report. Specific as-built drawings pertaining exclusively to the conditions\nof the SCM are required and shall depict both plan and profile views as described below:\n(1) Plan Drawing/s: Illustrate and label in plan view the components of the SCM,\nincluding inlet and outlet locations, embankments, treatment surface area, utility\neasements, vegetated cover, and other critical drainage elements. Indicate where the as-\nconstructed conditions differ from the final approved technical drawings.\n(2) Profile Drawing/s: Illustrate and label in profile view the elevations of SCM\ncomponents, including filter media depth, bottom elevation, embankment slopes,\ninlet/outlet inverts, and other critical drainage components. Indicate where the\nas-constructed conditions differ from the final approved technical drawings."
  },
  {
    "corpus": "DCS",
    "chapter": 7,
    "anchor": "7.17(C)",
    "heading": "Post-Construction Acceptance Inspection Required",
    "page_start": 201,
    "page_end": 201,
    "verbatim": "(1) Each SCM must pass a post-construction inspection by the Director to confirm SCMs,\nincluding RPAs, are clean, have established vegetation, and are fully operational in\nkeeping with their approved design. After these conditions are met, the SCM is\nconsidered fully functional and subject to Section 7.18 of these Standards.\n(2) The post-construction acceptance inspection shall occur after submittal of the complete\nas-built drawings to the Director. No application for inspection is required, as submittal\nof the stormwater as-built drawings will signify the project’s readiness for inspection.\nAn inspection will not be performed in the event of submittal of incomplete drawings.\nConfirmation of information on the stormwater as-built drawings will also be included\nin the inspection."
  },
  {
    "corpus": "DCS",
    "chapter": 7,
    "anchor": "7.17(D)",
    "heading": "Vegetation Warranty Required",
    "page_start": 202,
    "page_end": 202,
    "verbatim": "The Director may require a financial guarantee for vegetation installed within SCMs consistent\nwith the requirements of Subsection 11-5-6, “Stormwater Quality Management for Land\nDevelopment,” B.R.C. 1981. The financial guarantee may be held for up to three years and will\nbe released after an inspection confirms the vegetation within each SCM is in good health."
  },
  {
    "corpus": "DCS",
    "chapter": 7,
    "anchor": "7.18",
    "heading": "Post-Construction Stormwater Quality Inspection and",
    "page_start": 202,
    "page_end": 202,
    "verbatim": "Maintenance Requirements"
  },
  {
    "corpus": "DCS",
    "chapter": 7,
    "anchor": "7.18(A)",
    "heading": "Applicability",
    "page_start": 202,
    "page_end": 202,
    "verbatim": "The owner of SCMs of an applicable development site shall protect, inspect, maintain, repair,\nand reconstruct SCMs and associated drainage infrastructure on the property to ensure full,\nfunctional operation in accordance with the requirements in this section and pursuant to Chapter\n11-5, “Stormwater and Flood Management Utility,” B.R.C. 1981."
  },
  {
    "corpus": "DCS",
    "chapter": 7,
    "anchor": "7.18(B)",
    "heading": "Inspection and Maintenance Requirements for SCMs",
    "page_start": 202,
    "page_end": 203,
    "verbatim": "(1) Inspection and Maintenance Required: The owner of SCMs shall inspect and\nmaintain the SCMs as is necessary to ensure their full, functional operation at all times.\n(2) Inspection Frequency: The owner of SCMs shall be responsible to inspect the SCMs\nas often as necessary to assess the need for maintenance. The optimum inspection\nfrequency for SCMs varies depending on a number of factors including, but not limited\nto, the type of SCM, whether the SCM is vegetated, and activities that have occurred in\nthe area draining to the SCM. SCMs shall be visually inspected:\n(a) After storms and snow melt to assess whether stormwater in the SCM is\ndraining as expected, and\n(b) During property landscape maintenance activities to look for build-up or\nblockages of trash, debris, or sediment; check for damage; and determine\ncurrent maintenance needs.\nDocumentation of these inspections is not required. However, the owner of\nSCMs shall document a detailed visual inspection of their SCM(s) in\naccordance with the frequencies defined in Table 7-8, “Required Inspection\nFrequency by SCM Type.” The documented inspection shall be performed\nbetween May and August, when vegetation is not dormant and snow does not\ncover the SCM.\nTable 7-8: Required Inspection Frequency by SCM Type\nDocumented Inspection\nSCM Type\nFrequency\nBioretention (Rain Garden)\nConstructed Wetland Channel\nConstructed Wetland Pond\nExtended Detention Pond\nGrass Buffer\nGrass Swale Annually\nPermeable Pavement\nReceiving Pervious Area (RPA)\nRetention Pond\nSand Filter\nOther SCM Designs\nUnderground SCMs Every 3 months\n(3) Inspection Documentation: Inspections shall be documented using form(s) provided\nby the Director and located in the Inspection and Maintenance Guide for the SCMs in\nan appendix to the Final Drainage Report. Inspection documentation shall be kept by the\nowner of SCMs or their delegated representative for five years and shall be made\navailable by the owner of SCMs or their delegated representative to the Director\nimmediately upon request.\n(4) Performed Maintenance: Routine maintenance shall be performed to ensure that\nSCMs are functioning as designed. Corrective action shall be performed immediately\nwhen an inspection indicates the need for maintenance. Routine maintenance varies by\nSCM type but generally requires the regular removal of trash and debris (e.g., dead\nleaves, sticks, tree limbs) from inflow, outflow, and water storage areas; removal of\nsediment at inflows; repair of eroded areas; and general vegetation maintenance (if\nvegetation is part of the SCM).\n(5) Transitional Regulations: For any permanent stormwater quality facilities approved\nunder the City of Boulder Design and Construction Standards in effect prior to the\neffective date of Ordinance 8324, the property owner shall be responsible for\nmaintaining the stormwater quality facilities. The stormwater quality facilities shall be\nmaintained as recommended in the USDCM and such that the design of the properties\nof the facility are preserved."
  },
  {
    "corpus": "DCS",
    "chapter": 7,
    "anchor": "7.18(C)",
    "heading": "Inspection and Maintenance Guide",
    "page_start": 203,
    "page_end": 205,
    "verbatim": "An Inspection and Maintenance Guide shall be submitted as an appendix to the Preliminary and\nFinal Drainage Report. This guide shall be provided by the Engineer to the owner of SCMs upon\ncompletion of construction and signifies transfer of maintenance responsibilities from the\nerosion control permittee to the owner of the SCMs. The Inspection and Maintenance Guide\nshall provide inspection and maintenance guidelines specific to the SCM type and shall follow\nthe format provided by the Director.\nCITY OF BOULDER\nDESIGN AND CONSTRUCTION STANDARDS"
  }
]