[
  {
    "corpus": "BRC",
    "title": "3",
    "title_name": "Revenue and Taxation",
    "chapter": "1",
    "chapter_name": "Definitions",
    "anchor": "3-1-1",
    "heading": "Definitions.",
    "verbatim": "3-1-1. Definitions.\nThe definitions set forth in Chapter 1-2, \"Definitions,\" B.R.C. 1981, apply to Title 3 \"Revenue and Taxation,\" including, without limitation, the definitions of Compostables, Hauler, Recyclables, Trash, and Trash collection. In addition, the following terms used in this title have the following meanings unless the context clearly indicates otherwise:\nAgricultural producer means a person regularly engaged in the business of using land for the production of commercial crops or commercial livestock. The term includes farmers, market gardeners, commercial fruit growers, livestock breeders, dairymen, poultrymen, and other persons similarly engaged, but does not include a person who breeds or markets animals, birds, or fish for domestic pets nor a person who cultivates, grows, or harvests plants or plant products exclusively for that person's own consumption or casual sale.\nAircraft means a device that is used or intended to be used for flight in the air.\nAircraft part means any tangible personal property that is intended to be permanently affixed or attached as a component part of an Aircraft.\nAircraft simulator means a Flight Simulator Training Device (FSTD) as defined in Part I of Title 14 of the Code of Federal Regulations that is qualified in accordance with Part 60 of Title 14 of the Code of Federal Regulations for use in a Federal Aviation Administration Approved Flight Training Program.\nAircraft simulator part means any tangible personal property that is originally designed and intended to be permanently affixed or attached as a component part of an Aircraft, and which will also function when it is permanently affixed or attached as a component part of an Aircraft simulator.\nAirline company means any operator who engages in the carriage by aircraft of persons or property as a common carrier for compensation or hire, or the carriage of mail, or any aircraft operator who operates regularly between two (2) or more points and publishes a flight schedule. Airline company shall not include operators whose aircraft are all certified for a gross takeoff weight of twelve thousand five hundred (12,500) pounds or less and who do not engage in scheduled service or mail carriage service.\nAuction means any sale at which tangible personal property is sold by an auctioneer who is either the agent for the owner of such property or is in fact the owner thereof.\nAutomotive vehicle means any vehicle or device in, upon, or by which any person or property is or may be transported or drawn upon a public highway, or Aircraft.\nAutomotive vehicle includes, but is not limited to aircraft, motor vehicles, trailers, semi-trailers, or mobile homes.\nAutomotive vehicle shall not include devices moved by human power or used exclusively upon stationary rails or tracks.\nBusiness means all activities engaged in or caused to be engaged in with the object of gain, benefit, or advantage, direct or indirect.\nCapital lease means a lease with characteristics of a purchase, including, without limitation, a lease term corresponding to the useful life of property, the lessee's payment of costs of property incidental to ownership, or the lessee's option to purchase for less than fair value.\nCarrier access services means the services furnished by a local exchange company to its customers who provide telecommunications services which allow them to provide such Telecommunication services.\nCharitable Organization means any entity which: (1) has been certified as a nonprofit organization under Section 501(c) (3) of the Internal Revenue Code, and (2) is an organization which exclusively, and in a manner consistent with existing laws and for the benefit of an indefinite number of persons or animals, freely and voluntarily ministers to the physical, mental, or spiritual needs of persons or animals, and thereby lessens the burden of government.\nCollection costs shall include, but are not limited to, all costs of audit, assessment, bank fees, hearings, execution, lien filing, distraint, litigation, locksmith fees, auction fees and costs, prosecution and attorney fees.\nCommercial packaging materials means containers, labels, and/or cases, that become part of the finished product to the purchaser, used by or sold to a person engaged in manufacturing, compounding, wholesaling, jobbing, retailing, packaging, distributing or bottling for sale, profit or use, and is not returnable to said person for reuse. Commercial packaging materials does not include Commercial shipping materials.\nCommercial shipping materials means materials that do not become part of the finished product to the purchaser which are used exclusively in the shipping process. Commercial shipping materials include but are not limited to containers, labels, pallets, banding material and fasteners, shipping cases, shrink wrap, bubble wrap or other forms of binding, padding or protection.\nComputer software means digital products, software programs, software as a service, internet subscription service, software license fees, software maintenance agreements, and software contained on cards, tapes, discs, coding sheets or other machine-readable or human-readable form, including software that has been modified so long as the price of the modifications does not exceed twenty-five percent of the price of the unmodified software and excluding software created specifically for the user.\nConstruction equipment means equipment used in the erection, installation, demolition, alteration, repair, remodeling, or landscaping of a building or structure upon real estate, or otherwise make improvements to any real property, building, structure or infrastructure.\nConstruction materials means tangible personal property which, when combined with other tangible personal property, loses its identity to become an integral and inseparable part of a completed structure or project including public and private improvements. Construction materials include, without limitation, such things as: asphalt, bricks, builders' hardware, caulking material, cement, concrete, conduit, electric wiring and connections, fireplace inserts, electrical heating and cooling equipment, flooring, glass, gravel, insulation, lath, lead, lime, lumber, macadam, millwork, mortar, oil, paint, piping, pipe valves and pipe fittings, plaster, plumbing fixtures, putty reinforcing mesh, road base, roofing, sand, sanitary sewer pipe, sheet metal, site lighting, steel, stone, stucco, tile, trees, shrubs and other landscaping materials, wall board, wall coping, wallpaper, weather stripping, wire netting and screen, water mains and meters, and wood preserver. The above materials, when used for forms, or other items which do not remain as an integral or devoted part of a completed structure or project, are not Construction materials.\nConstruction project means the erection, installation, alteration, repair, or remodeling of a building or structure upon real estate and any other activity for which a building permit is required under this code or any other ordinance of the city.\nConsumer or purchaser means any person in the City who purchases, uses, stores, distributes or otherwise consumes tangible personal property or taxable services, purchased from sources inside or outside the City.\nContract auditor means a duly authorized agent designated by the City and qualified to conduct tax audits on behalf of and pursuant to an agreement with the City.\nContractor means any person who shall build, construct, reconstruct, demolish, alter, expand, modify, or improve any building, dwelling, structure, infrastructure, or other improvement to real property for another party pursuant to an agreement. For purposes of this definition, Contractor also includes subcontractor.\nDeductions means those items that may be deducted from gross taxable sales as provided in Section 3-2-10, \"Deductions,\" B.R.C. 1981.\nDepartment means the city department of finance, of which the sales and use tax division is a part.\nDigital product means an electronic product including, but not limited to: (1) \"digital images\" which means works that include, but are not limited to, the following that are generally recognized in the ordinary and usual sense as \"photographs,\" \"logos,\" \"cartoons,\" or \"drawing.\" (2) \"digital audio-visual works\" which means a series of related images which, when shown in succession, impart an impression of motion, together with accompanying sounds, if any, (3) \"digital audio works\" which means works that result from the fixation of a series of musical, spoken, or other sounds, including ringtones (for purposes of the definition of \"digital audio works,\" \"ringtones\" means digitized sounds files that are downloaded onto a device and that may be used to alert the customer with respect to a communication), and (4) \"digital books\" which means works that are generally recognized in the ordinary and usual sense as \"books.\"\nEconomic nexus means the connection between the city and a person not having a physical nexus in the State of Colorado, which connection is established when the person or marketplace facilitator makes retail sales into the city, and:\n(a)\tIn the previous calendar year, the person, which includes a marketplace facilitator, has made retail sales into the state exceeding the amount specified in C.R.S. § 39-26-102(3)(c), as amended; or\n(b)\tIn the current calendar year, 90 days has passed following the month in which the person, which includes a marketplace facilitator, has made retail sales into the state exceeding the amount specified in C.R.S. § 39-26-102(3)(c), as amended.\nThis definition does not apply to any person who is doing business in this state but otherwise applies to any other person.\nEngaged in business in the city means performing or providing services or selling, leasing, renting, delivering or installing tangible personal property or products for storage, use or consumption, within the City. Engaged in business in the city includes, without limitation, any one of the following activities by a person:\n(a)\tDirectly, indirectly, or by a subsidiary maintains a building, store, office, salesroom, warehouse, or other place of business within the city;\n(b)\tSending one or more employees, agents or commissioned sales persons into the city to solicit business or to install, assemble, repair, service, or assist in the use of its products, or for demonstration or other reason;\n(c)\tMaintaining one or more employees, agents or commissioned sales persons on duty at a location within the city;\n(d)\tOwning, leasing, renting or otherwise exercising control over real or personal property within the city;\n(e)\tMaking more than one delivery into the city within a twelve-month period by any means other thana common carrier;\n(f)\tWho is a retailer or vendor in the state of Colorado making more than one delivery into the city within a twelve month period; or\n(g)\tMaking retail sales sufficient to meet the definitional requirements of economic nexus.\nEstimated percentage basis means the permission by the city manager to a taxpayer to pay or satisfy in full a sales and use tax liability based on a percentage of gross sales or gross purchases.\nExcess tax means that amount of tax collected by a taxpayer during a reporting period that exceeds the tax rate set forth in Section 3-2-5, \"Rate of Tax,\" B.R.C. 1981, and that the taxpayer shall remit to the City as prescribed by Section 3-2-4, \"Retailer Liable for Tax,\" B.R.C. 1981.\nFamily means the heads of household plus the following persons who are related to the heads of the household: parents and children, grandparents and grandchildren, brothers and sisters, aunts and uncles, nephews and nieces, first cousins, the children of first cousins, great grandchildren, great grandparents, great great grandchildren, great great grandparents, grandnieces, grandnephews, great aunts and great uncles. These relationships may be of the whole or half blood, by adoption, guardianship, including foster children, or through a marriage or a domestic partnership meeting the requirements of Chapter 12-4, \"Domestic Partners,\" B.R.C. 1981, to a person with such a relationship with the heads of household.\nFood means any raw, cooked or processed edible substance, beverage or ingredient used or intended for use or for sale in whole or in part for human consumption.\nFood service establishment means any place that is kept or maintained for the purpose of preparing or serving food, but does not include:\n(a)\tHomes containing a family, and its nonpaying guests;\n(b)\tOutdoor recreation locations where food is prepared in the field rather than at a fixed base of operations;\n(c)\tHospital and health care facility feeding operations licensed by the Colorado Department of Health or its authorized agents or employees;\n(d)\tChild care centers licensed by the State of Colorado or Boulder County;\n(e)\tVending machines;\n(f)\tGrocery stores and similar establishments, if such grocery store or similar establishment meets the qualifications for participation in the federal food stamp program, pursuant to 7 CFR subparagraph 278.1(l)(i) and (ii), excluding sub-subparagraphs (A) through (C) of subparagraph (ii), as such subparagraphs exist on November 1, 1987, or are thereafter amended, whether or not such grocery store or similar establishment is actually authorized to so participate;\n(g)\tFood or beverage manufacturing, processing or packaging plants that are not categorized as food service establishments by the Colorado Department of Health;\n(h)\tFood caterers that use the customer's kitchen to prepare food.\nGarage sales means sales of tangible personal property, except automotive vehicles, occurring at the residence of the seller, where the property to be sold was originally purchased for use by members of the household where such sale is being conducted. The term includes, but is not limited to, yard sales, estate sales, and block sales.\nGross sales means the total amount received in money, credit, property or other consideration valued in money for all sales, leases or rentals of tangible personal property or taxable services.\nIncome means the gross amount of money received during the year by an individual or a family.\nIncontinence products and diapers means absorbent cloth or disposable products worn by humans who are incapable of, or have difficulty, controlling their bladder or bowel movements.\nIndividual means each person who is not a member of a family as defined in this title.\nInternet access services means services that provide or enable computer access by multiple users to the Internet, but shall not include that portion of packaged or bundled services providing phone or television cable services when the package or bundle includes the sale of Internet access services.\nInternet subscription service means software programs, systems, data and applications available online through rental, lease or subscription, that provide information and services including, but not limited to, data linking, data research, data analysis, data filtering or record compiling.\nLease or rent means an agreement to provide or facilitate the provision of, directly or indirectly, real or personal property or services to another for a specified time for consideration.\nLicense means a city sales and use tax license.\nLinen services means services involving provision and cleaning of linens, including, without limitation, rags, uniforms, coveralls and diapers.\nLodging services or public accommodation means the sale, facilitating, or furnishing of rooms or accommodations by any person or retailer to any person, who for consideration, uses, possesses, or has the right to use or possess any room in a hotel, inn, bed and breakfast residence, apartment hotel, lodging house, motor hotel, guesthouse, guest ranch, trailer coach, mobile home, auto camp or trailer court and park or similar establishment, for a continuous period of less than thirty days under any concession, permit, right of access, license to use or other agreement, or otherwise.\nMachinery means any apparatus consisting of interrelated parts used to produce an article of tangible personal property. The term includes both the basic unit and any adjunct or attachment necessary for the basic unit to accomplish its intended function.\nManufactured home means any preconstructed building unit or combination of preconstructed building units, without motive power, where such unit or units are manufactured in a factory or a location other than the residential site of the completed home, which is designed and commonly used for occupancy by persons for residential purposes, in either temporary or permanent locations, and which unit or units are not licensed as a vehicle.\nManufacturing means the operation or performance of an integrated series of operations which places a product, article, substance, commodity, or other tangible personal property in a form, composition of character different from that in which it was acquired whether for sale or for use by a manufacturer.\nMarketplace means a physical or electronic forum, including, but not limited to, a store, a booth, an internet website, a catalog, or a dedicated sales software application, where tangible personal property, taxable products, or taxable services are offered for sale.\nMarketplace facilitator means a person who:\n(a)\tContracts with a marketplace seller or multichannel seller to facilitate for consideration, regardless of whether or not the consideration is deducted as fees from the transaction, the sale of the marketplace seller's tangible personal property, products, or services through the person's marketplace;\n(b)\tEngages directly or indirectly, through one or more affiliated persons, in transmitting or otherwise communicating the offer or acceptance between a purchaser and the marketplace seller or multichannel seller; or\n(c)\tEither directly or indirectly, through agreements or arrangements with third parties, collects payment from the purchaser on behalf of the seller.\nMarketplace facilitator does not include a person that exclusively provides internet advertising services or lists products for sale, and that does not otherwise meet this definition.\nMarketplace seller means a person, regardless of whether or not the person is engaged in business in the city, which has an agreement with a marketplace facilitator and offers for sale tangible personal property, products, or services through a marketplace owned, operated, or controlled by a marketplace facilitator.\nMedical marijuana means any marijuana intended for medical use which meets all requirements for Medical marijuana contained in this code, the Colorado constitution, and any other applicable law.\nMedical supplies means Prescription drugs for humans, Prosthetic devices for humans and special beds for patients with neuromuscular or similar debilitating ailments, when dispensed for the direct, personal use of a specific individual in accordance with a prescription or other written directive issued by a licensed practitioner of medicine, dentistry or podiatry; corrective eyeglass lenses (including eyeglass frames), and corrective contact lenses, when sold for the direct, personal use of a specific individual in accordance with a prescription or other written directive issued by a licensed practitioner of medicine or optometry; wheelchairs, and crutches, when sold for the direct, personal use of a specific individual; oxygen and hemodialysis products for use by a medical patient, hearing aids, hearing aid batteries, insulin, insulin measuring and injecting devices, glucose to be used for treatment of insulin reactions, and human whole blood, plasma, blood products and derivatives. This term excludes items purchased for use by medical and dental practitioners or medical facilities in providing their services, even though certain of those items may be packaged for single use by individual patients after which the item would be discarded.\nMenstrual care products means products that are designed to absorb or contain menstrual flow. Menstrual care products include, without limitation, tampons, menstrual pads, sanitary napkins, pantiliners, menstrual sponges, menstrual under garments, and menstrual cups.\nMobile machinery and self-propelled construction equipment means those vehicles, self-propelled or otherwise, which are not designed primarily for the transportation of persons or cargo over the public highways, and those motor vehicles which may have originally been designed for the transportation of persons or cargo over the public highways, and those motor vehicles which may have originally been designed for the transportation of persons or cargo but which have been redesigned or modified by the mounting thereon of special equipment or machinery, and which may be only incidentally operated or moved over the public highways. This definition includes but is not limited to wheeled vehicles commonly used in the construction, maintenance, and repair of roadways, the drilling of wells, and the digging of ditches.\nModular homes mean any structure that consists of multiple sections fabricated, formed or assembled in manufacturing facilities for installation and assembly at the building site, and is constructed to the building codes adopted by the State Division of Housing, created in Section 24-32-706, C.R.S., and is designed to be installed on a permanent foundation.\nMotor fuel means gasoline, casing head or natural gasoline, benzol, benzene and naphtha, gasohol and any other liquid prepared, advertised, offered for sale, sold for use or used or commercially usable in internal combustion engines for the generation of power for the propulsion of motor vehicles upon the public highways. The term does not include fuel used for the propulsion of drawing of aircraft or railroad cars or railroad locomotives.\nMultichannel seller means a retailer that offers for sale tangible personal property, commodities, or services through a marketplace owned, operated, or controlled by a marketplace facilitator, and through other means.\nNet taxable sales means gross sales less deductions authorized in this title.\nNewspaper means a publication, printed on newsprint, intended for general circulation, and published regularly at short intervals, containing information and editorials on current events and news of general interest. The term Newspaper does not include: magazines, trade publications or journals, credit bulletins, advertising inserts, circulars, directories, maps, racing programs, reprints, newspaper clipping and mailing services or listings, publications that include an updating or revision service or books or pocket editions of books.\nOccasional food sale means a sale meeting all of the following criteria:\n(a)\tThe sale is made by a charitable organization meeting both of the following criteria:\n(1)\tThe organization has been in existence continuously for a period of five years.\n(2)\tThe organization has had during the entire five-year period members engaged in carrying out the objects of the organization.\n(b)\tThe sale is made by one of the organization's active members.\n(c)\tThe sale occurs during a continuous sale period of no more than thirty days in any calendar year. A sale is deemed to occur when consideration is received by the organization for the item sold.\n(d)\tAggregate sales by the organization in the city total less than $500,000.00 in any calendar year.\n(e)\tThe goods sold are food.\n(f)\tThe goods sold bear conspicuously on their exterior or the packaging the name of the organization or its registered trademark.\nOnline garage sales mean sales of tangible personal property, except automotive vehicles, occurring online, where the property to be sold was originally purchased for use by the seller or members of the seller's household.\nPhotovoltaic system means a power system designed to supply usable solar power by means of photovoltaics, a method of converting solar energy into direct current electricity using semiconducting materials that create voltage or electric current in a material upon exposure to light. It consists of an arrangement of several components, including solar panels to absorb and convert sunlight into electricity, a solar inverter to change the electric current from DC to AC, as well as mounting, cabling, metering systems and other electrical accessories to set up a working system.\nPlace or event open to the public,for the purposes of the admissions tax only, means any place or event, the admission or access to which is open to members of the public upon payment of a charge or fee. This term includes, without limitation, the following places and events when a charge or fee for admission to such places and events is imposed upon members of the public:\n(a)\tAny performance of a motion picture, stage show, play, concert or other manifestation of the performing arts;\n(b)\tAny sporting or athletic contest, exhibition or event, whether amateur or professional;\n(c)\tAny lecture, rally, speech or dissertation;\n(d)\tAny showing, display or exhibition of any type, such as an art exhibition; and\n(e)\tAny restaurant, tavern, lounge, bar or club, whether the admission is called a \"cover charge,\" \"door charge\" or any other such term.\nPrecious metal bullion means any precious metal, including but not limited to, gold, silver, platinum, palladium, that has been put through a process of refining and is in such a state or condition that its value depends upon its precious metal content and not its form.\nPreprinted newspaper supplement means an insert, attachment or supplement circulated in a newspaper that: a) is primarily devoted to advertising; and b) the distribution, insertion or attachment of which is commonly paid for by the advertiser.\nPrescription drugs for humans means a drug which, prior to being dispensed or delivered, is required by the federal Food, Drug, and Cosmetic Act, 21 U.S.C. Sect. 301, et seq., as amended, to state at a minimum the symbol \"Rx Only,\" and is dispensed in accordance with any written or electronic order dated and signed by a licensed practitioner of the healing arts, or given orally by a practitioner and immediately reduced to writing by the pharmacist, assistant pharmacist, or pharmacy intern, specifying the name and any required information of the person for whom the medicine, drug or poison is offered and directions, if any, to be placed on the label.\nPrice or purchase price means the aggregate value measured in currency paid or delivered or promised to be paid or delivered in consummation of a sale, without any discount from the price on account of materials used, labor or service cost, and exclusive of any direct tax imposed by the federal government or this article and, in the case of all retail sales involving the exchange of property, also exclusive of the fair market value of the property exchanged at the same time and place of the exchange, if:\n(a)\tSuch exchanged property is to be sold thereafter in the usual course of the retailer's business; or\n(b)\tSuch exchanged property is a vehicle and is exchanged for another vehicle and both vehicles are subject to licensing, registration or certification under the laws of the State of Colorado, including but not limited to vehicles operating upon public highways, off-highway recreation vehicles, watercraft and aircraft, and any money or other consideration paid over and above the value of the exchanged property is subject to tax.\nPrice or purchase price includes, without limitation:\n(a)\tThe amount of money received or due in cash and credits.\n(b)\tProperty at fair market value taken in exchange but not for resale in the usual course of the retailer's business.\n(c)\tAny consideration valued in money whereby the manufacturer or someone else reimburses the retailer for part of the purchase price, and other media of exchange.\n(d)\tThe total price charged on credit sales including, without limitation, finance charges which are not separately stated. An amount charged as interest on the unpaid balance of the purchase price is not part of the purchase price unless the amount added to the purchase price is included in the principal amount of a promissory note; except that the interest or carrying charge set out separately from the unpaid balance of the purchase price on the face of the note is not part of the purchase price. An amount charged for insurance on the property sold and separately stated is not part of the purchase price.\n(e)\tInstallation, applying, remodeling or repairing the property, delivery and wheeling-in charges included in the purchase price and not separately stated.\n(f)\tTransportation and other charges to effect delivery of tangible personal property to the purchaser.\n(g)\tIndirect federal manufacturers' excise taxes, such as taxes on automobiles, tires and floor stock.\n(h)\tThe gross purchase price of articles sold after manufacturing or after having been made to order, including the gross value of all of the materials used, and the labor and services performed and the profit thereon.\nPrice or purchase price excludes:\n(a)\tAny sales or use tax imposed by the State of Colorado or by any political subdivision thereof.\n(b)\tThe fair market value of property exchanged if such property is to be sold thereafter in the retailer's usual course of business. This is not limited to exchanges in the State of Colorado. Out of state trade-ins are an allowable adjustment to the purchase price.\n(c)\tDiscounts from the original price if such discount and the corresponding decrease in sales tax due is actually passed on to the purchaser and the seller is not reimbursed for the discount by the manufacturer or someone else. An anticipated discount to be allowed for payment on or before a given date is not an allowable adjustment to the price in reporting gross sales.\nPrimary employer means a business or organization consisting of any number of employees that generates more than fifty percent of its revenues from activities outside of Boulder County and shall include, but is not limited to, those facilities of such business or organization devoted to manufacturing, research and development, data processing, telecommunications and publishing, but shall not include hotels, motels, retailers or food service facilities.\nProject completion date means the (a) date of issuance of a certificate of occupancy or the (b) city-determined project completion status date that occurs after the final inspection requested by the responsible person.\nProsthetic device for humans means any artificial limb, part, device or appliance for human use which aids or replaces a bodily function; is designed, manufactured, altered or adjusted to fit a particular individual; and is prescribed by a licensed practitioner of the healing arts. Prosthetic devices include, without limitation, prescribed auditory, ophthalmic or ocular, cardiac, dental or orthopedic devices or appliances, oxygen concentrators and oxygen with related accessories.\nProsthetic device for animals means any artificial limb, part, device or appliance for animal use which replaces a body party of aids or replaces a bodily function; is designed, manufactured, altered or adjusted to fit a particular patient; and is prescribed by a licensed veterinarian. Prosthetic devices include, but are not limited to, prescribed auditory, ophthalmic or ocular, cardiac, dental, or orthopedic devices or appliances, and oxygen concentrators with related accessories.\nPublic accommodation means the same as lodging services defined in this section.\nPurchase or sale means the acquisition for any consideration by any person of tangible personal property, other taxable products or taxable services that are purchased, leased, sold, used, stored, distributed or consumed, but excludes a bona fide gift of property or services. These terms include capital leases, installment and credit sales and property and services acquired by:\n(a)\tTransfer, either conditionally or absolutely, of title or possession or both to tangible personal property, other taxable products or services;\n(b)\tA lease, lease-purchase agreement, rental or grant of a license, including royalty agreements, to use tangible personal property or taxable services, including, without limitation, access services and linen services;\n(c)\tPerformance of taxable services; or\n(d)\tBarter or exchange for other property or services including coupons;\nPurchase or sale excludes:\n(a)\tDivision of partnership assets among partners according to their interests in the partnership;\n(b)\tTransfer of assets of shareholders in the formation or dissolution of professional corporations;\n(c)\tDissolution and pro rata distribution of a corporation's assets to its stockholders if no consideration, including but not limited to the assumption of a liability, is paid for the transfer of assets;\n(d)\tTransfer of a partnership or limited liability company interest;\n(e)\tTransfer in a reorganization qualifying under Section 368(a)(1) of the Federal Internal Revenue Code, as amended;\n(f)\tFormation of a partnership by a transfer of assets to the partnership or transfer to a partnership in exchange for a proportionate interest in the partnership;\n(g)\tRepossession of personal property by a chattel mortgage holder or foreclosure by a lienholder;\n(h)\tTransfer of assets from a parent corporation to a subsidiary corporation or corporations that are owned at least eighty percent by the parent corporation, which transfer is solely in exchange for stock or securities of the subsidiary corporation;\n(i)\tTransfer of assets from a subsidiary corporation or corporations that are owned at least eighty percent by the parent corporation to a parent corporation or to another subsidiary that is owned at least eighty percent by the parent corporation, which transfer is solely in exchange for stock or securities of the parent corporation or the subsidiary which received the assets; and\n(j)\tTransfer of assets between parent and closely held subsidiary corporations, or between subsidiary corporations closely held by the same parent corporation, or between corporations which are owned by the same shareholders in identical percentage of stock ownership amounts, computed on a share-by-share basis, when a tax imposed by this chapter was paid by the transferor corporation at the time it acquired such assets, except to the extent that there is an increase in the fair market value of such assets resulting from the manufacturing, fabricating or physical changing of the assets by the transferor corporation. To such extent, any transfer referred to in this subsection (k) shall constitute a sale. For the purposes of this subsection (k), a closely held subsidiary corporation is one in which the parent corporation owns stock possessing at least eighty percent of the total combined voting power of all classes of stock entitled to vote and owns at least eighty percent of the total number of shares of all other classes of stock.\nRail carrier means as defined in Section 10102 of Title 49 of the United States Code as of October 10, 2013, and as it may be amended hereafter.\nRail carrier part means any Tangible personal property that is originally designed and intended to be permanently affixed or attached as a component part of a locomotive or rail car used by a rail carrier.\nRecreation services means all services relating to athletic or entertainment participation events and/or activities including but not limited to pool, golf, billiards, skating, tennis, bowling, health/athletic club membership, coin operated amusement devices, video games and video club memberships.\nRenewable energy means any energy resource that is naturally regenerated over a short time scale and derived directly from the sun (such as thermal, photochemical, and photoelectric), indirectly from the sun (such as wind, hydropower, and photosynthetic energy stored in biomass), or from other natural movements and mechanisms of the environment (such as geothermal and tidal energy). Renewable energy does not include energy resources derived from fossil fuels, waste products from fossil sources, or waste products from inorganic sources.\nResident means a person who resides or maintains a domicile within the City or who maintains one or more places of business within the City at the time of a taxable transaction as defined in this chapter, notwithstanding the fact that the person has other places of residence or domicile or business outside the City prior to, during or after the occurrence of a taxable transaction.\nResponsible person means (a) the contractor responsible for the construction of a permitted project, or (b) the contractor responsible for construction for a federal, state or local government that is not required to get a permit from the City, or (c) if no contractor is used for a permitted project, the homeowner receiving a permit from the City to build or make improvements to the homeowner's personal residence.\nRetail sales means all sales except wholesale sales.\nRetailer means any person selling, leasing, renting, or granting a license to use tangible personal property or services at retail. The term retailer shall include, but are not limited to, any: (1) auctioneer; (2) salesperson, representative, peddler, vendor, or canvasser, who makes sales as a direct or indirect agent of or obtains such property or services sold from a dealer, distributor, supervisor or employer; (3) charitable organization or governmental entity which makes sales of tangible personal property to the public, notwithstanding the fact that the merchandise sold may have been acquired by gift or donation or that the proceeds are to be used for charitable or governmental purposes; (4) retailer-contractor, when acting in the capacity of a seller of building supplies, construction materials, and other tangible personal property; and (5) marketplace facilitator, marketplace seller, or multichannel seller.\nRetailer-contractor means a contractor who is also a retailer of building supplies, construction materials, or other tangible personal property, and purchases, manufactures, or fabricates such property for sale (which may include installation), repair work, time and materials jobs, and/or lump sum contracts.\nReturn means any form prescribed by the city/town administration for computing and reporting a total tax liability.\nSale that benefits a Colorado school means a sale of a commodity or service from which all proceeds of the sale, less only the actual cost of the commodity or service to a person or entity as described in this code, are donated to a school or a school-approved student organization.\nSales tax means the tax that is collected or required to be collected and remitted by a retailer on sales taxed under this chapter.\nSchool means a public or nonpublic school for students in kindergarten through 12th grade or any portion thereof.\nSecurity system services means electronic alarm and/or monitoring services. Such term does not include non-electronic security services such as consulting or human or guard dog patrol services.\nSoft drink means a nonalcoholic beverage that contains natural or artificial sweeteners. \"Soft drink\" does not include beverages that contain milk or milk products, soy, rice, or similar milk substitutes, or greater than fifty percent of vegetable or fruit juice by volume.\nSoftware license fee means a fee charged for the right to use, access, or maintain software programs.\nSoftware maintenance agreement means an agreement, typically with a software provider, that may include (1) provisions to maintain the right to use the software; (2) provisions for software upgrades including code updates, version updates, code fix modification, enhancements, and added or new functional capabilities loaded into existing software, or (3) technical support.\nSoftware program means a sequence of instructions that can be measured, interpreted and executed by an electronic device (e.g. a computer, tablets, smart phones) regardless of the means by which it is accessed or the medium of conveyance. Software program includes: (1) Custom software program, which is a software program prepared to the special order or specifications of a single customer; (2) Pre-written Software program, which is a Software program prepared for sale or license to multiple users, and not to the special order or specifications of a single customer. Pre-written software is commonly referred to as \"canned,\" \"off-the-shelf (\"COTS),\" \"mass produced\" or \"standardized;\" (3) Modified software, which means pre-written software that is altered or enhanced by someone other than the purchaser to create a program for a particular user; and (4) The generic term \"software,\" \"software application,\" as well as \"updates,\" \"upgrades,\" \"patches,\" \"user exits,\" and any items which add or extend functionality to existing software programs.\nSoftware as a service means software that is rented, leased or subscribed to or from a provider and used at the consumer's location, including but not limited to applications, systems or programs.\nSolar thermal systems mean a system whose primary purpose is to use energy from the sun to produce heat or cold for: (1) Heating or cooling a residential or commercial building; (2) Heating or cooling water; or (3) Any industrial, commercial, or manufacturing process.\nSound system services means the provision of broadcast or pre-recorded audio programming to a building or portion thereof. Such term does not include installation of sound systems where the entire system becomes the property of the building owner or the Sound system services is for presentation of live performances.\nSpecial fuel means kerosene oil, kerosene distillate, diesel fuel, all liquefied petroleum gases, and all combustible gases and liquids for use in the generation of power for propulsion of motor vehicles upon the public highways. The term does not include fuel used for the propulsion or drawing of aircraft, railroad cars or railroad locomotives.\nSpecial sales event means any sales event which includes more than three (3) retailers taking place at a single location for a limited period of time not to exceed seven (7) consecutive days.\nStorage means any keeping or retention of, or exercise dominion or control over, or possession of, for any length of time, tangible personal property not while in transit but on a stand still basis for future use when leased, rented or purchased at retail from sources either within or without the City from any person or vendor.\nStudent means any person enrolled in a school.\nTangible personal property means personal property that can be one or more of the following seen, weighed, measured, felt touched, stored, transported, exchanged, or that is in any manner perceptible to the senses.\nTax means that use tax due from a consumer or the sales tax due from a retailer or the sum of both due from a retailer who also consumes.\nTax deficiency or \"deficiency\" means any amount of tax, penalty, interest, or other fee that is not reported and/or not paid on or before the date that any return or payment of the tax is required under the terms of this code.\nTaxable sales means gross sales less any exemptions and deductions specified in this chapter.\nTaxable services means services subject to tax pursuant to this code.\nTaxpayer means any person obligated to collect or pay tax under the terms of this title.\nTelecommunications service means the service of which the object is the transmission of any two-way interactive electronic or electromagnetic communications including but not limited to voice, image, data and any other information, by the use of any means but not limited to wire, cable, fiber optical cable, microwave, radio wave, Voice over Internet Protocol (VoIP), or any combinations of such media, including any form of mobile two-way communication.\nTelevision & Entertainment services means audio or visual content that can be transmitted electronically by any means, for which a charge is imposed.\nTherapeutic device means devices, appliances, or related accessories that correct or treat a human physical disability or surgically created abnormality.\nToll free telecommunications service means a Telecommunications service that allows a caller to dial a number without incurring an additional charge for the call.\nTotal tax liability means the total of all tax, penalties and/or interest owed by a taxpayer and shall include sales tax collected in excess of such tax computed on total sales.\nTransient/Temporary retailer means any person who engages in the business of transient/temporary sales.\nTransient/Temporary vendor means any person who engages in the business of Transient/Temporary Sales.\nUse means the exercise, for any length of time by any person within the city of any right, power or dominion over tangible personal property or services when rented, leased or purchased at retail from sources either within or without the city from any person or retailer or used in the performance of a contract in the city whether such tangible personal property is owned or not owned by the taxpayer. Use also includes the withdrawal of items from inventory for consumption.\nUse tax means the tax paid or required to be paid by a consumer for using, storing, distributing or otherwise consuming tangible personal property or taxable services inside the City.\nWholesale sales means a sale by wholesalers to retailers, jobbers, dealers, or other wholesalers for resale and does not include a sale by Wholesalers to users or consumers not for resale; latter types of sales shall be deemed to be Retail Sales and shall be subject to the provisions of this chapter.\nWholesaler means any person selling to retailers, jobbers, dealers, or other wholesalers, for resale and not for storage, use, consumption or distribution.\nOrdinance Nos. 4962 (1986); 5015 (1986); 5030 (1987); 5187 (1989); 5272 (1990); 5343 (1990); 5430 (1991); 6090 (1999); 7011 (1999); 7162 (2001); 7248 (2002); 7416 (2005); 7419 (2005); 7428 (2005); 7478 (2006); 7487 (2006); 7554 (2007); 7585 (2008); 7639 (2009); 7760 (2010); 8232 (2018); 8425 (2020); 8457 (2021); 8562 (2023); 8563 (2023)"
  },
  {
    "corpus": "BRC",
    "title": "3",
    "title_name": "Revenue and Taxation",
    "chapter": "1",
    "chapter_name": "Definitions",
    "anchor": "3-1-2",
    "heading": "Intercity Claims for Recovery.",
    "verbatim": "3-1-2. Intercity Claims for Recovery.\nThe intent of this section is to streamline and standardize procedures related to situations in which a tax, penalty or interest payment has been remitted to the incorrect municipality. It is not intended to reduce or eliminate the responsibilities of the taxpayer to correctly collect and remit such payments to the City.\n(a)\tAs used in this section, claim for recovery means a claim for reimbursement directed to a municipality for taxes, penalties and interest paid to the wrong taxing jurisdiction.\n(b)\tWhen it is determined by the city manager that tax, penalty or interest owed to the City has been reported and paid to another municipality, the City will promptly notify the taxpayer that such payments are being improperly collected and remitted, and that, as of the date of the notice, the taxpayer must cease improper tax collections and remittances.\n(c)\tThe City may make a written claim for recovery directly to the municipality that received tax, penalty or interest owed to the City, or, in the alternative, may institute procedures for collection of the tax from the taxpayer. The decision to make a claim for a recovery lies in the sole discretion of the City. Any claim for recovery shall include a properly executed release of claim from the taxpayer releasing its claim to the taxes paid to the wrong municipality, evidence to substantiate the claim, and a request that the municipality approve or deny, in whole or in part, the claim within ninety days of its receipt. The municipality to which the City submits a claim for recovery may, for good cause, request an extension of time to investigate the claim, and approval of such extension by the City will not be unreasonably withheld.\n(d)\tWithin ninety days after receipt of a claim for recovery, the City will verify to its satisfaction whether or not all or a portion of the tax claimed was improperly received, and will notify the municipality submitting the claim in writing that the claim is either approved or denied in whole or in part, including the reasons for the decision. If the claim is approved in whole or in part, the City will remit the undisputed amount to the municipality submitting the claim within thirty days of approval. If a claim is submitted jointly by a municipality and a taxpayer, the check will be made to the parties jointly. Denial of a claim for recovery will be made only for good cause.\n(e)\tThe City may deny a claim on the grounds that it has previously paid a claim for recovery arising out of an audit of the same taxpayer.\n(f)\tThe period subject to a claim for recovery shall be limited to the thirty-six-month period prior to the date on which the municipality that was wrongly paid the tax receives the claim for recovery.\nOrdinance No. 5430 (1991)"
  },
  {
    "corpus": "BRC",
    "title": "3",
    "title_name": "Revenue and Taxation",
    "chapter": "1",
    "chapter_name": "Definitions",
    "anchor": "3-1-3",
    "heading": "Hearings and Appeals.",
    "verbatim": "3-1-3. Hearings and Appeals.\n(a)\tAfter paying the tax, filing a written claim for refund with the city manager, and receiving a notice of denial of the claim for refund, a taxpayer may request a hearing on any tax imposed by this title, except the sales and use tax imposed by Chapter 3-2, \"Sales and Use Tax,\" B.R.C. 1981, by filing a request for hearing within ten days of the date of mailing of the notice of refund denial. The request for hearing shall set forth the reasons for the refund amount that the taxpayer seeks and such other information as the manager may prescribe.\n(b)\tThe city manager shall conduct the hearing under the procedures prescribed by Chapter 1-3, \"Quasi-Judicial Hearings,\" B.R.C. 1981, except that the manager shall notify the taxpayer in writing of the time and place of the hearing at least thirty days before it is scheduled, unless the taxpayer agrees to a shorter time.\n(c)\tIn lieu of making a timely request for a hearing as provided by subsection (a) of this section, a taxpayer may request an extension of up to twenty days for seeking a hearing by filing a written request within ten days after the date of mailing of the refund denial or may file a written brief and such other documents and information as the taxpayer wishes and request the city manager to reconsider the action without a hearing. If the taxpayer requests a reconsideration of the manager's decision, the manager shall consider the request and render a decision, after which the taxpayer may request a hearing thereon within ten days of the date of mailing thereof, as provided in subsection (a) of this section.\n(d)\tAfter a hearing held pursuant to subsection (b) of this section, the city manager shall send a determination notice to the taxpayer setting forth a decision, including any amount found due or amount of claim for refund denied and the grounds for allowing or rejecting the claim in whole or in part. The determination notice is an assessment that is due and payable within thirty days from its date, unless the taxpayer appeals the city manager's decision as provided in subsection (f) of this section.\n(e)\tIf ten days from the date of the mailing of the denial of refund no request for hearing has been made, no extension has been requested and no request for reconsideration has been filed by the taxpayer, the notice previously mailed constitutes a final denial of refund.\n(f)\tAn aggrieved taxpayer may appeal the city manager's determination notice to the district court in and for Boulder County by filing a complaint pursuant to Colorado Rule of Civil Procedure 106(a)(4).\nOrdinance Nos. 5052 (1987); 5430 (1991); 7838 (2012)"
  },
  {
    "corpus": "BRC",
    "title": "3",
    "title_name": "Revenue and Taxation",
    "chapter": "1",
    "chapter_name": "Definitions",
    "anchor": "3-1-4",
    "heading": "Telephone Exchange Access Facility Charge.",
    "verbatim": "3-1-4. Telephone Exchange Access Facility Charge.\n(a)\tEvery telephone service user shall pay monthly to the telephone service supplier, who shall remit the same to the Boulder Regional Emergency Telephone Service Authority, a telephone exchange access facility charge equal to the maximum charge permitted pursuant to § 29-11-102, C.R.S., or any successor statute as from time to time amended. But no charge shall be imposed upon more than one hundred exchange access facilities or their equivalent per customer billing.\n(b)\tThe Boulder Regional Emergency Telephone Service Authority may, by timely notice to the service supplier after determining that a lesser charge will suffice to pay the equipment, installation and other directly related costs of the continued operation of an emergency telephone service, annually fix some lesser rate and communicate such rate to the telephone service suppliers as provided by law.\n(c)\tThis charge is levied pursuant to Article 11 of Title 29, C.R.S., to carry out the purposes of that article. The Boulder Regional Emergency Telephone Service Authority is organized pursuant to an intergovernmental agreement authorized by article 11 to carry out its purposes. The definitions found at § 29-11-101, C.R.S., apply to this section, and this section is to be interpreted and administered consistently with Article 11 and to carry out its purposes.\n(d)\tIf the telephone service user owns the property upon which the telephone is located, the city manager may use the procedures specified in section 2-2-12, \"City Manager May Certify Taxes, Charges and Assessments to County Treasurer for Collection,\" B.R.C. 1981, to collect any uncollected charge. The manager may use any other proper means to collect such charges when not collected by the service supplier.\nOrdinance Nos. 5062 (1987); 5430 (1991); 7313 (2003); 8563 (2023)"
  },
  {
    "corpus": "BRC",
    "title": "3",
    "title_name": "Revenue and Taxation",
    "chapter": "1",
    "chapter_name": "Definitions",
    "anchor": "3-1-5",
    "heading": "Use of Electronic Databases.",
    "verbatim": "3-1-5. Use of Electronic Databases.\n(a)\tAny retailer who collects and remits sales tax to the sales tax division of the City of Boulder, as provided in this article, may use an electronic database of state addresses that is certified by the Colorado Department of Revenue pursuant to § 39-26-105.3, C.R.S., to determine the jurisdictions to which tax is owed.\n(b)\tAny retailer who uses the data contained in an electronic database certified by the Colorado Department of Revenue pursuant to § 39-26-105.3, C.R.S., to determine the jurisdictions to which tax is owed, shall be held harmless for any tax, penalty or interest owed to the City that otherwise would be due solely as a result of an error in the electronic database, provided, however, that the retailer can demonstrate the use of the most current information available in such electronic database on the date the sale occurred. Each retailer shall keep and preserve such records as prescribed by the city manager to demonstrate that it used the most current information available in the electronic database on the date the sale occurred. Notwithstanding the above, if the error in collecting and remitting is a result of a deceptive representation, a false representation or fraud, the provisions of this section shall not apply.\nOrdinance No. 7531 (2007)"
  },
  {
    "corpus": "BRC",
    "title": "3",
    "title_name": "Revenue and Taxation",
    "chapter": "2",
    "chapter_name": "Sales and Use Tax",
    "anchor": "3-2-1",
    "heading": "Legislative Intent.",
    "verbatim": "3-2-1. Legislative Intent.\n(a)\tIt is the intent of the city council in enacting this chapter that every person in the city who purchases at retail, leases, consumes, stores or puts to any use any tangible personal property or taxable services is exercising a taxable privilege. All sales, leases and purchases of tangible personal property and taxable services defined in this chapter are taxable unless specifically exempted in this chapter. The sales tax imposed on tangible personal property by this chapter applies to each transfer of ownership, possession and control of such property and may occur more than once during the life of the property.\n(b)\tThe sales tax is a transaction tax levied upon all sales, purchases and leases of tangible personal property and taxable services sold or leased by persons engaged in business in the city and is collected by the retailer and remitted to the city. The use tax is levied upon the privilege of persons in the city to use, store or consume tangible personal property located in the city and taxable services purchased or leased at retail and furnished within the city, whether purchased or leased inside or outside the city limits, and not subject to the sales tax imposed by this chapter. The use tax is remitted to the city by the person using, storing or consuming the tangible personal property or taxable services. The use tax is a complement to the sales tax, and its purposes are to equalize competition between in-city and out-of-city retailers of tangible personal property and services and to eliminate incentives for city residents to leave the city to purchase or lease tangible personal property and taxable services.\nOrdinance Nos. 8232 (2018); 8563 (2023)"
  },
  {
    "corpus": "BRC",
    "title": "3",
    "title_name": "Revenue and Taxation",
    "chapter": "2",
    "chapter_name": "Sales and Use Tax",
    "anchor": "3-2-2",
    "heading": "Imposition of Tax.",
    "verbatim": "3-2-2. Imposition of Tax.\n(a)\tThere is hereby levied and there shall be collected and paid a sales or use tax on the full purchase price paid or charged for tangible personal property and taxable services purchased or sold at retail by every person exercising a taxable privilege in the city by the sale or use of such property and services. The sales tax is levied on all sales of tangible personal property or taxable services, except those specifically exempted and is collected by the retailer and remitted to the city. The use tax is levied upon the privilege of using in the city, personally or as part of rendering a service, tangible personal property or taxable services upon which a municipal sales or use tax has not been paid and is paid by either the retailer doing business in the city or the consumer. The following paragraphs prescribe rules for various taxable transactions:\n(1)\tIf tangible personal property is purchased for use exclusively in the rental or leasing business and is not at any time used for the purchaser's general business or personal use, use tax is not due upon the purchase of the tangible personal property, but a sales tax is due upon the rental or leasing of tangible personal property used in the rental or leasing business, regardless of whether a sales or use tax has been paid upon a previous purchase of the property.\n(2)\tA resident of the City shall pay sales tax upon the purchase price paid or charged for automotive vehicles purchased for use or storage in the City. A resident of the City shall pay use tax under this chapter upon the purchase price paid or charged for automotive vehicles purchased outside of the City for use or storage within the City. No person may register an automotive vehicle for which registration is required until such person has paid all sales or use taxes due on the purchase of the vehicle. No resident shall register a vehicle at an address other than such resident's principal residence or place of business within the City for the purpose of evading the sales or use tax imposed by this chapter.\n(3)\tA use tax is not due upon a registered vehicle used in the City by a business if the vehicle is registered to a bona fide business address outside the City.\n(4)\tMotor vehicles used by automobile dealers for demonstrations are exempt from use tax if each such vehicle is available for and in fact used by licensed sales personnel of the dealership for the promotion of business of selling vehicles. Vehicles used in the dealer's service or repair business are subject to a use tax. Demonstrator vehicles are subject to a sales tax when they are sold, regardless of whether a use tax has been paid for their use. Use tax is based upon the dealer's net invoice price of the vehicle. To be entitled to claim an exemption for demonstration vehicles, a taxpayer shall file with the sales tax return a certification of the use of all demonstration vehicles used in the business.\n(5)\tExcept for construction equipment as provided in paragraphs (9)—(12), a use tax is due upon tangible personal property that is utilized in the City if such use occurs within three years of the most recent sale of the property, by the owner of the tangible personal property. No use tax shall be due on the use of tangible personal property within the City that occurs more than three years after the most recent sale of the property if, within three years following the date of such sale, the property has been significantly used within the state for the principal purpose for which it was purchased.\n(6)\tThe purchaser of tangible personal property acquired with the purchase of a business for use in the operation of such business shall pay a sales tax upon the purchase price of such property recorded in the bill or contract of sale, but in no event shall the tax be based upon a valuation of property less than its fair market value. If the purchase price of the property is not itemized in the bill or contract of sale, the tax shall be based upon the book value that the purchaser uses for income tax depreciation or upon the fair market value of the property if no book value has been established. Regardless of the method used to value the property, no deduction shall be made on account of any outstanding liabilities acquired by the purchaser of the business and property.\n(A)\tPurchasers of a business are liable to pay all unpaid sales or use taxes of the seller of the business if the purchasers have acquired the furniture, fixtures and equipment of the business and engage in a similar business.\n(B)\tConsumers from the business to be purchased who have accounts upon which sales or use tax is outstanding at the time of purchase of a business shall pay that tax at or before the time of sale.\n(7)\tWhenever tangible personal property, including property sold in conjunction with the sale of a business, is sold under a conditional sales contract, lease-purchase contract or capital lease contract, whereby the retailer retains title as security for all or part of the purchase price, or whenever the retailer retains a chattel mortgage on such tangible personal property to secure all or part of the purchase price, the sales tax is immediately due and payable upon the total selling price. There is no refund or credit for either party to the transaction if the property is repossessed by the retailer.\n(8)\tA sales tax is due upon the purchase price paid for the transmission of intrastate electronic messages originating within the City by means of microwave, telephone, telegraph or cable transmission, including cable, microwave or other television service for which a charge is imposed, except that for mobile telecommunications services, the definition of taxable services shall be as set forth in the Federal Mobile Telecommunications Sourcing Act, 4 USC sections 116 to 126, as amended, which provides that taxes on mobile telecommunications services are to be collected and remitted to the jurisdiction where the customer's primary use of said services occurs, regardless of where the mobile telecommunications services originate, pass through or terminate;\n(9)\tUse Tax on Construction Equipment. Construction equipment with a purchase price of two thousand five hundred dollars or more that is located within the City for a period of more than thirty consecutive calendar days shall be subject to the City's use tax based on the value of the equipment due and payable by the owner of the construction equipment. For purposes of paragraphs (a)(9)—(12), value of the equipment shall mean:\n(A)\tIf the owner purchased the equipment within five years before the date it is located within the City, the purchase price;\n(B)\tIf the owner purchased the equipment more than five years but less than ten years before the date it is located within the City, the book value or fair market value, whichever is greater;\n(C)\tIf the owner purchased the equipment more than ten years before the date it is located within the City, no use tax is due under these paragraphs.\n(10)\tConstruction Equipment in City for Thirty Days or Less. Construction equipment with a purchase price of two thousand five hundred dollars or more that is located within the City for a period of thirty consecutive days or less shall be subject to the City's use tax in an amount calculated as follows: the value of the equipment shall be multiplied by a fraction, the numerator of which is one and the denominator of which is twelve, and the result shall be multiplied by the tax rate set forth in Section 3-2-5, \"Rate of Tax,\" B.R.C. 1981. In order to use this provision rather than paragraphs (a)(9) and (12) to determine the amount of tax on, and filing requirements for, construction equipment, the construction equipment declaration must be filed and the use tax paid by the owner within twenty days of removal of the construction equipment from the City.\n(11)\tCredit for Sales and Use Tax Paid to Other Governments. The credit provisions of this title shall apply to taxation of construction equipment.\n(12)\tReporting and Payment of Tax on Construction Equipment. Except for owners of construction equipment paying tax pursuant to paragraph (a)(10), the owner of the construction equipment shall file with the city manager a construction equipment declaration on a form provided by the City and pay any tax due within ninety days of the date the equipment is brought into the City for the project for which the equipment is moved into the City, and every ninety days thereafter. The last declaration and payment of tax shall be filed within twenty days of removal of the equipment from the City. For purposes of determining penalties and interest for failure to timely file a construction equipment declaration and pay the tax, the construction equipment declaration shall be considered a return. Such declaration shall state:\n(A)\tThe dates on which the equipment was located within and removed from the boundaries of the City;\n(B)\tA description of each piece of equipment;\n(C)\tThe value of each piece of equipment;\n(D)\tThe actual amount of sales or use taxes paid to other municipalities or states; and\n(E)\tSuch other information as reasonably deemed necessary by the City.\n(13)\tCity sales and use tax applies to computer software which includes downloaded software and online data services described in Ball Aerospace & Technologies Corp. v. City of Boulder, 304 P.3d 609, (Colo.App, 2012).\n(b)\tRetailers engaged in business in the city shall collect and purchasers shall pay the taxes levied by this chapter, notwithstanding the fact that either retailer or purchaser disputes the tax liability or claims an exemption. If the retailer or purchaser disputes the application of this chapter to any transaction, the retailer shall collect and the purchaser shall pay the tax, and the purchaser may thereafter apply to the city manager for a refund of such taxes paid, as provided in this title.\n(c)\tRetailers shall remit to the city taxes collected according to their net taxable sales, whether or not each sales transaction consists of some items each of which has a retail sale price of less than the minimum taxable sale; but retailers may exclude from net taxable sales the amount of each individual sales transaction that is less than the minimum taxable sale.\n(d)\tEvery retailer required or permitted to collect the tax imposed by this chapter shall collect it upon the purchase price of tangible personal property purchased or leased outside the city and intended to be brought into the city for use, storage or consumption, notwithstanding the following circumstances:\n(1)\tThat the purchaser's order or the contract of sale is delivered, mailed or otherwise transmitted by the purchaser to the retailer at a point outside of the city as a result of solicitation by the retailer through the medium of a catalogue or other written advertisement, by radio or television advertising or by any other means;\n(2)\tThat the purchaser's order or contract of sale was made or closed by acceptance or approval outside of the city or before the tangible personal property enters the city;\n(3)\tThat the purchaser's order or contract of sale provides that the property shall be, or it is in fact, procured or manufactured at a point outside the city and shipped directly to the purchaser from a point of origin; or\n(4)\tThat the property is mailed to the purchaser in the city from a point outside the city or delivered to a carrier at a point outside the city, F.O.B., or otherwise, and directed to the purchaser in the city, regardless of whether the cost of transportation is paid by the retailer or by the purchaser.\n(e)\tServices taxable under this code include:\n(1)\tTelecommunication services;\n(2)\tProvision of carrier access to transmission and switching equipment to transmit interchange telephone calls to, from and within the City;\n(3)\tGas, electricity, steam and heat for domestic, manufacturing or commercial consumption and not for taxable resale;\n(4)\tMeals purchased or sold in any restaurant, eating house, hotel, residential facility, school commissary, cafeteria, lodge, church, drugstore, club, resort or any place at which meals or food are sold regularly or occasionally or that is required by law to have food or meals available for sale;\n(5)\tLabor used to render tangible personal property sold or leased into a form usable by the purchaser or lessee and the charge for connecting or installing taxable services for the purchaser or lessee; and\n(6)\tComputer software.\nOrdinance Nos. 8232 (2018); 8563 (2023)"
  },
  {
    "corpus": "BRC",
    "title": "3",
    "title_name": "Revenue and Taxation",
    "chapter": "2",
    "chapter_name": "Sales and Use Tax",
    "anchor": "3-2-3",
    "heading": "Reserved.",
    "verbatim": "3-2-3. Reserved.\nEditor's note(s)—Ord. No. 8434, § 1, adopted December 1, 2020, repealed § 3-2-3, which pertained to taxes collected are held in trust and derived from Ordinance No. 8232 (2018)."
  },
  {
    "corpus": "BRC",
    "title": "3",
    "title_name": "Revenue and Taxation",
    "chapter": "2",
    "chapter_name": "Sales and Use Tax",
    "anchor": "3-2-4",
    "heading": "Retailer Liable for Tax.",
    "verbatim": "3-2-4. Retailer Liable for Tax.\n(a)\tExcept as otherwise provided by this title, every retailer shall pay the tax rate set forth in Section 3-2-5, \"Rate of Tax,\" B.R.C. 1981, on all taxable sales. On or before the twentieth day of each month, each retailer shall file a return to the city manager for the preceding calendar month and remit an amount equal to the percentage specified in Section 3-2-5, \"Rate of Tax,\" B.R.C. 1981, of such sales and any excess tax collected over the specified percentage of such sales to the city manager.\n(b)\tThe retailer shall add the tax as a separate and distinct item in the sale, except that any retailer selling malt, vinous or spirituous liquors by the drink may include in the sales price the tax imposed by this chapter. The tax shall be a debt from the purchaser to the retailer recoverable at law in the same manner as other debts. The retailer may not absorb the tax or advertise or state that the tax will be absorbed or will not be imposed. Nor may the retailer refund any part of the tax, except when the full sales price is refunded, or a discount is made as provided in this Chapter 3-2.\nOrdinance Nos. 8232 (2018); 8563 (2023)"
  },
  {
    "corpus": "BRC",
    "title": "3",
    "title_name": "Revenue and Taxation",
    "chapter": "2",
    "chapter_name": "Sales and Use Tax",
    "anchor": "3-2-5",
    "heading": "Rate of Tax.",
    "verbatim": "3-2-5. Rate of Tax.\n(a)\tExcept as specified in Subsection (b) of this section, the amount of the tax hereby levied is 3.86 percent of the purchase price of tangible personal property or taxable services sold or purchased at retail.\n(b)\tThe amount of the tax hereby levied on food sold in or by a food service establishment shall be the amount levied in Subsection (a) of this section plus 0.15 percent of the purchase price of such food. Cover charges, admission, or entrance fees and mandatory service or service-related charges shall be included as part of the purchase price of such food. However, a mandatory service or service-related charge shall not be included as part of the purchase price of such food if the full amount of the charge is passed on to the employees of the food service establishment who have provided direct service to each person paying the charge, and if all federal and state income and other applicable taxes due on such charge have been withheld by the food service establishment and paid to the appropriate government.\n(c)\tOf the amount stated in (a) above:\n(1)\tParks and Recreation: 0.25 percent shall be deemed a parks and recreation tax, which tax shall expire at midnight on December 31, 2035 (Ord. No. 7862, approved by voters in 2012).\n(2)\tOpen Space and General: 0.33 percent shall be used for the purposes, during the time periods, and in the following amounts, as follows:\n(A)\tAn open space tax through midnight on December 31, 2018 (Ord. No. 5893, approved by voters in 1997).\n(B)\tAn open space tax for 0.22 percent, and a general sales and use tax for 0.11 percent from January 1, 2019 through midnight on December 31, 2034 (Ord. No. 7912, approved by voters in 2013).\n(C)\tAn open space tax for 0.10 percent, and a general sales and use tax for 0.23 percent from January 1, 2035 and continuing without expiration (Ord. No. 7912, approved by voters in 2013).\n(3)\tOpen Space: 0.15 percent shall be deemed an open space tax through midnight on December 31, 2039 (Ord. No. 8346, approved by voters in 2019).\n(4)\tTransportation and General: 0.15 percent shall be deemed for the purposes, during the time periods, and in the following amounts, as follows:\n(A)\tA transportation tax from January 1, 2014 through midnight on December 31, 2029 (Ord. No. 7922, approved by voters in 2013).\n(B)\tA general sales and use tax from January 1, 2030, which tax shall expire at midnight on December 31, 2039 (Ord. No. 7922, approved by voters in 2013).\n(5)\tCapital improvement: 0.30 percent shall be deemed a capital improvement tax through midnight on December 31, 2036 to be known as the Community, Culture, Resilience and Safety Tax (Ord. 8476, approved by voters in 2021).\n(6)\tArts and General: 0.15 percent shall be used for the purposes and in the amounts as follows:\n(A)\tPublic Safety and General Fund: 0.075% shall be deemed for the purposes of fire and emergency response services, public safety services, human services, homelessness solutions, parks, and other general fund purposes through midnight on December 31, 2044.\n(B)\tArts, Culture, and Heritage Purposes: 0.075% shall be deemed for arts, culture, and heritage purposes including direct and grant funding for arts and culture nonprofits, professional artists, arts education, venues and workspaces, public art, and muti-cultural programs through midnight on December 31, 2044.\nAs each tax expires, the aggregate tax shall be reduced accordingly.\nOrdinance Nos. 8232 (2018); 8449 (2021); 8492 (2021); Ord. No. 8591 (2023)"
  },
  {
    "corpus": "BRC",
    "title": "3",
    "title_name": "Revenue and Taxation",
    "chapter": "2",
    "chapter_name": "Sales and Use Tax",
    "anchor": "3-2-6",
    "heading": "Exempt Property and Services.",
    "verbatim": "3-2-6. Exempt Property and Services.\nPurchase, sale, or use of the following property and services is exempt from taxation under this chapter:\n(a)\tServices, not otherwise taxable under this chapter, whose price is separately stated from the price of tangible personal property with which the services are sold;\n(b)\tServices, not otherwise taxable under this chapter, whose price is not separately stated from the price of tangible personal property with which the services are sold, but that is calculated as a percentage of the total sales price of the property, and approved as exempt by the city manager upon written request;\n(c)\tTangible personal property sold at wholesale that is actually transformed by the process of manufacture and becomes through the manufacturing process a necessary and recognizable ingredient and component of the finished product, and whose presence in the finished product is essential to the use thereof in the hands of the ultimate consumer;\n(d)\tCommercial packing materials;\n(e)\tAny wheeled vehicle exceeding either eight feet in width or thirty-two feet in length excluding towing gear and bumpers, without power to move, that is designed and commonly used for residential human occupancy in either temporary or permanent locations and that may be drawn over the public highways by a motor vehicle, after such vehicle has once been subject to the payment of sales or use tax under this chapter;\n(f)\tWholesale sales of taxable property to a licensed retailer, jobber, dealer, or other wholesaler for purposes of taxable resale, and not for the retailer's, jobber's, dealer's, or wholesaler's own consumption, use, storage, or distribution;\n(g)\tTangible personal property that is to be used, stored, or consumed outside the State of Colorado by persons residing or doing business outside the State of Colorado when the property is to be delivered to the purchaser outside the state by mail; by common, contract, or commercial carrier that is employed to effect delivery by the retailer; or by the retailer's conveyance;\n(h)\tGasoline or motor fuel upon which has accrued or has been paid the tax prescribed by the Colorado Gasoline and Special Fuel Tax Law;\n(i)\tCigarettes;\n(j)\tMedical supplies;\n(k)\tPublic accommodations or short-term rentals;\n(l)\tAdmission to places or events as defined in Section 3-1-1, \"Definitions,\" B.R.C. 1981;\n(m)\tNeat cattle; sheep, lambs, swine, and goats; and mares and stallions for breeding;\n(n)\tNewspapers and newsprint and printer's ink used to produce newspapers, but not preprinted newspaper supplements;\n(o)\tSales of tangible personal property and taxable services that are to be used, stored, or consumed outside the city to persons who are not residents of the city and who do not engage in business in the city if the property or services purchased or sold are to be delivered to the purchaser outside the city by mail; by common, contract, or commercial carrier that is employed by the retailer to effect delivery; or by the retailer's conveyance;\n(p)\tMotion picture prints when the exhibitor thereof charges admissions for exhibition and pays the admission tax imposed by Chapter 3-4, \"Admissions Tax,\" B.R.C. 1981;\n(q)\tTangible personal property owned by a resident but purchased when the purchaser was not a resident of the city and used for a substantial period of time outside of the city. When such property is an automotive vehicle, it may qualify as exempt property only if it was registered outside the city for a substantial period of time;\n(r)\tAmounts paid by any purchaser as, or in the nature of, interest or finance charges on account of credit extended in connection with the sale or purchase of any tangible personal property if the interest is separately stated from the consideration received for the property;\n(s)\tTangible personal property brought into the city by a nonresident for temporary personal use;\n(t)\tAutomobile dealers' demonstration vehicles, subject to the conditions in Paragraph 3-2-2(a)(4), B.R.C. 1981;\n(u)\tAll property and services whose sale, purchase, or use the city is prohibited from taxation by the laws or Constitution of the United States or the Constitution of the State of Colorado;\n(v)\tAll sales of food purchased with food stamps on or after November 1, 1987;\n(w)\tBuilding materials for installation, use, or consumption on buildings which have been designated as landmarks and for which a landmark alteration certificate is required under Chapter 10-13, \"Historic Preservation,\" B.R.C. 1981, if, at the time of application for building permit, the applicant submits proof that the building has been so designated and accompanying affidavits of the owner and the contractor performing the construction on the building stating that the building materials will be installed, used, or consumed exclusively upon the building for which the permit has been issued and that at least thirty percent of the dollar value of the building permit shall be for exterior improvements. No person shall fail to comply with such an affidavit. No more than $25,000 of tax per year and no more than $12,500 of tax per site per year shall be exempted under this subsection;\n(x)\tOccasional food sale;\n(y)\tConstruction materials purchased by the responsible person to be used for installation, use or consumption on job sites or building construction addresses if:\n(1)\tThe value of the construction materials was included in determining the valuation of the construction;\n(2)\tThe retailer records on the invoice of sale the job site address and, when applicable, the building permit number; and\n(3)\tThe contractor has prepaid the tax directly to the city as permitted in Chapter 3-16.\n(z)\tThe disposable bag fee as established in Chapter 6-15, \"Disposable Bag Fee,\" B.R.C. 1981;\n(aa)\tIncontinence products and diapers; or\n(bb)\tMenstrual care products.\nOrdinance Nos. 8232 (2018); 8559 (2023); 8562 (2023); 8563 (2023)"
  },
  {
    "corpus": "BRC",
    "title": "3",
    "title_name": "Revenue and Taxation",
    "chapter": "2",
    "chapter_name": "Sales and Use Tax",
    "anchor": "3-2-7",
    "heading": "Reserved.",
    "verbatim": "3-2-7. Reserved.\nEditor's note(s)—Ord. No. 8563, § 1, adopted February 2, 2023, repealed § 3-2-7, which pertained to exempt persons and derived from Ordinance No. 8232 (2018)."
  },
  {
    "corpus": "BRC",
    "title": "3",
    "title_name": "Revenue and Taxation",
    "chapter": "2",
    "chapter_name": "Sales and Use Tax",
    "anchor": "3-2-8",
    "heading": "Tax Limited When Other Taxes Paid.",
    "verbatim": "3-2-8. Tax Limited When Other Taxes Paid.\nThe tax imposed under this chapter shall be reduced by the amounts of taxes paid to the City, other cities or other states as follows:\n(a)\tWhen a sales tax has been paid to the City under this chapter, no use tax is due upon the use, storage or consumption of tangible personal property, but a sales or use tax is due upon the rental or leasing of such property.\n(b)\tA credit shall be granted against the City's use tax as follows:\n(1)\tIf the sales or use tax was paid to another municipality in Colorado, and the amount of the sales or use tax paid is less than the amount of tax determined by the rate in Section 3-2-5, \"Rate of Tax,\" B.R.C. 1981, the City use tax shall be the difference between the tax paid and the City's rate applied to the property or service;\n(2)\tIf the retail sales tax was paid in another state, and the amount of the combined state and local government sales tax in the other state is less than the amount of tax determined by the total combined tax rate of the state of Colorado, its local governments, and the City, the city use tax shall be the difference between the combined tax paid and the amount of the total combined tax rate of the state and local governments of Colorado that would have been applicable to the property or service in Colorado;\n(3)\tIn no instance shall the credit exceed the rate in Section 3-2-5, \"Rate of Tax,\" B.R.C. 1981;\n(4)\tThe credit will not be granted unless the tax paid to such other municipality or state was legally due under the laws of the state, and the laws of the other state or municipality are compatible with or reciprocal to those of the City as applied to the property or service being taxed;\n(5)\tThe credit applies only to the tax paid on initial purchases by the taxpayer and does not apply to, without limitation, rentals, leases and uses of tangible personal property;\n(6)\tThe credit shall not apply to a sales or use tax paid on construction materials.\n(c)\tThe City's sales tax shall not apply to the sale of construction materials, if such materials are picked up by the purchaser and if the purchaser of such materials presents to the retailer a building permit evidencing that a local use tax has been paid or is required to be paid.\n(d)\tThe City's use tax shall not apply to construction materials that are stored inside the City but are not used for any other purpose within the City.\nOrdinance No. 8232 (2018)"
  },
  {
    "corpus": "BRC",
    "title": "3",
    "title_name": "Revenue and Taxation",
    "chapter": "2",
    "chapter_name": "Sales and Use Tax",
    "anchor": "3-2-9",
    "heading": "Deductions.",
    "verbatim": "3-2-9. Deductions.\nThe following amounts may be deducted from a taxpayer's gross sales:\n(a)\tExempt property and services set forth in Section 3-2-6, \"Exempt Property and Services,\" B.R.C. 1981;\n(b)\tGross sales that are represented by accounts not secured by a conditional sale contract or chattel mortgage, found to be worthless and actually and properly charged as bad debts for Colorado state income tax purposes; except that if any such accounts are thereafter collected by the taxpayer, the taxpayer shall pay the tax upon the amount so collected and the three-year limitation in this title applies from the date on which the tax was payable without consideration for the write-off rather than from the date when the retailer actually writes off the debt;\n(c)\tThe sales price of property returned by the purchaser when the full sale price including the tax levied is refunded in cash or by credit;\n(d)\tThe amount of discount from the original sales price if the discount and corresponding decrease in sales tax due is actually passed on to the purchaser; but any allowed rebate, credit or cash discount allowed for payment on or before a given date may only be deducted on the taxpayer's return that follows the customer's actual receipt of the discount. If the price upon which the tax was computed and paid to the city by the retailer is subsequently readjusted before the purchaser pays the retailer the tax, the taxpayer may request the city manager to approve a credit of such additional tax paid against the tax due on the next return the taxpayer files with the city;\n(e)\tThe amount of the fair market value of any exchanged or traded property that is to be resold thereafter in the usual course of the retailer's business, if included in the full price of an article sold; and\n(f)\tThe amount of each individual sales transaction that is less than the minimum taxable sale.\nOrdinance Nos. 8232 (2018); 8563 (2023)"
  },
  {
    "corpus": "BRC",
    "title": "3",
    "title_name": "Revenue and Taxation",
    "chapter": "2",
    "chapter_name": "Sales and Use Tax",
    "anchor": "3-2-10",
    "heading": "Marketplace Sales.",
    "verbatim": "3-2-10. Marketplace Sales.\n(a)\tRequirements of Marketplace Facilitator.\n(1)\tA marketplace facilitator engaged in business in the city is required to collect and remit sales tax on all taxable sales made by the marketplace facilitator or facilitated by it for marketplace sellers or multichannel sellers to customers in the city, whether or not the marketplace seller for whom sales are facilitated would have been required to collect sales tax had the sale not been facilitated by the marketplace facilitator.\n(2)\tA marketplace facilitator shall assume all the duties, responsibilities, and liabilities of a retailer. Marketplace facilitators shall be liable for the taxes collected from marketplace sellers or multichannel sellers. The city may recover any unpaid taxes, penalties, and interest from the marketplace facilitator that is responsible for collecting on behalf of marketplace sellers or multichannel sellers.\n(3)\tThe liabilities, obligations, and rights set forth under this chapter are in addition to any duties and responsibilities of the marketplace facilitator has under this chapter if it also offers for sale tangible personal property, products, or services through other means.\n(4)\tA marketplace seller, with respect to sales of tangible personal property, products, or services made in or through a marketplace facilitator's marketplace, does not have the liabilities, obligations, or rights of a retailer under this chapter if the marketplace seller can show that such sale was facilitated by a marketplace facilitator:\n(A)\tWith whom the marketplace seller has a contract that explicitly provides that the marketplace facilitator will collect and remit sales tax on all sales subject to tax under this chapter; or\n(B)\tFrom whom the marketplace seller requested and received in good faith a certification that the marketplace facilitator is registered to collect sales tax and will collect sales tax on all sales subject to tax under this chapter made in or through the marketplace facilitator's marketplace.\n(5)\tIf a marketplace seller makes a sale that is not facilitated by a licensed marketplace facilitator in a marketplace, the marketplace seller is subject to all of the same licensing, collection, remittance, filing and recordkeeping requirements as any other retailer.\n(b)\tAuditing. With respect to any sale, the city shall solely audit the marketplace facilitator for sales made by marketplace sellers or multichannel sellers but facilitated by the marketplace. The city will not audit or otherwise assess tax against marketplace sellers or multichannel sellers for sales facilitated by a marketplace facilitator.\nOrdinance Nos. 8457 (2021); 8563 (2023)"
  },
  {
    "corpus": "BRC",
    "title": "3",
    "title_name": "Revenue and Taxation",
    "chapter": "3",
    "chapter_name": "Public Accommodations Tax",
    "anchor": "3-3-1",
    "heading": "Legislative Intent.",
    "verbatim": "3-3-1. Legislative Intent.\nThe city council intends that every person who, for consideration, purchases any accommodation located in the city for lodging purposes shall pay, and every person or retailer who makes a sale of or furnishes for consideration any such accommodation shall collect, the tax imposed by this chapter upon the total purchase price charged to the customer. The purpose of this tax is to increase the revenue base for the city to provide municipal improvements and services to the residents and visitors of the city. It is the purpose of this tax, in part, to promote tourism in the city. Revenues from the tax shall be deposited in the general fund and shall therefore be available to pay for the general expenses of government. However, although the city council recognizes that it cannot bind future city councils, it nonetheless declares its intention that up to twenty percent of the revenues generated by this tax be appropriated by future city councils for purposes of promoting programs and services that bring increased tourism to the city.\nOrdinance Nos. 5882 (1997); 7771 (2010); 8563 (2023)"
  },
  {
    "corpus": "BRC",
    "title": "3",
    "title_name": "Revenue and Taxation",
    "chapter": "3",
    "chapter_name": "Public Accommodations Tax",
    "anchor": "3-3-2",
    "heading": "Imposition and Rate of Tax.",
    "verbatim": "3-3-2. Imposition and Rate of Tax.\nThere is hereby levied and shall be paid and collected an excise tax of seven and one-half percent on the price paid for lodging services.\nOrdinance Nos. 4865 (1984); 5882 (1997); 7771 (2010); 8563 (2023)"
  },
  {
    "corpus": "BRC",
    "title": "3",
    "title_name": "Revenue and Taxation",
    "chapter": "3",
    "chapter_name": "Public Accommodations Tax",
    "anchor": "3-3-3",
    "heading": "Liability for Tax.",
    "verbatim": "3-3-3. Liability for Tax.\n(a)\tNo person who pays for lodging services in the city shall fail to pay and no retailer selling or otherwise furnishing lodging services shall fail to collect and remit the tax levied by this chapter.\n(b)\tThe burden of proving that any transaction is not subject to the tax imposed by this chapter is upon the person upon whom the duty to collect the tax is imposed.\nOrdinance Nos. 5882 (1997); 8563 (2023)"
  },
  {
    "corpus": "BRC",
    "title": "3",
    "title_name": "Revenue and Taxation",
    "chapter": "3",
    "chapter_name": "Public Accommodations Tax",
    "anchor": "3-3-4",
    "heading": "Reserved.",
    "verbatim": "3-3-4. Reserved.\nEditor's note(s)—Ord. No. 8434, § 1, adopted December 1, 2020, repealed § 3-3-4, which pertained to taxes collected are held in trust."
  },
  {
    "corpus": "BRC",
    "title": "3",
    "title_name": "Revenue and Taxation",
    "chapter": "3",
    "chapter_name": "Public Accommodations Tax",
    "anchor": "3-3-5",
    "heading": "Definition.",
    "verbatim": "3-3-5. Definition.\nAs used in this chapter, lodging purposes means any use of a hotel room, motel room, or other accommodation other than for meeting or eating.\nOrdinance No. 5882 (1997)"
  },
  {
    "corpus": "BRC",
    "title": "3",
    "title_name": "Revenue and Taxation",
    "chapter": "3",
    "chapter_name": "Public Accommodations Tax",
    "anchor": "3-3-6",
    "heading": "Exempt Transactions.",
    "verbatim": "3-3-6. Exempt Transactions.\nThe following entities and transactions are exempt from the duty to pay tax under this chapter but not the duty to collect and remit the tax levied hereby:\n(a)\tThe United States Government, the State of Colorado, its departments and institutions and the political subdivisions thereof including the city, when acting in their governmental capacities and performing governmental functions and activities, and when the government's obligation is paid for directly to the licensee by a purchase card or a draft or warrant drawn on the government's account; and\n(b)\tReligious, charitable and quasi-governmental organizations but only in the conduct of their regular religious, charitable and quasi-governmental capacities, only if each such organization has obtained an exempt organization license under Section 3-2-12, \"Exempt Institution License,\" B.R.C. 1981, and furnishes the exempt tax license to the person who rents or leases public accommodation to the organization, and only if the organization's obligations have been paid for directly by it to the public accommodations tax licensee without reimbursement therefor.\nOrdinance Nos. 5882 (1997); 6090 (1999)\n3-3-7—3-3-14. Reserved.\nEditor's note(s)—Ord. No. 8237, § 2, adopted February 6, 2018, effective March 8, 2018, repealed §§ 3-3-7—3-3-14, which pertained to licensing and reporting procedure; maintenance and preservation of tax returns, reports and records; interest and penalties for failure to file tax return or pay tax; refunds, hearings and appeals; enforcement of tax liability; duties and powers of city manager; city employee conflicts of interest prohibited. See Code Comparative Table for complete derivation."
  },
  {
    "corpus": "BRC",
    "title": "3",
    "title_name": "Revenue and Taxation",
    "chapter": "4",
    "chapter_name": "Admissions Tax",
    "anchor": "3-4-1",
    "heading": "Legislative Intent.",
    "verbatim": "3-4-1. Legislative Intent.\nThe city council intends that every person who pays to gain admission to any place or event in the city that is open to the public shall pay and every person or retailer, whether owner, lessee or operator, who charges or causes to be charged admission to any such place or event shall collect the tax imposed by this chapter.\nOrdinance No. 8563 (2023)"
  },
  {
    "corpus": "BRC",
    "title": "3",
    "title_name": "Revenue and Taxation",
    "chapter": "4",
    "chapter_name": "Admissions Tax",
    "anchor": "3-4-2",
    "heading": "Imposition and Rate of Tax.",
    "verbatim": "3-4-2. Imposition and Rate of Tax.\nThere is levied, and shall be paid and collected, an excise tax of five percent on the price paid to gain admission to any place or event in the city that is open to the public.\nOrdinance No. 8563 (2023)"
  },
  {
    "corpus": "BRC",
    "title": "3",
    "title_name": "Revenue and Taxation",
    "chapter": "4",
    "chapter_name": "Admissions Tax",
    "anchor": "3-4-3",
    "heading": "Liability for Tax.",
    "verbatim": "3-4-3. Liability for Tax.\n(a)\tNo person who pays to gain admission to any place or event in the city that is open to the public shall fail to pay and no person or retailer, whether owner, lessee or operator, who charges or causes to be charged admission to any place or event in the city that is open to the public shall fail to collect the tax levied by this chapter. If an owner or operator of a facility leases or rents such facility to another party who conducts an event open to the public in such facility, such owner or operator is not liable for collecting and remitting the tax if the party to whom the facility is leased or rented is at the time of the leasing or rental licensed to collect and remit the tax.\n(b)\tThe burden of proving that any transaction is not subject to the tax imposed by this chapter is upon the person upon whom the duty to collect the tax is imposed.\nOrdinance No. 8563 (2023)"
  },
  {
    "corpus": "BRC",
    "title": "3",
    "title_name": "Revenue and Taxation",
    "chapter": "4",
    "chapter_name": "Admissions Tax",
    "anchor": "3-4-4",
    "heading": "Reserved.",
    "verbatim": "3-4-4. Reserved.\nEditor's note(s)—Ord. No. 8434, § 1, adopted December 1, 2020, repealed § 3-4-4, which pertained to taxes collected are held in trust."
  },
  {
    "corpus": "BRC",
    "title": "3",
    "title_name": "Revenue and Taxation",
    "chapter": "4",
    "chapter_name": "Admissions Tax",
    "anchor": "3-4-5",
    "heading": "Exempt Transactions.",
    "verbatim": "3-4-5. Exempt Transactions.\n(a)\tThe following entities are exempt from the duty to pay the tax imposed by this chapter but not the duty to collect and remit the tax levied hereby:\n(1)\tThe United States government and the State of Colorado, its departments and institutions and the political subdivisions thereof including the city, when acting in their governmental capacities and performing governmental functions and activities, and when the government's obligation is paid for directly to the licensee by a purchase card or a draft or warrant drawn on the government's account;\n(2)\tSales made directly to charitable organizations that have been approved for city tax exempt status in the conduct of their regular charitable and governmental capacities;\n(3)\tAny person or retailer who refunds an admission price for any reason, either before or after an event has taken place, and refunds the admission tax along with the admission price;\n(4)\tAny person or retailer who provides free \"passes\" or complimentary admission tickets or otherwise fails to charge an admission price for admission to a place or event open to the public, but if such person imposes a reduced admission charge for any such \"pass,\" complimentary admission or otherwise, the tax imposed by this chapter applies to the actual amount of such reduced admission charge.\n(b)\tThe following transactions are exempt from the tax imposed by this chapter:\n(1)\tAny admission fee paid or charged to gain entry into any event sponsored or conducted by the city.\n(2)\tAny admission fee paid or charged to gain entry into any event sponsored or conducted by a Boulder licensed charitable organization.\n(3)\tAny admission fee paid or charged to participate in a racing event which includes running, walking, biking, or swimming.\nOrdinance Nos. 5001 (1986); 6090 (1999); 7456 (2006); 8232 (2018); 8563 (2023)\n3-4-6—3-4-13. Reserved.\nEditor's note(s)—Ord. No. 8237, § 2, adopted February 6, 2018, effective March 8, 2018, repealed §§ 3-4-6—3-4-13, which pertained to licensing and reporting procedure; maintenance and preservation of tax returns, reports and records; interest and penalties for failure to file tax return or pay tax; refunds; hearings and appeals; enforcement of tax liability; duties and powers of city manager; city employee conflicts of interest prohibited. See Code Comparative Table for complete derivation."
  },
  {
    "corpus": "BRC",
    "title": "3",
    "title_name": "Revenue and Taxation",
    "chapter": "5",
    "chapter_name": "Tax Refund Program",
    "anchor": "3-5-1",
    "heading": "Legislative Intent.",
    "verbatim": "3-5-1. Legislative Intent.\nThe purpose of this chapter is to make refunds of estimated sales tax on the purchase of food to certain qualifying families and individuals with lower incomes in order to make more equitable the burden placed upon them by city sales taxes.\nOrdinance Nos. 5554 (1993); 8364 (2019)"
  },
  {
    "corpus": "BRC",
    "title": "3",
    "title_name": "Revenue and Taxation",
    "chapter": "5",
    "chapter_name": "Tax Refund Program",
    "anchor": "3-5-2",
    "heading": "Definitions.",
    "verbatim": "3-5-2. Definitions.\nThe following terms used in this chapter have the following meanings unless the context clearly indicates others:\nPerson with a disability means a person receiving Supplemental Security Income or Social Security Disability Income or who can produce a letter from a physician stating that the individual has a disability as defined by the federal Americans with Disabilities Act.\nFamily is defined in Section 3-1-1, \"Definitions,\" B.R.C. 1981.\nIncome means total income and is found on the following tax forms in the following places:\nOrdinance Nos. 5554 (1993); 7177 (2002); 8364 (2019)"
  },
  {
    "corpus": "BRC",
    "title": "3",
    "title_name": "Revenue and Taxation",
    "chapter": "5",
    "chapter_name": "Tax Refund Program",
    "anchor": "3-5-3",
    "heading": "Qualifications for Tax Refund.",
    "verbatim": "3-5-3. Qualifications for Tax Refund.\nEvery person desiring to claim a tax refund shall submit to the city manager a verified, written application therefor signed under oath, on the form specified by the city manager and with the attachments required by the city manager, and filed at such place and time as designated by the city manager. Each applicant must satisfy the following qualifications to be entitled to a refund in the amount provided in this chapter:\n(a)\tThe applicant must be one of the following categories of families or individuals:\n(1)\tA family at least one of the members of which is a child under the age of eighteen who is the son or daughter of one of the other persons who is:\n(A)\tClaiming the dependent deduction on his or her tax return as set forth on I.R.S. Form 1040, Section 6c, \"Exemptions,\" or I.R.S. Form 1040NR, Section 7c, \"Dependents;\" or\n(B)\tFiling Head of Household status with the I.R.S. if applicant is unmarried and pays more than 50% of the cost of upkeep for a home with children under 18; or\n(2)\tA person with a disability or over the age of sixty-one and who is not a member of a family which has applied or which subsequently applies for a refund for the same year. For purposes of this section, Person with a disability means a person receiving Supplemental Security Income or Social Security Disability Income or who can produce a letter from a physician stating that the individual has a disability as defined by the federal Americans with Disabilities Act.\n(b)\tThe applicant must have been a resident of the city of Boulder during the entire year for which the refund application is made. Individuals experiencing homelessness can meet this residency requirement by providing documentation that they are receiving services from a city-recognized homelessness services agency.\n(c)\tThe applicant's income during the year for which the refund is requested must be no greater than fifty percent of the Area Median Income for Boulder County by family size, as published by the United States Department of Housing and Urban Development or its successor agency, for such year. For purposes of this requirement, income is the total income found on the following tax forms in the following places:\nOrdinance Nos. 4812 (1984); 4897 (1985); 4971 (1986); 5470 (1992); 5554 (1993); 7177 (2002); 7202 (2002); 8364 (2019); 8563 (2023); 8682 (2025)"
  },
  {
    "corpus": "BRC",
    "title": "3",
    "title_name": "Revenue and Taxation",
    "chapter": "5",
    "chapter_name": "Tax Refund Program",
    "anchor": "3-5-4",
    "heading": "Refund Amount.",
    "verbatim": "3-5-4. Refund Amount.\n(a)\tIf the applicant meets the requirements for a refund as set forth in this chapter, the city manager shall refund, for calendar year 2018, $83 per individual and $253 per family.\n(b)\tFor each calendar year after 2018, the city manager shall also adjust the refund amounts set forth above in accordance with the change in the cost of living for the previous calendar year. The index used for such adjustment shall be as shown in the \"all items\" category of the United States Department of Labor Consumer Price Index for All Urban Consumers for the metropolitan statistical area which includes the city. In the event that either of these data have not been published as of the start of the refund program during any particular year, then for the refund program during that year, the city manager shall adjust the income levels, or the refund amounts, based on the city manager's best estimate of the unknown data, but the city manager shall take the subsequently published data, rather than the estimated data, into account in setting the qualifying income levels or refund amounts for the refund program for the following year.\nOrdinance Nos. 4897 (1985); 4971 (1986); 5043 (1987); 5115 (1988); 5185 (1989); 5283 (1990); 5385 (1991); 5470 (1992); 5554 (1993); 7177 (2002); 8364 (2019); 8563 (2023)"
  },
  {
    "corpus": "BRC",
    "title": "3",
    "title_name": "Revenue and Taxation",
    "chapter": "5",
    "chapter_name": "Tax Refund Program",
    "anchor": "3-5-5",
    "heading": "Administration of Chapter.",
    "verbatim": "3-5-5. Administration of Chapter.\n(a)\tThe city manager shall administer the program established by this chapter and may prepare a refund application form, specifying attachments, such as, without limitation, income tax forms and other proof of income and residency, adjust qualifying income levels and refund amounts, adopt rules and regulations consistent with the provisions of this chapter, and audit and verify the applications submitted pursuant to this chapter. The city manager shall provide public notice of the tax refund application period annually, at least two weeks before it starts.\n(b)\tAny refund application form shall require the claimant to verify and sign the application under oath. Any applicant who receives a refund based upon information provided by the applicant that is materially incorrect shall, within fifteen days of the mailing by first class mail or at the electronic mail address provided by the business for electronic tax filings of a written demand therefor from the city manager, repay the city the full amount of any excess refund that was based on this incorrect information, together with a penalty. The penalty shall be interest at the rate of eighteen percent per annum on the excess refund from the date the city paid the applicant the refund to the date the excess refund is repaid to the city.\n(c)\tThe burden of proving entitlement to a tax refund under this chapter is on the applicant. The city manager may require reasonable information to support the refund application, as long as such information is uniformly required of all similarly situated applicants. Upon audit, the city manager may require all reasonable information necessary to support the claim of tax refund.\n(d)\tIf the city manager denies any claim for tax refund, the city manager shall state the reasons therefor in writing to the claimant and indicate all or the portion of the claim that is being denied. If a claimant wishes to appeal the decision of the program administrator, the claimant must do so in writing within fourteen days of the date of mailing of the notice of denial. The claimant shall be thereupon entitled to a hearing before the city manager to appeal the decision of the director, under the procedures established pursuant to this title.\nOrdinance Nos. 5052 (1987); 5554 (1993); 7177 (2002); 8364 (2019); 8434 (2020); 8563 (2023)"
  },
  {
    "corpus": "BRC",
    "title": "3",
    "title_name": "Revenue and Taxation",
    "chapter": "6",
    "chapter_name": "Occupation Tax on Local Exchange Telephone Service Suppliers",
    "anchor": "3-6-1",
    "heading": "Application of Chapter.",
    "verbatim": "3-6-1. Application of Chapter.\nA tax is levied by this chapter upon the services of any local exchange telephone service supplier provided in the city."
  },
  {
    "corpus": "BRC",
    "title": "3",
    "title_name": "Revenue and Taxation",
    "chapter": "6",
    "chapter_name": "Occupation Tax on Local Exchange Telephone Service Suppliers",
    "anchor": "3-6-2",
    "heading": "Definitions.",
    "verbatim": "3-6-2. Definitions.\nThe following words and phrases as used in this chapter shall have the following meanings:\nAnnual line count means the total number of lines having service addresses located within the city for which each provider subject to this chapter provided basic local exchange service as of the last business day of November of each year.\nBasic local exchange service means basic local exchange service or basic service authorized, by a certificate of public convenience and necessity, or otherwise, under title 40, article 15, C.R.S., as amended or recodified from time to time.\nInhabitant means any person residing or having a place of business within the city.\nLine means a separate telephone number or telephone circuit identification number provided to an inhabitant at retail, having a service address located within the city except that, to the extent that a provider provides basic local exchange service through trunks, a line means an individual circuit, or its functional equivalent, provided to a customer at retail.\nNew basic local exchange service provider ornew provider means any company or entity other than the incumbent provider who enters the business of providing basic local exchange service.\nProvider means a person providing basic local exchange service, through use of its own or leased facilities, through resale, or through any combination thereof.\nOrdinance No. 8563 (2023)"
  },
  {
    "corpus": "BRC",
    "title": "3",
    "title_name": "Revenue and Taxation",
    "chapter": "6",
    "chapter_name": "Occupation Tax on Local Exchange Telephone Service Suppliers",
    "anchor": "3-6-3",
    "heading": "Tax Levied; Amount.",
    "verbatim": "3-6-3. Tax Levied; Amount.\n(a)\tThere is levied on and against each provider operating in the city a tax on the occupation and business of providing local exchange service at retail to inhabitants of the city.\n(b)\tThe annual amount and payment rates and times of the tax shall be as follows:\n(1)\tAll providers shall pay a tax of up to a total of $768,000 per year.\n(2)\tThe tax shall be determined by dividing $768,000 by the annual line count, determined under this chapter, and multiplying the result by the number of lines the provider provides within the city. Expressed as a formula, the calculation shall be as follows:\n($768,000 ÷ annual line count) x provider lines = provider tax\n(3)\tThe tax levied against each provider shall be calculated by the city manager by the last business day of November, shall be effective on the first calendar day of the immediately following year, and shall be paid in full on or before February 20 of that year. The city manager shall promptly notify each provider of its annual tax and of its monthly amount for the next calendar year.\n(4)\tEach new provider that first becomes subject to this chapter prior to the last business day of November during any calendar year shall file its initial annual report of its line count as required by Section 3-6-5, \"Initial and Annual Reports,\" B.R.C. 1981, and start to pay the tax during the next calendar year. Any new provider that first becomes subject to this chapter after the last business day of November of any year shall file its initial report on the last business day of November of the next year and start to pay the tax during the calendar year immediately following that date."
  },
  {
    "corpus": "BRC",
    "title": "3",
    "title_name": "Revenue and Taxation",
    "chapter": "6",
    "chapter_name": "Occupation Tax on Local Exchange Telephone Service Suppliers",
    "anchor": "3-6-4",
    "heading": "Schedule of Payment.",
    "verbatim": "3-6-4. Schedule of Payment.\nExcept as this chapter may otherwise provide, the tax for each year shall be due and payable in full on or before February 20 of the following year.\nOrdinance No. 8563 (2023)"
  },
  {
    "corpus": "BRC",
    "title": "3",
    "title_name": "Revenue and Taxation",
    "chapter": "6",
    "chapter_name": "Occupation Tax on Local Exchange Telephone Service Suppliers",
    "anchor": "3-6-5",
    "heading": "Initial and Annual Reports.",
    "verbatim": "3-6-5. Initial and Annual Reports.\nOn the last business day of November of each calendar year, each provider then subject to this chapter shall determine its total number of lines within the city, and file with the city manager a statement reporting its determined total number of lines. All statements shall be in such form as the city manager may require, including oaths, verifications or acknowledgments. These reports and each provider's tax returns shall be preserved as provided in this title.\nOrdinance No. 8563 (2023)"
  },
  {
    "corpus": "BRC",
    "title": "3",
    "title_name": "Revenue and Taxation",
    "chapter": "6",
    "chapter_name": "Occupation Tax on Local Exchange Telephone Service Suppliers",
    "anchor": "3-6-6",
    "heading": "Tax Reported to Inhabitants.",
    "verbatim": "3-6-6. Tax Reported to Inhabitants.\nEach provider may separately state on each inhabitant's bill for basic local exchange service the proportionate share of the provider's liability imposed pursuant to this chapter. If the provider's service is regulated by the Colorado Public Utility Commission, such reporting of the tax to the inhabitant shall be in accordance with an applicable tariff approved by the Commission."
  },
  {
    "corpus": "BRC",
    "title": "3",
    "title_name": "Revenue and Taxation",
    "chapter": "6",
    "chapter_name": "Occupation Tax on Local Exchange Telephone Service Suppliers",
    "anchor": "3-6-7",
    "heading": "Failure to Pay; Penalty; City Action to Collect.",
    "verbatim": "3-6-7. Failure to Pay; Penalty; City Action to Collect.\nIf any provider subject to the provisions of this chapter fails to pay the tax imposed within the time prescribed, the penalty in the amount of fifteen percent of the amount of the tax is due and payable in addition to such tax. Interest at the rate of twelve percent annually shall be due and payable on all amounts past due plus the amount of the penalty until the date that payment of the tax, penalty and interest is made. Absent compromise, the city attorney may commence and prosecute to final judgment an action at law to collect the debt."
  },
  {
    "corpus": "BRC",
    "title": "3",
    "title_name": "Revenue and Taxation",
    "chapter": "6",
    "chapter_name": "Occupation Tax on Local Exchange Telephone Service Suppliers",
    "anchor": "3-6-8",
    "heading": "Inspection of Records.",
    "verbatim": "3-6-8. Inspection of Records.\nTo enforce this chapter, the city and its officers, agents or representatives including, without limitation, the city manager shall have the right, at all reasonable hours and times, to examine and copy the books and records of every provider subject to this chapter. The city shall use these books and records and copies only to enforce this chapter. Except under a court order, or in connection with enforcing this chapter, the city shall not divulge these books, records or copies to any other person."
  },
  {
    "corpus": "BRC",
    "title": "3",
    "title_name": "Revenue and Taxation",
    "chapter": "6",
    "chapter_name": "Occupation Tax on Local Exchange Telephone Service Suppliers",
    "anchor": "3-6-9",
    "heading": "Tax Not on Interstate Commerce; Not a Franchise.",
    "verbatim": "3-6-9. Tax Not on Interstate Commerce; Not a Franchise.\nThe tax provided in this chapter is upon occupations and businesses in the performance of local functions and is not a tax upon functions relating to interstate commerce. None of the terms of this chapter mean that the city has granted any provider a franchise."
  },
  {
    "corpus": "BRC",
    "title": "3",
    "title_name": "Revenue and Taxation",
    "chapter": "6",
    "chapter_name": "Occupation Tax on Local Exchange Telephone Service Suppliers",
    "anchor": "3-6-10",
    "heading": "Tax in Lieu of Certain Other Consideration.",
    "verbatim": "3-6-10. Tax in Lieu of Certain Other Consideration.\nThe tax levied in this chapter is in lieu of all other occupation taxes on any provider subject to this chapter. It is in addition to any otherwise applicable ad valorem taxes and other taxes and fees."
  },
  {
    "corpus": "BRC",
    "title": "3",
    "title_name": "Revenue and Taxation",
    "chapter": "6",
    "chapter_name": "Occupation Tax on Local Exchange Telephone Service Suppliers",
    "anchor": "3-6-11",
    "heading": "Violation of Section 3-6-5, Penalty.",
    "verbatim": "3-6-11. Violation of Section 3-6-5, Penalty.\nIt shall be unlawful to fail to make the reports required by this chapter. Upon conviction of violation of such section, the municipal court shall punish any officer, agent or manager of a provider to this chapter who fails, neglects or refuses to make or file the annual statement of accounts provided in this chapter by a fine between $25 and $500. Each day after the statement becomes delinquent during which the officer, agent or manager so fails, neglects or refuses to make and file such statement is a separate and distinct offense.\nOrdinance No. 8563 (2023)"
  },
  {
    "corpus": "BRC",
    "title": "3",
    "title_name": "Revenue and Taxation",
    "chapter": "6",
    "chapter_name": "Occupation Tax on Local Exchange Telephone Service Suppliers",
    "anchor": "3-6-12",
    "heading": "Enforcement of Tax Liability.",
    "verbatim": "3-6-12. Enforcement of Tax Liability.\n(a)\tThe occupation tax imposed by this chapter is a first and prior lien on tangible personal property in which the person responsible to remit the tax has an ownership interest, subject only to valid mortgages or other liens of record at the time of and prior to the recording of notice of tax lien as provided in subsection 3-2-27(c), B.R.C. 1981.\n(b)\tThe provisions of sections 3-2-27, \"Tax Constitutes Lien,\" 3-2-29, \"Sale of Business Subject to Lien,\" 3-2-30, \"Certificate of Discharge of Lien,\" 3-2-31, \"Jeopardy Assessment,\" 3-2-32, \"Enforcing the Collection of Taxes Due (Applies to Entire Title),\" 3-2-33, \"Recovery of Unpaid Tax by Action at Law,\" 3-2-34, \"City May Be a Party Defendant,\" 3-2-35, \"Injunctive Relief,\" 3-2-36, \"Obligations of Fiduciaries and Others,\" and 3-2-38, \"Limitations,\" B.R.C. 1981, providing for enforcement of collection of taxes due, govern the authority of the city manager to collect the occupation tax imposed under this chapter."
  },
  {
    "corpus": "BRC",
    "title": "3",
    "title_name": "Revenue and Taxation",
    "chapter": "6",
    "chapter_name": "Occupation Tax on Local Exchange Telephone Service Suppliers",
    "anchor": "3-6-13",
    "heading": "Offenses and Liabilities to Continue.",
    "verbatim": "3-6-13. Offenses and Liabilities to Continue.\nAll offenses committed and all tax liabilities incurred before amendment of this chapter, under prior versions of the telephone utility preparation tax, shall be and remain unconditionally due and payable, shall constitute a debt to the city, and shall be treated as though all prior applicable ordinances and amendments thereto were in full force and effect."
  },
  {
    "corpus": "BRC",
    "title": "3",
    "title_name": "Revenue and Taxation",
    "chapter": "7",
    "chapter_name": "Occupation Tax",
    "anchor": "3-7-1",
    "heading": "Legislative Intent.",
    "verbatim": "3-7-1. Legislative Intent.\nThe purpose of this chapter is to impose an occupation tax upon persons engaged in the business of manufacture or sale of malt, vinous or spirituous liquor or fermented malt beverages in the city."
  },
  {
    "corpus": "BRC",
    "title": "3",
    "title_name": "Revenue and Taxation",
    "chapter": "7",
    "chapter_name": "Occupation Tax",
    "anchor": "3-7-2",
    "heading": "Imposition and Rate of Tax.",
    "verbatim": "3-7-2. Imposition and Rate of Tax.\n(a)\tNo person licensed to sell malt, vinous or spirituous liquor or fermented malt beverage in the city shall fail to pay to the city manager an occupation tax upon the business of selling malt, vinous or spirituous liquors or fermented malt beverages according to the following schedule:\n(1)\tThe holder of a malt, vinous or spirituous liquor license shall pay an annual occupation tax as follows:\n(A)\tRetailer liquor store license $988.50\n(B)\tLiquor-licensed drugstore 988.50\n(C)\tBeer and wine license 1,085.00\n(D)\tHotel and restaurant license 3,253.00\n(E)\tBrew pub license 3,253.00\n(F)\tTavern license 3,253.00\n(G)\tClub license 1,284.00\n(H)\tArts license 1,284.00\n(I)\tRace track license 2,957.50\n(J)\tVintner's restaurant 3,253.00\n(K)\tDistillery pubs 3,253.00\n(L)\tLodging facility 3,253.00\n(M)\tEntertainment facility 3,253.00\n(N)\tResort complex 3,253.00\n(2)\tA fermented malt beverages licensee shall pay an annual occupation tax as follows:\n(A)\tConsumption on the premises $400.00\n(B)\tConsumption off the premises 275.00\n(b)\tThe occupation tax is due and payable to the city manager for each year for which a license has been obtained on the first day of January of each year, or as soon thereafter as the license is issued. If the city manager issues a beverage license for less than a full year, the manager shall prorate the occupation tax on the number of whole months remaining in the year. If a license under this chapter is issued for any applicant who previously paid an occupation tax for the current year for the exercise of a fermented malt beverage or liquor license, the manager shall prorate the tax and credit it to the new occupation tax applicable to the new license after the licensee surrenders the old license.\n(c)\tNo delinquency in the payment of the occupation tax imposed by this section is a ground for suspension or revocation of a fermented malt beverage or liquor license issued by the city or state.\n(d)\tNo person shall operate any malt, vinous or spirituous liquor or fermented malt beverage establishment in the city unless such person has paid the appropriate occupation tax. Each day of operation in violation of this subsection constitutes a separate offense.\n(e)\tAny person obligated to pay the tax imposed by this chapter may elect to pay the occupation tax in installments, one-half of the tax on or before January 1 of the year for which the tax is due and the remaining one-half on or before July 1 of the same year.\nOn any new license issued after January 1 but prior to July 1, such person may also make such an election.\n(f)\tIf a person obligated to pay the tax imposed by this chapter goes out of business or otherwise intends not to make use of its city or state license and so certifies to the city manager under oath, the manager shall refund a prorated amount of the occupation tax previously paid attributable to the time that the license will be unused, at the rate of one-twelfth of the fee for each whole month remaining in the year. No person shall make a false statement on such certificate.\n(g)\tPayment of $295.50 of the occupation tax for a license that did not possess an extended hours license as of June 30, 1997, shall be waived if the licensee submits an annual notarized statement to the city manager that malt, vinous or spirituous liquor has not and will not be sold during the hours from 8:00 p.m. to 2:00 a.m. on Sundays and on Christmas Day.\nOrdinance Nos. 5425 (1991); 5835 (1996); 5899 (1997); 8223 (2018); 8284 (2018); 8676 (2025)"
  },
  {
    "corpus": "BRC",
    "title": "3",
    "title_name": "Revenue and Taxation",
    "chapter": "7",
    "chapter_name": "Occupation Tax",
    "anchor": "3-7-3",
    "heading": "Reserved.",
    "verbatim": "3-7-3. Reserved.\nEditor's note(s)—Ord. No. 8237, § 2, adopted February 6, 2018, effective March 8, 2018, repealed § 3-7-3, which pertained to enforcement of tax liability. See Code Comparative Table for complete derivation."
  },
  {
    "corpus": "BRC",
    "title": "3",
    "title_name": "Revenue and Taxation",
    "chapter": "8",
    "chapter_name": "Development Excise Tax",
    "anchor": "3-8-1",
    "heading": "Purpose and Legislative Intent.",
    "verbatim": "3-8-1. Purpose and Legislative Intent.\n(a)\tPurpose: The purpose of this chapter is to impose a development excise tax on persons engaged in nonresidential and residential development in the city to fund the costs of growth related capital improvements for transportation. City council intends that the combined tax for transportation continue to serve the purposes originally set forth for the two revenue sources.\n(b)\tLegislative Intent: The city council recites the following legislative findings and statements of intent that were taken into consideration in the adoption of this chapter:\n(1)\tPrior to 1998, the city collected development-related fees and taxes for public services, including parks and recreation, transportation, human services, municipal facilities, libraries, fire and police facilities, through a development excise tax, a transportation excise tax and a park land acquisition and development fee, to help ensure that new development pay for its growth-related impacts on public facilities.\n(2)\tIn 1998, under a ballot measure in Ordinance No. 6019, the voters authorized the city council to repeal the city's transportation excise tax and park land acquisition and development fee and consolidate them into the development excise tax.\n(3)\tThe 1998 ballot measure was based in part from the recommendations in a study entitled \"Development Excise Tax, Boulder, Colorado - July 29, 1996,\" prepared by Tischler & Associates, consultants with expertise in fiscal impact analysis, capital facilities analysis and growth policy planning.\n(4)\tThe city council stated its intent in Ordinance No. 6019 that the allocation of the funds from the development excise tax could be changed at any time and the ballot measure stated that the proceeds from the authorized tax could be collected and spent without limitation.\n(5)\tTischlerBise, a fiscal, economic and planning consulting firm, updated the 1996 study which provides the basis for the transportation and park land acquisition excise taxes of this chapter, entitled \"Development Excise Tax Study, City of Boulder Colorado - Jan. 9, 2009.\"\n(6)\tTischlerBise also completed an updated 1996 study which provides the basis for the development impact fees that are in chapter 8-9, \"Capital Facility Impact Fee,\" B.R.C. 1981, which is entitled \"Development Impact Fee Study, City of Boulder Colorado - Jan. 9, 2009.\"\n(7)\tTischlerBise updated the 2009 study which provides the basis for the transportation excise tax of this chapter, entitled \"2016 Transportation Development Excise Tax Study, City of Boulder Colorado - Sept. 20, 2016.\"\n(8)\tTischlerBise also updated 2009 study which provides the basis for the development fees that are in Chapter 8-9, \"Capital Facility Impact Fee,\" B.R.C. 1981, which is entitled \"2016 Capital Facility Development Impact Fee Study, City of Boulder Colorado - Sept. 20, 2016\" and \"2016 Transportation Development Impact Fee Study, City of Boulder Colorado - Sept. 20, 2016.\"\n(9)\tThe city council intends that the taxes collected pursuant to this chapter and Chapter 8-9, \"Capital Facility Impact Fees\" will recover a portion of the costs related to the capital facilities' needs associated with nonresidential and residential development for transportation, park land acquisition, police, fire, human service, parks and recreation and municipal services.\n(10)\tThe development excise tax applies regardless of the value of the property developed. The development excise tax shall be imposed in addition to the capital facility impact fees imposed by Chapter 8-9 and water, sanitary sewer and stormwater and flood management plant investment fees imposed by Sections 11-1-52, \"Water Plant Investment Fee,\" 11-2-33, \"Wastewater Plant Investment Fee,\" and 11-5-11, \"Stormwater and Flood Management Utility Plant Investment Fee,\" B.R.C. 1981, or any other fees, taxes, or charges of the city.\nOrdinance Nos. 5216 (1989); 7144 (2001); 7698 (2009); 8152 (2017); 8323 (2019); 8617 (2024)"
  },
  {
    "corpus": "BRC",
    "title": "3",
    "title_name": "Revenue and Taxation",
    "chapter": "8",
    "chapter_name": "Development Excise Tax",
    "anchor": "3-8-2",
    "heading": "Development Excise Tax Imposed on Nonresidential and Residential Development of Developed Land.",
    "verbatim": "3-8-2. Development Excise Tax Imposed on Nonresidential and Residential Development of Developed Land.\n(a)\tNonresidential and Residential Development: No person engaged in nonresidential or residential development in the city shall fail to pay the development excise tax in the amounts specified in Section 3-8-3, \"Tax Imposed on Nonresidential and Residential Development,\" B.R.C. 1981, prior to the scheduling of final building inspection for new structures or buildings and at the time of building permit issuance for all other types of development in addition to any other fee, tax, or charge required by this code or any other ordinance of the city.\n(b)\tDefinitions: For purposes of this chapter:\nAccessory use means a portion of developed property that is incidental to but a necessary part of the principal development, which is operated for the benefit and convenience of the occupants, employees, and customers of or visitors to the principal development and which is served by any utility for the principal development.\nDevelopment and developed property mean the construction or existence of any structure attached to real property.\nFloor area means the total square footage of all levels included within the outside walls of a building or portion thereof, but excluding courts, garages useable exclusively for the storage of motor vehicles and uninhabitable areas that are located above the highest inhabitable level or below the first floor level.\nNonresidential development means the principal use of developed property as other than a single-unit or multiunit dwelling and includes, without limitation, motels, hotels, resorts, and bed and breakfasts.\nPermanently affordable unit means a dwelling unit that is defined as a permanently affordable unit in Section 9-16-1, \"General Definitions,\" B.R.C. 1981.\nUninhabitable area means a room that has a six-foot or less floor-to-ceiling height, or a room housing mechanical or electrical equipment that serves the building, with less than three feet of clearance in any dimension between the equipment (except supply and return air ducts and wiring) and the adjacent wall.\n(c)\tMeasurement of Nonresidential Floor Area: No person applying for a building permit for nonresidential development shall fail to provide the city with a floor area measurement of the proposed building signed by a professional engineer or architect licensed by the State of Colorado or in another form acceptable to the city manager at the time of such application. If both nonresidential and residential developments exist within a particular developed property, the floor area measurement shall specify the amount of floor area dedicated to nonresidential development, and the tax imposed by this chapter shall be apportioned according to such measurement. The rate of tax for each accessory use shall be the same as that for the principal development to which the accessory use is related.\nOrdinance Nos. 5150 (1988); 5196 (1989); 5216 (1989); 7144 (2001); 7698 (2009)"
  },
  {
    "corpus": "BRC",
    "title": "3",
    "title_name": "Revenue and Taxation",
    "chapter": "8",
    "chapter_name": "Development Excise Tax",
    "anchor": "3-8-3",
    "heading": "Tax Imposed on Nonresidential and Residential Development.",
    "verbatim": "3-8-3. Tax Imposed on Nonresidential and Residential Development.\n(a)\tTax Rate: No person engaged in nonresidential or residential development in the city shall fail to pay a development excise tax thereon according to the following rates:\n(1)\tFor new or additional floor area for nonresidential development per square foot of floor area:\n(2)\tFor new detached dwelling unit:\n(3)\tFor new attached dwelling unit or mobile home:\n(b)\tWaiver of Tax Imposed on Annexation of Developed Residential Land: For property annexed with existing residential development, the tax imposed by this chapter is prorated in accordance with the following formula: one twenty-sixth of the applicable tax is waived for each full year the residence existed prior to July 17, 1988. The date on which residential development existed for determination of the waiver is the date of the issuance by Boulder County of a certificate of occupancy for the structure.\nOrdinance Nos. 5366 (1991); 7008 (1999); 7087 (2000); 7168 (2001); 7240 (2002); 7329 (2003); 7406 (2004); 7439 (2005); 7495 (2006); 7564 (2007); 7629 (2008); 7698 (2009); 7874 (2012); 7945 (2013); 8004 (2014); 8088 (2016); 8147 (2017); 8152 (2017); 8213 (2017); 8291 (2018); 8355 (2019); 8429 (2021); 8508 (2021); 8538 (2023); 8598 (2024); 8656 (2025)"
  },
  {
    "corpus": "BRC",
    "title": "3",
    "title_name": "Revenue and Taxation",
    "chapter": "8",
    "chapter_name": "Development Excise Tax",
    "anchor": "3-8-4",
    "heading": "Development Excise Tax on Redevelopment.",
    "verbatim": "3-8-4. Development Excise Tax on Redevelopment.\nWhenever existing developed property in the city is redeveloped, no person shall fail to pay the development excise tax imposed by Section 3-8-3, \"Tax Imposed on Nonresidential and Residential Development,\" B.R.C. 1981, for the net increase in floor area or number of dwelling units prior to obtaining a building permit."
  },
  {
    "corpus": "BRC",
    "title": "3",
    "title_name": "Revenue and Taxation",
    "chapter": "8",
    "chapter_name": "Development Excise Tax",
    "anchor": "3-8-5",
    "heading": "Development Excise Tax to Be Revised.",
    "verbatim": "3-8-5. Development Excise Tax to Be Revised.\nIn 2000, and every year thereafter, the development excise tax imposed by this chapter shall be recomputed by raising or lowering it in an amount equal to the percentage of change for the preceding year in the consumer price index (all items) of the U.S. Department of Labor, Bureau of Labor and Statistics for the statistical area which includes the city."
  },
  {
    "corpus": "BRC",
    "title": "3",
    "title_name": "Revenue and Taxation",
    "chapter": "8",
    "chapter_name": "Development Excise Tax",
    "anchor": "3-8-6",
    "heading": "Development Excise Tax Revenues to Be Earmarked.",
    "verbatim": "3-8-6. Development Excise Tax Revenues to Be Earmarked.\nThe city council hereby delegates to the city manager the duty to reflect the historical allocation of the recodified development excise tax in each annual budget. The funds collected will be allocated to the transportation development fund, which shall be exclusively for the purpose of constructing growth-related transportation capital improvements and collection and administration of the tax.\nOrdinance Nos. 7698 (2009); 8152 (2017)"
  },
  {
    "corpus": "BRC",
    "title": "3",
    "title_name": "Revenue and Taxation",
    "chapter": "8",
    "chapter_name": "Development Excise Tax",
    "anchor": "3-8-7",
    "heading": "Development Excise Tax Credit.",
    "verbatim": "3-8-7. Development Excise Tax Credit.\n(a)\tCapital Improvements: The city council may grant a development excise tax credit to a taxpayer on any or all of the tax imposed by this chapter if the city council, after receiving a recommendation from the city manager, finds that the taxpayer has agreed to make and dedicate to the city any police, fire, human services or municipal offices capital improvements beyond those required by any provision of this code that would benefit the public at large to the same degree as collection of the tax, and that granting the credit will not result in a substantial increase in the city's costs of providing capital improvements in the future. The amount of the credit shall be equal to the cost of such improvements to the taxpayer, as determined by the city manager, and in no event shall the credit be greater than the amount of development excise tax that would be due on the property. No certificate of occupancy, temporary or otherwise, shall be issued for the property until such improvements have been completed to the satisfaction of the city manager and dedicated to the city, or a financial guarantee in a form allowed under Section 9-12-13, \"Sub-divider Financial Guarantees,\" B.R.C. 1981, and in an amount sufficient to secure the full costs, as determined by the city manager, of constructing or installing the improvements, has been provided by the developer.\n(b)\tTransportation Improvements: The city council may grant a development excise tax credit to a taxpayer on any or all of the tax imposed by this chapter and deposited in the transportation development fund if the city council, after reviewing a recommendation from the city manager, finds that such a credit is in the public interest. In making this determination, the council shall consider whether such improvements to be constructed by a developer are consistent with the ultimate configuration of the Transportation Master Plan for the Boulder Valley and do not solely benefit the private interests of the specific development project. No certificate of occupancy, temporary or otherwise, shall be issued for the property until such improvements have been completed to the satisfaction of the city manager and dedicated to the city, or a financial guarantee in a form allowed under Section 9-12-13, \"Sub-divider Financial Guarantees,\" B.R.C. 1981, and in an amount sufficient to secure the full costs, as determined by the city manager, of constructing or installing the improvements, has been provided by the developer. The amount of the credit shall be based on reasonable project costs for constructing the improvement. The amount of the credit shall not exceed the total transportation excise tax owed to the city.\n(c)\tAffordable Housing, Facilities Serving the General Public and Urban Renewal Areas: The city council may grant a development excise tax credit to a taxpayer on any or all of the tax imposed by this chapter if the city council finds the public interest is adequately served and the waiver or reduction is intended to assist in the provision of affordable housing or facilities serving the general public or in order to promote development in an urban renewal area established under state law. Any such decision by the city council to grant a development excise tax credit is at its discretion and is legislative in nature.\n(d)\tWaiver of Tax for Permanently Affordable Housing: The development excise tax does not apply to those permanently affordable units that are provided on site within a single development that are in excess of the number of units required by Chapter 9-13, \"Inclusionary Housing,\" B.R.C. 1981. In addition, for every permanently affordable unit provided on site within a single development in excess of the number required by Chapter 9-13, \"Inclusionary Housing,\" B.R.C. 1981, the development excise tax will be waived for one of the permanently affordable dwelling units required by Chapter 9-13, \"Inclusionary Housing,\" B.R.C. 1981. This waiver applies only if the entire inclusionary housing requirement for the development is constructed on the site within a single development.\n(e)\tBusiness Incentive Rebates: The city manager may grant rebates of development excise taxes paid by primary employers in connection with equipment acquisition, construction projects, construction equipment and construction materials when, in the judgment of the city manager, the rebate will serve the economic interests of the city by helping attract or retain a primary employer which contributes to a socially, environmentally and economically sustainable community.\nOrdinance Nos. 5216 (1989); 7144 (2001); 7478 (2006); 7554 (2007); 7639 (2009); 7698 (2009); 7701 (2010); 8152 (2017); 8617 (2024)"
  },
  {
    "corpus": "BRC",
    "title": "3",
    "title_name": "Revenue and Taxation",
    "chapter": "8",
    "chapter_name": "Development Excise Tax",
    "anchor": "3-8-8",
    "heading": "Collection of Unpaid Taxes.",
    "verbatim": "3-8-8. Collection of Unpaid Taxes.\nUnpaid development excise taxes constitute a lien on the property. Any promise to pay such tax is a covenant running with the land enforceable against the personal representatives, heirs, successors and assigns of the property owner. In addition to other collection remedies, the city manager may certify due and unpaid development excise taxes to the Boulder County Treasurer for collection in the same manner as general property taxes are collected as provided in section 2-2-12, \"City Manager May Certify Taxes, Charges and Assessments to County Treasurer for Collection,\" B.R.C. 1981."
  },
  {
    "corpus": "BRC",
    "title": "3",
    "title_name": "Revenue and Taxation",
    "chapter": "10",
    "chapter_name": "Trash Tax",
    "anchor": "3-10-1",
    "heading": "Legislative Intent.",
    "verbatim": "3-10-1. Legislative Intent.\nThe purpose of this chapter is to impose a tax upon persons engaged in the business of furnishing trash collection services to the inhabitants and residents of the City. The city council determines and declares that the receipt of trash collection services within the City is the exercise of a taxable privilege. The city council further declares that the purposes of the levy of the taxes imposed by this chapter are for the raising of funds for the payment of the expenses of operating the City, including but not limited to the funding of city waste reduction programs. In accordance with these purposes, all proceeds of the tax shall be placed in and become a part of the general fund of the City.\nOrdinance Nos. 7406 (2004); 7585 (2008)"
  },
  {
    "corpus": "BRC",
    "title": "3",
    "title_name": "Revenue and Taxation",
    "chapter": "10",
    "chapter_name": "Trash Tax",
    "anchor": "3-10-2",
    "heading": "Imposition of Occupation Tax.",
    "verbatim": "3-10-2. Imposition of Occupation Tax.\n(a)\tNo hauler furnishing trash collection services in the City shall fail to pay to the city manager the occupation tax, prescribed by subsection (b) of this section, upon such services.\n(b)\tEvery hauler furnishing trash collection services within the City shall pay occupation tax rates as follows:\n(1)\tPer residential customer: $3.50 per month.\n(2)\tCommercial accounts, including service for residential dumpsters, shall be taxed at $0.85 per cubic yard.\nOrdinance Nos. 5683 (1994); 5940 (1997); 7406 (2004); 7585 (2008); 7678 (2009)"
  },
  {
    "corpus": "BRC",
    "title": "3",
    "title_name": "Revenue and Taxation",
    "chapter": "10",
    "chapter_name": "Trash Tax",
    "anchor": "3-10-3",
    "heading": "Exemptions.",
    "verbatim": "3-10-3. Exemptions.\nHaulers taxed under the provisions of Section 3-10-2, \"Imposition of Occupation Tax,\" B.R.C. 1981, shall be exempt from the payment of the tax otherwise imposed on the furnishing of services for the collection of recyclables and compostables for the expressed purpose of reuse, recycling or composting.\nOrdinance No. 7585 (2008)"
  },
  {
    "corpus": "BRC",
    "title": "3",
    "title_name": "Revenue and Taxation",
    "chapter": "10",
    "chapter_name": "Trash Tax",
    "anchor": "3-10-4",
    "heading": "Voter Approval.",
    "verbatim": "3-10-4. Voter Approval.\nAs part of a ballot question placed before the voters by Ordinance No. 5649 (1994), and approved by them in the November 1994 special municipal election, the City's trash tax was raised to a maximum of $3.50 per month for residential customers and a maximum of $0.85 per cubic yard for commercial customers.\nOrdinance Nos. 7406 (2004); 7585 (2008)"
  },
  {
    "corpus": "BRC",
    "title": "3",
    "title_name": "Revenue and Taxation",
    "chapter": "10",
    "chapter_name": "Trash Tax",
    "anchor": "3-10-5",
    "heading": "Imposition of Excise Tax.",
    "verbatim": "3-10-5. Imposition of Excise Tax.\nRepealed.\nOrdinance No. 5683 (1994)"
  },
  {
    "corpus": "BRC",
    "title": "3",
    "title_name": "Revenue and Taxation",
    "chapter": "10",
    "chapter_name": "Trash Tax",
    "anchor": "3-10-6",
    "heading": "Payment of Tax.",
    "verbatim": "3-10-6. Payment of Tax.\nAny hauler subject to the occupation tax herein levied shall pay the tax at the end of each quarter of a year for every customer receiving trash collection services. Quarterly payments are due on the first day of the months of February, May, August and November of each year.\nOrdinance Nos. 5349 (1990); 7406 (2004); 7585 (2008)"
  },
  {
    "corpus": "BRC",
    "title": "3",
    "title_name": "Revenue and Taxation",
    "chapter": "10",
    "chapter_name": "Trash Tax",
    "anchor": "3-10-7",
    "heading": "Designation of Tax.",
    "verbatim": "3-10-7. Designation of Tax.\nPersons taxed under the provisions of this chapter are hereby authorized to reflect this tax under the title of \"Trash Tax\" on the billing statements of their customers or accounts.\nOrdinance Nos. 7078 (2000); 7406 (2004)"
  },
  {
    "corpus": "BRC",
    "title": "3",
    "title_name": "Revenue and Taxation",
    "chapter": "10",
    "chapter_name": "Trash Tax",
    "anchor": "3-10-8",
    "heading": "Inspection of Records.",
    "verbatim": "3-10-8. Inspection of Records.\nIt shall be the duty of every hauler taxed under the provisions of this title to keep and preserve suitable records and other such books or accounts as may be necessary to determine the amount of tax for the collection of which the person is liable under this chapter. The city manager and agents and representatives thereof are entitled at any reasonable time, upon adequate notice, to examine the books and records of any hauler furnishing trash collection services subject to the tax levied by this chapter and to make copies of the entries or contents thereof.\nOrdinance Nos. 7406 (2004); 7585 (2008)"
  },
  {
    "corpus": "BRC",
    "title": "3",
    "title_name": "Revenue and Taxation",
    "chapter": "10",
    "chapter_name": "Trash Tax",
    "anchor": "3-10-9",
    "heading": "Enforcement of Tax Liability.",
    "verbatim": "3-10-9. Enforcement of Tax Liability.\n(a)\tThe tax imposed by this chapter is a first and prior lien on tangible personal property in which the person responsible to remit the tax has an ownership interest, subject only to valid mortgages or other liens of record at the time of and prior to the recording of notice of tax lien as provided in subsection 3-2-27(c), B.R.C. 1981.\n(b)\tThe provisions of sections 3-2-22, \"Penalties for Failure to File Tax Return or Pay Tax (Applies to Entire Title),\" 3-2-27, \"Tax Constitutes Lien,\" 3-2-29, \"Sale of Business Subject to Lien,\" 3-2-30, \"Certificate of Discharge of Lien,\" 3-2-31, \"Jeopardy Assessment,\" 3-2-32, \"Enforcing the Collection of Taxes Due (Applies to Entire Title),\" 3-2-33, \"Recovery of Unpaid Tax by Action at Law,\" 3-2-34, \"City May Be a Party Defendant,\" 3-2-35, \"Injunctive Relief,\" 3-2-36, \"Obligations of Fiduciaries and Others,\" and 3-2-38, \"Limitations,\" B.R.C. 1981, providing for enforcement of collection of taxes due, govern the authority of the city manager to collect the occupation tax imposed under this chapter.\nOrdinance Nos. 7012 (1999); 7406 (2004); 7585 (2008)"
  },
  {
    "corpus": "BRC",
    "title": "3",
    "title_name": "Revenue and Taxation",
    "chapter": "10",
    "chapter_name": "Trash Tax",
    "anchor": "3-10-10",
    "heading": "Duties and Powers of City Manager.",
    "verbatim": "3-10-10. Duties and Powers of City Manager.\nThe city manager is authorized to adopt rules and regulations necessary in order to interpret or implement the provisions of this chapter.\nOrdinance Nos. 7406 (2004); 7585 (2008)"
  },
  {
    "corpus": "BRC",
    "title": "3",
    "title_name": "Revenue and Taxation",
    "chapter": "12",
    "chapter_name": "Climate Action Plan Excise Tax",
    "anchor": "3-12-1",
    "heading": "Legislative Intent.",
    "verbatim": "3-12-1. Legislative Intent.\nIt is the purpose of this chapter to raise revenue to implement the City's Climate Action Plan, including incentives, services and other assistance to Boulder residents and businesses to improve energy efficiency, expand the use of renewable energy, and take other necessary steps toward reducing local greenhouse gas emissions. Additionally, the city council determines and declares that the consumption of electricity within the City is the exercise of a taxable privilege. The city council further declares that the purpose of the levy of the taxes imposed by this chapter is for the raising of funds for the payment of the expenses incurred to implement the Climate Action Plan; and in accordance with this purpose, all of the proceeds of this excise tax should be placed in and become a part of a separate special revenue fund of the City.\nOrdinance No. 7884 (2012)"
  },
  {
    "corpus": "BRC",
    "title": "3",
    "title_name": "Revenue and Taxation",
    "chapter": "12",
    "chapter_name": "Climate Action Plan Excise Tax",
    "anchor": "3-12-2",
    "heading": "Imposition of Climate Action Plan Excise Tax.",
    "verbatim": "3-12-2. Imposition of Climate Action Plan Excise Tax.\n(a)\tAny person consuming electricity shall pay a Climate Action Plan excise tax at the rate prescribed by subsection (c) of this section, as applicable.\n(b)\tThe Climate Action Plan excise tax shall expire on March 31, 2023.\n(c)\tThe Climate Action Plan excise tax rates shall be:\nOrdinances Nos. 7657 (2009); 7884 (2012); Ord. No. 8097 (2015)"
  },
  {
    "corpus": "BRC",
    "title": "3",
    "title_name": "Revenue and Taxation",
    "chapter": "12",
    "chapter_name": "Climate Action Plan Excise Tax",
    "anchor": "3-12-3",
    "heading": "Exemptions.",
    "verbatim": "3-12-3. Exemptions.\nThe portion of electricity voluntarily purchased as utility provided wind power shall be exempt.\nOrdinance No. 7884 (2012)"
  },
  {
    "corpus": "BRC",
    "title": "3",
    "title_name": "Revenue and Taxation",
    "chapter": "12",
    "chapter_name": "Climate Action Plan Excise Tax",
    "anchor": "3-12-4",
    "heading": "Payment of Tax.",
    "verbatim": "3-12-4. Payment of Tax.\nAny incumbent electricity provider operating within the City pursuant to a franchise or otherwise (\"Provider\") shall bill and collect the Climate Action Plan excise tax and shall remit said tax to the city manager in the manner required by section 3-12-5, \"Payment Schedule, Reporting and Inspection of Records,\" B.R.C. 1981. The tax may be expressly identified on any consumer bills as the \"The City of Boulder Climate Action Plan Excise Tax\" or as the \"Climate Action Plan Tax.\"\nOrdinance No. 7884 (2012)"
  },
  {
    "corpus": "BRC",
    "title": "3",
    "title_name": "Revenue and Taxation",
    "chapter": "12",
    "chapter_name": "Climate Action Plan Excise Tax",
    "anchor": "3-12-5",
    "heading": "Payment Schedule, Reporting, and Inspection of Records.",
    "verbatim": "3-12-5. Payment Schedule, Reporting, and Inspection of Records.\n(a)\tFor the Climate Action Plan excise tax amounts billed pursuant to this chapter, payment shall be made by the Provider in monthly installments not more than thirty days following the close of the month for which payment is to be made. Initial and final payments shall be prorated for the portions of the months at the beginning and end of the term of this excise tax.\n(b)\tIn addition, the Provider shall also submit monthly reports to the city supporting the amount of the Climate Action Plan excise tax remitted for that month including energy use and amounts remitted by sector and Windsource electricity purchases exempted by sector. Electronic or paper reports are acceptable.\n(c)\tIt shall be the duty of the Provider to keep and preserve, for a period of three years, suitable records and other such books or accounts, including, without limitation, original sales and purchase records, as may be necessary to determine the amount of the Climate Action Plan excise tax for the collection of which the Provider is liable under this chapter. The city manager and agents and representatives thereof are entitled at any reasonable time, upon adequate notice, to examine the books and records of the Provider and to make copies of the entries or contents thereof.\nOrdinance No. 7884 (2012)\n3-12-6, 3-12-7. Reserved.\nEditor's note(s)—Ord. No. 8237, § 2, adopted February 6, 2018, effective March 8, 2018, repealed §§ 3-12-6, 3-12-7 which pertained to enforcement of tax liability; duties and powers of city manager. See Code Comparative Table for complete derivation."
  },
  {
    "corpus": "BRC",
    "title": "3",
    "title_name": "Revenue and Taxation",
    "chapter": "13",
    "chapter_name": "Climate Tax",
    "anchor": "3-13-1",
    "heading": "Legislative Purpose, Findings, and Intent.",
    "verbatim": "3-13-1. Legislative Purpose, Findings, and Intent.\n(a)\tPurpose. It is the purpose of this chapter to implement the city's climate tax as a utility occupation tax on the delivery of electricity and natural gas passed by the voters on November 8, 2022.\n(b)\tFindings. The city council finds that:\n(1)\tThe occupation of delivering electricity and natural gas within the city is the exercise of a taxable privilege;\n(2)\tThe city has levied a utility occupation tax on the delivery of electricity and natural gas since 2010;\n(3)\tThe levy of the portion of the climate tax approved by the voters on November 8, 2022, and imposed by this chapter is to provide funding to pay:\n(A)\tCosts of projects, pilots, initiatives, and research that support the city's clean energy goals in the context of the city's racial equity goals;\n(B)\tCosts of programs and services that are part of the partnership with Xcel Energy approved by the voters on November 3, 2020 as ballot issue 2D; and\n(C)\tCosts authorized in the ballot issue approved by the voters.\n(c)\tIntent. The city council intends to use the funds collected pursuant to this tax for general fund purposes to meet the city's climate goals. The city council intends to give full effect to the ballot measures approved by the voters.\n(d)\tUsage of Funds. Funds shall be used as described in the ballot measures related to the Climate Tax, including but not limited to the following purposes:\n(1)\tMaintaining and expanding climate-focused programs and services;\n(2)\tFinancing capital projects and stabilizing the funding for initiatives to meet the city's climate goals, including without limitation reduction of greenhouse gas emission, increasing resilience to climate-driven events;\n(3)\tProviding energy-related assistance to disadvantaged members of the community, including support for utility bill payments and access to renewable energy;\n(4)\tImproving system reliability and modernizing and supporting clean energy-related businesses, including, without limitation, new approaches in electrification of buildings and transportation and enhancement of resilience;\n(5)\tImplementing a partnership agreement with Public Service Company of Colorado; and\n(6)\tIncreasing access to energy efficiency and renewable energy solutions.\nOrdinance No. 8563 (2023)"
  },
  {
    "corpus": "BRC",
    "title": "3",
    "title_name": "Revenue and Taxation",
    "chapter": "13",
    "chapter_name": "Climate Tax",
    "anchor": "3-13-2",
    "heading": "Imposition of Occupation Tax.",
    "verbatim": "3-13-2. Imposition of Occupation Tax.\n(a)\tPayment of Tax Required. No utility delivering electricity and gas to residential, commercial, or industrial customers shall fail to pay to the city manager the utility occupation tax imposed by this chapter.\n(b)\tTax Rate. The utility occupation tax shall be $6,500,000 effective January 1, 2023. The rate of tax due January 1 of 2024 and each year thereafter until December 31, 2040, shall be increased by the percentage change in the United State Bureau of Labor Statistics Consumer Price Index for Denver-Boulder, all items.\nOrdinance No. 8563 (2023)"
  },
  {
    "corpus": "BRC",
    "title": "3",
    "title_name": "Revenue and Taxation",
    "chapter": "13",
    "chapter_name": "Climate Tax",
    "anchor": "3-13-3",
    "heading": "Payment of Tax.",
    "verbatim": "3-13-3. Payment of Tax.\nUtility occupation tax payments shall be remitted to the city manager in equal monthly installments not more than thirty days following the end of each month. The first payment following the November 8, 2022 election shall be due February 20, 2023. Initial and final payments shall be prorated for the portions of the months at the beginning and end of the term of this utility occupation tax.\nOrdinance No. 8563 (2023)"
  },
  {
    "corpus": "BRC",
    "title": "3",
    "title_name": "Revenue and Taxation",
    "chapter": "13",
    "chapter_name": "Climate Tax",
    "anchor": "3-13-4",
    "heading": "Designation of Tax.",
    "verbatim": "3-13-4. Designation of Tax.\nPersons taxed under the provisions of this chapter are hereby authorized to reflect this tax under the title of \"Climate Tax.\"\nOrdinance No. 8563 (2023)"
  },
  {
    "corpus": "BRC",
    "title": "3",
    "title_name": "Revenue and Taxation",
    "chapter": "13",
    "chapter_name": "Climate Tax",
    "anchor": "3-13-5",
    "heading": "Tax not on Interstate Commerce; not a Franchise.",
    "verbatim": "3-13-5. Tax not on Interstate Commerce; not a Franchise.\nThe tax provided in this chapter is upon occupations and businesses in the performance of local functions and is not a tax upon functions relating to interstate commerce. None of the terms of this chapter mean that the city has granted any provider a franchise.\nOrdinance No. 8563 (2023)"
  },
  {
    "corpus": "BRC",
    "title": "3",
    "title_name": "Revenue and Taxation",
    "chapter": "13",
    "chapter_name": "Climate Tax",
    "anchor": "3-13-6",
    "heading": "Dedicated Revenues.",
    "verbatim": "3-13-6. Dedicated Revenues.\n(a)\tThe amount of the repurposing of the climate tax revenue passed by the voters in 2022 shall be used for the purpose of funding the costs of projects, pilots, initiatives, and research that support the city's clean energy goals in the context of the city's racial equity goals.\nOrdinance No. 8563 (2023)"
  },
  {
    "corpus": "BRC",
    "title": "3",
    "title_name": "Revenue and Taxation",
    "chapter": "14",
    "chapter_name": "Recreational Marijuana Taxes",
    "anchor": "3-14-1",
    "heading": "Legislative Intent.",
    "verbatim": "3-14-1. Legislative Intent.\nThe city council intends that an additional excise tax be imposed on the first sale or transfer of recreational marijuana by a retail cultivation facility within the city and an additional sales tax imposed on every retail sale of recreational marijuana or recreational marijuana-infused product. The purpose of this tax is to increase the revenue base for the city to provide municipal improvements and services related to the introduction of a new marijuana industry to the city. Revenues from the tax shall be deposited in the general fund and shall be available to pay for the general expenses of government. However, although the city council recognizes that it cannot bind future city councils, it nonetheless declares its intention that sufficient revenues generated by this tax be appropriated by future city councils for public safety, enforcement and administrative purposes and for comprehensive substance abuse programs including, without limitation, prevention, treatment, education, responsible use, intervention, and monitoring, with an emphasis on youth with the remainder used to fund other governmental expenses including police, fire, transportation, and general government. Each council shall decide what constitutes sufficient funds. As used here, sufficient shall mean an amount determined by council to balance the revenue received with the established need in the community for programs to address the subjects identified above.\nOrdinance Nos. 7916 (2013); 8617 (2024)"
  },
  {
    "corpus": "BRC",
    "title": "3",
    "title_name": "Revenue and Taxation",
    "chapter": "14",
    "chapter_name": "Recreational Marijuana Taxes",
    "anchor": "3-14-2",
    "heading": "Imposition and Rate of Tax.",
    "verbatim": "3-14-2. Imposition and Rate of Tax.\n(a)\tExcise Tax. There is levied and shall be paid and collected an excise tax of five percent on the average market rate of unprocessed recreational marijuana that is sold or transferred from a recreational marijuana cultivation facility.\n(b)\tSales and Use Tax. There is hereby levied and there shall be collected and paid a sales and use tax, in addition to the sales and use tax levied in Chapter 3-2, \"Sales and Use Tax,\" B.R.C. 1981, of three and one-half percent on the full purchase price paid or charged for recreational marijuana or recreational marijuana-infused products purchased or sold at retail by every recreational marijuana business exercising a taxable privilege in the city by the sale or use of such recreational marijuana. The additional sales tax is levied on all sales of recreational marijuana or recreational marijuana-infused products, and is collected by the vendor and remitted to the city. The use tax is levied upon the privilege of using in the city, personally or as part of rendering a service, recreational marijuana or recreational marijuana-infused products upon which a municipal sales and use tax has not been paid, and is paid by either the recreational marijuana business in the city or the consumer.\nOrdinance Nos. 7916 (2013); 8218 (2017); 8563 (2023)"
  },
  {
    "corpus": "BRC",
    "title": "3",
    "title_name": "Revenue and Taxation",
    "chapter": "14",
    "chapter_name": "Recreational Marijuana Taxes",
    "anchor": "3-14-3",
    "heading": "Retailer Liable for Tax.",
    "verbatim": "3-14-3. Retailer Liable for Tax.\n(a)\tExcise Tax. Each recreational marijuana cultivation facility shall pay the tax imposed in Subsection 3-14-2(a) on the first sale or transfer of recreational marijuana from a cultivation facility in the city.\n(b)\tSales and Use Tax. Each recreational marijuana center shall pay the tax imposed on Subsection 3-14-2(b) on every sale or transfer of recreational marijuana or a recreational marijuana-infused product from the recreational marijuana center.\n(c)\tThe burden of proving that any transaction is not subject to the tax imposed by this chapter is upon the person upon whom the duty to collect the tax is imposed.\nOrdinance Nos. 7916 (2013); 8218 (2017); 8563 (2023)"
  },
  {
    "corpus": "BRC",
    "title": "3",
    "title_name": "Revenue and Taxation",
    "chapter": "14",
    "chapter_name": "Recreational Marijuana Taxes",
    "anchor": "3-14-4",
    "heading": "Reserved.",
    "verbatim": "3-14-4. Reserved.\nEditor's note(s)—Ord. No. 8434, § 1, adopted December 1, 2020, repealed § 3-14-4, which pertained to taxes collected are held in trust and derived from Ordinance No. 7916 (2013)."
  },
  {
    "corpus": "BRC",
    "title": "3",
    "title_name": "Revenue and Taxation",
    "chapter": "14",
    "chapter_name": "Recreational Marijuana Taxes",
    "anchor": "3-14-5",
    "heading": "Definition.",
    "verbatim": "3-14-5. Definition.\nAs used in this chapter, average market rate means the amount determined by the state pursuant to § 39-28.8-101(1), C.R.S., or such alternate amount as may be determined by the city manager as the average price of unprocessed recreational marijuana that is sold or transferred from a cultivation facility to a retail marijuana center or manufacturer.\nOrdinance No. 7916 (2013)\n3-14-6—3-14-13. Reserved.\nEditor's note(s)—Ord. No. 8237, § 2, adopted February 6, 2018, effective March 8, 2018, repealed §§ 3-14-6—3-14-13 which pertained to licensing and reporting procedure; maintenance and preservation of tax returns, reports, and records; interest and penalties for failure to file tax return or pay tax; refunds; enforcement of tax liability; duties and powers of city manager; city employee conflicts of interest prohibited; prohibited acts. See Code Comparative Table for complete derivation."
  },
  {
    "corpus": "BRC",
    "title": "3",
    "title_name": "Revenue and Taxation",
    "chapter": "15",
    "chapter_name": "Short-Term Rental Tax",
    "anchor": "3-15-1",
    "heading": "Legislative Intent.",
    "verbatim": "3-15-1. Legislative Intent.\nThe City Council intends that every person who, for consideration, purchases a short-term rental accommodation located in the city for lodging purposes, other than a person subject to the provisions of Chapter 3-3, \"Public Accommodations Tax,\" B.R.C. 1981, shall pay, and every person or retailer who sells or furnishes for consideration such accommodation shall collect, the tax imposed by this chapter upon the total purchase price charged to the customer. The purpose of this tax is to level the playing field for short-term rentals by imposing a tax on the acquisition of lodging services in private residences in an amount equal to that paid by hotels, motels and other public accommodations. It is council's intent that this program be self-sufficient. Proceeds from the tax will first be used to fund enforcement, administration and all other reasonable expenses of the short-term rental regulatory program. The conversion of residential dwelling units into short-term rentals can adversely affect the sully of affordable housing in Boulder. Accordingly, after administration expenses are met, any additional funds shall be placed in the city's affordable housing fund.\nOrdinance Nos. 8065 (2016); 8563 (2023)"
  },
  {
    "corpus": "BRC",
    "title": "3",
    "title_name": "Revenue and Taxation",
    "chapter": "15",
    "chapter_name": "Short-Term Rental Tax",
    "anchor": "3-15-2",
    "heading": "Imposition and Rate of Tax.",
    "verbatim": "3-15-2. Imposition and Rate of Tax.\nThere is and shall be paid and collected an excise tax of seven and one-half percent on the price paid for short-term rental lodging services. This tax does not apply to any person subject to Chapter 3-3 \"Public Accommodations Tax,\" B.R.C. 1981.\nOrdinance Nos. 8065 (2016); 8154 (2016); 8563 (2023)"
  },
  {
    "corpus": "BRC",
    "title": "3",
    "title_name": "Revenue and Taxation",
    "chapter": "15",
    "chapter_name": "Short-Term Rental Tax",
    "anchor": "3-15-3",
    "heading": "Liability for Tax.",
    "verbatim": "3-15-3. Liability for Tax.\n(a)\tNo person who pays for short-term lodging services shall fail to pay, and no retailer selling or otherwise furnishing short-term rental lodging services shall fail to collect and remit the tax levied by this chapter.\n(b)\tThe burden of proving that any transaction is not subject to the tax imposed by this chapter is upon the person upon whom the duty to collect the tax is imposed.\nOrdinance Nos. 8065 (2016); 8563 (2023)"
  },
  {
    "corpus": "BRC",
    "title": "3",
    "title_name": "Revenue and Taxation",
    "chapter": "15",
    "chapter_name": "Short-Term Rental Tax",
    "anchor": "3-15-4",
    "heading": "Reserved.",
    "verbatim": "3-15-4. Reserved.\nEditor's note(s)—Ord. No. 8434, § 1, adopted December 1, 2020, repealed § 3-15-4, which pertained to taxes collected are held in trust and derived from Ordinance No. 8065 (2016)."
  },
  {
    "corpus": "BRC",
    "title": "3",
    "title_name": "Revenue and Taxation",
    "chapter": "15",
    "chapter_name": "Short-Term Rental Tax",
    "anchor": "3-15-5",
    "heading": "Exempt Transactions.",
    "verbatim": "3-15-5. Exempt Transactions.\nThe following entities and transactions are exempt from the duty to pay tax under this chapter but not the duty to collect and remit the tax levied hereby:\n(a)\tThe United States Government, the State of Colorado, its departments and institutions and the political subdivisions thereof including the city, when acting in their governmental capacities and performing governmental functions and activities, and when the government's obligation is paid for directly to the licensee by a purchase card or a draft or warrant drawn on the government's account; and\n(b)\tReligious, charitable and quasi-governmental organizations but only in the conduct of their regular religious, charitable and quasi-governmental capacities, only if each such organization has obtained an exempt organization license under Section 3-2-12, \"Exempt Institution License,\" B.R.C. 1981, and furnishes the exempt tax license to the person who rents or leases a dwelling unit to the organization, and only if the organization's obligations have been paid for directly by it to the short-term rental tax licensee without reimbursement therefor.\n(c)\tBurden of Proof for Exemptions. The burden of proving that any person or entity is exempt from payment of the short-term rental tax under this section shall be on the person or entity claiming such exemption, and such proof shall be by a preponderance of evidence.\n(d)\tLimitations. Nothing contained in this chapter shall be construed to empower the city to levy and collect the tax hereby imposed upon any taxpayer not within the taxing power of the city under the laws of the United States or the State of Colorado.\nOrdinance No. 8065 (2016)\n3-15-6—3-15-12. Reserved.\nEditor's note(s)—Ord. No. 8237, § 2, adopted February 6, 2018, effective March 8, 2018, repealed §§ 3-15-6—3-15-12 which pertained to licensing and reporting procedure; maintenance and preservation of tax returns, reports, and records; interest and penalties for failure to file tax return or pay tax; refunds; enforcement of tax liability; duties and powers of city manager; city employee conflicts of interest prohibited. See Code Comparative Table for complete derivation."
  },
  {
    "corpus": "BRC",
    "title": "3",
    "title_name": "Revenue and Taxation",
    "chapter": "16",
    "chapter_name": "Sugar Sweetened Beverage Product Distribution Tax",
    "anchor": "3-16-1",
    "heading": "Findings and Purpose.",
    "verbatim": "3-16-1. Findings and Purpose.\n(a)\tAn excise tax on the distribution of sugar-sweetened beverages is intended to protect the health, safety and well-being of all in the City of Boulder.\n(b)\tWhereas consuming one sugar-sweetened beverage a day increases the risk for childhood obesity by 55%.\n(c)\tWhereas consuming one sugar-sweetened beverage a day increases the risk of developing Type Two Diabetes by 25%.\n(d)\tWhereas consuming one sugar-sweetened beverage a day increases the likelihood of death from cardiovascular disease by 30%.\nOrdinance No. 8181 (2017)"
  },
  {
    "corpus": "BRC",
    "title": "3",
    "title_name": "Revenue and Taxation",
    "chapter": "16",
    "chapter_name": "Sugar Sweetened Beverage Product Distribution Tax",
    "anchor": "3-16-2",
    "heading": "Imposition and Rate of Tax.",
    "verbatim": "3-16-2. Imposition and Rate of Tax.\n(a)\tExcise tax. There is levied and shall be paid and collected an excise tax of two cents ($0.02) per fluid ounce of sugar-sweetened beverage products that are distributed in the city. The tax is imposed only when the supply, acquisition, delivery or transport is for the ultimate retail sale of the sugar-sweetened beverage product within the city.\n(b)\tFor purposes of calculating the tax imposed under this chapter, the volume, in fluid ounces, of a sugar-sweetened beverage product shall be:\n(1)\tFor a bottled sugar-sweetened beverage the tax shall be calculated on the volume, in fluid ounces, of sugar-sweetened beverages distributed to any person in the course of business in the city.\n(2)\tFor a sugar-sweetened beverage made from syrups and powders the tax shall be calculated on:\n(A)\tThe manufacturer's suggested serving size for the volume of fluid ounces of sugar-sweetened beverages produced from syrup or powder upon the initial distribution of syrup or powder; or\n(B)\tIf the labeling or packaging does not specify the recommended number of servings per container, the tax shall be calculated using the largest volume of fluid ounces of sugar-sweetened beverages that could be produced from syrup or powder upon the initial distribution of syrup or powder.\nOrdinance No. 8181 (2017)"
  },
  {
    "corpus": "BRC",
    "title": "3",
    "title_name": "Revenue and Taxation",
    "chapter": "16",
    "chapter_name": "Sugar Sweetened Beverage Product Distribution Tax",
    "anchor": "3-16-3",
    "heading": "Distributor Liable for Tax.",
    "verbatim": "3-16-3. Distributor Liable for Tax.\n(a)\tEach distributor of sugar-sweetened beverage products shall pay the tax imposed in this chapter on each non-exempt distribution of a sugar-sweetened beverage product, except that if there is a chain of distribution within the City of Boulder involving more than one distributor, the tax shall be levied on the first distributor subject to the jurisdiction of the city, unless the tax is not paid by the first distributor for any reason, it shall be levied on subsequent distributors, provided that the distribution of sugar-sweetened beverage products may not be taxed more than once in the chain of commerce within the city.\n(b)\tPrior to distributing any sugar-sweetened beverage product in the city, the distributor shall obtain the license required by Section 3-2-11, \"Sales and Use Tax License,\" B.R.C 1981.\n(c)\tIn order to aid in the city's collection of taxes due under this chapter, any retailer of sugar-sweetened beverage products that receives sugar-sweetened beverage products from a distributor, in accordance with rules and regulations promulgated by the city manager pursuant to Section 3-16-6, shall provide to the city evidence that the distributor from whom the sugar-sweetened beverage products were received has registered as a distributor with the city.\nOrdinance No. 8181 (2017)"
  },
  {
    "corpus": "BRC",
    "title": "3",
    "title_name": "Revenue and Taxation",
    "chapter": "16",
    "chapter_name": "Sugar Sweetened Beverage Product Distribution Tax",
    "anchor": "3-16-4",
    "heading": "Definitions.",
    "verbatim": "3-16-4. Definitions.\nFor the purposes of this Chapter 3-16, unless the context otherwise requires:\n\"Beverage for medical use\" means a beverage suitable for human consumption and manufactured for use as a:\n(1)\tSource of necessary nutrition due to a medical condition, or\n(2)\tFor use as an oral rehydration electrolyte solution for infants and children formulated to prevent or treat dehydration due to illness.\nIt shall not include drinks commonly referred to as \"Sports Drinks\" or any other common names that are derivations thereof.\n\"Bottled sugar-sweetened beverage\" means any sugar-sweetened beverage in a container that is ready for consumption without further processing, such as, and without limitation, dilution or carbonation.\n\"Caloric sweetener\" means a substance or combination of substances suitable for human consumption that adds calories to and is perceived as sweet to humans when consumed, including, but not limited to sucrose, dextrose, fructose, glucose, other mono and disaccharides; corn syrup or high-fructose corn syrup; or any other caloric sweetener designated by the city manager.\n\"Consumer\" for purposes of this chapter only means a natural person who purchases a sugar-sweetened beverage product in the city for a purpose other than resale in the ordinary course of business.\n\"Distribution\" or \"Distribute\" means the transfer of title or possession:\n(1)\tFrom one business entity to another for consideration;\n(2)\tWithin a single business entity, such as by a wholesale or warehousing unit to a retail outlet or between two or more employees or contractors; or\n(3)\tFor products for which the tax imposed by this chapter has not been paid by a prior distributor, \"distribution\" or \"distribute\" also means the placement of a product with a retailer of sugar-sweetened beverage products.\n\"Distribution\" or \"Distribute\" shall not mean the retail sale to a consumer.\n\"Distributor\" means any person who distributes sugar-sweetened beverage products in the city.\n\"Milk products\" means natural fluid milk, regardless of animal source or butterfat content, natural milk concentrate, whether or not reconstituted, regardless of animal source or butterfat content, or dehydrated natural milk, whether or not reconstituted and regardless of animal source or butterfat content, and plant-based milk substitutes, that are marketed as milk, such as soy milk, coconut milk, rice milk and almond milk.\n\"Powder\" means any solid mixture, containing one or more caloric sweetener as an ingredient, intended to be used in making, mixing, or compounding a sugar-sweetened beverage by combining the powder with one or more ingredients.\n\"Retailer of sugar-sweetened beverage products\" means a person, other than a distributor, manufacturer, or wholesaler who receives, stores, mixes, compounds, or manufactures a sugar-sweetened beverage and sells or otherwise dispenses the sugar-sweetened beverage to the ultimate consumer.\n\"Simple syrup\" means a mixture of water and one or more natural or common sweeteners without any additional ingredients.\n\"Sugar-sweetened beverage\" means any non-alcoholic beverage which contains at least five grams of caloric sweetener per twelve fluid ounces.\n(l)\t\"Sugar-sweetened beverage\" includes all drinks and beverages commonly referred to as \"soda,\" \"pop,\" \"cola,\" \"soft drinks,\" \"sports drinks,\" \"energy drinks,\" \"sweetened ice teas,\" \"sweetened coffees,\" or any other common names that are derivations thereof.\n(2)\t\"Sugar-sweetened beverage\" does not include any of the following:\n(A)\tAny beverage in which milk is the primary ingredient, i.e., the ingredient constituting a greater volume of the product than any other;\n(B)\tAny beverage for medical use;\n(C)\tAny liquid sold for use for weight reduction as a meal replacement;\n(D)\tAny product commonly referred to as \"infant formula\" or \"baby formula\";\n(E)\tAny alcoholic beverage;\n(F)\tAny beverage consisting of 100 percent natural fruit or vegetable juice with no added caloric sweetener. Natural fruit juice and natural vegetable juice is the original liquid with or without water added resulting from the pressing of fruits or vegetables;\n(G)\tSweetened medication such as cough syrup, liquid pain relievers, fever reducers and similar products; or\n(H)\tAny product commonly used exclusively to mix with alcohol that may exceed five grams or more per serving of caloric sweetener per twelve ounces of fluid that is not a sugar sweetened beverage, including without limitation margarita mix, bloody mary mix, daiquiri mix or similar products.\n\"Sugar-sweetened beverage product\" means a bottled sugar-sweetened beverage or a sugar sweetened beverage made from the dilution of syrup or powder.\n\"Syrup\" means any liquid mixture, containing one or more caloric sweeteners as an ingredient, intended to be used in making, mixing, or compounding a sugar-sweetened beverage by combining the syrup with one or more other ingredients.\nOrdinance Nos. 8181 (2017); 8184 (2017); 8563 (2023)"
  },
  {
    "corpus": "BRC",
    "title": "3",
    "title_name": "Revenue and Taxation",
    "chapter": "16",
    "chapter_name": "Sugar Sweetened Beverage Product Distribution Tax",
    "anchor": "3-16-5",
    "heading": "Exemptions.",
    "verbatim": "3-16-5. Exemptions.\nThe tax imposed by this chapter shall not apply:\n(a)\tTo any distribution of syrups and powders sold directly to a consumer and intended for personal use by a consumer that are not already pre-mixed into a sugar-sweetened beverage product such as granulated sugar, honey, agave and similar products.\n(b)\tTo any milk product.\n(c)\tTo infant formula.\n(d)\tTo any alcoholic beverage.\n(e)\tTo any beverage for medical use.\n(f)\tTo any product that does not meet the definition of a sugar sweetened beverage.\nOrdinance Nos. 8181 (2017); 8184 (2017)"
  },
  {
    "corpus": "BRC",
    "title": "3",
    "title_name": "Revenue and Taxation",
    "chapter": "16",
    "chapter_name": "Sugar Sweetened Beverage Product Distribution Tax",
    "anchor": "3-16-6",
    "heading": "Reserved.",
    "verbatim": "3-16-6. Reserved.\nEditor's note(s)—Ord. No. 8434, § 2, adopted December 1, 2020, repealed § 3-16-6, which pertained to duties, responsibilities and authority of the city manager and derived from Ordinance No. 8181 (2017)."
  },
  {
    "corpus": "BRC",
    "title": "3",
    "title_name": "Revenue and Taxation",
    "chapter": "16",
    "chapter_name": "Sugar Sweetened Beverage Product Distribution Tax",
    "anchor": "3-16-7",
    "heading": "Liability for Tax; Records; Retailer Obligations.",
    "verbatim": "3-16-7. Liability for Tax; Records; Retailer Obligations.\n(a)\tNo receiver of a sugar-sweetened beverage product from a distributor shall fail to pay and no distributor shall fail to collect the tax levied by this chapter.\n(b)\tThe receiver of any sugar-sweetened beverage product from a distributor shall include with its records of receipt of such product, the name of the distributor and amount of tax paid to the distributor.\n(c)\tThe records required to be maintained by the receiver of the sugar-sweetened beverage product and the distributor shall preserve all records and reports as provided in Section 3-2-18, \"Taxpayer Duty to Keep Records, Provide Information and File Returns,\" B.R.C. 1981.\n(d)\tThe burden of proving that any transaction is not subject to the tax imposed by this chapter is upon the person whom the duty to collect the tax is imposed.\n(e)\tIn order to aid in the city's collection of taxes due under this chapter, when requested by the city manager, any retailer of sugar-sweetened beverage products that receives sugar-sweetened beverage products from a distributor shall:\n(1)\tProvide to the city evidence that the distributor from whom the sugar-sweetened beverage products were received has registered as a distributor with the city; or\n(2)\tReport to the city all such transactions, the volume in ounces of sugar-sweetened beverage products received in each transaction, and the identity and contact information of any unregistered distributor from whom the sugar-sweetened beverage product was received and remit it to the city.\nOrdinance Nos. 8181 (2017); 8184 (2017)"
  },
  {
    "corpus": "BRC",
    "title": "3",
    "title_name": "Revenue and Taxation",
    "chapter": "16",
    "chapter_name": "Sugar Sweetened Beverage Product Distribution Tax",
    "anchor": "3-16-8",
    "heading": "Reserved.",
    "verbatim": "3-16-8. Reserved.\nEditor's note(s)—Ord. No. 8434, § 1, adopted December 1, 2020, repealed § 3-16-8, which pertained to taxes collected are held in trust and derived from Ordinance No. 8181 (2017)."
  },
  {
    "corpus": "BRC",
    "title": "3",
    "title_name": "Revenue and Taxation",
    "chapter": "16",
    "chapter_name": "Sugar Sweetened Beverage Product Distribution Tax",
    "anchor": "3-16-9",
    "heading": "Reserved.",
    "verbatim": "3-16-9. Reserved.\nEditor's note(s)—Ord. No. 8237, § 2, adopted February 6, 2018, effective March 8, 2018, repealed § 3-16-9 which pertained to enforcement of tax liability. See Code Comparative Table for complete derivation."
  },
  {
    "corpus": "BRC",
    "title": "3",
    "title_name": "Revenue and Taxation",
    "chapter": "16",
    "chapter_name": "Sugar Sweetened Beverage Product Distribution Tax",
    "anchor": "3-16-10",
    "heading": "Not a Sales and Use Tax.",
    "verbatim": "3-16-10. Not a Sales and Use Tax.\nThe tax imposed by this Chapter is a tax upon the privilege of conducting business, specifically, distributing sugar-sweetened beverage products within the City of Boulder. It is not a sales, use or other excise tax on the sale, consumption or use of sugar-sweetened beverage products. The tax imposed herein shall be in addition to any license fee or tax imposed or levied under any other law, statute or ordinance where imposed or levied by the city, state, or other governmental entity or political subdivision.\nOrdinance No. 8181 (2017)"
  },
  {
    "corpus": "BRC",
    "title": "3",
    "title_name": "Revenue and Taxation",
    "chapter": "16",
    "chapter_name": "Sugar Sweetened Beverage Product Distribution Tax",
    "anchor": "3-16-11",
    "heading": "Dedicated Revenues.",
    "verbatim": "3-16-11. Dedicated Revenues.\n(a)\tThe revenues from this excise tax shall be designated for the administrative cost of the tax, and once that obligation has been fulfilled, used for health promotion, general wellness programs and chronic disease prevention in the City of Boulder that improve health equity, such as access to safe and clean drinking water, healthy foods, nutrition and food education, physical activity, and other health programs especially for residents with low income and those most affected by chronic disease linked to sugary drink consumption.\n(b)\tThe city shall track and record all revenues collected from the excise tax imposed by this chapter, all administrative costs and the distribution of the portion of the tax collected not used for administrative costs. The city council shall annually publish a public report on the city's website detailing the amount of revenue collected as a result of the tax and the type and amount of expenditures made as a result of the tax levied in this chapter.\nOrdinance No. 8181 (2017)"
  },
  {
    "corpus": "BRC",
    "title": "3",
    "title_name": "Revenue and Taxation",
    "chapter": "16",
    "chapter_name": "Sugar Sweetened Beverage Product Distribution Tax",
    "anchor": "3-16-12",
    "heading": "Municipal Affair.",
    "verbatim": "3-16-12. Municipal Affair.\nThe people of the City of Boulder hereby declare that the taxation of the privilege of distributing sugar-sweetened beverage products and that the public health impact of sugar-sweetened beverage products separately and together constitute municipal affairs. The people of the City of Boulder hereby further declare their desire for this measure to coexist with any similar tax adopted at the county or state levels.\nOrdinance No. 8181 (2017)"
  },
  {
    "corpus": "BRC",
    "title": "3",
    "title_name": "Revenue and Taxation",
    "chapter": "17",
    "chapter_name": "General Provisions for Tax Compliance",
    "anchor": "3-17-1",
    "heading": "Legislative Intent.",
    "verbatim": "3-17-1. Legislative Intent.\nIt is the intent of the city council in enacting this chapter that any person responsible for any tax imposed in this title comply with the following requirements. Some of the following were formerly in separate chapters of this title.\nOrdinance No. 8237 (2018)"
  },
  {
    "corpus": "BRC",
    "title": "3",
    "title_name": "Revenue and Taxation",
    "chapter": "17",
    "chapter_name": "General Provisions for Tax Compliance",
    "anchor": "3-17-2",
    "heading": "Exemption Burden of Proof.",
    "verbatim": "3-17-2. Exemption Burden of Proof.\nThe burden of proving that any vendor, retailer, consumer or purchaser is exempt from collecting or paying the tax upon any property or services sold or purchased, paying tax to the city manager, or making returns to the city manager is on the person asserting the claim of exemption.\nOrdinance No. 8237 (2018)"
  },
  {
    "corpus": "BRC",
    "title": "3",
    "title_name": "Revenue and Taxation",
    "chapter": "17",
    "chapter_name": "General Provisions for Tax Compliance",
    "anchor": "3-17-3",
    "heading": "Sales and Use Tax or Business License Required.",
    "verbatim": "3-17-3. Sales and Use Tax or Business License Required.\n(a)\tThe city manager shall not issue a sales and use tax license to any business that is proposing to conduct business activities that are in violation of any applicable law. The sales and use tax license may be referred to as a business license.\n(b)\tThe manager may issue a business license to a business to offer shared electric scooters as defined in Section 7-1-1, \"Definitions,\" B.R.C. 1981. Such business license shall be issued pursuant to licensing standards specific to micromobility adopted by city council.\n(c)\tGeneral Licensing Provisions. The general procedures and requirements of licenses, as more fully set forth in Chapter 4-1, \"General Licensing Provisions,\" B.R.C. 1981, shall apply to business licenses. To the extent there is any conflict between the provisions of this title and Chapter 4-1, the provisions of this title shall control for business licenses.\n(d)\tIssuance of a License Does Not Grant Rights. A business license is required to do business in the city, but issuance of the license by the city is not approval of any representations made by the applicant and does not confer any rights on the license holder.\n(e)\tCosts of Inspection and Clean-Up. In the event the city incurs costs in the inspection, clean-up, or any other requirements to implement a forfeiture, the business and responsible person shall reimburse the city all actual costs incurred by the city for such inspection or clean-up.\n(f)\tLicense Required. It shall be unlawful to engage in the business of selling at retail tangible personal property or taxable services without first having obtained a sales and use tax license from the city manager.\n(g)\tEach license shall be numbered, show the name, address for business, place and character of business of the licensee, and be conspicuously posted in the place of business for which it is issued. No sales and use tax license is transferable.\n(h)\tNo person engaged in business in the city who regularly purchases or leases tangible personal property or taxable services for use, storage or consumption in connection with said business, from sources within or without the city, shall use, store or consume such property or services without first having obtained a sales and use tax license.\n(i)\tThe city manager shall not issue a sales and use tax license until the city manager has verified that the location of the business complies with the provisions of Title 9, \"Land Use Code,\" B.R.C. 1981.\n(j)\tAll licenses issued pursuant to this section shall be renewed on a biennial basis, effective January 1, 2020, with the first effective renewal deadline being December 31, 2021. It is the duty of each such licensee on or before December 31 of odd numbered years to obtain a renewal thereof if the licensee remains engaged in business in the city or liable to account for the tax provided for in this section.\n(k)\tIf business is transacted at two or more separate locations by one person, each location shall be separately licensed.\n(l)\tWhenever a business entity that is required to be licensed under this title is sold, purchased or transferred, so that the ownership interest of the purchaser or seller changes in any respect, the purchaser shall obtain a new license for the business.\nOrdinance Nos. 8237 (2018); 8303 (2018); 8356 (2019); 8423 (2020); 8563 (2023)"
  },
  {
    "corpus": "BRC",
    "title": "3",
    "title_name": "Revenue and Taxation",
    "chapter": "17",
    "chapter_name": "General Provisions for Tax Compliance",
    "anchor": "3-17-4",
    "heading": "Requirements for Tax Exempt Organizations.",
    "verbatim": "3-17-4. Requirements for Tax Exempt Organizations.\n(a)\tThe following entities and transactions are exempt from the duty to pay tax under this title but not the duty to collect and remit the tax levied hereby:\n(1)\tThe United States Government, the State of Colorado, its departments and institutions and the political subdivisions thereof including the city, when acting in their governmental capacities and performing governmental functions and activities, and when the government's obligation is paid for directly to the licensee by a purchase card or a draft or warrant drawn on the government's account; and\n(2)\tSales made directly to charitable organizations that have a business license from the city for the conduct of their regular religious, charitable and quasi-governmental capacities.\n(b)\tTo qualify for this exemption on a taxable sale, a charitable organization must:\n(1)\tObtain a business license with an exempt organization designation;\n(2)\tFurnish the license with the exempt designation to the person or retailer who sells or furnishes tangible personal property or taxable services; and\n(3)\tPay for the tangible personal property or taxable services with its own funds and not be reimbursed by a third party.\n(c)\tTo obtain a charitable organization exemption designation, the charitable organization must submit an application on the form provided by the city. The application shall include without limitation the organization's certificate of incorporation and a copy of the institution's federal tax exemption letter, bylaws and financial statements showing source of funds and expenditures.\n(d)\tAs a condition of maintaining charitable organization exemption designation, the charitable organization shall, as requested by the city, make regular and complete reports of all purchases, both those that are not taxable and those that are taxable, including, without limitation, purchases of property and services resold to members and others and those used for other than the exempt purpose of the institution.\nOrdinance Nos. 8237 (2018); 8563 (2023)"
  },
  {
    "corpus": "BRC",
    "title": "3",
    "title_name": "Revenue and Taxation",
    "chapter": "17",
    "chapter_name": "General Provisions for Tax Compliance",
    "anchor": "3-17-5",
    "heading": "Revocation of License.",
    "verbatim": "3-17-5. Revocation of License.\nAfter notice and an opportunity for a hearing under Chapter 1-3, \"Quasi-Judicial Hearings,\" B.R.C. 1981, the city manager may revoke the license of any person whom the manager finds to have violated any provision of this title.\nOrdinance No. 8237 (2018)"
  },
  {
    "corpus": "BRC",
    "title": "3",
    "title_name": "Revenue and Taxation",
    "chapter": "17",
    "chapter_name": "General Provisions for Tax Compliance",
    "anchor": "3-17-6",
    "heading": "Methods of Paying Taxes Imposed Under this Title.",
    "verbatim": "3-17-6. Methods of Paying Taxes Imposed Under this Title.\n(a)\tEvery contractor who builds, reconstructs, installs, demolishes, alters, repairs or moves any building or other structure, including work performed for federal, state or city governments or exempt institutions in the city, and every person engaged in the installation of poles, lines, cables or other transmission or distribution facilities of public utilities, and who purchases tangible personal property or taxable services for use therein and every owner or lessee of realty or improvements to realty in the city who attaches tangible personal property to or causes to be performed taxable services upon said realty or improvements thereto shall pay the tax imposed by this title upon such tangible personal property and taxable services in one of the following ways:\n(1)\tPrepayment of the tax at the time a building or right-of-way permit is issued, on the estimated percentage basis, based on a percentage of the total valuation of the construction contract determined in Subsection 4-20-4(d), \"Building Contractor License, Building Permit Fees and Payment of Estimated Use Tax;\" B.R.C. 1981; or\n(2)\tPrepayment of the tax directly to the city by a contractor on a project for a federal, state or local government that is not required to obtain a permit from the city; or\n(3)\tFiling a use tax return on a monthly or other basis approved by the city manager under Section 3-17-7, \"Tax Returns,\" B.R.C. 1981, and payment of the tax by the twentieth day of each reporting period for the previous reporting period after obtaining a sales and use tax license; or\n(4)\tPayment of the tax directly to a retailer that has a sales and use tax license from the city. This option cannot be used when tax is prepaid in accordance with subsection (1) or (2) above.\n(b)\tEvery person who engages in business in the city and who purchases, leases or rents tangible personal property or taxable services for use, storage or consumption in the city in connection with the business from sources within or without the city and taxable under this title and who has not paid the sales tax imposed by this title to a retailer required to collect the tax shall pay the city use tax, after obtaining a sales and use tax license, by filing a return on a monthly or other basis approved by the city manager under this title, and remitting the tax by the twentieth day of each reporting period for the previous reporting period.\n(c)\tEvery resident of the city who purchases or leases any taxable property or taxable services for use, storage or consumption in the city from sources within or without the city and who has not paid a sales tax under this title to a retailer required to collect it shall file a use tax return and pay the tax within thirty days from the purchase or lease of the taxable property or taxable services.\n(d)\tNonresident retailers engaged in business in the city shall collect and remit the sales and use taxes as prescribed in this title, but the nonresident retailer may petition the city manager to allow filing returns and paying taxes on a regularly audited and reasonable estimated payment basis on the grounds that the payment of the tax on individual sales will impose an undue hardship and that the type, occasion and infrequency of sales warrants such exception. Estimated payments of the tax shall be based upon the proportion that the retailer's gross sales taxable under this title bear to the retailer's total gross sales.\nOrdinance Nos. 8237 (2018); 8563 (2023)"
  },
  {
    "corpus": "BRC",
    "title": "3",
    "title_name": "Revenue and Taxation",
    "chapter": "17",
    "chapter_name": "General Provisions for Tax Compliance",
    "anchor": "3-17-7",
    "heading": "Tax Returns.",
    "verbatim": "3-17-7. Tax Returns.\n(a)\tThe city shall use and the taxpayer shall file its return upon the standard form provided by the city.\n(b)\tA retailer doing business in two or more locations, whether inside or outside the city, may file one return covering all such locations, but the retailer shall file a supplemental report showing gross sales and net taxable sales and taxes collected thereon for each such location.\n(c)\tTaxpayers are required to file returns and pay taxes due as provided in the chapter imposing the tax. Sales and use taxes are due according to the following schedule:\n(d)\tUpon request of a taxpayer whose regularly employed accounting methods are such that monthly returns may result in undue hardship, the city manager may accept returns at more convenient intervals or in installments that will not jeopardize collection of the tax.\n(e)\tThe city manager may require a bond or other financial guarantee to secure payment of the tax on less frequent than monthly basis, as authorized in subsection (d) of this section, and may revoke permission to pay the tax on such basis if the tax due becomes delinquent.\nOrdinance Nos. 8237 (2018); 8563 (2023)"
  },
  {
    "corpus": "BRC",
    "title": "3",
    "title_name": "Revenue and Taxation",
    "chapter": "17",
    "chapter_name": "General Provisions for Tax Compliance",
    "anchor": "3-17-8",
    "heading": "Duties and Powers of City Manager.",
    "verbatim": "3-17-8. Duties and Powers of City Manager.\n(a)\tThe city manager is authorized to administer the provisions of this title, issue licenses, adopt legislative and interpretive rules to implement this title, prescribe forms and provide a uniform method of adding the tax or its average equivalent to the purchase price, and permit taxpayers to pay tax on an estimated percentage basis or at less than monthly intervals.\n(b)\tThe city manager may, upon the request of a taxpayer or potential taxpayer, issue a written opinion on the applicability of this title and any provisions thereof to such taxpayer. The request shall be written and under oath shall include all information required by the city manager. The city manager's opinion shall be limited to the statement of facts as submitted and applicable ordinances in effect on the date of the opinion.\n(c)\tThe city manager may appoint such auditors, accountants, experts and other persons as are necessary to carry out the city manager's responsibilities under this title. The city manager may delegate to such persons authority granted to the city manager as necessary for administration of this title and shall bond any person handling money under this title.\n(d)\tThe city manager may waive sales and use taxes otherwise payable under this title for the portion of a construction project directly related to the rehabilitation of deed-restricted housing units for low-income persons whose income does not exceed thirty-five percent of the median income for Boulder County.\n(e)\tThe city manager may compromise any civil or criminal dispute under this title to the extent of $500 before referring it to the office of the city attorney for prosecution. The city attorney shall compromise any criminal or civil case arising under this title, upon the city manager's written request. Whenever a compromise of $500 or more is made by the city manager, the city manager shall file a written opinion explaining the reasons therefor, which may include financial inability of the taxpayer to pay a larger amount, and a statement of:\n(1)\tThe amount of tax assessed;\n(2)\tThe amount of interest, penalties and additional amounts imposed by this chapter on the taxpayer; and\n(3)\tThe amount paid under the terms of the compromise.\n(f)\tThe city manager shall make available to any requesting retailer a map showing the boundaries of the city. The requesting retailer may rely on such map and any update thereof available to such retailer in determining whether to collect a sales or use tax or both. No penalty shall be imposed or action for deficiency maintained against such a retailer who in good faith complies with the most recent map available to it.\n(g)\tThe city manager may grant rebates of sales and use taxes paid by primary employers in connection with equipment acquisition, construction projects, construction equipment and construction materials when, in the judgment of the city manager, the rebate will serve the economic interests of the city by helping attract or retain a primary employer which contributes to a socially, environmentally and economically sustainable community. The city manager may promulgate interpretive guidelines to define more specifically the circumstances under which rebates may be granted and to establish application procedures, review criteria, schedules or other matters necessary or desirable for implementation of this subsection or the purposes and findings in Ordinance No. 7639. Any taxes rebated pursuant to this subsection shall be deemed payable by the city's general fund. This subsection shall not be used in connection with a taxpayer protest or as an offset to an audit assessment.\n(h)\tThe city manager shall rebate to the taxpayer the portion of sales and use taxes paid under this chapter for Photovoltaic and Solar Thermal Systems specified in this subsection. A portion of the sales and use taxes paid under this title for Photovoltaic and Solar Thermal Systems may be set aside by City Council budget actions to create a reserve account dedicated to providing access to Photovoltaic and Solar Thermal Systems on housing for low- or moderate-income persons and on the facilities of site-based nonprofit entities operating in Boulder. The taxpayer rebate shall be the amount remaining after the reserve account set aside is deducted. Taxpayers must file an application for the sales and use tax rebate within twelve months of the city's final inspection. This program shall be reviewed periodically for effectiveness, and shall not be deemed a change in taxing policy.\nOrdinance Nos. 8237 (2018); 8563 (2023)"
  },
  {
    "corpus": "BRC",
    "title": "3",
    "title_name": "Revenue and Taxation",
    "chapter": "17",
    "chapter_name": "General Provisions for Tax Compliance",
    "anchor": "3-17-9",
    "heading": "Taxpayer Duty to Keep Records, Provide Information and File Returns.",
    "verbatim": "3-17-9. Taxpayer Duty to Keep Records, Provide Information and File Returns.\n(a)\tThe city manager may require any person, by regulation or notice served on such person to make such return, render such statement, keep and furnish such records or make such information reports as the manager may deem sufficient to demonstrate whether or not such person is liable for payment or collection of tax imposed by this title.\n(b)\tFor all projects with a final contract price or final project cost of $75,000 or more, the responsible person who has prepaid use tax, shall:\n(1)\tWithin ninety days of the project completion date complete a construction use tax reconciliation return on a form provided by the City reconciling the use tax due with the amount paid;\n(2)\tReport the actual costs of tangible personal property, taxable services and construction materials used for the project;\n(3)\tDetermine if the use tax due the City is more or less than any prepaid tax; and\n(4)\tPay the additional tax due with the filing of the return. If the use tax due is less than the prepaid tax estimate, the City shall refund the difference.\n(c)\tEvery taxpayer or other person liable to the City for sales or use tax under this title shall keep and preserve for a period of three years from the date the tax is due such books, accounts and records, including, without limitation, original sales and purchase records, as may be necessary to determine the amount of tax that the taxpayer is liable to pay or collect.\n(d)\tAll such books, accounts and records shall be open for examination at any time by the city manager or a duly authorized agent thereof. If the taxpayer or person does not keep the necessary books, accounts and records within the City, such taxpayer or person may comply with this subsection by producing books, accounts, records or such information as the manager reasonably requires for examination within the City or at the place where such books, accounts, records or information are regularly kept.\n(e)\tIf a taxpayer refuses to furnish any of the foregoing books, accounts, records or information upon request of the city manager or an agent thereof, the manager may apply to any judge of the District Court of the State of Colorado for a subpoena to require the taxpayer to appear before the manager, produce any of the foregoing information in the taxpayer's possession, and testify under oath before the manager.\n(f)\tIf the city manager is unable to secure from the taxpayer information relating to the correctness of the taxpayer's return or the amount of the taxpayer's taxable sales, the manager may apply to any judge of the District Court in and for Boulder County for subpoenas to such other persons as the manager believes may have knowledge of the taxpayer's return or income. If the manager shows that the taxpayer cannot be found, evades service of subpoena, fails or refuses to produce records or give testimony, the judge may cause subpoenas to issue to the persons sought, requiring them to appear before the manager and give testimony regarding the taxpayer's return or income. If any of the persons so served with subpoenas fail to respond thereto, the judge may proceed against such persons as in cases of contempt.\nOrdinance Nos. 8237 (2018); 8434 (2020)"
  },
  {
    "corpus": "BRC",
    "title": "3",
    "title_name": "Revenue and Taxation",
    "chapter": "17",
    "chapter_name": "General Provisions for Tax Compliance",
    "anchor": "3-17-10",
    "heading": "Coordinated Audit.",
    "verbatim": "3-17-10. Coordinated Audit.\n(a)\tAny taxpayer licensed in the city and holding a similar sales tax license in at least four other Colorado municipalities that administer their own sales tax collection, may request a coordinated audit as provided in this section.\n(b)\tWithin fourteen days of receipt of notice of an intended audit by any municipality that administers its own sales tax collection, the taxpayer may provide to the city manager, by certified mail, return receipt requested, a written request for a coordinated audit indicating the municipality from which the notice of intended audit was received and the name of the official who issued such notice. Such request shall include a list of those Colorado municipalities utilizing local collection of their sales tax in which the taxpayer holds a current sales tax license and a declaration that the taxpayer will sign a waiver of any passage-of-time based limitation upon the city's right to recover tax owed by the retailer for the audit period.\n(c)\tExcept as provided in subsection (g) of this section, any taxpayer that submits a complete request for a coordinated audit and promptly signs a waiver of any passage-of-time based limitation upon the City's right to recover taxes owed for the proposed audit period may be audited by the City during the twelve months after such request is submitted only through a coordinated audit involving all of the listed Colorado municipalities electing to participate in such an audit.\n(d)\tIf the City desires to participate in the audit of a taxpayer that submits a complete request for a coordinated audit pursuant to subsection (b) of this section, the city manager will so notify the city manager or other appropriate official of the municipality whose notice of audit prompted the taxpayer's request within ten days after receipt of the taxpayer's request for a coordinated audit. The city manager will then cooperate with other participating municipalities in the development of arrangements for the coordinated audit, including arrangement of the time during which the coordinated audit will be conducted, the period of time to be covered by the audit, and a coordinated notice to the taxpayer of those records most likely to be required for completion of the coordinated audit.\n(e)\tIf the taxpayer's request for a coordinated audit was in response to a notice of audit issued by the City, the city manager will facilitate arrangements between the City and other municipalities participating in the coordinated audit unless and until an official from some other participating municipality agrees to assume this responsibility. The city manager will cooperate with other participating municipalities to, whenever practicable, minimize the number of auditors present on the taxpayer's premises to conduct the coordinated audit on behalf of the participating municipalities. Information obtained by or on behalf of those municipalities participating in the coordinated audit may be shared only among such participating municipalities.\n(f)\tIf the taxpayer's request for a coordinated audit was in response to a notice of audit issued by the City, the city manager will, once arrangements for the coordinated audit between the City and other participating municipalities are completed, provide written notice to the taxpayer of which municipalities will be participating, the period to be audited, the records most likely to be required by participating municipalities for completion of the coordinated audit, and the proposed schedule for the coordinated audit.\n(g)\tThe coordinated audit procedure set forth in this section shall not apply:\n(1)\tWhen the proposed audit is a jeopardy audit;\n(2)\tTo audits for which a notice of audit was given prior to the effective date of this section;\n(3)\tWhen a taxpayer refuses to promptly sign a waiver of any ordinance that could limit, based upon passage of time, the City's right to recover for a portion of the audit period; or\n(4)\tWhen a taxpayer fails to provide a timely and complete request for a coordinated audit as provided in subsection (b) of this section.\nOrdinance Nos. 8237 (2018); 8563 (2023)"
  },
  {
    "corpus": "BRC",
    "title": "3",
    "title_name": "Revenue and Taxation",
    "chapter": "17",
    "chapter_name": "General Provisions for Tax Compliance",
    "anchor": "3-17-11",
    "heading": "Preservation of Tax Returns and Reports.",
    "verbatim": "3-17-11. Preservation of Tax Returns and Reports.\n(a)\tAll reports and returns required under this title and received by the City shall be preserved for three years and thereafter until the city manager orders them to be destroyed.\n(b)\tExcept in accordance with judicial order or as otherwise provided by law, the city manager and agents, clerks and employees thereof shall not divulge or make known in any way any information disclosed in any document, report or return filed under this title except such information as is displayed on the tax license. The officials charged with the custody of documents, reports and returns shall not be required to produce any of them or evidence of anything contained in them in any action or proceeding in any court, except on behalf of the manager in an action or proceeding under the provisions of this title when the report of a fact shown thereby is directly involved in such action or proceeding, in either of which events the court may require the production of, and may admit into evidence, so much of said reports or of the facts shown thereby as are pertinent to the action or proceeding and no more.\n(c)\tNothing in this section shall be construed to prohibit the delivery to a person or a duly authorized representative thereof of a copy of any return or report filed in connection with such person's tax. Copies of such records may be certified by the city manager or an agent thereof and when so certified shall be evidence equally with the originals and may be received as evidence of their contents.\n(d)\tNothing in this section shall be construed to prohibit the publication of statistics so classified as to prevent the identification of particular reports or returns and the items thereof or the inspection of returns by the city attorney or other legal representatives of the City.\n(e)\tNotwithstanding the provisions of this section, the city manager may furnish to the taxing officials of the State of Colorado, its political subdivisions, any other state or political subdivision or the United States, any information contained in tax returns and related documents filed pursuant to this title or in the report of an audit or investigation made with respect to a return, if the recipient jurisdiction agrees with the manager to grant similar privileges to the City and if such information is to be used by the jurisdiction only for tax purposes.\n(f)\tNotwithstanding the provisions of this section, the city manager may disclose:\n(1)\tNames, addresses and telephone numbers of the officers and owners of a sales, use, accommodations admissions or admissions tax licensee as that information has been provided to the City by the licensee;\n(2)\tInformation to an individual with whom, or an organization with which, the manager has contracted to assist the City in examining or auditing tax records or collecting taxes, provided that the individual or organization is required by contract not to disclose any of that information to any person other than the city manager and the authorized agents, clerks and employees thereof; and\n(3)\tInformation to an individual with whom, or an organization with which, the manager has contracted to assist the City in evaluating economic trends or revenue projections within the City, provided that the individual or organization is required by contract not to disclose any of that information to any person other than the city manager and the authorized agents, clerks and employees thereof.\n(g)\tIf a city employee or officer violates the provisions of this section, such employee or officer may be dismissed from office and may also be prosecuted for a violation of this section.\n(h)\tNo individual with whom, or organization with which, the manager has contracted pursuant to this section shall fail to comply with the confidentiality provisions of this section. Any such failure may be prosecuted for a violation of this section, and may constitute a basis upon which to terminate the individual's or organization's contract with the city.\nOrdinance No. 8237 (2018)"
  },
  {
    "corpus": "BRC",
    "title": "3",
    "title_name": "Revenue and Taxation",
    "chapter": "17",
    "chapter_name": "General Provisions for Tax Compliance",
    "anchor": "3-17-12",
    "heading": "Restrictions on Employment by City Employees.",
    "verbatim": "3-17-12. Restrictions on Employment by City Employees.\nNo deputy, agent, clerk or other officer or employee of the city engaged in any activity governed by this title shall engage in the business or profession of tax accounting or accept employment with or without compensation from any person holding a sales and use tax license from the city for the purpose, directly or indirectly, of preparing tax returns or reports required by the city, the State of Colorado, its political subdivisions, any other state or the United States or accept any employment for the purpose of advising, preparing materials or data or auditing books or records to be used in an effort to defeat or cancel any tax or part thereof that has been assessed by the city, the State of Colorado, its political subdivisions, any other state, its political subdivisions or the United States.\nOrdinance No. 8237 (2018)"
  },
  {
    "corpus": "BRC",
    "title": "3",
    "title_name": "Revenue and Taxation",
    "chapter": "17",
    "chapter_name": "General Provisions for Tax Compliance",
    "anchor": "3-17-13",
    "heading": "Penalties for Failure to File Tax Return or Pay Tax.",
    "verbatim": "3-17-13. Penalties for Failure to File Tax Return or Pay Tax.\n(a)\tIf any person fails, neglects or refuses to collect tax or to file a return and pay the tax required by this title or fails to remit the correct amount of tax; or underpays the tax; or underpays the tax because of negligence or fraud, the city manager shall make an estimate of the tax due, based on available information, and shall add thereto penalties, interest and any additions to the tax. The city manager shall serve upon the delinquent taxpayer personally, by first class mail directed to the last address of the taxpayer on file with the city, or at the electronic mail address provided by the business for electronic tax filings, written notice of assessment for estimated taxes, penalties and interest due and payable within thirty calendar days after the date of the notice. The taxpayer may request a hearing on the assessment as provided in this chapter.\n(b)\tIf a person neglects or fails to file a return or pay the tax on any return required under this title on the date prescribed therefor, determined including any extension of time for filing, such taxpayer is liable to pay the penalty and interest provided for in subsection (j) of this section on such tax deficiency.\n(c)\tIf a taxpayer fails to file a return or pay the tax on any return required under this title on the date prescribed therefor, determined with regard to any extension of time for filing, due to fraud with the intent to evade the tax, is liable to pay a penalty of one hundred percent of the deficiency plus interest collected at a rate of three percent per month on the amount of the deficiency from the date the return was due until paid. The city manager shall assess the penalties by serving upon the taxpayer a notice of assessment, as provided in subsection (a) of this section.\n(d)\tIf the amount of tax is understated on the taxpayer's return because of a mathematical error on the face of the return, the city manager shall notify the taxpayer by issuing a notice of assessment for the amount of tax liability exceeding that shown in the return. The taxpayer has no right of appeal from this assessment but shall pay the tax due and assessed or file an amended return to show the correct amount of tax due within ten days from the date of the notice.\n(e)\tIf any amount of tax is not paid on or before the twentieth day following the end of the prescribed reporting period, interest on such amount at the rate imposed under subsection (j) of this section shall be paid for the period from such date until paid. The last date prescribed for payment shall be determined without regard to any extension of time for payment and shall be determined without regard to any notice and demand for payment issued, by reason of jeopardy, prior to the last date otherwise prescribed for such payment.\n(f)\tIf any person liable to pay tax imposed by this title has repeatedly failed, neglected or refused to pay the tax within the time specified for such payment and the city manager has been required to exercise enforcement proceedings through issuing a distraint warrant to enforce collection of taxes due, the manager may add to the amount of taxes due, together with all penalties and interest thereon otherwise provided in this title, the following penalties for recurring distraint warrants:\n(1)\tFor the second through fifth distraint warrants issued, the greater of fifteen percent of the delinquent taxes, interest and penalties due or the sum of $25; and\n(2)\tFor six or more distraint warrants issued, the greater of thirty percent of the delinquent taxes, interest and penalties due or the sum of $50.\n(g)\tFor good cause shown the city manager may waive any penalty assessed or interest imposed under this title.\n(h)\tInterest prescribed under this title shall be paid upon notice and demand, shall be assessed, collected and paid in the same manner as the tax to which it applies, and may be assessed and collected at any time during the period within which the tax to which the interest relates may be assessed and collected.\n(i)\tIf any portion of a tax is satisfied by credit of an overpayment, no interest shall be imposed under this title on the portion of the tax so satisfied for any period during which, if the credit had been allowed, interest would have been allowed to the taxpayer upon the overpayment.\n(j)\tWhen interest is required or permitted to be charged under any provisions of subsections (b) through (e) of this section, there shall be a one-time penalty of ten percent and interest of one percent per month on any tax deficiency from the date when return or payment was due until paid.\n(k)\tThe penalties provided in this section are not exclusive.\nOrdinance Nos. 8237 (2018); 8356 (2019); 8434 (2020); 8563 (2023)"
  },
  {
    "corpus": "BRC",
    "title": "3",
    "title_name": "Revenue and Taxation",
    "chapter": "17",
    "chapter_name": "General Provisions for Tax Compliance",
    "anchor": "3-17-14",
    "heading": "Refunds.",
    "verbatim": "3-17-14. Refunds.\n(a)\tThe right of any person to a refund under this title is not assignable. An application for refund shall be completed by the purchaser or retailer who paid the tax, as shown on the invoice of sale.\n(b)\tIf a dispute arises between the purchaser and retailer at the time of sale as to whether or not a sale or purchase is exempt from taxation under this title, the retailer shall collect and the purchaser shall pay the tax and the retailer shall issue to the purchaser a sales receipt or paid invoice.\n(c)\tLimitations on refund claims shall be as follows:\n(1)\tAn application for refund of tax paid to a retailer by a purchaser shall be made within sixty days from the date of purchase.\n(2)\tAll other applications for refund shall be made within three years after the date of overpayment to the city.\n(3)\tApplications for refunds shall be made upon forms furnished by the city manager, and the taxpayer shall support the claim for refund by the original paid invoice or sales receipt issued by the retailer and by the taxpayer's own affidavit establishing grounds for the exception and provide such other information as the city manager may require.\n(d)\tThe city manager shall determine whether to grant the refund and shall notify the applicant in writing of that determination. Aggrieved applicants may appeal the initial decision by requesting a hearing from the city manager thereon within twenty calendar days of the date of the decision, as provided in this chapter.\n(e)\tIf the city manager discovers from examining a return within the time periods provided for filing refund requests, upon a claim duly filed by the taxpayer, or upon final judgment of a court that tax, penalty or interest paid by any taxpayer under this title exceeds the amount due or has been illegally or erroneously collected, the city manager shall refund such improperly collected tax, penalty or interest, regardless of whether the tax was paid under protest, together with interest as provided in this chapter.\n(f)\tWhenever it is established that any taxpayer has, for any period under applicable statutes of limitations, overpaid a tax imposed by this title and that the taxpayer also has an unpaid balance of tax, penalty, and interest accrued on the city manager's records for any other period, the city manager shall credit the portion of the overpayment of tax plus interest allowable thereon that does not exceed the amount of such unpaid balance and shall refund the remainder.\n(g)\tNo applicant for a refund or other person supporting an application for refund shall make any false statement in connection with such application. The conviction of any person for violating this section is prima facie evidence that all refunds received by such person during the current calendar year were unlawfully obtained. The city manager may bring an action to recover such refunds. All refund application forms shall contain a summary of the penalty provisions provided in this subsection.\nOrdinance Nos. 8237 (2018); 8563 (2023)"
  },
  {
    "corpus": "BRC",
    "title": "3",
    "title_name": "Revenue and Taxation",
    "chapter": "17",
    "chapter_name": "General Provisions for Tax Compliance",
    "anchor": "3-17-15",
    "heading": "No Interest on Overpayments and Refunds.",
    "verbatim": "3-17-15. No Interest on Overpayments and Refunds.\n(a)\tNo interest shall be allowed and paid upon any overpayment under this title.\n(b)\tAny portion of a tax or any interest, penalty, additional assessment or addition to the tax that has been erroneously refunded shall bear interest at the rate stated in this title, B.R.C. 1981, from the date of the payment of the refund to the date of its repayment by the taxpayer.\nOrdinance No. 8237 (2018)"
  },
  {
    "corpus": "BRC",
    "title": "3",
    "title_name": "Revenue and Taxation",
    "chapter": "17",
    "chapter_name": "General Provisions for Tax Compliance",
    "anchor": "3-17-16",
    "heading": "Hearings.",
    "verbatim": "3-17-16. Hearings.\n(a)\tA taxpayer may request a hearing on any tax imposed under this title after issuance of a written notice of assessment or denial of a refund by filing a request for hearing within thirty calendar days of the date of the notice of assessment or refund denial. The request for hearing shall set forth the reasons for and amount of changes in the notice of assessment or refund denial that the taxpayer seeks and such other information as the city manager may prescribe.\n(b)\tThe city manager shall conduct the hearing under the procedures prescribed by Chapter 1-3, \"Quasi-Judicial Hearings,\" B.R.C. 1981. The hearing shall be held within sixty days of the date of receipt of the request for a hearing, unless the taxpayer agrees to a later date.\n(c)\tThe city manager shall conduct the hearing and may administer oaths and take testimony. The hearing officer shall not be the same individual who determined the tax liability.\n(d)\tIn addition to the request for a hearing, a taxpayer may file a written brief with supporting documents and information within thirty calendar days after the date of the notice of assessment or refund denial and request the city manager to reconsider all or a portion of the assessed amounts or denial of refund without a hearing. If the taxpayer requests a reconsideration of the notice of assessment or denial of refund, the city manager shall consider the request and render a decision.\n(e)\tThe city manager or hearing officer may modify or abate in full the tax, penalty and interest protested by the taxpayer or grant the requested refund, based on the evidence and argument presented.\n(f)\tThe city manager or hearing officer shall issue a final written decision, including any amount found due or amount of claim for refund denied and the grounds for allowing or rejecting the claim in whole or in part within ten days of the hearing. Any tax found due in the decision shall be paid to the city or any refund found due from the city to the taxpayer shall be paid within thirty days of the written decision, unless there is an appeal of the decision as provided in this chapter.\n(g)\tInterest shall accrue on any amounts due in the decision of the hearing officer at the rate set forth in this title.\nOrdinance Nos. 8237 (2018); 8563 (2023)"
  },
  {
    "corpus": "BRC",
    "title": "3",
    "title_name": "Revenue and Taxation",
    "chapter": "17",
    "chapter_name": "General Provisions for Tax Compliance",
    "anchor": "3-17-17",
    "heading": "Appeals From City Manager's Decision.",
    "verbatim": "3-17-17. Appeals From City Manager's Decision.\n(a)\tAn aggrieved taxpayer may appeal the city manager's decision to:\n(1)\tThe District Court in and for Boulder County by filing a complaint pursuant to Colorado Rule of Civil Procedure 106(a)(4); or\n(2)\tFor sales and use tax, the taxpayer may elect instead to appeal to the executive director of the Colorado Department of Revenue as provided in § 29-2-106.1, C.R.S., if all the transactions that are the subject matter of the city manager's decision occurred after January 1, 1986.\n(b)\tWithin fifteen days after filing the notice of appeal in cases proceeding under paragraph (a)(1) of this section, the taxpayer shall file with the District Court a bond in twice the amount of the taxes, interest and other charges prescribed in the decision that are contested on appeal, or the taxpayer shall deposit the disputed amount with the city manager in lieu of a bond. The taxpayer may satisfy the bond requirement by a savings account or certificate of deposit issued by a state or national bank or by a state or federal savings and loan association in accordance with § 11-35-101, C.R.S., equal to twice the amount of taxes, interest and other charges stated in the city manager's decision. If the taxpayer deposits the disputed amount with the city manager, no further interest shall accrue on the deficiency contested during the pendency of the action. After final action of the Supreme Court of Colorado in the case or when time for appeal has expired, the funds deposited shall be, at the direction of the court, either retained by the city manager and applied against the deficiency or returned in whole or in part to the taxpayer with interest at the rate imposed by this chapter, on the amount refunded, according to the final order in the case. No claim for refund of amounts so deposited with the city manager need be made by the taxpayer in order for the court to order the city manager to repay them as herein provided.\nOrdinance Nos. 8237 (2018); 8563 (2023)"
  },
  {
    "corpus": "BRC",
    "title": "3",
    "title_name": "Revenue and Taxation",
    "chapter": "17",
    "chapter_name": "General Provisions for Tax Compliance",
    "anchor": "3-17-18",
    "heading": "Tax Constitutes Lien.",
    "verbatim": "3-17-18. Tax Constitutes Lien.\n(a)\tThe taxes imposed by this Title 3, together with all penalties and interest and collection costs pertaining thereto, is a first and prior lien on tangible personal property other than the goods, stock in trade and business fixtures in which the taxpayer has an ownership interest, subject only to valid mortgages and other liens of record at the time of and prior to the recording of the notice of lien provided by subsection (c) of this section. When the tax is collected by a retailer or its agent, the taxes imposed by this title together with all penalties and interest pertaining thereto, is a first and prior lien upon the goods, stock in trade and business fixtures in which the retailer or agent has an ownership interest except for goods that have been purchased in the ordinary course of business by retail customers, and such lien takes priority over other liens or claims of whatsoever kind or nature on such property. The personal property of an owner who has made a bona fide lease to a retailer shall be exempt from the lien created by this subsection if such property can reasonably be identified from the lease description and if the lessee is given no right to become the owner of the property used. This exemption shall be effective from the date of the execution of the lease if the lease is recorded with the city clerk. Motor vehicles which are properly licensed in this state showing the lessor as the owner thereof shall be exempt from the lien created by this subsection, except that said lien shall apply to the extent that the lessee has equity or a similar interest in the motor vehicle. Where the lessor and lessee are blood relatives or relatives by law or have twenty-five percent or more common ownership, a lease between such lessee and such lessor shall not be considered as bona fide for purposes of this subsection.\n(b)\tWhenever the business or property of any taxpayer is placed in receivership, docketed in bankruptcy, seized under distraint for nonpayment of property taxes, or an assignment is made for the benefit of creditors, all taxes, penalties and interest imposed by this title and for which the taxpayer is in any way liable under this title are a prior and preferred claim on the property of the taxpayer, except as to preexisting liens or claims of a bona fide mortgagee, pledgee, judgment creditor, or purchaser whose rights have attached prior to the filing of the notice of lien provided for in subsection (c) of this section property of the taxpayer other than the goods, stock in trade and business fixtures. No sheriff, receiver, assignee or other officer may sell the property of any taxpayer subject to the provisions of this title pursuant to process or order of any court without first ascertaining from the city manager the amount of any taxes, penalties or interest due and payable under this title. If there are any such taxes, penalties or interest due, the sheriff, receiver, assignee or other officer shall first pay the amount of said taxes, penalties or interest due out of the proceeds of such sale of the property before paying any monies to judgment creditors or other claimants, except that the officer may pay costs of the proceedings and other preexisting liens or claims as provided in this subsection.\n(c)\tIf any tax, penalty or interest imposed by this title and shown due by returns filed by the taxpayer or by assessments made by the city manager as provided in this title is not paid within ten days after it is due, the manager may issue a notice, setting forth the name of the taxpayer, the amount of the tax, penalty and interest, the date of its accrual and the fact that the City claims a first and prior lien on the real and personal property of the taxpayer, except as to preexisting liens or claims of a bona fide mortgagee, pledgee, judgment creditor or purchaser whose rights have attached prior to the filing of the notice on property of the taxpayer other than the goods, stock in trade and business fixtures in which the taxpayer has ownership interest. The notice of lien shall be made on forms prescribed by the manager and verified by the manager or a duly qualified agent thereof and may be filed in the office of the clerk and recorder of any county in the state in which the taxpayer owns real or personal property or with any person in possession of any personal property or rights to property belonging to the taxpayer.\n(d)\tThe city manager shall release any lien as shown on the records of the county clerk and recorder as herein provided, upon payment of all taxes, penalties and interest covered thereby, in the same manner as mortgages and judgments are released.\nOrdinance No. 8237 (2018)"
  },
  {
    "corpus": "BRC",
    "title": "3",
    "title_name": "Revenue and Taxation",
    "chapter": "17",
    "chapter_name": "General Provisions for Tax Compliance",
    "anchor": "3-17-19",
    "heading": "Liens on Construction Improvements.",
    "verbatim": "3-17-19. Liens on Construction Improvements.\n(a)\tThe full amount of unpaid taxes arising from and required to be reported on construction of personal property affixed to real property under this title, together with interest and penalties as herein provided, are a first and prior lien on the property of the taxpayer and take priority over all other liens of whatsoever kind and nature, except for liens for general taxes created by state law and for preexisting liens or claims of a bona fide mortgagee, pledgee, judgment creditor or purchaser whose rights have attached prior to the filing of the notice of lien provided for in this chapter.\n(b)\tIn the event a person has not paid or arranged with the city manager to pay all taxes due under this title for a construction project, the city manager may refuse to make a final inspection or issue a project completion status date. Performance of a final inspection or issuance of a project completion status date by the City shall not relieve any person from the obligation to pay any tax due the City.\nOrdinance Nos. 8237 (2018); 8563 (2023)"
  },
  {
    "corpus": "BRC",
    "title": "3",
    "title_name": "Revenue and Taxation",
    "chapter": "17",
    "chapter_name": "General Provisions for Tax Compliance",
    "anchor": "3-17-20",
    "heading": "Sale of Business Subject to Lien.",
    "verbatim": "3-17-20. Sale of Business Subject to Lien.\n(a)\tAny person who sells a business or stock of goods or quits business shall complete and file the returns required under this title within ten days of the date on which such person sold the business or stock of goods or quit business and indicate that it is a final return, that the business is sold, and the name and address of the purchaser of the business.\n(b)\tA purchaser of a business who has acquired the furniture, fixtures and equipment of the business and engages in a similar business shall withhold sufficient funds from the purchase money to cover the amount of taxes, penalties and interest imposed by this title due and unpaid until the former owner provides a receipt from the city manager that such taxes, penalties and interest have been paid. If taxes, penalties and interest imposed by this title are due and unpaid after the ten day period herein provided, such purchaser of the business is liable for the payment of the taxes, penalties and interest imposed by this title due and unpaid to the City to the same extent as the seller of the business or stock of goods. But the purchaser of the business is not liable for such taxes, penalties and interest unless, within sixty days of the date that the final return is filed, the manager files a notice of lien in the office of the clerk and recorder of the county where the property is located, stating the amount of taxes, penalties and interest due or otherwise gives written notice to the purchaser of the business of the amount of taxes, penalties and interest due.\n(c)\tAny person who obtains by purchase, foreclosure sale or otherwise, except at a sale conducted pursuant to this chapter, any goods, stock in trade or business fixtures owned, leased or used by any person takes them subject to any lien of the City for any delinquent taxes owned by the prior owner of the property and is liable to pay all delinquent taxes of the prior owner, but only up to and including the value of property so acquired.\nOrdinance No. 8237 (2018)"
  },
  {
    "corpus": "BRC",
    "title": "3",
    "title_name": "Revenue and Taxation",
    "chapter": "17",
    "chapter_name": "General Provisions for Tax Compliance",
    "anchor": "3-17-21",
    "heading": "Certificate of Discharge of Lien.",
    "verbatim": "3-17-21. Certificate of Discharge of Lien.\n(a)\tIf any real or personal property is subject to a lien for payment of tax due to the City under this title, the city manager may issue a certificate of discharge of any part of the property subject to the lien if the manager finds that the fair market value of that part of such property remaining subject to the lien is at least twice the amount of the unsatisfied tax liability plus all prior liens upon such property.\n(b)\tIf any real or personal property is subject to a lien for payment of tax due to the City under this title, the city manager may issue a certificate of discharge of any part of the property subject to the lien if the manager is paid in partial satisfaction of the tax liability an amount determined by the manager to be not less than the value of the City's interest in the part of the property so discharged. In determining the value of the part of the property to be discharged, the manager shall consider the fair market value of the property and the value of the liens that have priority over the City's lien.\n(c)\tA certificate of release of lien issued under this section is conclusive evidence that the City's lien upon the property is extinguished, but does not extinguish or release any portion of the lien on property not specified in the release.\nOrdinance No. 8237 (2018)"
  },
  {
    "corpus": "BRC",
    "title": "3",
    "title_name": "Revenue and Taxation",
    "chapter": "17",
    "chapter_name": "General Provisions for Tax Compliance",
    "anchor": "3-17-22",
    "heading": "Jeopardy Assessment.",
    "verbatim": "3-17-22. Jeopardy Assessment.\n(a)\tNotwithstanding any provisions of this chapter, if the city manager finds that collection of the tax will be jeopardized for any reason, the manager may declare the taxable period immediately terminated, determine the tax and issue notice and demand for payment thereof.\n(b)\tIf the taxpayer subject to a jeopardy assessment provides security for payment of the tax satisfactory to the city manager, the manager may forego the jeopardy assessment collection proceedings.\nOrdinance No. 8237 (2018)"
  },
  {
    "corpus": "BRC",
    "title": "3",
    "title_name": "Revenue and Taxation",
    "chapter": "17",
    "chapter_name": "General Provisions for Tax Compliance",
    "anchor": "3-17-23",
    "heading": "Enforcing the Collection of Taxes Due.",
    "verbatim": "3-17-23. Enforcing the Collection of Taxes Due.\n(a)\tThe city manager may issue a warrant directed to any employee, agent or representative of the city or any sheriff of any county of the state, commanding such person to distrain, seize and sell the personal property of the taxpayer in which the taxpayer has an ownership interest, except such property as is exempt from the execution and sale by any statute of the State of Colorado, for the payment of tax due together with interest and penalties thereon and costs of execution in the following circumstances:\n(1)\tWhen any deficiency in tax is not paid within thirty calendar days from the date of the notice of assessment and no hearing or extension or reconsideration has been requested;\n(2)\tWhen any deficiency in tax is not paid within thirty days from the date of the city manager or hearing officer's decision and no appeal from such notice has been docketed in any District Court in and for Boulder County or filed with the Colorado Director of Revenue during such time, except that if the city manager finds that collection of the tax will be jeopardized during such period, the city manager may immediately issue a distraint warrant;\n(3)\tWhen any deficiency in tax is not paid within the time prescribed in the judgment on any appeal to the District Court in and for Boulder County or the Colorado Director of Revenue;\n(4)\tImmediately upon making a jeopardy assessment or issuing a demand for payment upon jeopardy assessment as provided in this chapter; or\n(5)\tAfter or concurrently with the filing of a notice of lien as provided in this chapter.\n(b)\tThe city manager may apply to any judge of the municipal court for a warrant authorizing the manager to search for and seize property located within the city limits for the purpose of enforcing the collection of taxes under this title. Municipal judges shall issue such warrant after the manager demonstrates that:\n(1)\tThe premises to which entry is sought contain property that is subject to levy and sale for taxes due; and\n(2)\tAt least one of the preconditions of Subsection (a) of this section have been satisfied, but if a jeopardy assessment has been declared under this chapter, the city manager sets forth the reasons that collection of the tax will be jeopardized.\n(c)\tThe procedures to be followed in issuing and executing a warrant pursuant to this subsection shall comply with Rule 241(C) and (D) of the Colorado Municipal Court Rules of Procedure.\n(d)\tThe taxpayer may contest a warrant previously issued under the procedure provided by Rule 241(E) of the Colorado Municipal Court Rules of the Procedure, except that no proceeding to contest such warrant may be brought after five days prior to the date fixed for sale of the distrained property.\n(e)\tThe agent charged with the collection shall make or cause to be made an account of the goods or effects distrained, and shall leave a copy of such account, signed by the agent making such distraint, with the owner or possessor; at the owner's or possessor's usual place of abode with some family member over the age of eighteen years; at the owner's or possessor's usual place of business with a stenographer, bookkeeper or chief clerk; or, if the taxpayer is a corporation, with any officer, manager, general agent or agent for process, with a statement of the sum demanded and the time and place of sale. The agent charged with collection shall forthwith cause to be published a notice of the time and place of sale and a description of the property to be sold in a newspaper within the county wherein distraint is made, or, in lieu thereof and in the discretion of the city manager, the agent or sheriff shall cause such notice to be publicly posted at the courthouse of the county wherein such distraint is made, and copies thereof to be posted in at least two other public places within said county. The time fixed for the sale shall not be less than ten days nor more than sixty days from the date of such notification to the owner or possessor of the property and the publication or posting of such notices. The sale may be adjourned or postponed from time to time by the agent or sheriff, if the agent or sheriff deems it advisable, to a date certain but not for a time to exceed in all ninety days from the date first fixed for the sale. When any personal property is advertised for sale under distraint, the agent or sheriff making the seizure shall proceed to sell such property at public auction, offering the property at not less than a fair minimum price that includes the expenses of making the seizure and of advertising the sale. If the amount bid for the property at the sale does not equal the fair minimum price so fixed, the agent or sheriff conducting the sale may declare the same to be purchased for the city. The property so purchased may then be sold by the agent or sheriff under such regulations as may be prescribed by the city manager for disposing of city property. The goods, chattels or effects so distrained shall be restored to the owner or possessor, if, prior to the sale, the amount due is paid together with the fees and other charges, or they may be redeemed by any person holding a chattel mortgage or other evidence of right of possession.\n(f)\tIn all cases of sale, the agent or sheriff making the sale shall issue a certificate of sale to each purchaser, and such certificate is prima facie evidence of the right of the agent or sheriff to make such sale and conclusive evidence of the regularity of the proceedings in making the sale; it transfers to the purchaser all right, title and interest of the delinquent taxpayer in and to the property sold. Where such property consists of certificates of securities or other evidence of indebtedness in the possession of the agent or sheriff, the taxpayer shall endorse such certificates to the purchaser thereof and supply the purchaser with any proof of the taxpayer's authority to transfer or with any other requisite that may be necessary to obtain registration of the transfer of the certificate. Any surplus remaining above first the city's taxes, penalties, interest, costs and expenses of making the seizure and of advertising the sale and then any amounts distributed pro rata to other jurisdictions under recorded sales and use or personal property ad valorem tax liens shall be returned to the property owner or such person having a legal right to the property and, on demand, the city manager shall render an account in writing of the sale.\n(g)\tIn any case where a taxpayer has refused or neglected to pay any tax due to the city under this title and a lien has been filed as provided in this chapter, the city manager may certify the amount of the tax due and unpaid interest, together with ten percent of the delinquent amount for costs of county collection, to the Boulder County Treasurer to be assessed and collected in the same manner as general taxes are assessed and collected, as provided in this chapter.\nOrdinance Nos. 8237 (2018); 8563 (2023)"
  },
  {
    "corpus": "BRC",
    "title": "3",
    "title_name": "Revenue and Taxation",
    "chapter": "17",
    "chapter_name": "General Provisions for Tax Compliance",
    "anchor": "3-17-24",
    "heading": "Recovery of Unpaid Tax by Action at Law.",
    "verbatim": "3-17-24. Recovery of Unpaid Tax by Action at Law.\n(a)\tIn addition to other remedies provided in this title, the city manager may also treat any such taxes, penalties or interest due and unpaid as a debt due to the city from the taxpayer. If a taxpayer fails to pay the tax, or any portion thereof, or any penalty or interest thereon when due, the manager may recover at law the amount of such taxes, penalties and interest in a county or district court of the county where the taxpayer resides or has a principal place of business that has jurisdiction of the amounts sought to be collected. The return of the taxpayer or the assessment made by the manager as herein provided is prima facie proof of the amount due.\n(b)\tSuch actions may be actions in attachment, and writs of attachment may be issued to the sheriff. In any such proceedings no bond shall be required of the city manager, nor shall any sheriff require of the manager an indemnifying bond for executing the writ of attachment or writ of execution upon any judgment entered in such proceedings. The manager may also prosecute appeals or writs of error in such cases without the necessity of providing bond therefor.\n(c)\tIn any case in which a taxpayer has refused or neglected to pay any tax, penalty or interest due to the city under this title and a lien has been filed upon any real or personal property, the city manager may cause a civil action to be filed in the district court of the county in which is situated any such property subject to said lien to enforce the lien and subject any real or personal property or any right, title or interest in such property to the payment of the amount due. The court shall decree a sale of such real property and distribute the proceeds of such sale, according to the court's findings concerning the interest of the parties and of the city. The proceedings in such action, the manner of sale, the period for and manner of redemption from such sale, and the execution of deed of conveyance shall be in accordance with the law of foreclosures of mortgages upon real property. In any such action, the court may appoint a receiver of the property involved in such action if equity so requires.\n(d)\tAny person having a lien upon or any interest in any real or personal property referred to in this section under or by virtue of any instrument duly filed of record in the office of the county clerk and recorder of the county in which such property is located prior to the filing of the notice that created a lien upon such property for taxes, penalties or interest or any person purchasing such property at a sale to satisfy such prior lien or interest may make a written request to the city manager to file a civil action as provided in this section. If the manager does not file such civil action within two months after receiving such written request, such person may file a civil action in the district court of any county where any such property is situated asking for a final determination of all claims of the city to and all liens of the city upon the property in question. Service of the process in such action upon the city shall be made upon the manager or an agent thereof. The court shall in such civil action adjudicate the matters involved therein in the same manner as in the case of civil actions filed under subsection (c) of this section.\nOrdinance No. 8237 (2018)"
  },
  {
    "corpus": "BRC",
    "title": "3",
    "title_name": "Revenue and Taxation",
    "chapter": "17",
    "chapter_name": "General Provisions for Tax Compliance",
    "anchor": "3-17-25",
    "heading": "City May Be a Party Defendant.",
    "verbatim": "3-17-25. City May Be a Party Defendant.\nIn any action affecting the title to real estate or the ownership or rights to possession of personal property, the city may be made a party defendant for the purpose of obtaining an adjudication or determination of its lien upon the property involved therein, and in any such action service of summons upon the city manager or any person in charge of the manager's office is sufficient service upon the city.\nOrdinance No. 8237 (2018)"
  },
  {
    "corpus": "BRC",
    "title": "3",
    "title_name": "Revenue and Taxation",
    "chapter": "17",
    "chapter_name": "General Provisions for Tax Compliance",
    "anchor": "3-17-26",
    "heading": "Injunctive Relief.",
    "verbatim": "3-17-26. Injunctive Relief.\nThe city manager may seek injunctive or other equitable relief in any court of competent jurisdiction to enforce provisions of this title.\nOrdinance No. 8237 (2018)"
  },
  {
    "corpus": "BRC",
    "title": "3",
    "title_name": "Revenue and Taxation",
    "chapter": "17",
    "chapter_name": "General Provisions for Tax Compliance",
    "anchor": "3-17-27",
    "heading": "Obligations of Fiduciaries and Others.",
    "verbatim": "3-17-27. Obligations of Fiduciaries and Others.\n(a)\tFor the purpose of facilitating settlement and distribution of estates, trusts, receiverships, other fiduciary relationships and the assets of corporations in the process of dissolution or that have been dissolved, the city manager may agree with the fiduciary or surviving corporate directors upon an amount of taxes due from the decedent or from the decedent's estate, the trust, receivership or other fiduciary relationship, or corporation for any of the periods of tax liability under this title. Payment in accordance with such agreement fully satisfies the tax liability for the periods that the agreement covers, unless the taxpayer has committed fraud or malfeasance or misrepresented a material fact regarding the tax or liability therefor.\n(b)\tExcept as provided in subsection (d) of this section, any personal representative of a decedent or the estate of a decedent, any trustee, receiver or other person acting in a fiduciary capacity, or any director of a corporation in the process of dissolution or that has been dissolved who distributes the estate or fund under such person's control without having first paid any taxes covered by this title due from such decedent, decedent's estate, trust estate, receivership or corporation and that may be assessed within the periods authorized by this title is personally liable to the extent of the property distributed by such person for any unpaid taxes of the decedent, decedent's estate, trust estate, receivership or corporation imposed by or due under this title and assessed within the periods authorized by this title.\n(c)\tThe distributee of a decedent's estate, a trust estate or fund and the stockholder of any dissolved corporation who receives any of the property of such decedent's estate, trust estate, fund or corporation is liable under this title to the same extent that the decedent, trust estate, fund or corporation is liable under this title.\n(d)\tIf a tax under this title is due from a decedent or the decedent's estate, personal liability of the persons set forth in this section remains in effect only if a determination of the tax due is made and notice and demand therefor issues within eighteen months after the decedent's personal representative files with the city manager a written request for such determination, filed after it has filed the decedent's final return or the decedent's estate's return to which the request applies. A request for determination under this subsection does not extend the otherwise applicable period of limitation.\n(e)\tIf a tax under this title is due from a corporation that is in the process of dissolution or has been dissolved, personal liability of directors or stockholders as provided in this section remains in effect only if a determination of the tax due is made and notice and demand therefor issued within eighteen months after the corporation files with the city manager a written request for such determination, filed after it has filed the corporation's return, but only if the request states that the dissolution was begun in good faith before the expiration of the eighteen month period and the dissolution is completed. A request for determination under this subsection does not extend the otherwise applicable period of limitation.\nOrdinance No. 8237 (2018)"
  },
  {
    "corpus": "BRC",
    "title": "3",
    "title_name": "Revenue and Taxation",
    "chapter": "17",
    "chapter_name": "General Provisions for Tax Compliance",
    "anchor": "3-17-28",
    "heading": "Violations of Title 3.",
    "verbatim": "3-17-28. Violations of Title 3.\nIt shall be unlawful for any person to fail or refuse to make any return required to be made, make any false or fraudulent return or any false statements in any return, fail or refuse to pay to the city manager any taxes collected or taxes, penalties or interest due to the city, evade the collection and payment of the tax in any manner, fail to keep or disclose records required by this title or violate any of the requirements of this title.\nOrdinance No. 8237 (2018)"
  },
  {
    "corpus": "BRC",
    "title": "3",
    "title_name": "Revenue and Taxation",
    "chapter": "17",
    "chapter_name": "General Provisions for Tax Compliance",
    "anchor": "3-17-29",
    "heading": "Limitations.",
    "verbatim": "3-17-29. Limitations.\n(a)\tExcept as otherwise provided in this section, the taxes for any period, together with the interest thereon and penalties with respect thereto, imposed by this title shall not be assessed, nor shall credit be taken, notice of lien be filed, distraint warrant be issued, bond be collected upon, suit for collection be instituted, or any other action be commenced to collect the taxes more than three years after the date on which the return is filed. Nor shall any lien continue after such period, except for taxes assessed before the expiration of such period, when a notice of lien regarding such taxes was filed prior to the expiration of such period, in which case the lien shall continue for only one year after the filing of notice thereof.\n(b)\tProceedings for collection of taxes, interest and penalties may be commenced at any time in the case of a false or fraudulent return filed with the intent to evade tax and in the case of a taxpayer who fails to file a return as required under this title.\n(c)\tFor purposes of this section, a tax return filed before the last day prescribed by law or regulation issued under this title for filing of returns shall be considered to be filed on such last day.\n(d)\tThe period of limitation may be extended before its expiration.\n(1)\tWhere before the expiration of the time prescribed in this section for the assessment of tax, both the city manager and the taxpayer have consented in writing to any assessment after such time, the tax may be assessed at any time prior to the expiration of the agreed upon time. The period to which the city manager and taxpayer agree may be extended by subsequent agreement in writing made before the expiration of the previously agreed upon time.\n(2)\tThe city provides written notice to the taxpayer prior to the expiration of the period of limitation that the latter's records will be audited pursuant to this chapter, such period of limitation shall be extended for the audit period until thirty days after the date of the notice of assessment or notice of overpayment is issued as a result of such audit. \"Audit period\" includes all reporting periods with due dates that fall within the thirty-six-month period preceding the date of the notice of audit, or, if a city building permit is required, the period between the issuance of such building permit and the issuance of a final certificate of occupancy.\n(e)\tNothing in this section shall be construed to limit any right of any statute on the effective date of this title.\n(f)\tIn the case of failure to file a return, the sales tax, use tax or both may be assessed and collected at any time.\nOrdinance Nos. 8237 (2018); 8563 (2023)"
  },
  {
    "corpus": "BRC",
    "title": "3",
    "title_name": "Revenue and Taxation",
    "chapter": "17",
    "chapter_name": "General Provisions for Tax Compliance",
    "anchor": "3-17-30",
    "heading": "Participation in Simplification Meetings and Central Registry.",
    "verbatim": "3-17-30. Participation in Simplification Meetings and Central Registry.\n(a)\tThe city manager will cooperate with and participate on an as-needed basis in a permanent statewide sales and use tax committee convened by the Colorado Municipal League which is composed of state and municipal sales and use tax officials and business officials. Said committee will meet for the purpose of discussing and seeking resolution to sales and use tax problems which may arise.\n(b)\tIn order to initiate and maintain a central registry of sales and use tax ordinances, the city manager will file with the Colorado Municipal League a copy of the city's sales and use tax title prior to the enactment of this ordinance.\n(c)\tIn order to keep the central registry current, the city manager will file any proposed amendment to the sales and use tax chapter with the Colorado Municipal League prior to its effective date.\n(d)\tFailure to file any such ordinance or amendment shall not invalidate such ordinance or amendment.\nOrdinance No. 8237 (2018)"
  },
  {
    "corpus": "BRC",
    "title": "3",
    "title_name": "Revenue and Taxation",
    "chapter": "17",
    "chapter_name": "General Provisions for Tax Compliance",
    "anchor": "3-17-31",
    "heading": "Receipt for Customer-Paid Tax or Tax Pass-Through.",
    "verbatim": "3-17-31. Receipt for Customer-Paid Tax or Tax Pass-Through.\nIt shall be unlawful for a retailer to identify on a receipt any amount as a \"tax\" other than the tax collected for the retail sale. A retailer may identify amount(s) on the receipt for an amount from another transaction that it is passing on to the customer as a \"pass through,\" \"surcharge,\" or other words that indicate that it is not a direct tax on the transaction. It shall be unlawful for a retailer to fail to show on the customer receipt any amount charged as a tax on the transaction.\nOrdinance Nos. 8237 (2018); 8563 (2023)"
  },
  {
    "corpus": "BRC",
    "title": "3",
    "title_name": "Revenue and Taxation",
    "chapter": "17",
    "chapter_name": "General Provisions for Tax Compliance",
    "anchor": "3-17-32",
    "heading": "Taxes Collected are Held in Trust.",
    "verbatim": "3-17-32. Taxes Collected are Held in Trust.\nAll sums of money paid by a person or purchaser as a tax imposed in this title are public monies that are the property of the city. The collector of such monies shall hold the money in trust for the sole use and benefit of the city until such time it is paid to the city.\nOrdinance No. 8434 (2020)"
  },
  {
    "corpus": "BRC",
    "title": "3",
    "title_name": "Revenue and Taxation",
    "chapter": "17",
    "chapter_name": "General Provisions for Tax Compliance",
    "anchor": "3-17-33",
    "heading": "Use of Electronic Databases.",
    "verbatim": "3-17-33. Use of Electronic Databases.\n(a)\tAny retailer who collects and remits sales tax to the sales tax division of the City of Boulder, as provided in this article, may use an electronic database of state addresses that is certified by the Colorado Department of Revenue pursuant to § 39-26-105.3, C.R.S., to determine the jurisdictions to which tax is owed.\n(b)\tAny retailer who uses the data contained in an electronic database certified by the Colorado Department of Revenue pursuant to § 39-26-105.3, C.R.S., to determine the jurisdictions to which tax is owed, shall be held harmless for any tax, penalty or interest owed to the city that otherwise would be due solely as a result of an error in the electronic database, provided, however, that the retailer can demonstrate the use of the most current information available in such electronic database on the date the sale occurred. Each retailer shall keep and preserve such records as prescribed by the city manager to demonstrate that it used the most current information available in the electronic database on the date the sale occurred. Notwithstanding the above, if the error in collecting and remitting is a result of a deceptive representation, a false representation or fraud, the provisions of this section shall not apply.\nOrdinance No. 8563 (2023)"
  },
  {
    "corpus": "BRC",
    "title": "3",
    "title_name": "Revenue and Taxation",
    "chapter": "17",
    "chapter_name": "General Provisions for Tax Compliance",
    "anchor": "3-17-34",
    "heading": "Intercity Claims for Recovery.",
    "verbatim": "3-17-34. Intercity Claims for Recovery.\nThe intent of this section is to streamline and standardize procedures related to situations in which a tax, penalty or interest payment has been remitted to the incorrect municipality. It is not intended to reduce or eliminate the responsibilities of the taxpayer to correctly collect and remit any tax, interest, and/or penalty to the city.\n(a)\tAs used in this section, claim for recovery means a claim for reimbursement directed to a municipality for taxes, penalties, and interest that were due the city but paid to another municipality.\n(b)\tWhen it is determined by the city manager that tax, penalty or interest owed to the city has been reported and paid to another municipality, the city will promptly notify the taxpayer that such payments are being improperly collected and remitted, and that, as of the date of the notice, the taxpayer must cease improper tax collections and remittances.\n(c)\tThe city may make a written claim for recovery directly to the municipality that received tax, penalty or interest owed to the city, or, in the alternative, may institute procedures for collection of the tax from the taxpayer. The decision to make a claim for a recovery lies in the sole discretion of the city. Any claim for recovery shall include a properly executed release of claim from the taxpayer releasing its claim to the taxes paid to the wrong municipality, evidence to substantiate the claim, and a request that the municipality approve or deny, in whole or in part, the claim within ninety days of its receipt. The municipality to which the city submits a claim for recovery may, for good cause, request an extension of time to investigate the claim, and approval of such extension by the city will not be unreasonably withheld.\n(d)\tWithin ninety days after receipt of a claim for recovery, the city will verify to its satisfaction whether or not all or a portion of the tax claimed was improperly received, and will notify the municipality submitting the claim in writing that the claim is either approved or denied in whole or in part, including the reasons for the decision. If the claim is approved in whole or in part, the city will remit the undisputed amount to the municipality submitting the claim within thirty days of approval. If a claim is submitted jointly by a municipality and a taxpayer, the check will be made to the parties jointly. Denial of a claim for recovery will be made only for good cause.\n(e)\tThe city may deny a claim on the grounds that it has previously paid a claim for recovery arising out of an audit of the same taxpayer.\n(f)\tThe period subject to a claim for recovery shall be limited to the thirty-six-month period prior to the date on which the municipality that was wrongly paid the tax receives the claim for recovery.\nOrdinance No. 8563 (2023)"
  },
  {
    "corpus": "BRC",
    "title": "3",
    "title_name": "Revenue and Taxation",
    "chapter": "18",
    "chapter_name": "General Revenue Provisions",
    "anchor": "3-18-1",
    "heading": "Earmarked Revenues.",
    "verbatim": "3-18-1. Earmarked Revenues.\n(a)\tThe amount of the sales and use tax revenue attributable to the levy and collection of one cent of sales and use tax for each fiscal year shall be set aside in a separate fund entitled \"Open Space and Street Fund,\" and expended by the city only as follows:\n(1)\tTo pay a portion of the tax refund program as provided under Chapter 3-5, \"Tax Refund Program,\" B.R.C. 1981, as amended, such portion to be $160,000 for 1984, and an equivalent amount as adjusted by the change in the Consumer Price Index each year thereafter.\n(2)\tAll other monies accruing to the open space and street fund shall be expended only for the acquisition of open space real property or interest in real property, or for the payment of indebtedness incurred for such acquisition, and for such expenditures as may be necessary to protect open space properties or interest in real properties so acquired from any and all threatened or actual damages, loss, destruction, or impairment from any cause or occurrence, and also for projects related to transportation or for or related or appurtenant to transportation services or facilities, including, without limitation, studying, acquiring, constructing, providing, operating, replacing, or maintaining transportation services or facilities and all services and facilities incidental or appurtenant thereto, and the payment of indebtedness for any such expenditures.\n(b)\tPrior to the adoption of the city's budget for the succeeding fiscal year, the city council shall review the revenues and expenditures of the open space and street fund in order to assure that the period 1968-1969 and in every succeeding two-year period, the expenditures of monies during said period for acquisition of open space real property or interests in real property, or the payment of indebtedness incurred therefor and the expenses as may be necessary to protect open space real properties or interests therein so acquired from any and all threatened or actual damages, loss, destruction, or impairment from any cause or occurrence, do not exceed forty percent of the revenues accruing or expected to accrue to said fund during said two-year period, exclusive of that portion necessary to pay the portion of the tax refund program specified in Paragraph (a)(1) of this section and exclusive of that portion authorized for transfer and transferred to the general fund; and to assure that in such two-year period the expenditures of monies for transportation and related or appurtenant facilities or service or indebtedness therefor described in Paragraph (a)(2) of this section, do not exceed sixty percent of the revenues accruing or expected to accrue to said fund during such two-year period, exclusive of that portion necessary to pay the portion of the tax refund program specified in Paragraph (a)(1) of this section and exclusive of that portion authorized for transfer and transferred to the general fund of the city.\n(c)\tPledged sales and accommodations tax revenue, as defined in the cooperation agreement dated May 7, 2003, between the city, the City of Boulder Central Area General Improvement District, and the Boulder Urban Renewal Authority, means the 1.6 percent sales tax levied by the city on the retail sale of taxable goods and services within the Boulder Urban Renewal Authority's 9th and Canyon Tax Increment Area, which 1.6 percent includes the 1.0 percent general sales tax allocable to the city's general fund and the 0.6 percent transportation sales tax allocable to the city's transportation fund, each of which is a permanent city sales tax and does not have a stated expiration date, and the 5.5 percent accommodations tax in the nature of a sales tax levied by the city on the price paid for the rental of hotel rooms located within the tax increment area; but this shall not include any such tax if the same is repealed. This revenue is pledged to the Authority to support the District's bonds for the facility it constructed in the Tax Increment Area.\n(d)\tFrom January 1, 1990, through December 31, 2018, the amount of the sales and use tax revenue attributable to the levy and collection of 0.33 percent of sales and use tax shall be set aside in an open space fund for the acquisition, maintenance, preservation, retention, and use of open space lands as defined in section 170 of the charter, and the payment of any indebtedness and tax refunds related thereto.\n(e)\tFrom January 1, 1996, through December 31, 2015, the amount of the sales and use tax revenue attributable to the levy and collection of 0.25 percent of sales and use tax approved by the electors in November, 1995, shall be set aside in a separate fund and pledged for the payment of the principal, interest, and premium, if any, on the park bonds concurrently approved by the electors, and then for: development, operation, and maintenance of the land and improvements purchased or constructed with the proceeds of the bonds; renovation and refurbishment or replacement of four pools; renovation and replacement of recreation facilities, playgrounds, mountain park trails, and the civic park complex; improvements to recreation centers and development of new recreation projects to be determined in the future through the master planning process by the city council; maintenance of the community park site in north Boulder; development of a mountain parks environmental education program; and for renovation of city-owned historical and cultural facilities; with the remainder being dedicated for parks and recreation purposes.\n(f)\tFrom January 1, 2007 through December 31, 2007, the amount of the sales and use tax revenue attributable to the levy and collection of 0.15 percent sales and use tax approved by the electors in November 2006, shall be used for funding construction of phase I of a fire training center and, if any funds remain after construction of phase I, using the funds for construction of phase II or the purchase of fire apparatus, or both.\n(g)\tFrom January 1, 2004 through December 31, 2019, the amount of sales and use tax attributable to the levy and collection of 0.15 percent sales and use tax approved by the electors in November 2003, shall be used to provide additional revenues for open space purposes as defined in the charter, and the payment of any indebtedness therefor.\nOrdinance No. 8237 (2018); 8617 (2024)"
  },
  {
    "corpus": "BRC",
    "title": "3",
    "title_name": "Revenue and Taxation",
    "chapter": "18",
    "chapter_name": "General Revenue Provisions",
    "anchor": "3-18-2",
    "heading": "Revenue Changes.",
    "verbatim": "3-18-2. Revenue Changes.\nPursuant to article X, section 20 of the Colorado Constitution, the qualified electors of the City of Boulder authorize the city to collect, retain, and expend the full proceeds of the city's sales and use tax, admissions tax, and accommodations tax and all available non-federal grants, notwithstanding any state restriction on fiscal year spending, including, without limitation, the restrictions of article X, section 20 of the Colorado Constitution. Such taxes and grants shall be excluded from the definition of fiscal year spending contained in article X, section 20 of the Colorado Constitution on and after January 1, 1993. Nothing in this section shall be interpreted to authorize any increase in the rate of taxation of the sales and use tax, the admissions tax, or the accommodations tax, without a vote of the people if and when required pursuant to article X, section 20 of the Colorado Constitution.\nOrdinance Nos. 8237 (2018)"
  },
  {
    "corpus": "BRC",
    "title": "3",
    "title_name": "Revenue and Taxation",
    "chapter": "19",
    "chapter_name": "Tax on Electronic Smoking Devices Containing Nicotine",
    "anchor": "3-19-1",
    "heading": "Findings and Purpose.",
    "verbatim": "3-19-1. Findings and Purpose.\n(a)\tA sales and use tax on the retail price of all electronic smoking devices sold with the intent of discouraging the use of such products and funding health promotion and education programs regarding nicotine products.\n(b)\tElectronic smoking devices are designed to deliver products, primarily nicotine, to the consumer and nicotine is highly addictive and difficult to cease using.\n(c)\tCartridges for electronic smoking devices, particularly candy- and fruit-flavored substances, are primarily marketed to youth and young adults.\n(d)\tUse of electronic smoking devices, known as vaping, is a problem in Colorado in general and particularly in Boulder among youth, and 95 percent of adult smokers begin smoking before they turn 21.\nOrdinance No. 8376 (2020)"
  },
  {
    "corpus": "BRC",
    "title": "3",
    "title_name": "Revenue and Taxation",
    "chapter": "19",
    "chapter_name": "Tax on Electronic Smoking Devices Containing Nicotine",
    "anchor": "3-19-2",
    "heading": "Imposition and Rate of Tax.",
    "verbatim": "3-19-2. Imposition and Rate of Tax.\nThere is levied and shall be paid and collected a sales tax of 40 percent in addition to the sales and use tax levied in Chapter 3-2, \"Sales and Use Tax,\" B.R.C. 1981, of the retail sales price of all electronic smoking devices containing nicotine, including any refill, cartridge or component of such a product.\nOrdinance Nos. 8376 (2020); 8548 (2023)"
  },
  {
    "corpus": "BRC",
    "title": "3",
    "title_name": "Revenue and Taxation",
    "chapter": "19",
    "chapter_name": "Tax on Electronic Smoking Devices Containing Nicotine",
    "anchor": "3-19-3",
    "heading": "Tobacco Retailer Liable for Tax.",
    "verbatim": "3-19-3. Tobacco Retailer Liable for Tax.\nThe tobacco retailer is responsible for payment of the tax on the retail sales price whether or not the retail sales price is charged by the tobacco retailer.\nOrdinance No. 8376 (2020)"
  },
  {
    "corpus": "BRC",
    "title": "3",
    "title_name": "Revenue and Taxation",
    "chapter": "19",
    "chapter_name": "Tax on Electronic Smoking Devices Containing Nicotine",
    "anchor": "3-19-4",
    "heading": "Definitions.",
    "verbatim": "3-19-4. Definitions.\nThe definitions in Section 6-4.5-1, \"Definitions,\" shall apply to this chapter, including but not limited to the definitions of electronic smoking devices, nicotine, tobacco products and tobacco, and ESD retailer.\nOrdinance Nos. 8376 (2020); 8548 (2023)"
  },
  {
    "corpus": "BRC",
    "title": "3",
    "title_name": "Revenue and Taxation",
    "chapter": "19",
    "chapter_name": "Tax on Electronic Smoking Devices Containing Nicotine",
    "anchor": "3-19-5",
    "heading": "Exemptions.",
    "verbatim": "3-19-5. Exemptions.\nThe tax imposed by this chapter shall not apply to any electronic smoking device that has been approved or certified by the United States Food and Drug Administration for sale as a smoking cessation product or for other medically approved or certified purposes.\nOrdinance Nos. 8376 (2020); 8548 (2023)"
  },
  {
    "corpus": "BRC",
    "title": "3",
    "title_name": "Revenue and Taxation",
    "chapter": "19",
    "chapter_name": "Tax on Electronic Smoking Devices Containing Nicotine",
    "anchor": "3-19-6",
    "heading": "Dedicated Revenues.",
    "verbatim": "3-19-6. Dedicated Revenues.\nThe revenues from this sales tax shall be designated for the administrative cost of the tax, and once that obligation has been fulfilled, used for implementation and administration and enforcement of a licensing program for all tobacco retailers and once that obligation has been fulfilled, used for health promotion including but not limited to community-wide substance abuse prevention, promotion and education programs regarding nicotine product use, including enforcement. With any remaining funds being available for general government services, including police, fire, parks, transportation and general government administration.\nOrdinance Nos. 8376 (2020); 8617 (2024)"
  },
  {
    "corpus": "BRC",
    "title": "3",
    "title_name": "Revenue and Taxation",
    "chapter": "20",
    "chapter_name": "Rental License Excise Tax",
    "anchor": "3-20-1",
    "heading": "Findings and Purpose.",
    "verbatim": "3-20-1. Findings and Purpose.\nAn excise tax on each dwelling unit that is not exempt from the rental license requirement will be used to fund legal representation for persons that may be subject to an eviction proceeding and to provide funding for rental assistance for persons that may be facing an eviction or need emergency rental assistance.\nOrdinance No. 8412 (2020)"
  },
  {
    "corpus": "BRC",
    "title": "3",
    "title_name": "Revenue and Taxation",
    "chapter": "20",
    "chapter_name": "Rental License Excise Tax",
    "anchor": "3-20-2",
    "heading": "Imposition and Rate of Rental License Excise Tax.",
    "verbatim": "3-20-2. Imposition and Rate of Rental License Excise Tax.\nThere is levied and shall be paid and collected an excise tax of $78.90 per year for each dwelling unit that is required to get a rental license by the city, unless it is exempt from the tax by Section 3-20-5, B.R.C. 1981.\nOrdinance Nos. 8412 (2020); 8656 (2025)"
  },
  {
    "corpus": "BRC",
    "title": "3",
    "title_name": "Revenue and Taxation",
    "chapter": "20",
    "chapter_name": "Rental License Excise Tax",
    "anchor": "3-20-3",
    "heading": "License holder Liable for Tax.",
    "verbatim": "3-20-3. License holder Liable for Tax.\nThe rental license holder is responsible for payment of the tax.\nOrdinance No. 8412 (2020)"
  },
  {
    "corpus": "BRC",
    "title": "3",
    "title_name": "Revenue and Taxation",
    "chapter": "20",
    "chapter_name": "Rental License Excise Tax",
    "anchor": "3-20-4",
    "heading": "Definitions.",
    "verbatim": "3-20-4. Definitions.\nThe definitions in Chapter 12-2, \"Landlord-Tenant Relations, No Eviction Without Representation,\" B.R.C. 1981, shall apply to this chapter.\nOrdinance No. 8412 (2020)"
  },
  {
    "corpus": "BRC",
    "title": "3",
    "title_name": "Revenue and Taxation",
    "chapter": "20",
    "chapter_name": "Rental License Excise Tax",
    "anchor": "3-20-5",
    "heading": "Exemptions.",
    "verbatim": "3-20-5. Exemptions.\nThe tax imposed by this chapter shall not apply to any rental license if associated with any dwelling unit that is exempt from a rental license in Section 10-3-2, B.R.C. 1981, exempt from the rental license fee in Subsection 10-3-12(d), B.R.C. 1981, or to a unit that is certified by the city manager as an affordable rental unit.\nOrdinance Nos. 8412 (2020); 8462 (2021)"
  },
  {
    "corpus": "BRC",
    "title": "3",
    "title_name": "Revenue and Taxation",
    "chapter": "20",
    "chapter_name": "Rental License Excise Tax",
    "anchor": "3-20-6",
    "heading": "Dedicated Revenues.",
    "verbatim": "3-20-6. Dedicated Revenues.\nThe revenues from this sales tax shall be designated for the administrative cost of the tax, and once that obligation has been fulfilled, used for implementation and administration and enforcement of a program to provide representation to tenants who face the loss of housing in eviction and administrative proceedings, to provide a Tenant's Legal Services and Assistance Coordinator to administer the program; to create a tenants' committee comprised of five members paid a $1,000 per year stipend; and to pay any related expenses; to pay costs associated with approaches to mediation or other alternative dispute resolution methods; and to use funding for rental assistance and associated services for persons that are vulnerable to eviction.\nOrdinance Nos. 8412 (2020); 8462 (2021)"
  },
  {
    "corpus": "BRC",
    "title": "3",
    "title_name": "Revenue and Taxation",
    "chapter": "20",
    "chapter_name": "Rental License Excise Tax",
    "anchor": "3-20-7",
    "heading": "Tax Increase.",
    "verbatim": "3-20-7. Tax Increase.\nThe city council is authorized to increase the annual excise tax rate by an amount not to exceed the Colorado consumer price index or a similar index that is tied to the annual rate of inflation in the state or Denver metropolitan area.\nOrdinance No. 8412 (2020)"
  },
  {
    "corpus": "BRC",
    "title": "3",
    "title_name": "Revenue and Taxation",
    "chapter": "20",
    "chapter_name": "Rental License Excise Tax",
    "anchor": "3-20-8",
    "heading": "Tax Collection.",
    "verbatim": "3-20-8. Tax Collection.\nThe city manager is authorized to arrange for other entities to collect the tax that is required by this section.\nOrdinance No. 8462 (2021)"
  },
  {
    "corpus": "BRC",
    "title": "3",
    "title_name": "Revenue and Taxation",
    "chapter": "21",
    "chapter_name": "Oil and Gas Pollution Tax",
    "anchor": "3-21-1",
    "heading": "Legislative Intent.",
    "verbatim": "3-21-1. Legislative Intent.\nThis chapter is to impose the oil and gas pollution tax approved by the voters in November 2018 as provided in Ordinance 8264. This chapter is being added to this code at the same time as the oil and gas provisions in Title 9, \"Land Use Code,\" B.R.C. 1981, allowing the extraction of oil and natural gas within the city limits. The voters approved a tax at the rate of up to $6.90 per barrel of oil and up to $0.88 per thousand cubic feet of natural gas for oil or gas extracted within the city limits. The city council has determined to set the rate of the tax at the full amount approved by the voters for oil or gas extracted within the city limits. This rate was determined based on the societal cost of fossil fuels.\nOrdinance No. 8514 (2021)"
  },
  {
    "corpus": "BRC",
    "title": "3",
    "title_name": "Revenue and Taxation",
    "chapter": "21",
    "chapter_name": "Oil and Gas Pollution Tax",
    "anchor": "3-21-2",
    "heading": "Imposition and Rate of Tax.",
    "verbatim": "3-21-2. Imposition and Rate of Tax.\n(a)\tOil Excise Tax. There is levied and shall be paid and collected an excise tax of $6.90 per barrel of oil extracted within the city limits.\n(b)\tNatural Gas Excise Tax. There is levied and shall be paid and collected an excise tax of $0.88 per cubic foot of natural gas extracted within the city limits.\nOrdinance No. 8514 (2021)"
  },
  {
    "corpus": "BRC",
    "title": "3",
    "title_name": "Revenue and Taxation",
    "chapter": "21",
    "chapter_name": "Oil and Gas Pollution Tax",
    "anchor": "3-21-3",
    "heading": "Vendor Liable for Tax.",
    "verbatim": "3-21-3. Vendor Liable for Tax.\n(a)\tOil Excise Tax. The operator of oil and gas operations with a point of extraction within the city shall pay the tax on oil imposed by this chapter.\n(b)\tNatural Gas Excise Tax. The operator of oil and gas operations with a point of extraction within the city shall pay the tax on gas imposed by this chapter.\n(c)\tThe burden of proving that any transaction is not subject to the tax imposed by this chapter is upon the person who has the duty to collect the tax imposed.\nOrdinance No. 8514 (2021)"
  },
  {
    "corpus": "BRC",
    "title": "3",
    "title_name": "Revenue and Taxation",
    "chapter": "21",
    "chapter_name": "Oil and Gas Pollution Tax",
    "anchor": "3-21-4",
    "heading": "Definitions.",
    "verbatim": "3-21-4. Definitions.\nFor purposes of this chapter, extraction occurs at the well pad.\nOrdinance No. 8514 (2021)"
  }
]