[
  {
    "corpus": "BRC",
    "title": "1",
    "title_name": "GENERAL ADMINISTRATION",
    "chapter": "1",
    "chapter_name": "Construction and Interpretation",
    "anchor": "1-1-1",
    "heading": "Legislative Intent.",
    "verbatim": "1-1-1. Legislative Intent.\nThe purpose of this chapter is to provide general rules for the interpretation of this code and other ordinances of the city."
  },
  {
    "corpus": "BRC",
    "title": "1",
    "title_name": "GENERAL ADMINISTRATION",
    "chapter": "1",
    "chapter_name": "Construction and Interpretation",
    "anchor": "1-1-2",
    "heading": "How Code Designated and Cited.",
    "verbatim": "1-1-2. How Code Designated and Cited.\nThe ordinances embraced in this and the following chapters and sections constitute and are designated the \"Boulder Revised Code 1981,\" which may be referred to as B.R.C. 1981."
  },
  {
    "corpus": "BRC",
    "title": "1",
    "title_name": "GENERAL ADMINISTRATION",
    "chapter": "1",
    "chapter_name": "Construction and Interpretation",
    "anchor": "1-1-3",
    "heading": "Catchlines of Sections.",
    "verbatim": "1-1-3. Catchlines of Sections.\nThe city council intends that the catchlines of the several sections of this code printed in boldface type be mere catchwords to indicate the contents of the section and not titles or parts of such sections, nor, unless expressly so provided, are amendments or reenactments of any catchlines intended to be titles or parts of such sections."
  },
  {
    "corpus": "BRC",
    "title": "1",
    "title_name": "GENERAL ADMINISTRATION",
    "chapter": "1",
    "chapter_name": "Construction and Interpretation",
    "anchor": "1-1-4",
    "heading": "Severability of Parts of Code.",
    "verbatim": "1-1-4. Severability of Parts of Code.\nThe city council intends that the sections, paragraphs, sentences, clauses and phrases of this code be severable. If any phrase, clause, sentence, paragraph or section of this code is declared unconstitutional or invalid by the valid judgment or decree of any court of competent jurisdiction, such unconstitutionality or invalidity does not affect any of the remaining phrases, clauses, sentences, paragraphs and sections of this code, unless it appears to the court that the valid provisions of the section or ordinance are so essentially and inseparably connected with, and so dependent upon, the void provision that it cannot be presumed the council would have enacted the valid provisions without the void one; or unless the court determines that the valid provisions, standing alone, are incomplete and are incapable of being executed in accordance with the legislative intent. If provision of an exception invalidates a prohibition, but the prohibition without the exception would be valid, then it is council's intent in such cases that the exception be severed and the prohibition upheld.\nOrdinance No. 5186 (1989)"
  },
  {
    "corpus": "BRC",
    "title": "1",
    "title_name": "GENERAL ADMINISTRATION",
    "chapter": "1",
    "chapter_name": "Construction and Interpretation",
    "anchor": "1-1-5",
    "heading": "Liberal Construction.",
    "verbatim": "1-1-5. Liberal Construction.\nThe city council intends that all general provisions, terms, phrases and expressions contained in this code be liberally construed in order that the council's true intent and meaning may be fully implemented."
  },
  {
    "corpus": "BRC",
    "title": "1",
    "title_name": "GENERAL ADMINISTRATION",
    "chapter": "1",
    "chapter_name": "Construction and Interpretation",
    "anchor": "1-1-6",
    "heading": "Common and Technical Usage.",
    "verbatim": "1-1-6. Common and Technical Usage.\nThe city council intends that words and phrases be read in context and construed according to the rules of grammar and common usage. Words and phrases that have acquired a technical or particular meaning, whether by legislative definition or otherwise, are intended to be construed accordingly."
  },
  {
    "corpus": "BRC",
    "title": "1",
    "title_name": "GENERAL ADMINISTRATION",
    "chapter": "1",
    "chapter_name": "Construction and Interpretation",
    "anchor": "1-1-7",
    "heading": "Singular and Plural.",
    "verbatim": "1-1-7. Singular and Plural.\nUnless the context clearly indicates otherwise, the singular includes the plural, and the plural includes the singular."
  },
  {
    "corpus": "BRC",
    "title": "1",
    "title_name": "GENERAL ADMINISTRATION",
    "chapter": "1",
    "chapter_name": "Construction and Interpretation",
    "anchor": "1-1-8",
    "heading": "Tense.",
    "verbatim": "1-1-8. Tense.\nUnless the context clearly indicates otherwise, words in the present tense include the future tense."
  },
  {
    "corpus": "BRC",
    "title": "1",
    "title_name": "GENERAL ADMINISTRATION",
    "chapter": "1",
    "chapter_name": "Construction and Interpretation",
    "anchor": "1-1-9",
    "heading": "Gender.",
    "verbatim": "1-1-9. Gender.\nWhenever this code or any ordinance of the city refers to the feminine or masculine gender, it is deemed to refer to both genders."
  },
  {
    "corpus": "BRC",
    "title": "1",
    "title_name": "GENERAL ADMINISTRATION",
    "chapter": "1",
    "chapter_name": "Construction and Interpretation",
    "anchor": "1-1-10",
    "heading": "Computation of Time.",
    "verbatim": "1-1-10. Computation of Time.\n(a)\tIn computing a period of days, the first day is excluded and the last day is included.\n(b)\tExcept as otherwise expressly provided by this code or any ordinance of the city or applicable state statute, if the last day of any period is a Saturday, Sunday or legal holiday, the period is extended to include the next day which is not a Saturday, Sunday or legal holiday.\n(c)\tIf a number of months is to be computed by counting the months from a particular day, the period ends on the same numerical day in the concluding month as the day of the month from which the computation is begun, unless there are not that many days in the concluding month, in which case the period ends on the last day of that month."
  },
  {
    "corpus": "BRC",
    "title": "1",
    "title_name": "GENERAL ADMINISTRATION",
    "chapter": "1",
    "chapter_name": "Construction and Interpretation",
    "anchor": "1-1-11",
    "heading": "Joint Authority.",
    "verbatim": "1-1-11. Joint Authority.\nA grant of authority to three or more persons as a public body confers the authority upon a majority of the number of members fixed by the code."
  },
  {
    "corpus": "BRC",
    "title": "1",
    "title_name": "GENERAL ADMINISTRATION",
    "chapter": "1",
    "chapter_name": "Construction and Interpretation",
    "anchor": "1-1-12",
    "heading": "Conflict in the Expression of Numbers.",
    "verbatim": "1-1-12. Conflict in the Expression of Numbers.\nIf there is a conflict between figures and words in expressing a number, the words govern."
  },
  {
    "corpus": "BRC",
    "title": "1",
    "title_name": "GENERAL ADMINISTRATION",
    "chapter": "1",
    "chapter_name": "Construction and Interpretation",
    "anchor": "1-1-13",
    "heading": "Standard Time, Daylight Saving Time.",
    "verbatim": "1-1-13. Standard Time, Daylight Saving Time.\nUnited States Mountain Time, as defined by state law, applies to all ordinances, rules and regulations relating to the time of performance of any act by any officer or department of this city, relating to the time in which any rights accrue or determine, or within which any act shall or shall not be performed by any person subject to the jurisdiction of the city."
  },
  {
    "corpus": "BRC",
    "title": "1",
    "title_name": "GENERAL ADMINISTRATION",
    "chapter": "1",
    "chapter_name": "Construction and Interpretation",
    "anchor": "1-1-14",
    "heading": "Intention in Enacting Ordinances.",
    "verbatim": "1-1-14. Intention in Enacting Ordinances.\nIn enacting an ordinance the city council intends:\n(a)\tTo comply with the city charter and the constitutions of the State of Colorado and the United States;\n(b)\tThat the entire ordinance be effective;\n(c)\tA just and reasonable result;\n(d)\tA result that may be feasibly executed; and\n(e)\tThat the public interest be favored over any private interest."
  },
  {
    "corpus": "BRC",
    "title": "1",
    "title_name": "GENERAL ADMINISTRATION",
    "chapter": "1",
    "chapter_name": "Construction and Interpretation",
    "anchor": "1-1-15",
    "heading": "Ambiguous Ordinances, Aids in Construction.",
    "verbatim": "1-1-15. Ambiguous Ordinances, Aids in Construction.\nIf an ordinance is ambiguous, a court in determining the intent of the city council may consider, among other matters:\n(a)\tThe legislative declaration or purpose\n(b)\tThe object sought to be obtained;\n(c)\tThe administrative construction of the ordinance;\n(d)\tThe legislative history, if any;\n(e)\tThe circumstances under which the ordinance was enacted;\n(f)\tThe common law or former code provisions, including ordinances upon the same or similar subjects; and\n(g)\tThe consequences of a particular construction."
  },
  {
    "corpus": "BRC",
    "title": "1",
    "title_name": "GENERAL ADMINISTRATION",
    "chapter": "1",
    "chapter_name": "Construction and Interpretation",
    "anchor": "1-1-16",
    "heading": "Special or Local Provision Prevails Over General.",
    "verbatim": "1-1-16. Special or Local Provision Prevails Over General.\nIf a general provision conflicts with a special or local provision, the city council intends that it be construed, if possible, so that effect is given to both. If the conflict between the provisions is irreconcilable, the special or local provision prevails as an exception to the general provision, unless the general provision is the later adoption and the manifest intent is that the general provision prevail."
  },
  {
    "corpus": "BRC",
    "title": "1",
    "title_name": "GENERAL ADMINISTRATION",
    "chapter": "1",
    "chapter_name": "Construction and Interpretation",
    "anchor": "1-1-17",
    "heading": "Irreconcilable Ordinances.",
    "verbatim": "1-1-17. Irreconcilable Ordinances.\nIf the city council enacts an ordinance that is irreconcilable with another provision of this code, the ordinance whose effective date is latest prevails."
  },
  {
    "corpus": "BRC",
    "title": "1",
    "title_name": "GENERAL ADMINISTRATION",
    "chapter": "1",
    "chapter_name": "Construction and Interpretation",
    "anchor": "1-1-18",
    "heading": "Continuation of Prior Law.",
    "verbatim": "1-1-18. Continuation of Prior Law.\n(a)\tAn ordinance is presumed to be prospective in its operation.\n(b)\tThe provisions appearing in this and the following chapters, so far as they are the same as or substantially similar to the provisions of \"The Revised Code of the City of Boulder, Colorado 1965,\" as amended, which they replace, are deemed to be continuations thereof and not new enactments.\n(c)\tAn ordinance that is reenacted, revised or amended is intended to be a continuation of the prior law and not a new enactment to the extent that its terms are the same as the prior ordinance."
  },
  {
    "corpus": "BRC",
    "title": "1",
    "title_name": "GENERAL ADMINISTRATION",
    "chapter": "1",
    "chapter_name": "Construction and Interpretation",
    "anchor": "1-1-19",
    "heading": "Reference to Ordinances.",
    "verbatim": "1-1-19. Reference to Ordinances.\nA reference to any ordinance or title, chapter, section or any part thereof of this code applies to all reenactments or revisions thereof or amendments thereto."
  },
  {
    "corpus": "BRC",
    "title": "1",
    "title_name": "GENERAL ADMINISTRATION",
    "chapter": "1",
    "chapter_name": "Construction and Interpretation",
    "anchor": "1-1-20",
    "heading": "Accumulation of Remedies.",
    "verbatim": "1-1-20. Accumulation of Remedies.\nThe remedies provided for in any section of this code are cumulative. Unless otherwise expressly provided by this code or any ordinance of the City, no action taken by the City constitutes an election by the City to pursue any remedy to the exclusion of any other remedy provided by this code or other ordinance of the City."
  },
  {
    "corpus": "BRC",
    "title": "1",
    "title_name": "GENERAL ADMINISTRATION",
    "chapter": "1",
    "chapter_name": "Construction and Interpretation",
    "anchor": "1-1-21",
    "heading": "Meaning of \"May,\" \"Shall\" and Present Tense.",
    "verbatim": "1-1-21. Meaning of \"May,\" \"Shall\" and Present Tense.\nWhen used in this code or any ordinance of the City, the use of the \"present tense\" and the word \"shall\" mandate or prohibit an action, and the word \"may\" confers authority or privilege to act."
  },
  {
    "corpus": "BRC",
    "title": "1",
    "title_name": "GENERAL ADMINISTRATION",
    "chapter": "1",
    "chapter_name": "Construction and Interpretation",
    "anchor": "1-1-22",
    "heading": "Rounding Rule.",
    "verbatim": "1-1-22. Rounding Rule.\n(a)\tUnless otherwise specifically provided, if it is necessary under this code or any ordinance of the City to determine which whole number a computed fractional number represents, it shall be presumed to represent the lower.\n(b)\tThis section does not apply to title 10, \"Structures,\" B.R.C. 1981, nor to any codes adopted by reference therein.\nOrdinance No. 4927 (1985)"
  },
  {
    "corpus": "BRC",
    "title": "1",
    "title_name": "GENERAL ADMINISTRATION",
    "chapter": "2",
    "chapter_name": "Definitions",
    "anchor": "1-2-1",
    "heading": "Definitions.",
    "verbatim": "1-2-1. Definitions.\n(a)\tThe definitions in this chapter apply throughout this code unless a term is defined differently in a specific title, chapter or section.\n(b)\tThe following words used in this code and other ordinances of the City have the following meanings unless the context clearly indicates otherwise:\nAbandoned motor vehicle means any motor vehicle that is left in one location on public property or on private property without the consent of the owner thereof for twenty-four hours or more than the time limited by any signs, parking payment apparatus or technology, or pavement markings that apply to that location, or for a continuous period of more than seventy-two hours at any otherwise unregulated location.\nAccessory means subordinate or incidental to, and on the same lot or on a contiguous lot in the same ownership, as the building or use being identified or advertised.\nAffirmative defense means a defense in which the defendant, to raise the issue, presents some credible evidence on that issue, unless the City's evidence raises the issue involving the alleged defense. If the issue involved in an affirmative defense is raised, then the guilt of the defendant must be established beyond a reasonable doubt as to that issue as well as all other elements of the violation.\nAge means age between forty and sixty-five years.\nAgency means the city council and any officer, employee, department, division or other agency of the City of Boulder, including boards and commissions, but excludes the municipal court.\nAlley means a street or way within a block set apart for public use, vehicular travel and local convenience to provide access to the rear or side of the abutting lots or buildings.\nAmbulatory vendor means any person who engages in the business of selling balloons, flowers or shoeshines while moving about the downtown Boulder mall or a portrait artist with a minimum amount of artist's equipment.\nAnnual world-class pro cycling race means one cycling race per year and associated events per year that is designated and approved by the city manager. The cycling race shall be sanctioned or recognized by a national governing body of competitive cycling, with media coverage to national and international audiences. The cycling race shall be conducted exclusively on paved roads.\nAntique vehicle means a vehicle registered with and licensed by the Colorado State Division of Motor Vehicles of the Department of Revenue or the department of motor vehicles of any other state as an antique vehicle.\nAppear on behalf of means to act as a witness, advocate or expert or otherwise to support the position of another person.\nArchitectural projection means any projection that is not intended for occupancy and that extends beyond the face of an exterior wall of a building, including, without limitation, a roof overhang, mansard, unenclosed exterior balcony, marquee, canopy, awning, pilaster and fascia, but not including a sign.\nAuthorized emergency vehicle means every vehicle equipped with audible or visual signals meeting the requirements of § 42-4-212, C.R.S., as amended, and operated by a city police officer, city firefighter or any peace officer, and every other vehicle defined as an authorized emergency vehicle by state law.\nAuthorized service vehicle means such highway or traffic maintenance vehicles as are publicly owned and operated on a highway by or for a governmental agency, the function of which requires the use of service vehicle warning lights as prescribed by state law, and such other vehicles having a public service function, including, without limitation, public utility vehicles and tow trucks, as determined by the state department of highways under § 42-4-214(5), C.R.S., as amended. Some vehicles may be designated as both an authorized emergency vehicle and an authorized service vehicle.\nAutomotive vehicle means any vehicle, including every device in, upon or by which any person or property is or may be transported or drawn upon a public highway or any device used or designed for aviation or for flight in the air and upon which a specific ownership tax is imposed by the State of Colorado, including, without limitation, all motor vehicles, trailers, semi-trailers and aircraft, but excluding devices moved by human power or used exclusively upon stationary rails or tracks.\nAwning means an architectural projection roofed with flexible material, including, without limitation, fabric, supported entirely from an exterior wall of a building, and that may be retracted, folded or collapsed against the face of the supporting building.\nAwning sign means a sign depicted or placed upon, attached to, constructed in or supported by a marquee, canopy or awning.\nBallot proposition means any amendment to the city charter, initiative, referendum or recall, for which petitions have been properly certified by the city clerk for submission to the city council or any ordinance or issue put to a vote of only the electors of the City of Boulder. Such term does not include any ballot issue placed on the ballot by the United States, the State of Colorado or any political or other subdivision thereof except the City.\nBasement means that portion of a dwelling between floor and ceiling that is located partly below and partly above grade and has less than half its clear floor-to-ceiling height below the average grade of the adjoining ground abutting the exterior walls of the dwelling unit.\nBathroom means a room containing a toilet that may also contain a lavatory, shower or bathtub.\nBicycle means a vehicle propelled solely by human power through a chain, belt or gears and that has at least one wheel more than fourteen inches in diameter.\nBike path or bicycle path means a separate path that has been designated for use by bicycles by traffic control device or other sign and that is separated from the roadway for other vehicular traffic by open space or a barrier.\nBlue Line means the line above which the City of Boulder shall not supply water for domestic, commercial or industrial uses, as described in Section 128A of the Charter of the City of Boulder, except as specifically stated therein.\nBrush means woody shrubs not part of a planned and maintained landscape of either a highly structured manicured type or a natural appearance.\nBuilding means any structure built for the support, shelter or enclosure of persons, animals or property of any kind.\nBuilding extension means any structure that is an extension of an existing building front or basement adjacent to the mall and that encroaches upon the mall.\nBuilding ornament means any awning, sign, planter box or other ornament on a building adjacent to the mall that encroaches upon the air space above the mall.\nBusiness means all activities in which a person engages or in which such person causes another to be engaged with the object of gain, benefit or advantage, whether direct or indirect.\nCamper means a unit containing cooking or sleeping facilities that is designed to be loaded onto or affixed to the bed or chassis of a truck to provide temporary living quarters for recreational camping or travel use.\nCandidate means any person for whom a petition as a choice for an elective office of the City has been completed, certified and filed in the office of the city clerk, pursuant to Charter Section 26, including a candidate to fill a possible vacancy at a recall election, unless such person withdraws as a choice for that elective office. The term also means those persons elected to, reelected to or appointed to elective offices in the City.\nCanopy means a roofed architectural projection which is supported by an exterior wall of a building and by additional supports, including, without limitation, columns, upright poles or braces extended from the ground.\nCellar means that portion of a dwelling that is located partly or wholly below grade and has half or more than half of its clear floor-to-ceiling height below the average grade of the adjoining ground abutting the exterior walls of the dwelling unit.\nCentral Area General Improvement District or CAGID means the City of Boulder Central Area General Improvement District established by Ordinance 3644 (1970), as subsequently amended.\nCharitable organization means any entity organized and operated in the City exclusively for religious or charitable purposes, no part of whose net earnings inures to the benefit of any private shareholder or individual, no substantial part of whose activities is carrying on propaganda or otherwise attempting to influence legislation, and that does not participate in or intervene in any political campaign on behalf of any candidate for public office or publish or distribute any statements on such candidate's behalf.\nCharter means the charter of the City of Boulder, Colorado, as amended.\nCity means the City of Boulder, Colorado.\nCity clerk or city treasurer means the chief financial officer, city clerk and city treasurer.\nCity council means the city council of the City of Boulder, Colorado.\nCity manager means the city manager of the City of Boulder, Colorado or the manager's authorized representative.\nCity of Boulder Design and Construction Standards means the design and construction standards adopted by Ordinance 5986 (1998), amended by Ordinance 7088 (2000), and including any subsequent amendments to those standards adopted by ordinance.\nCleanable means having a smooth, hard surface that is free from unsealed breaks and impervious to the amount of water that would be used in cleaning.\nCode enforcement officer means any city employee or person employed under independent contract by the City who is appointed by the city manager to enforce the laws of the City. Code enforcement officer also means an authorized volunteer appointed by the city manager to enforce the laws concerning parking of vehicles in spaces reserved for the handicapped by issuing parking tickets.\nCompostable material or compostables means any organic material that will naturally degrade and that has been designated as compostable by city manager regulation. Compostable materials may include, without limitation:\n(1)\tYard clippings, wood, branches, twigs, leaves and animal or vegetable based food scraps resulting from the preparation, cooking and serving of food;\n(2)\tOrganic material that has been generated by any residential or commercial source; and\n(3)\tOrganic material that has been completely segregated from trash by the generator for the purpose of being composted or otherwise processed through natural degradation into soil amendment, fertilizer or mulch.\nCondominium means real property having more than one dwelling unit and the ownership of which consists of separate, divided fee simple estates in individual air space units, together with an undivided fee simple interest in the common elements appurtenant to such units.\nCondominium conversion means the transfer of ownership of less than the total number of dwelling units in a multiple dwelling unit structure, where the ownership interests created by the transfer of ownership are in a number of dwelling units that is less than the total number of units in the structure in which the seller had an interest prior to the sale or, with respect to a mobile home park, the transfer of ownership of the mobile home park property so that it is jointly and severally owned by the owners of the mobile homes upon such property.\nCondominium unit means a form of property ownership of airspace, as defined in § 38-33-103, C.R.S.\nConstruction project means the erection, installation, alteration, repair or remodeling of a building or structure upon real estate or any other activity for which a building permit is required under this code or an ordinance of the City.\nContractor means any person who undertakes with or for another person within the City to build, construct, install, demolish, alter, repair or move any (a) building or structure, or any portion thereof, or (b) poles, lines, cables or other transmission or distribution facilities in any right of way or utility easement.\nDeveloper means any person who participates in any manner in the development of land.\nDevelopment means any plan to construct or place one or more dwelling units on a particular parcel of land within the City.\nDriver means every person who drives or is in actual physical control of the steering, accelerating or braking controls of a vehicle or the rider of an animal. No person shall be deemed not to be the driver or to drive because a vehicle is out of control except immediately following a collision not proximately caused by a traffic violation of such driver. A person dismounted from a bicycle, moped, low-power scooter, or motorcycle and pushing it on foot is a pedestrian, not a driver.\nDwelling means any building, structure or other housing accommodation that is wholly or partly used or intended to be used for living or sleeping by human occupants, but excludes temporary housing.\nDwelling unit means one room or rooms connected together for residential occupancy and including bathroom and kitchen facilities. If there is more than one meter for any utility, address to the property or kitchen; or if there are separate entrances to rooms which could be used as separate dwelling units; or if there is a lockable, physical separation between rooms in the dwelling unit such that a room or rooms on each side of the separation could be used as a dwelling unit, multiple dwelling units are presumed to exist; but this presumption may be rebutted by evidence that the residents of the dwelling share utilities and keys to all entrances to the property and that they: 1) share a single common bathroom as the primary bathroom, or 2) share a single common kitchen as the primary kitchen.\nDwelling unit, detached means a detached principal building other than a mobile home, designed for or used as a dwelling with no more than one dwelling unit within a structure.\nDuplex means a structure containing only two dwelling units.\nElectric assisted bicycle means a vehicle having two tandem wheels or two parallel wheels and one forward wheel, fully operable pedals, and an electric motor not exceeding 750 watts of power. Electric assisted bicycles are further required to conform to one of two classes as follows:\n(1)\tClass 1 electric assisted bicycle means an electric assisted bicycle equipped with an electric motor that provides assistance only when the rider is pedaling and that ceases to provide assistance when the bicycle reaches a speed of twenty miles per hour.\n(2)\tClass 2 electric assisted bicycle means an electric assisted bicycle equipped with an electric motor that provides assistance regardless of whether the rider is pedaling but ceases to provide assistance when the bicycle reaches a speed of twenty miles per hour.\nExtermination means control and elimination of insects, rodents, vermin or other pests by eliminating their harborage and materials that may serve as their food or by taking recognized, legal methods of eliminating pests, including, without limitation, poisoning, spraying, fumigating or trapping.\nFamily means the heads of household plus the following persons who are related to the heads of the household: parents and children, grandparents and grandchildren, brothers and sisters, aunts and uncles, nephews and nieces, first cousins, the children of first cousins, great grandchildren, great grandparents, great great grandchildren, great great grandparents, grandnieces, grandnephews, great aunts and great uncles. These relationships may be of the whole or half blood, by adoption, guardianship, including foster children, or through a marriage or a domestic partnership meeting the requirements of chapter 12-4, \"Domestic Partners,\" B.R.C. 1981, to a person with such a relationship with the heads of household.\nFinal construction acceptance means the City's acceptance of public improvements and appurtenances thereto constructed or installed by the developer or subdivider at the end of the prescribed warranty period on such improvements and after correction of any deficiencies discovered in the final inspection of such improvements.\nFirearm means any handgun, automatic revolver, pistol, rifle, shotgun or other instrument or device capable or intended to be capable of discharging bullets, cartridges or other explosive charges.\nFirefighter means any person commissioned as such under the provisions of Section 2-5-4, \"Identification Card for Firefighters,\" B.R.C. 1981, and any member of another fire department who is acting under the direction of the City of Boulder Fire Department and is identifiable as a firefighter.\nFood means any raw, cooked or processed edible substance, beverage or ingredient used or intended for use or for sale in whole or in part for human consumption.\nFrontage, building means the horizontal, linear dimension of that side of a building that abuts a street, a parking area, a mall or other circulation area open to the general public and that has either the primary window display of the enterprise or the primary public entrance to the building; in industrial districts, the building side with the primary entrance open to employees is the building frontage; where more than one use occupies a building, each such use having a primary window display or a primary public entrance for its exclusive use is considered to have its own building frontage, which is the front width of the portion of the building frontage occupied by that use.\nFrontage, street means the linear frontage of a lot or parcel abutting a private or public street that provides principal access to or visibility of the premises.\nGarbage means trash.\nGeneral circulation means delivered to a substantial number of residences in the City and also otherwise made available for purchase or distribution.\nGrade means the average of the finished ground level at the center of all walls of a building. When walls are parallel to and within five feet of a sidewalk, \"grade\" means the sidewalk level.\nHabitable room means a room or enclosed floor space used, intended to be used or designed to be used for living, sleeping, eating or cooking and excludes bathrooms, toilet compartments, closets, halls and storage places.\nHauler means any person engaged in the business of collecting, transporting or disposing of trash, recyclables or compostables for another.\nHeads of the household means one person or up to two persons who are married or are domestic partners meeting the requirements of chapter 12-4, \"Domestic Partners,\" B.R.C. 1981.\nHeight of a sign, high or in height means the vertical distance measured from the elevation of the nearest sidewalk, or, if there is no sidewalk within twenty-five feet, from the lowest point of the finished grade on the lot upon which the sign is located and within twenty-five feet of the sign, to the uppermost point on the sign or the sign structure, whichever is higher.\nHereafter means any time after the effective date of this code.\nHeretofore means any time previous to the effective date of this code.\nHoliday means New Year's Day, Martin Luther King, Jr. Day, President's Day, Memorial Day, Independence Day, Labor Day, Colorado Day, Thanksgiving Day, Christmas Day and such additional entire days declared as holidays by city ordinance.\nHotel means an establishment that offers temporary lodging, for less than one month, in rooms, and that may provide meals, entertainment and various personal services for the public, but excludes a \"bed and breakfast\" as defined in Section 9-16-1, \"General Definitions,\" B.R.C. 1981.\nHotel room, motel room or other accommodation means any room or other accommodation in any hotel, apartment-hotel, motel, guest house, trailer court or any such similar place to any person who for a consideration uses, possesses or has the right to use or possess such room or other accommodation for a total continuous duration of less than one month.\nHousing means any building, structure, vacant land or part thereof during the period it is advertised, listed or offered for sale, lease, rent or transfer of ownership, except that transfer does not include transfer of property by will or gift.\nIncarcerate means the restraint of a person authorized by Chapter 2-6, \"Courts and Confinements,\" B.R.C. 1981, in lieu of immediate release on summons and complaint, and \"for custodial arrest\" includes transportation to a detention facility, booking and lodging in a detention facility. The term also means lodging in a detention facility under a sentence imposed by the municipal court.\nIncome means the gross amount of money received during the year by an individual or family.\nInfestation means the presence of insects, rodents, vermin or other pests of a kind or in a quantity that endanger health within or around a dwelling.\nInoperable motor vehicle means any motor vehicle that does not have a current license plate and a validation sticker lawfully affixed thereto or that is apparently inoperable due to being wrecked, dismantled or partially dismantled, or having essential parts missing.\nIntentionally or with intent means that one's conscious objective is to cause the specific result proscribed by the provision of this code or the ordinance defining the violation. All violations defined in this code in which the mental culpability requirement is expressed as intentionally or with intent are specific intent offenses. It is immaterial to the issue of specific intent whether or not the result actually occurred.\nInterested person means any person described as interested by city charter, ordinance, or code, or state or federal constitution or law, any person having a legally protected interest under city charter, ordinance, or code, or state or federal constitution or law that is subject to potential injury in fact due to proposed final agency action, or any person having a right of appeal therefrom by virtue of a specific provision of city charter, ordinance, or code, or state or federal constitution or law. Interested person may include a city agency.\nIntersection means the area embraced within the prolongation or connection of the lateral curblines of two streets that join one another at, or approximately at, right angles, or the area within which vehicles traveling upon different streets joining at any other angle may come in conflict, whether or not one such street crosses the other, but the term does not include the junction of any alley with a street. If a street includes two roadways thirty feet or more apart, every crossing of each roadway of such divided street by an intersecting street is a separate intersection. If such intersecting street also includes two roadways thirty feet or more apart, every crossing of such streets is a separate intersection. The farthest applicable points shall be used when measuring.\nJudge means any judge of the municipal court.\nKeeper means a person who has custodial or supervisory authority or control over an animal.\nKiosk means a freestanding structure located within a pedestrian circulation area used for posting of notices or advertisement of goods.\nKitchen means any part of a room or dwelling unit that can be used for the preparation of food that includes one or more of the following: a refrigerator, cooking device, kitchen sink, or dishwasher. The following do not constitute a kitchen under this definition: (1) a wet bar; or (2) an ancillary refrigerator that is used solely to store food that is prepared in the kitchen of a principal dwelling unit.\nKnowingly or willfully means, with respect to conduct or to a circumstance described by a section of this code or an ordinance defining a violation, that a person is aware that such person's conduct is of that nature or that the circumstance exists. With respect to a result, this means that a person is aware that such person's conduct is practically certain to cause the result. All violations defined in this code in which the mental culpability requirement is expressed as knowingly or willfully are general intent offenses.\nLaw means any regulation, ordinance, provision of this code, or charter provision of the city; any rule, statute, or constitutional provision of the state which is binding on a home rule city; or any regulation, statute, or constitutional provision of the United States which is binding on the state or its cities.\nLot means a portion or parcel of land, including a portion of a platted subdivision, occupied or intended to be occupied by a building or use and its accessories, together with the yards required under the provisions of the zoning chapter of this code, which is an integral unit of land held under unified ownership in fee or co-tenancy or under legal control tantamount to such ownership.\nMall means the Boulder downtown pedestrian mall established by Ordinance No. 4022, adopted February 18, 1975, as amended by Ordinance No. 4267, adopted September 6, 1977. (2-18-1975).\nMay means is authorized to.\nMobile home means a transportable, single-family dwelling unit, suitable for year-round occupancy that contains the same water supply, waste disposal, and electrical conveniences as immobile housing, but that has no foundation other than wheels or removable jacks for conveyance on highways, and that may be transported to a site as one or more modules, but the term does not include \"travel trailers,\" \"campers,\" \"camper buses,\" \"motor homes,\" or modular homes designed to be placed on a foundation.\nMobile home park means any lot or tract of land designed, used, or intended to provide a location or accommodation for one or more mobile homes and upon which any mobile home or homes are parked or located, whether or not the lot or tract or any part thereof is held or operated for profit, but the term excludes automobile or mobile home sales lots on which mobile homes are parked only for inspection and sale.\nMobile home space means a plot of ground within a mobile home park designed for the accommodation of one mobile home and its accessory structures.\nMonth means a calendar month.\nMotel means a hotel that is arranged in such a manner that individual guest rooms are directly accessible from an automobile parking area.\nMotor home means a motor vehicle containing cooking or sleeping facilities and designed as temporary living quarters for recreational camping or travel use and includes, without limitation, vehicles designated as \"camper buses\" and those that may have been originally designed for use as vans or buses but that have been converted to use as living quarters.\nMotor vehicle means any self-propelled vehicle other than a moped, electric assisted bicycle, or motorized wheelchair.\nMulti-unit dwelling means a building used by two or more of the following groups of persons living independently of each other in separate dwelling units but not including motels, hotels, and detached dwelling units:\n(1)\tThe members of a family plus one or two roomers. The quarters the roomers use shall not exceed one-third of the total floor area of the dwelling unit and shall not be a separate dwelling unit;\n(2)\tUp to three individuals in RR-1, RR-2, RE, and RL zones;\n(3)\tUp to eight persons sixty years of age or older in RR-1, RR-2, RE, and RL zones;\n(4)\tUp to four individuals in RM, RMX, MU-1, MU-2, MU-3, RH-1, RH-2, RH-3, RH-4, RH-5, BT, BC, DT-1, DT-2, DT-3, DT-4, DT-5, IS, IG, IM, IMS, BMS, and BR zones; or\n(5)\tTwo individuals and any of their children by blood, marriage, guardianship, including foster children, or adoption.\nMunicipal court means the police magistrate's court or police court prescribed by Charter Sections 86 and 87 and described in Colorado Constitution Article XX, Sections 6(b) and (c).\nNegligently means to act with negligence with respect to a result or to a circumstance described by a section of this code by failing to exercise the degree of care that would be exercised by the ordinarily reasonable and prudent inhabitant of the city under the same or similar circumstances.\nNewspaper means a publication, having been in existence for at least six months, regularly printed and distributed no less than once a week, that contains news, opinions, advertisements, and other items of general interest.\nNotice or legal notice means any requirement for informing a person or persons, a segment of the public, or the public generally. A notice required to be published may be published in any newspaper of general circulation unless otherwise required by the charter, this code, or an ordinance of the city.\nOath includes an affirmation in all cases in which, by law, an affirmation may be substituted for an oath, and in such cases the words \"swear\" and \"sworn\" are equivalent to the words \"affirm\" and \"affirmed.\"\nOccupant means any person living in, sleeping in, possessing, or otherwise using any land, building, or part thereof.\nOpen space land means any interest in real property purchased or leased with the sales and use tax pledged to the open space fund pursuant to the vote of the electorate on November 7, 1967, November 7, 1989 and November 4, 1997, or proceeds thereof, any interest in real property dedicated to the city for open space purposes, and any interest in real property that is ever placed under the direction, supervision, or control of the department of open space and mountain parks, unless disposed of as expressly provided in Charter Section 177 and Subsection 2-3-9(e), B.R.C. 1981.\nOwner means a person as defined by this code, who, alone, jointly or severally with others, or in a representative capacity (including, without limitation, an authorized agent, executor or trustee), has legal or equitable title to any property in question.\nParking payment apparatus or technology has the meaning given in Section 7-1-1, \"Definitions,\" B.R.C. 1981. References to parking meter, pay station, or parking kiosk, if any, shall mean parking payment apparatus or technology.\nPeace officer means any police officer or city code enforcement officer.\nPerson means a natural person, corporation, firm, partnership, association, organization and any other group acting as a unit, as well as individuals. It also includes an executor, administrator, trustee, receiver or other representative appointed according to law. Whenever the word person is used in any provision of this code prescribing a penalty or fine as to partnership or associations, the word includes the partners or members thereof, and as to corporations, includes the officers, agents or members thereof who are responsible for any violation of such section. Person includes the plural as well as the singular.\nPlace of accommodation means any place of business engaged in any sales to the general public and any place that offers services, facilities, privileges or advantages to the general public or that receives financial support through solicitation of the general public or through governmental subsidy of any kind.\nPlace or event open to the public means any place or event, the admission or access to which is open to members of the public upon payment of a charge or fee. This term includes, without limitation, the following places and events when a charge or fee for admission to such places and events is imposed upon members of the public:\n(1)\tAny performance of a motion picture, stage show, play, concert or other manifestation of the performing arts;\n(2)\tAny sporting or athletic contest, exhibition or event, whether amateur or professional;\n(3)\tAny lecture, rally, speech or dissertation;\n(4)\tAny showing, display or exhibition of any type, such as an art exhibition; and\n(5)\tAny restaurant, tavern, lounge, bar or club, whether the admission is called a \"cover charge,\" \"door charge\" or any other such term.\nPolice officer means:\n(1)\tAny city police officer commissioned by the city manager;\n(2)\tAny person appointed by the city manager pursuant to Charter Section 72;\n(3)\tAny peace officer of another jurisdiction who is also commissioned by the city manager to enforce the laws of the City;\n(4)\tAny city park patrol officer commissioned by the city manager;\n(5)\tAny city fire chief, fire marshal or firefighter commissioned by the city manager; and\n(6)\tAny other city employee designated by the city manager to exercise police powers, including the power of arrest, and commissioned by the city manager.\nPossessor of real property means a person not the owner of the property who is in control of the property and is responsible as lessee, caretaker or otherwise for its care and upkeep.\nPreceding and following mean next before and next after, respectively.\nPreliminary construction acceptance means the City's acceptance of the developer's or subdivider's construction, installation and testing of public improvements and appurtenances thereto as conforming with city standards and defines the date on which the warranty period on such improvements commences.\nPremises of the owner or keeper of an animal means only that property over which the owner or keeper has full possession and control. The unenclosed property of a condominium or townhouse or the common passageway, parking facility or unenclosed common yard of an apartment building or shopping center are not premises of an owner or keeper.\nPrimary, primarily, principal or principally means more than half, if used in a quantifiable context, and first in rank, importance or value, if used in a context where ranking is possible but quantification is not.\nProperty means real, tangible and intangible personal property.\nProximate cause means that which, in natural and continuous sequence, unbroken by an efficient, intervening cause, produced the result complained of and without which the result would not have occurred.\nPublic authority means the City of Boulder, state of Colorado or the United States, any of their agencies or instrumentalities, and any body or official thereof possessing power or authority delegated by the public authority.\nPublic right of way means the entire area between property boundaries which is: owned by a government, dedicated to public use or impressed with an easement for public use; primarily used for pedestrian or vehicular travel; and publicly maintained, in whole or in part, for such use. Right of way includes, without limitation, the public street, shoulder, gutter, curb, sidewalk, sidewalk area, parking or parking strip and any other public way.\nPublic way means any street, alley, boulevard, parkway, highway, sidewalk or other public thoroughfare.\nQuorum means a majority of the number of members of a public body fixed by the charter, this code, another ordinance of the City or a statute.\nRat harborage means any plant growth, object or structure that provides rats with shelter from the weather, protection from predators or sites for nest building and rearing of young.\nReal property, premises, real estate or lands means lands, tenements and hereditaments.\nRecyclable materials or recyclables means any materials that are designated by city manager regulation to be recyclable. Such materials may include, without limitation, newspapers, magazines, sorted mail and office paper, cardboard, paperboard, telephone books, glass containers, plastic containers, steel cans, aluminum cans and scraps, reusable clothing and household items or anything else that has been discarded from residential or commercial sources and that is completely segregated from trash in order to divert it from landfills.\nRental property means all dwellings, dwelling units and rooming units located within the City and rented or leased for any valuable consideration, but the term excludes dwellings owned by the federal government, the state of Colorado or any of their agencies or political subdivisions and facilities licensed by the state of Colorado as health care facilities.\nRoadway means that portion of a street from curb to curb improved, designed or ordinarily used for vehicular travel. If a street includes two or more separate roadways, roadway refers to any such roadway separately, but not to all such roadways collectively.\nRodent means members of the order Rodentia, including, without limitation, rats and mice in the family Muridae, any other introduced rodents and various native species such as field mice, voles, wood rats, ground and tree squirrels, chipmunks and prairie dogs.\nRoof means the cover of any building, including the eaves and similar projections.\nRoof line means the highest point on any building where an exterior wall encloses usable floor space (including roof areas for housing mechanical equipment) and the highest point on any parapet wall if the parapet wall extends around the entire perimeter of the building.\nRooming house means an establishment where, for direct or indirect compensation, lodging, with or without kitchen facilities or meals, is offered for one month or more for three or more roomers living independently within rooming units.\nRooming unit means a type of housing accommodation that consists of a room or group of rooms for a roomer, arranged primarily for sleeping and studying, and that may include a private bath but does not include a sink or any cooking device.\nRubble means large brush wood, large cardboard boxes or parts thereof, large or heavy yard trimmings, discarded fence posts, crates, vehicle tires, junked motor vehicle bodies or parts thereof, scrap metal, bed springs, water heaters, discarded furniture and all other household goods or items, demolition materials, used lumber and other discarded or stored objects three feet or more in length, width or breadth.\nRunoff coefficient means the percentage of runoff from the parcel produced by a five-year storm according to the City of Boulder Design and Construction Standards.\nSafe, safely and in safety mean:\n(1)\tWithout hazard to person or property;\n(2)\tWithout in any way interfering with, impeding, hindering, obstructing or taking the right of way from any other vehicle or pedestrian;\n(3)\tIn an attentive, careful and prudent manner; and\n(4)\tAt a speed such that recovery from errors in judgment is possible.\nShall means is required to.\nSidewalk means that portion of the sidewalk area paved or otherwise improved, designed or ordinarily used for pedestrians and every such walk parallel and adjacent to a roadway.\nSidewalk area means the area between the curb of a street and the adjacent property lines.\nSign means any writing, pictorial representation, illustration, decoration (including any material used to differentiate sign copy from its background), landscaping, form, emblem, symbol, trademark, banner, flag, pennant, captive balloon, streamer, spinner, ribbon, sculpture, statue or any other figure of similar character that:\n(1)\tIs a structure or any part thereof (including the roof or wall of a building); or\n(2)\tIs written, printed, projected, painted, constructed or otherwise placed or displayed upon or designed into landscaping or a structure or a board, plate, canopy, awning, marquee or vehicle, or upon any material object or device whatsoever; and\n(3)\tBy reason of its form, color, wording, symbol, design, illumination or motion, attracts or is designed to attract attention to the subject thereof or is used as a means of identification, advertisement or announcement or political or artistic expression or decoration; but\n(4)\tLandscaping constitutes a sign only to the extent that it is planted, trimmed, graded, arranged or installed in such a manner as to convey an explicit commercial message.\nSignature means the name written in proper handwriting of such person or his or her mark.\nSound condition and good repair mean freedom from defects that would endanger the health, safety and welfare of the occupants of the structure.\nSpecific defense means a defense in which the defendant, to raise the issue, presents some credible evidence on that issue, unless the City's evidence raises the issue involving the defense. If the issue involved in the specific defense is raised, it may be submitted to the trier of fact along with other issues, but the defendant bears the burden of proving the issue by a preponderance of the evidence, although the City must prove all other issues by proof beyond a reasonable doubt in any criminal action.\nStairway means all stairwells and includes stair stringers, risers, treads, handrails, banisters and vertical and horizontal supports.\nState, the state or this state means the state of Colorado.\nState highway means a street designated as part of the state highway system under the provisions of § 43-2-134, C.R.S., as amended. Designation of the street as a state highway on any map published by the state or the City or marked as such by signs is prima facie evidence of such designation.\nStormwater means any flow occurring during or following any form of normal precipitation and resulting therefrom, including without limitation stormwater runoff, snow melt runoff, surface runoff and drainage.\nStreet means the entire width between the property boundary line of every way publicly maintained when any part thereof is open to the use of the public for purposes of vehicular travel and includes, without limitation, alleys or the entire width of every way declared to be a public highway by any law.\nStructure means any thing constructed or erected with a fixed location on the ground above grade, but the term does not include poles, lines, cables or other transmission or distribution facilities of public utilities.\nSubdivider means any person who participates in any manner in the dividing of land for the purpose, immediate or future, of sale or building development.\nSubdivision means the division of a lot, tract or parcel of land into two or more lots, plats, sites or other divisions of land for the purpose, whether immediate or future, of sale or building development for residential, industrial, commercial or other use, but the term excludes any transaction that is exempt from subdivision regulation under chapter 9-12, \"Subdivision,\" B.R.C. 1981.\nTemporary housing means any mobile home, camper or other structure used for human shelter that is designed to be transportable and is not attached to the ground, to another structure or to any utilities system.\nTenant - see definition of occupant.\nTime means, whenever certain hours are named in this code or on any traffic control sign or parking payment apparatus or technology, Mountain Standard Time or mountain daylight time, depending on the date, as prescribed by state law. Mountain Standard Time is Coordinated Universal Time minus seven hours. Mountain daylight time is Coordinated Universal Time minus six hours.\nTownhouse means a multi-unit dwelling in which the ownership of each dwelling unit consists of a separate fee simple estate on an individually platted lot, together with an undivided fee simple interest in the common elements, if any.\nTownhouse means an attached dwelling unit located or capable of being located on its own lot and separated from adjoining dwelling units by a wall extending from the foundation through the roof which is structurally independent of the corresponding wall of the adjoining unit.\nTownhouse unit means that part of a townhouse constituting a single dwelling unit.\nTraffic means pedestrians, ridden or herded animals, and vehicles, either singly or together, while using any street for purposes of travel.\nTraffic control sign means a sign on, above, or adjacent to a street placed by a public authority to regulate, warn, or guide traffic.\nTraffic control signal means a device on, above, or adjacent to a street placed by a public authority by which traffic is alternately directed to proceed and stop by means of the display of colored lights or symbols.\nTraffic engineer means the city manager, any city employee designated by the manager to act as traffic engineer or assistant traffic engineer, and the supervisors of any person so designated.\nTrash means any solid or liquid waste, whether combustible or noncombustible. Trash includes, without limitation, garbage, rubbish, rubble, refuse, industrial waste products, brush, fence posts, crates, vehicle tires, vehicle bodies or parts, household items, organic material, animal or vegetable waste resulting from the preparation, cooking, and serving of food, paper, ashes, cardboard, cans, broken glass, cups, pieces of paper, plastic, yard clippings, wood, branches, twigs, glass, rags, and wearing apparel of any kind.\nTrash collection means any trash collected by any person which will ultimately be disposed of in a landfill.\nTrash container means a metal, plastic, or other nonabsorbent container equipped with a lid designed for that specific container or sealed plastic bags, but does not include incinerators or ash pits.\nTravel trailer means a portable structure, mounted on wheels and designed to be towed by a motor vehicle, which contains cooking or sleeping facilities to provide temporary living quarters for recreational camping or travel.\nUniversity Hill General Improvement District or UHGID means the City of Boulder University Hill General Improvement District established by Ordinance Number 3638, as subsequently amended.\nVehicle means any device that is capable of moving itself, or of being moved, from place to place upon wheels or endless tracks, but the term excludes devices used exclusively upon stationary rails or tracks.\nVisible to the public means that which can be viewed from ground level by a person located on public property without taking extraordinary steps, such as climbing a ladder or peering over a screening fence, in order to achieve a point of vantage.\nWeek means any seven consecutive days.\nWildlife-resistant container means a fully enclosed cart or container that has a lid designed for that specific container, and that also has a latching mechanism designed to deter access to the contents of the cart or container by wildlife.\nWillingly - see definition of knowingly.\nWriting and written means printing, handwriting, lithography, or any other physical mode of representing words and letters.\nYear means a calendar year, unless otherwise expressed, and the word year shall be equivalent to the words year of our Lord.\nOrdinance Nos. 4803 (1984); 4879 (1985); 4969 (1986); 5039 (1987); 5085 (1987); 5106 (1988); 5182 (1989); 5186 (1989); 5187 (1989); 5190 (1989); 5270 (1990); 5681 (1994); 5805 (1996); 5930 (1997); 5986 (1998); 7182 (2002); 7291 (2003); 7294 (2003); 7304 (2003); 7416 (2005); 7522 (2007); 7572 (2008); 7579 (2008); 7585 (2008); 7760 (2010); 7799 (2012); 7838 (2012); 7851 (2012); 7941 (2013); 7996 (2014); 8256 (2018); 8323 (2019); 8447 (2021); 8551 (2022); 8575 (2023); 8642 (2024); 8651 (2025)"
  },
  {
    "corpus": "BRC",
    "title": "1",
    "title_name": "GENERAL ADMINISTRATION",
    "chapter": "3",
    "chapter_name": "Quasi-Judicial Hearings",
    "anchor": "1-3-1",
    "heading": "Legislative Intent and Application of Chapter.",
    "verbatim": "1-3-1. Legislative Intent and Application of Chapter.\nThe following rules of procedure are intended to provide a uniform, consistent, and expeditious method for conducting quasi-judicial hearings held by city officers, employees, departments, divisions, boards, commissions, and the city council, and to afford persons due process of law. An agency may supplement the provisions of this chapter by adopting further rules of procedure not inconsistent herewith. An agency may grant the opportunity for public testimony and shall permit public testimony whenever required by city charter, ordinance, or code, or state or federal constitution or law. This chapter applies whenever a quasi-judicial hearing is required by any provision of the city charter, ordinance, or code, or state or federal constitution or law, unless another procedure is provided by city charter, ordinance, code, or contract, or state or federal constitution or law. Nothing in this chapter shall be interpreted to grant any person the right to appeal to any agency or to have a hearing before it unless a specific provision of the city charter, ordinance, or code, or state or federal constitution or law grants such a right. This chapter does not apply to any pre-disciplinary procedures involving any employee of the city.\nOrdinance Nos. 4879 (1985); 5202 (1989)"
  },
  {
    "corpus": "BRC",
    "title": "1",
    "title_name": "GENERAL ADMINISTRATION",
    "chapter": "3",
    "chapter_name": "Quasi-Judicial Hearings",
    "anchor": "1-3-2",
    "heading": "Definitions.",
    "verbatim": "1-3-2. Definitions.\nAs used in this chapter:\nAgency means the city council and any officer, employee, department, division, or other agency of the City of Boulder, including boards and commissions but excluding the municipal court.\nInterested person means any person described as interested by city charter, ordinance, or code, or state or federal constitution or law, or any person having a legally protected interest under the city charter, ordinance, or code, or state or federal constitution or law that is subject to potential injury in fact due to proposed final agency action, or any person having a right of appeal from proposed final agency action by virtue of a specific provision of the city charter, ordinance, or code, or state or federal constitution or law.Interested person may include a city agency.\nParty to a hearing means any interested person who requests a hearing, appears at a hearing, or submits a written entry of appearance at or before a hearing.\nPre-disciplinary procedures means any and all activities conducted by supervisory personnel of the city prior to imposition of disciplinary action.\nProponent of an order means the party requesting proposed final agency action.\nOrdinance Nos. 4879 (1985); 5202 (1989)"
  },
  {
    "corpus": "BRC",
    "title": "1",
    "title_name": "GENERAL ADMINISTRATION",
    "chapter": "3",
    "chapter_name": "Quasi-Judicial Hearings",
    "anchor": "1-3-3",
    "heading": "Notice of Agency Action.",
    "verbatim": "1-3-3. Notice of Agency Action.\n(a)\tExcept as provided by Section 1-3-4, \"Exception for Emergencies,\" B.R.C. 1981, no agency may take final agency action subject to this chapter unless, before taking such proposed action, the agency has given all known interested persons notice by hand delivery, posting on the property subject to agency action, regular mail, or publication once in a newspaper of general circulation in the city of:\n(1)\tThe proposed agency action;\n(2)\tThe legal authority under which it is proposed to be taken;\n(3)\tThe opportunity for any interested person to submit written data, views, and arguments with respect to such proposed action; and\n(4)\tEither:\n(A)\tThe date of a hearing if city charter, ordinance, or code, or state or federal constitution or law requires a hearing without a request therefor before proposed agency action; or\n(B)\tThe opportunity for any interested person to request a hearing on such proposed agency action by filing a written request therefor that is received by the agency no more than ten days after the date the notice is deposited in the mail, hand delivered, posted, or published.\nNotice shall be given at least ten days before the date of the hearing. If the notice is mailed, it is given when mailed to the address shown on the license, permit, or application in question or in the records of the county clerk or tax assessor, or any other official custodian of public records of property ownership for any specific property in question. For purposes of this subsection, public records means those records defined in § 24-72-202(6), C.R.S.\n(b)\tIf an interested person requests a hearing as prescribed by subparagraph (a)(4)(B) of this section, the agency shall give notice at least ten days before the hearing of the date, time, place, and nature of the hearing to all known interested persons. Unless otherwise provided by city charter, ordinance, or code, or state or federal constitution or law, such notice shall be given to the person first requesting the hearing upon depositing the notice in the mail or hand delivering the notice at least ten days before the date of the hearing to the last address furnished to the agency by the person requesting the hearing. The agency shall notify all other known interested persons by the means specified in Subsection (a) of this section of the date, time, place, and nature of the hearing; that they may participate in the hearing; and that failure to appear at the hearing waives any hearing right."
  },
  {
    "corpus": "BRC",
    "title": "1",
    "title_name": "GENERAL ADMINISTRATION",
    "chapter": "3",
    "chapter_name": "Quasi-Judicial Hearings",
    "anchor": "1-3-4",
    "heading": "Exception for Emergencies.",
    "verbatim": "1-3-4. Exception for Emergencies.\n(a)\tThe requirements of prior notice and hearing in Section 1-3-3, \"Notice of Agency Action,\" B.R.C. 1981, do not apply when the agency determines that the public health, safety, or welfare requires emergency agency action pending a hearing. If the agency takes emergency action, it shall provide timely notice of the action and shall thereafter provide the notices required by Section 1-3-3, \"Notice of Agency Action,\" B.R.C. 1981, and an opportunity for a post-emergency action hearing to interested persons by the means prescribed by Section 1-3-3, \"Notice of Agency Action,\" B.R.C. 1981.\n(b)\tNothing in this chapter shall be deemed to prohibit an agency from ordering interim relief to preserve the status quo pending a hearing.\nOrdinance No. 5099 (1988)"
  },
  {
    "corpus": "BRC",
    "title": "1",
    "title_name": "GENERAL ADMINISTRATION",
    "chapter": "3",
    "chapter_name": "Quasi-Judicial Hearings",
    "anchor": "1-3-5",
    "heading": "Hearings and Determinations.",
    "verbatim": "1-3-5. Hearings and Determinations.\n(a)\tThe agency may charge a fee for a hearing, if so authorized by city code or ordinance. The hearing officer or agency may waive or refund the fee upon a showing of undue hardship.\n(b)\tAny interested person shall be admitted as a party to the hearing upon filing a written entry of appearance before the hearing, setting forth a brief and plain statement of the facts that entitle such person to be admitted and the matters that the person claims should be decided.\n(c)\tThe hearing shall be conducted by the agency; by an employee, agent, or subcommittee of the agency; or by one or more hearing officers who have not personally determined the factual issues in controversy at the hearing and have no personal financial interest in the outcome of the hearing. In its discretion the agency may, but need not, appoint an employee of the city or other person possessing qualifications acceptable to the agency as a hearing officer to hear and receive evidence and render a decision on the law and the facts. The hearing officer has all the authority possessed by the agency to render decisions. While presiding at a hearing, the agency or hearing officer shall determine whether the proposed agency action comports with the requirements and standards in the applicable provisions of city charter, ordinance, or code, or state or federal constitution or law.\n(d)\tThe agency or hearing officer has authority to administer oaths and affirmations; sign and issue subpoenas; waive or refund hearing fees; rule upon offers of proof; compel testimony; receive evidence; dispose of motions relating to the discovery and production of relevant documents and things for inspection, copying, or photographing; regulate the course of the hearing; set the time and place for continued hearings; fix the time for filing of briefs and other documents; direct the parties to appear and confer to consider simplification of issues, admissions of facts, or documents to avoid unnecessary proof, and limitation of the number of witnesses; issue appropriate orders that control the subsequent course of the proceeding; dispose of motions; and control the decorum and conduct of the proceeding.\n(e)\tAll testimony shall be taken under oath or by affirmation.\n(f)\tNo person shall fail to comply with the orders of the agency or hearing officer at the hearing. Violation of this requirement may be prosecuted in municipal court in the same manner that other municipal offenses are prosecuted.\n(g)\tThe proceedings of the hearing shall be recorded through tape recording, stenographic, or other verbatim reproduction, and copies of transcriptions of the proceedings shall be available, upon payment of the reasonable costs thereof, to the parties to the hearing.\n(h)\tUnless otherwise provided by city charter, ordinance, or code, or by state or federal constitution or law, the proponent of an order has the burden of proof, and every party to the proceeding has the right to present such party's case or defense by oral and documentary evidence, to submit rebuttal evidence, and to conduct such cross examination as may be required for a full and true disclosure of the facts.\nThe agency or hearing officer may receive all or part of the evidence in written form if the interests of the parties will not be prejudiced substantially and if the hearing will be expedited thereby. The rules of evidence and requirements of proof and procedure shall conform to the extent practicable to those in civil nonjury cases, but when necessary to ascertain facts affecting the substantial rights of the parties to the proceeding, the agency or hearing officer may receive and consider evidence not admissible under such rules if such evidence possesses probative value commonly accepted by reasonable and prudent persons in the conduct of their affairs. The person conducting the hearing shall give effect to the rules of privilege required by law, may exclude incompetent and unduly repetitious evidence, and may receive documentary evidence in the form of a copy or excerpt if the copy is authenticated. The agency or hearing officer shall use its experience, technical competence, and specialized knowledge in evaluating the evidence presented to it. Parties to the hearing may make objections to evidentiary offers, which shall then be noted in the record. In the absence of objection, the hearing may be conducted informally, and failure to request any procedure shall constitute a waiver thereof.\n(i)\tThe agency or hearing officer may issue a decision at the hearing and shall issue a written decision with findings of fact and conclusions of law, setting forth the grounds of the decision, based on the evidence presented at the hearing. The agency shall serve the decision on each party to the hearing by personal service or by mailing by regular mail to the last address furnished to the agency by the party. The decision shall be effective as to such party on the date mailed or on such other date as is stated in the decision.\n(j)\tUnless otherwise provided by city charter, ordinance, or code, or by state or federal constitution or law, the decision of the agency or hearing officer is final subject only to judicial review pursuant to Colorado Rule of Civil Procedure 106(a)(4). No defense or objection may be presented for judicial review unless it is first presented to the agency or hearing officer, prior to the decision thereof.\nOrdinance No. 4879 (1985)"
  },
  {
    "corpus": "BRC",
    "title": "1",
    "title_name": "GENERAL ADMINISTRATION",
    "chapter": "3",
    "chapter_name": "Quasi-Judicial Hearings",
    "anchor": "1-3-6",
    "heading": "Ex Parte Contacts.",
    "verbatim": "1-3-6. Ex Parte Contacts.\nNo ex parte material or representation of any kind or any other communication outside the hearing shall be considered by the agency or hearing officer conducting the hearing unless it is fully disclosed on the hearing record and an opportunity is given for comment thereon at the hearing."
  },
  {
    "corpus": "BRC",
    "title": "1",
    "title_name": "GENERAL ADMINISTRATION",
    "chapter": "4",
    "chapter_name": "Rulemaking",
    "anchor": "1-4-1",
    "heading": "Definitions.",
    "verbatim": "1-4-1. Definitions.\nThe following words and phrases, wherever used in this chapter, have the following meanings unless the context clearly indicates otherwise:\nAdopting authority means the city manager or any board or commission authorized by charter, this code or another ordinance of the city to make rules.\nRule means the whole or any part of any statement of general applicability and future effect implementing the legislative intent of the charter, this code, or another ordinance of the city, but does not include: a) a general statement of policy which is not binding on the public, b) a statement of agency organization, conduct required of city employees, or regulation of internal management and procedures, which is not binding on the public, or c) a rule concerning the use of city property which does not form a basis for a prosecution in municipal court. \"Regulation\" is a synonym for \"rule.\""
  },
  {
    "corpus": "BRC",
    "title": "1",
    "title_name": "GENERAL ADMINISTRATION",
    "chapter": "4",
    "chapter_name": "Rulemaking",
    "anchor": "1-4-2",
    "heading": "Submission to City Manager and City Attorney.",
    "verbatim": "1-4-2. Submission to City Manager and City Attorney.\nBefore a proposed rule is published as provided in this chapter, and before a proposed rule as changed after public comment becomes effective, the city manager, board, or commission, as applicable, shall approve it as to substance and the city attorney shall approve it as to form and legality."
  },
  {
    "corpus": "BRC",
    "title": "1",
    "title_name": "GENERAL ADMINISTRATION",
    "chapter": "4",
    "chapter_name": "Rulemaking",
    "anchor": "1-4-3",
    "heading": "Publication of Proposed Rules.",
    "verbatim": "1-4-3. Publication of Proposed Rules.\nBefore a proposed rule becomes effective, the adopting authority shall file three copies of the proposed rule with the city clerk, and publish in a newspaper of general circulation in the city a notice stating that the filing with the city clerk has been made, the date of the filing, the general subject matter of the proposed rule, the right of the public to submit written comments on the proposed rule, and the time during which such comments may be filed."
  },
  {
    "corpus": "BRC",
    "title": "1",
    "title_name": "GENERAL ADMINISTRATION",
    "chapter": "4",
    "chapter_name": "Rulemaking",
    "anchor": "1-4-4",
    "heading": "Public Comment.",
    "verbatim": "1-4-4. Public Comment.\nMembers of the public may file written comments with the adopting authority during a period of fifteen days following the date of publication of the notice required in Section 1-4-3, \"Publication of Proposed Rules,\" B.R.C. 1981. The adopting authority shall consider such comments and may, in its discretion, incorporate a response to such comment and such other changes as it may determine to be appropriate in the proposed rules. The adopting authority shall submit any rule that it has changed for approval of the city attorney, after which approval the rule shall be effective. If, however, the proposed changes are substantial, the adopting authority may, in its discretion, provide by published notice an additional period for accepting public comments on the proposed changed rule before it becomes effective. If the adopting authority further changes the proposed rule, it shall submit the proposed rule for approval of the city attorney, after which approval the rule shall become effective."
  },
  {
    "corpus": "BRC",
    "title": "1",
    "title_name": "GENERAL ADMINISTRATION",
    "chapter": "4",
    "chapter_name": "Rulemaking",
    "anchor": "1-4-5",
    "heading": "Effective Date.",
    "verbatim": "1-4-5. Effective Date.\nUnless a later date is stated therein, rules are effective when, after the time for comment has passed, a copy signed by the adopting authority and the city attorney is filed with the city clerk."
  },
  {
    "corpus": "BRC",
    "title": "1",
    "title_name": "GENERAL ADMINISTRATION",
    "chapter": "4",
    "chapter_name": "Rulemaking",
    "anchor": "1-4-6",
    "heading": "Emergency Rules Excepted.",
    "verbatim": "1-4-6. Emergency Rules Excepted.\nA rule may become effective immediately if the adopting authority finds that the public health, safety, or welfare requires immediate effectiveness of the rule and states the reasons for such finding. If it adopts an emergency rule, the adopting authority shall so state in its published notice and shall also state that it will accept written public comment for a period of thirty days subsequent to the date of the publication of the notice. After considering public comment and after receiving approval from the city attorney, the adopting authority shall issue a final rule."
  },
  {
    "corpus": "BRC",
    "title": "1",
    "title_name": "GENERAL ADMINISTRATION",
    "chapter": "4",
    "chapter_name": "Rulemaking",
    "anchor": "1-4-7",
    "heading": "Copies of Rules.",
    "verbatim": "1-4-7. Copies of Rules.\nThe adopting authority and the city clerk shall provide a copy of a proposed rule without charge to any interested person who requests it. The city clerk is authorized to sell copies of adopted rules to the public, and to set a reasonable price therefor."
  },
  {
    "corpus": "BRC",
    "title": "1",
    "title_name": "GENERAL ADMINISTRATION",
    "chapter": "4",
    "chapter_name": "Rulemaking",
    "anchor": "1-4-8",
    "heading": "Numbering.",
    "verbatim": "1-4-8. Numbering.\nThe city clerk shall assign an identifying number to each adopted rule."
  },
  {
    "corpus": "BRC",
    "title": "1",
    "title_name": "GENERAL ADMINISTRATION",
    "chapter": "4",
    "chapter_name": "Rulemaking",
    "anchor": "1-4-9",
    "heading": "Repeal.",
    "verbatim": "1-4-9. Repeal.\nRules may be amended, repealed, and readopted, or repealed by following the provisions set forth in this chapter. Rules also may be repealed by publishing notice thereof once in a newspaper of general circulation in the city."
  },
  {
    "corpus": "BRC",
    "title": "1",
    "title_name": "GENERAL ADMINISTRATION",
    "chapter": "4",
    "chapter_name": "Rulemaking",
    "anchor": "1-4-10",
    "heading": "Existing Rules.",
    "verbatim": "1-4-10. Existing Rules.\nNothing in this chapter shall be interpreted to nullify or limit the effectiveness of any rule adopted on or before December 1, 1987. All such rules shall remain effective, but three copies thereof shall be filed in the office of the city clerk before January 1, 1988."
  }
]