[
  {
    "corpus": "BRC",
    "title": "10",
    "title_name": "Structures",
    "chapter": "1",
    "chapter_name": "Definitions",
    "anchor": "10-1-1",
    "heading": "Definitions.",
    "verbatim": "10-1-1. Definitions.\n(a)\tThe following terms used in this title have the following meanings unless the context clearly indicates otherwise:\nAccessible means, with respect to energy conservation measures, able to be modified to comply with this code at reasonable expense. The city manager shall determine the reasonableness of any expense after submission of evidence by the owner and a request for such determination. In such regard, the manager shall take account of the payback period for the measure, its contribution to the capital value of the dwelling unit, and whether or not the measure can be financed.\nAccessory dwelling unit means an accessory dwelling unit permitted under Section 9-6-3(n), \"Accessory Dwelling Unit,\" B.R.C. 1981. Accessory dwelling units shall not have separate utilities from the principal dwelling.\nAir infiltration means the leakage of air through cracks in a building, including, without limitation, cracks associated with doors, windows, baseboards, penetrations for entry of pipes and wires, and places where dissimilar materials meet.\nApproved means approved by the city manager to serve the purpose for which it is intended to be used.\nApproved semi-rigid tubing connector means a flexible metal pipe connecting a gas residential dryer or range, if it meets the requirements of and is installed in accordance with the city fuel gas code, or, if it is a commercial gas dryer or range, it is a connector supplied with the appliance from the manufacturer, or is an equivalent commercial grade flex connector, and is installed in accordance with the manufacturer's instructions.\nApproved sewer system means a sewer system authorized by the city manager to be connected to the municipal wastewater system or by the Boulder County Health Department to be connected to a properly constructed individual sewage disposal system.\nApproved water system means a water system authorized by the city manager to be connected to the municipal water system or by the Boulder County Health Department to be connected to a potable water system.\nArea median income shall have the same meaning as set forth in Section 9-16-1, \"General Definitions,\" B.R.C. 1981.\nASTM means American Society for Testing Materials.\nBase building systems mean the systems or sub-systems of a building that use energy and/or impact energy consumption including but not limited to:\n(1)\tPrimary HVAC (heating, ventilation, air conditioning) systems;\n(2)\tConveying systems;\n(3)\tDomestic hot water systems;\n(4)\tElectrical and lighting systems.\nBase building systems shall not include equipment used for industrial processes.\nBaseline inspection as used in Chapter 10-3, \"Rental Licenses,\" B.R.C. 1981, means a physical inspection of a dwelling unit performed by a qualified city-licensed contractor for the purpose of determining compliance with all required items specified on a rental housing inspection checklist developed by the city manager based on the requirements of Chapter 10-2, \"Property Maintenance Code,\" and Section 9-9-16, \"Lighting, Outdoor,\" B.R.C. 1981.\nBasement means any floor level below the first story in a building, except that a floor level in a building having only one floor level shall be classified as a basement unless such floor level qualifies as a story as that term is used in Chapter 10-2, \"Property Maintenance Code,\" B.R.C. 1981.\nBlock face includes all dwelling units with addresses on either side of a street bounded by street perpendicular to the street on which the houses have addresses.\nBuilding for the Chapter 10-7.7 only, is based on a building list developed from the Boulder County Tax Assessor's database that will be provided by the city manager at least six months in advance of each reporting deadline.\nCaulk means material designed to reduce air infiltration and having an estimated effective life exceeding five years.\nCellar means that portion of a dwelling that is located partly or wholly below grade and has half or more than half of its clear floor-to-ceiling height below the average grade of the adjoining ground abutting the exterior walls of the dwelling unit.\nCleanable means having a smooth, hard surface that is free from unsealed breaks and impervious to the amount of water that would be used in cleaning.\nCommercial or industrial means any structure or portion of structure used exclusively for, or designed as and capable of being used for, office, commercial, industrial, or governmental occupation, or the temporary lodging of persons for periods of less than thirty days, including hotels, motels, emergency shelters, and overnight shelters but excluding dormitories, fraternities, and bed and breakfasts.\nCondominium unit means a form of property ownership of airspace, as defined in Section 38-33-103, C.R.S.\nCooking device excludes, where cooking devices are prohibited or excluded in this section or in Chapter 10-2, \"Property Maintenance Code,\" B.R.C. 1981, one microwave oven unit or one microwave oven unit combined with a refrigerator-freezer.\nDoor means an opening in a solid wall for the ingress and egress of persons, including, without limitation, doorways, lintels, or headers, casing, frames, sills, and doors with or without glazing.\nDraft diverter means a device attached to or made part of the vent outlet from an appliance and designed to: insure the ready escape of products of combustion in the event of no draft, back draft, or stoppage in the vent or flue beyond the draft hood; prevent a back draft from entering the appliance; and neutralize the effect of stack action of the flue upon operation of the appliance.\nDwelling means any building, structure, or other housing accommodation that is wholly or partly used or intended to be used for living or sleeping by human occupants but excludes temporary housing.\nDwelling unit shall have the same meaning as set forth in Section 9-16-1, \"General Definitions,\" B.R.C. 1981.\nElectrical convenience outlet means a point on the electrical wiring system equipped with one receptacle box that may contain one or more receptacles to receive plugs from which current is taken to supply electrical appliances.\nElements means wind, rain, snow, hail, or sleet, or surface run-off water.\nEnergy assessment means a comprehensive review of energy usage and emissions conducted in a manner established by the city manager.\nEnergy efficiency requirements inspection means a physical inspection performed by a class G city-licensed contractor for the purpose of determining compliance with the Prescriptive Energy Efficiency Option under Section C101.2.2.\nExpert cooperative housing organization means an organization recognized by the city manager as having experience and expertise in the formation, operation and organization of cooperative housing units.\nExtermination means control and elimination of insects, rodents, vermin, or other pests by eliminating their harborage and materials that may serve as their food or by taking recognized, legal methods of eliminating pests, including, without limitation, poisoning, spraying, fumigating, or trapping.\nFamily shall have the same meaning as set forth in Section 9-16-1, \"General Definitions,\" B.R.C. 1981.\nFinancial hardship means the building meets one of the following criteria:\n(1)\tThe building is the subject of a qualified tax lien sale or public auction due to property tax arrearages;\n(2)\tThe building is controlled by a court appointed receiver;\n(3)\tThe building has been acquired by a deed in lieu of foreclosure.\nFloor area means the total square footage of all levels included within the outside walls of a building or portion thereof, but excluding courts, garages useable exclusively for the storage of motor vehicles and uninhabitable areas that are located above the highest inhabitable level or below the first-floor level.\nGarbage means putrescible animal or vegetable waste resulting from the preparation, cooking, and serving of food or the storage or sale of produce.\nGrade means the average of the finished ground level at the center of all walls of a building. When walls are parallel to and within five feet of a sidewalk, grade means the sidewalk level.\nHabitable room means a room or enclosed floor space used, intended to be used or designed to be used for living, sleeping, eating, or cooking and excludes bathrooms, toilet compartments, closets, halls, and storage places.\nIndustrial processes means any business-related process supported by mechanical or electrical systems other than base building systems.\nInfestation means the presence of insects, rodents, vermin, or other pests of a kind or in a quantity that endanger health within or around a dwelling.\nLarge industrial campus means a facility in which three or more buildings, at least partially used for manufacturing uses, are served by a central power plant or a single utility meter.\nMakeshift repairs means repairs not made in accordance with the requirements of this code, any ordinance of the city, or rule or regulation adopted thereunder; accepted practices; prevailing standards; design of a licensed contractor; or manufacturer's recommendations.\nManufacturing means any building which has a primary use of assemblage, processing, and/or manufacturing products from raw materials or fabricated parts OR one that has the majority of its energy usage come from process loads.\nNot-for-profit permanently affordable cooperative means a cooperative that is owned by a not-for-profit organization with a housing focused mission, which is tax exempt under Section 501(c)(3) of the Internal Revenue Code.\nOccupant means any person living in, sleeping in, cooking in, or possessing a building or part thereof.\nOperator means any person who is an owner, is an owner's representative, has charge of, or controls any dwelling or parts thereof.\nOwner shall have the same meaning as set forth in Section 9-16-1, \"General Definitions,\" B.R.C. 1981.\nPermanently affordable unit has the same meaning as in Chapter 9-13, \"Inclusionary Housing,\" B.R.C. 1981.\nPrincipal residence means the dwelling unit in which a person resides for more than one-half of the year. However, if (1) the entire unit is offered and available for rental for more than twenty days in any month; or, (2) the person owns another dwelling unit that is not licensed for long term rental; (3) the person's spouse or domestic partner has a different principal residence; (4) the person's driver's license, voter registration or any dependent's school registration shows a different residence address, or (5) the Boulder County Assessor lists a mailing address different from the dwelling unit address it shall be presumed that the dwelling unit in question is not a principal residence. Provided, however, no presumption shall apply in any criminal proceeding.\nThese presumptions are rebuttable, but each must be rebutted by credible evidence from the party claiming that the dwelling is a principal residence.\nPrivate equity cooperative means a cooperative in which at least two-thirds of the adult non-dependent residents own an interest in the property or of the organization that owns the property, at least two-thirds of the individuals who own an interest in the property or the organization that owns the property are also residents of the property, and the owner-residents hold a controlling ownership interest in the property or the organization that owns the property. A organization recognized as tax exempt under Section 501(c)(3) of the Internal Revenue Code may own a minority interest in the property.\nQualified heating maintenance person means a licensed professional engineer; a licensed mechanical contractor; or an employee of a regulated public utility whose duties include such inspections.\nRate means process of measuring and comparing energy performance metrics (such as the normalized energy use of a building) to other similar buildings, in a manner specified by the city manager.\nReadily accessible means capable of being reached safely and quickly for operation, repair, or inspection without the necessity of climbing over or removing obstacles or using portable access equipment.\nRenewal inspection means, with respect to any rental housing unit covered by a current rental license, an inspection performed by a qualified city-licensed contractor for the purpose of determining compliance with all required items specified on a rental housing renewal inspection checklist that are likely to become noncompliant over time, based on the requirements of Chapter 10-2, \"Property Maintenance Code,\" and Section 9-9-16, \"Lighting, Outdoor,\" B.R.C. 1981.\nRental cooperative means a cooperative in which more than one-third of the residents do not have a direct or indirect ownership interest in the property in which the cooperative operates.\nRental housing inspector means a person licensed as a D-9 contractor under Chapter 4-4, \"Building Contractor License,\" B.R.C. 1981, to perform inspections under contract to owners or operators of rental housing to determine compliance with Chapter 10-2, \"Property Maintenance Code,\" B.R.C. 1981, using forms supplied by the city manager, and to certify compliance to the manager as part of the process of licensing rental housing.\nRental property means all dwellings, dwelling units, and rooming units located within the city and rented or leased for any valuable consideration, but excludes dwellings owned by the federal government, the state, or any of their agencies or political subdivisions and facilities licensed by the state as health care facilities. Rental property includes any property used as a short-term rental.\nRetrocommissioning means the process of making low-cost adjustments to an existing building's operation to improve its energy performance, in a manner specified by the City Manager.\nRetrocommissioning measure means a corrective action or facility improvement identified during the investigation or evaluation phase of retrocommissioning.\nRetrocommissioning report means a report prepared and certified by a retrocommissioning professional, covering the scope provided by the city manager.\nRooming house means an establishment where, for direct or indirect compensation, lodging, with or without kitchen facilities or meals, is offered for one month or more for three or more roomers living independently within rooming units.\nRooming unit means a type of housing accommodation that consists of a room or group of rooms for a roomer, arranged primarily for sleeping and study, and that may include a private bath but does not include a sink or any cooking device.\nShort-term rental means any dwelling, dwelling unit, rooming unit, room or portion of any dwelling unit, rooming unit, room being offered, advertised, rented or leased to any person for valuable consideration for periods of time less than thirty days, but excludes commercial hotels, motels or bed and breakfasts. A short-term rental is a residential use that is accessory to such dwelling, dwelling unit, rooming unit, or room and no person shall use a short-term rental for meetings, including but not limited to weddings, banquets, fund raisers or similar gatherings, when such person is receiving compensation, directly or indirectly for such meetings.\nSound condition means freedom from defects that would endanger the health, safety, and welfare of the occupants of the structure, and in good working condition if applicable.\nStairway means all stairwells, and includes stair stringers, risers, treads, handrails, banisters, and vertical and horizontal supports.\nStory means that portion of a building included between the upper surface of any floor and the upper surface of the floor next above, except that the topmost story shall be that portion of a building included between the upper surface of the top-most floor and the ceiling or roof above. If the finished floor level directly above a usable or unused under-floor space is more than six feet above grade for more than fifty percent of the total perimeter or is more than twelve feet above grade at any point, such usable or unused under-floor space shall be considered as a first story.\nSupplied means paid for, furnished, provided by, or under the control of the owner or operator.\nTemporary housing means any mobile home, camper, or other structure used for human shelter that is designed to be transportable and is not attached to the ground, to another structure, or to any utilities system.\nTrap means a fitting or device in a plumbing system designed and constructed to provide, when properly vented, a liquid seal that will prevent the back passage of air without materially affecting the flow of sewage or wastewater through it.\nVent means a pipe designed to convey the product of combustion from an appliance to a flue or chimney.\nVentilation means not less than one square inch of area of contiguous inside and outside air for every square foot of floor space.\nWater heater insulation means a thermal insulation blanket with a membrane facing which has a flame spread classification of no more than two hundred for an electric water heater and twenty-five for an oil- and gas-fired water heater when tested in accordance with ASTM E 84-80 or originally installed insulation integral to the water heater which provides equivalent resistance to heat loss.\nWindow means an opening in a solid wall for the interior illumination and ventilation of a structure and includes lintels or headers, casings, sills, frames, and glazing.\n(b)\tWords defined in Chapter 1-2, \"Definitions,\" B.R.C. 1981, have the meanings therein expressed if not differently defined by this chapter.\n(c)\tFor the purposes of Chapter 10-2, \"Property Maintenance Code,\" B.R.C. 1981, a word not defined in this chapter or in Chapter 1-2, \"Definitions,\" B.R.C. 1981, but defined in the International Building Code adopted in Chapter 10-5, \"Building Code,\" B.R.C. 1981, the International Residential Code adopted in Chapter 10-5.5, \"Residential Building Code,\" B.R.C. 1981, the National Electrical Code adopted in Chapter 10-6, \"Electrical Code,\" B.R.C. 1981, the International Energy Conservation Code adopted in Chapter 10-7, \"Energy Conservation Code,\" B.R.C. 1981, the International Mechanical Code adopted in Chapter 10-9, \"Mechanical Code,\" B.R.C. 1981, the International Fuel Gas Code adopted in Chapter 10-9.5, \"Fuel Gas Code,\" B.R.C. 1981, and the International Plumbing Code adopted in Chapter 10-10, \"Plumbing Code,\" B.R.C. 1981, has the meaning expressed in such code if it and the housing code provision concern similar subjects.\nOrdinance Nos. 4824 (1984); 5182 (1989); 5270 (1990); 5462 (1992); 5798 (1996); 5975 (1998); 7023 (1999); 7024 (1999); 7189 (2002); 7304 (2003); 7416 (2005); 7697 (2009); 7725 (2010); 7726 (2010); 7925 (2013); 8050 (2050); 8071 (2015); 8154 (2016); 8119 (2017); 8234 (2018); 8235 (2018); 8283 (2018); 8371 (2019); 8366 (2020); 8556 (2023); 8571 (2023); 8651 (2025); 8684 (2025)"
  },
  {
    "corpus": "BRC",
    "title": "10",
    "title_name": "Structures",
    "chapter": "2",
    "chapter_name": "Property Maintenance Code",
    "anchor": "10-2-1",
    "heading": "Legislative Intent.",
    "verbatim": "10-2-1. Legislative Intent.\n(a)\tThe city council finds:\n(1)\tEnergy efficiency requirements for housing are necessary because:\n(A)\tReducing greenhouse gas emissions in existing buildings is imperative to meet the City of Boulder's sustainability goals;\n(B)\tRental housing represents the largest number of existing housing units in the city; and\n(C)\tEfforts to establish incentives for voluntary energy efficiency retrofits in rental housing have proven to be ineffective.\n(b)\tReducing greenhouse gas emissions has been established as an important public policy objective and mandated by the city due to:\n(1)\tThe well-documented link between reduction of such emissions and current and projected climate change; and\n(2)\tThe profound public health and safety impacts of such emissions, including but not limited to:\n(A)\tIncreased risk of extreme weather events,\n(B)\tIncreased flood severity,\n(C)\tIncreased risk and intensity of catastrophic wildfire,\n(D)\tIncreased insect invasions causing forest die-offs, and\n(E)\tIncreased risk of drought.\n(c)\tThe purposes of this chapter are as follows:\n(1)\tTo protect the public health, safety, and general welfare of the residents of the city by regulating existing residential rental and privately occupied residential structures and to promote conservation and the efficient use of energy;\n(2)\tTo establish minimum energy efficiency requirements for existing rental and privately occupied housing in the city with the goal of reducing greenhouse gas emissions; and\n(3)\tTo address the unique needs and challenges associated with energy retrofits in existing rental and privately occupied housing.\n(d)\tThe city council hereby adopts the 2024 edition of the International Property Maintenance Code as the Property Maintenance Code of the City of Boulder. This chapter establishes minimum code standards related to: administration; definitions; general requirements; light, ventilation and occupancy limitations; plumbing facilities and fixture requirements; mechanical and electrical systems; fire safety requirements; and rental licensing; and existing residential rental structure energy conservation.\nOrdinance Nos. 7724 (2010); 7726 (2010); 7925 (2013); 8366 (2020); 8684 (2025)"
  },
  {
    "corpus": "BRC",
    "title": "10",
    "title_name": "Structures",
    "chapter": "2",
    "chapter_name": "Property Maintenance Code",
    "anchor": "10-2-2",
    "heading": "Adoption of International Property Maintenance Code With Modifications.",
    "verbatim": "10-2-2. Adoption of International Property Maintenance Code With Modifications.\n(a)\tThe 2024 edition of the International Property Maintenance Code (IPMC) of the International Code Council is hereby adopted by reference as the City of Boulder Property Maintenance Code and has the same force and effect as though fully set forth in this chapter, except as specifically amended for local application by this chapter.\n(b)\tIPMC Appendix chapters A, \"Boarding Standard,\" B, \"Rental Housing Inspections,\" and C, \"Energy Efficiency Requirement - Existing Residential Rental Structures Energy Conservation,\" are adopted.\n(c)\tFor ease of reference, the following identifies all chapters, sections and appendices of the published and adopted IPMC and includes specific amendments for local application. Chapter, Section, Subsection, or Appendix numbers of provisions not amended appear, followed by the words, \"No changes.\" The amended text of specifically amended provisions appears below. Chapter, Section, Subsection, or Appendix numbers of any provisions not adopted appear, followed by the word, \"Deleted.\""
  },
  {
    "corpus": "BRC",
    "title": "10",
    "title_name": "Structures",
    "chapter": "3",
    "chapter_name": "Rental Licenses",
    "anchor": "10-3-1",
    "heading": "Legislative Intent.",
    "verbatim": "10-3-1. Legislative Intent.\nThis chapter provides for comprehensive enforcement of Chapter 10-2, \"Property Maintenance Code,\" B.R.C. 1981, and other requirements under the Boulder Revised Code, by establishing a system of rental licenses for all dwelling and rooming accommodations in the city that are rented to tenants.\nOrdinance Nos. 5798 (1996); 7724 (2010); 7725 (2010); 8283 (2018)"
  },
  {
    "corpus": "BRC",
    "title": "10",
    "title_name": "Structures",
    "chapter": "3",
    "chapter_name": "Rental Licenses",
    "anchor": "10-3-2",
    "heading": "Rental License Required Before Occupancy and License Exemptions.",
    "verbatim": "10-3-2. Rental License Required Before Occupancy and License Exemptions.\n(a)\tNo operator shall allow, or offer to allow through advertisement or otherwise, any person to occupy any dwelling, dwelling unit or rooming unit as a tenant or lessee or otherwise for a valuable consideration unless each room or group of rooms constituting the rental property has been issued a valid rental license by the city manager, provided however, an operator may advertise for a rental of thirty days or longer, if the operator has submitted a complete rental licensing application or is advertising for pre-leasing of new construction. Any advertisement shall include the rental licensing number once assigned by the city manager.\n(b)\tBuildings, or building areas, described in one or more of the following paragraphs are exempted from the requirement to obtain a rental license from the city manager, provided, however that the exemptions in subsections (b)(1) and (b)(2) below shall not apply to short-term rentals. No operator shall allow any person to occupy any dwelling, dwelling unit or rooming unit exempted pursuant to subsections (b)(1) and (b)(2) below prior to submitting to the city manager an Affidavit of Exemption for the dwelling, dwelling unit or rooming unit. No person shall be issued any civil penalty or summons for failure to submit an Affidavit of Exemption, unless the person has previously been advised in writing of this requirement.\n(1)\tAny dwelling unit occupied by the owner or members of the owner's family who are at least 21 years of age and housing roomers who are unrelated to the owner or the owner's family. An owner includes an occupant who certifies that the occupant owns an interest in a corporation, firm, partnership, association, organization or any other group acting as a unit that owns the rental property.\n(2)\tA dwelling unit meeting all of the following conditions:\n(A)\tThe dwelling unit constitutes the owner's principal residence;\n(B)\tThe dwelling unit is temporarily rented by the owner for one period of time no greater than twelve consecutive months in any twenty-four-month period;\n(C)\tThe dwelling unit was occupied by the owner immediately before its rental;\n(D)\tThe owner of the dwelling unit is temporarily living outside of Boulder County; and\n(E)\tThe owner intends to re-occupy the dwelling unit upon termination of the temporary rental period identified in subparagraph (b)(2)(B) of this section.\n(3)\tCommercial hotel and motel occupancies which offer lodging accommodations primarily for periods of time less than thirty days, but bed and breakfast facilities are not excluded from rental license requirements.\n(4)\tCommon areas and elements of buildings containing attached, but individually owned, dwelling units.\nOrdinance Nos. 5798 (1996); 7416 (2005); 7725 (2010); 7772 (2010); 8050 (2015); 8072 (2015); 8135 (2016); 8154 (2016); 8234 (2018); 8651 (2025)"
  },
  {
    "corpus": "BRC",
    "title": "10",
    "title_name": "Structures",
    "chapter": "3",
    "chapter_name": "Rental Licenses",
    "anchor": "10-3-3",
    "heading": "Terms of Licenses.",
    "verbatim": "10-3-3. Terms of Licenses.\n(a)\tLicense terms shall be as follows: Licenses, other than reduced term licenses issued under Section 10-3-4, \"Reduced Term License,\" B.R.C. 1981, or temporary licenses issued under Section 10-3-9, \"Temporary License Appeals,\" B.R.C. 1981, shall expire four years from issuance or when ownership of the licensed property is transferred.\n(b)\tIn addition to any other applicable requirements, new licenses and renewals shall require that the licensee submit to the city manager a complete application packet for the license, on forms provided by the manager. The application shall satisfy the following requirements:\n(1)\tA current rental inspection report (for a new license except as set forth in Section 10-3-5, \"License Procedure for Newly Constructed Rental Property,\" B.R.C. 1981,) certifying compliance with those portions of Chapter 10-2, \"Property Maintenance Code,\" and Section 9-9-16, \"Lighting, Outdoor,\" B.R.C. 1981, for which the report form requires inspection and certification; and\n(2)\tThe operator shall certify on the application forms provided by the manager that the operator has a current valid contract with a commercial trash hauler for removal of accumulated trash from the licensed property in accordance with Subsection 6-3-3(b), B.R.C. 1981; and\n(3)\tThe property has no outstanding violations pursuant to Chapter 10-2.5, \"Abatement of Public Nuisance and Chronic Nuisance Property,\" B.R.C. 1981.\n(c)\tThe city manager shall issue separate licenses for individual buildings. Such licenses shall cover all dwelling units and rooming units within such buildings. In a building containing attached but individually owned dwelling units, or any other dwelling units which may be separately conveyed, the city manager shall issue separate licenses for each dwelling unit. A structure, or group of structures, shall be considered to be a single building if it has been assigned a single street address by the City. If a complex of buildings on one property is under common ownership, and this owner is willing to have a common expiration date for the licenses for all dwelling and rooming units, the city manager may consider the whole complex to be the equivalent of a single building for the purposes of licensing and the fee schedule in Section 4-20-18, \"Rental License Fee,\" B.R.C. 1981.\n(d)\tWhenever an existing license is renewed, the renewal license shall be effective from the date of expiration of the last license if the applicant submits a complete renewal application by or within ninety days from the expiration date.\n(e)\tIssuance of any license (new or renewed) requires meeting the energy efficiency requirements of Chapter 10-2, \"Property Maintenance Code, Appendix C - Energy Efficiency Requirements,\" B.R.C. 1981.\nOrdinance Nos. 5798 (1996); 5952 (1997); 7023 (1999); 7189 (2002); 7725 (2010); 7726 (2010); 7772 (2010); 8283 (2018); 8371 (2019); 8366 (2020); 8637 (2024)"
  },
  {
    "corpus": "BRC",
    "title": "10",
    "title_name": "Structures",
    "chapter": "3",
    "chapter_name": "Rental Licenses",
    "anchor": "10-3-4",
    "heading": "Reduced Term License.",
    "verbatim": "10-3-4. Reduced Term License.\n(a)\tThe city manager shall issue a reduced term license whenever the city manager determines that:\n(1)\tViolations of Chapter 10-2, \"Property Maintenance Code,\" B.R.C. 1981, revealed during an inspection, individually or in combination, demonstrate a failure to maintain the rental property in a safe, sanitary and clean condition so that the dwelling endangers the health and safety of the occupants;\n(2)\tThere is or has been a violation of a limitation on numbers of occupants or numbers of dwelling units found in Title 9, \"Land Use Code,\" B.R.C. 1981, which demonstrates a failure to maintain the rental property in compliance with that title;\n(3)\tViolations of Section 9-9-16, \"Lighting Outdoor,\" B.R.C. 1981, of a building or complex of buildings on the same property with multiple dwelling units that are all held under common ownership, revealed during an inspection or otherwise, demonstrate a failure to maintain the rental property in compliance with Title 9, \"Land Use Code,\" B.R.C. 1981; or\n(4)\tThere is an outstanding violation of Chapter 10-2.5, \"Abatement of Public Nuisance and Chronic Nuisance Property,\" B.R.C. 1981, within the past two years.\n(b)\tThe terms of a reduced term license shall be as follows:\n(1)\tFor violations of Chapter 10-2, \"Property Maintenance Code,\" B.R.C. 1981, the license term shall be reduced to twenty-four months.\n(2)\tFor violations of Title 9, \"Land Use Code,\" and Chapter 10-2.5, \"Abatement of Public Nuisance and Chronic Nuisance Property,\" B.R.C. 1981, the license term shall be reduced to twelve months. A reduced term license issued to allow the operator to bring the rental property into compliance with Section 9-9-16, \"Lighting Outdoor,\" B.R.C. 1981, may only be issued one time.\n(c)\tThe city manager may issue a reduced term short-term rental license if the operator has received a penalty, suspension or other order pursuant to Section 10-3-16(a), \"Administrative Remedy,\" B.R.C. 1981.\n(d)\tIf an operator disagrees with the decision of the city manager to issue a reduced term license under subsection (a) of this section, such person may appeal the city manager's decision within thirty days after the issuance of the reduced term license, as follows:\n(1)\tFor reduced term licenses issued as a result of violations of Chapter 10-2, \"Property Maintenance Code,\" B.R.C. 1981, the appeal shall be made as provided in Section 10-2-2, Section 111, \"Means of Appeal,\" B.R.C. 1981.\n(2)\tFor reduced term licenses issued as a result of violations of Title 9, \"Land Use Code,\" or Chapter 10-2.5, \"Abatement of Public Nuisance and Chronic Nuisance Property,\" B.R.C. 1981, the appeal shall be made to the board of zoning adjustment, although the fee amount shall be as specified for an appeal to the board of building appeals.\nOrdinance Nos. 5798 (1996); 7724 (2010); 7725 (2010); 7726 (2010); 8234 (2018); 8290 (2018); 8371 (2019); 8637 (2024)"
  },
  {
    "corpus": "BRC",
    "title": "10",
    "title_name": "Structures",
    "chapter": "3",
    "chapter_name": "Rental Licenses",
    "anchor": "10-3-5",
    "heading": "License Procedure for Newly Constructed Rental Property.",
    "verbatim": "10-3-5. License Procedure for Newly Constructed Rental Property.\nBaseline inspections are not required before issuance of the first rental license for newly constructed rental property if a license application is submitted by or within one year after the date of issuance of the first certificate of occupancy or temporary certificate of occupancy.\nOrdinance Nos. 5798 (1996); 7023 (1999); 7724 (2010); 7725 (2010)"
  },
  {
    "corpus": "BRC",
    "title": "10",
    "title_name": "Structures",
    "chapter": "3",
    "chapter_name": "Rental Licenses",
    "anchor": "10-3-6",
    "heading": "License Application Procedure for Buildings Converted to Rental Property.",
    "verbatim": "10-3-6. License Application Procedure for Buildings Converted to Rental Property.\nEvery operator converting a property to rental property shall follow the procedures in this section for procuring a rental license:\n(a)\tSubmit to the city manager a complete application packet, on forms provided by the manager, at least thirty days before rental of the property including:\n(1)\tA rental housing inspector's certification of rental inspection dated within twelve months before the application. The operator shall make a copy of the inspection form available to city staff and tenants of inspected units within fourteen days of a request;\n(2)\tThe rental housing inspector shall certify in the rental inspection report the condition and location of all smoke and carbon monoxide alarms required by Chapter 10-2, \"Property Maintenance Code,\" B.R.C. 1981;\n(3)\tA trash removal plan meeting the requirements of Subsection 6-3-3(b), B.R.C. 1981, made and verified by the operator; and\n(4)\tIf the unit is an affordable accessory dwelling unit as defined in Section 9-16-1, \"General Definitions,\" B.R.C. 1981, a sworn certification that the unit will meet the rental affordability standard as defined in Section 9-16-1, \"General Definitions,\" B.R.C. 1981.\n(b)\tPay all license fees prescribed by Section 4-20-18, \"Rental License Fee,\" B.R.C. 1981. The city manager shall not issue any rental license if the operator owes any fees or penalties, unless the penalties are subject to a pending appeal.\n(c)\tTake all reasonable steps to notify any occupants of the property in advance of the date and time of the inspection. The operator shall be present and accompany the inspector throughout the inspection, unlocking and opening doors as required.\nOrdinance Nos. 5798 (1996); 7023 (1999); 7724 (2010); 7725 (2010); 7772 (2010); 8234 (2018); 8283 (2018); 8256 (2018); 8366 (2020); 8571 (2023)"
  },
  {
    "corpus": "BRC",
    "title": "10",
    "title_name": "Structures",
    "chapter": "3",
    "chapter_name": "Rental Licenses",
    "anchor": "10-3-7",
    "heading": "License Renewal Procedure for Buildings Occupied as Rental Property.",
    "verbatim": "10-3-7. License Renewal Procedure for Buildings Occupied as Rental Property.\nEvery operator of a rental property shall follow the procedures in this section when renewing an unexpired license:\n(a)\tSubmit to the city manager a complete application packet, on forms provided by the manager including:\n(1)\tA rental housing inspector's certification of rental inspection dated within twelve months before the application. The operator shall make a copy of the inspection form available to city staff and tenants of inspected units within fourteen days of a request;\n(2)\tThe rental housing inspector shall certify in the rental inspection report the condition and location of all smoke and carbon monoxide alarms required by Chapter 10-2, \"Property Maintenance Code,\" B.R.C. 1981;\n(3)\tA trash removal plan meeting the requirements of Subsection 6-3-3(b), B.R.C. 1981, made and verified by the operator; and\n(4)\tIf the unit is an affordable accessory dwelling unit as defined in Section 9-16-1, \"General Definitions,\" B.R.C. 1981, a sworn certification that the unit will meet the rental affordability standard as defined in Section 9-16-1, \"General Definitions,\" B.R.C. 1981.\n(b)\tPay all license fees prescribed by Section 4-20-18, \"Rental License Fee,\" B.R.C. 1981, before the expiration of the existing license. The city manager shall not issue any rental license if the operator owes any fees or penalties, unless the penalties are subject to a pending appeal.\n(c)\tTake all reasonable steps to notify in advance all tenants of the property of the date and time of the inspection. The operator shall be present and accompany the inspector throughout the inspection, unlocking and opening doors as required.\nOrdinance Nos. 5798 (1996); 7023 (1999); 7724 (2010); 7725 (2010); 7772 (2010); 8234 (2018); 8283 (2018); 8256 (2018); 8366 (2020); 8571 (2023)"
  },
  {
    "corpus": "BRC",
    "title": "10",
    "title_name": "Structures",
    "chapter": "3",
    "chapter_name": "Rental Licenses",
    "anchor": "10-3-8",
    "heading": "Temporary License.",
    "verbatim": "10-3-8. Temporary License.\nIf the inspection shows that there are violations of Chapter 10-2, \"Property Maintenance Code,\" B.R.C. 1981, in the building, and the operator cannot correct the deficiencies before the housing is to be occupied (in the case of new rental property) or the existing license expires (in the case of a renewal), the operator may apply, on forms specified by the city manager, for a temporary license. If the manager finds, based on the number and severity of violations, that such a temporary license would not create or continue an imminent health or safety hazard to the public or the occupants, the manager may issue a temporary license. The manager shall specify the duration of the temporary license, for a period reasonably necessary to make the needed repairs and changes. Upon receipt of an additional certificate of inspection showing correction of the deficiencies, and an additional housing license fee, the manager shall issue the housing license.\nOrdinance Nos. 5798 (1996); 7023 (1999); 7725 (2010)"
  },
  {
    "corpus": "BRC",
    "title": "10",
    "title_name": "Structures",
    "chapter": "3",
    "chapter_name": "Rental Licenses",
    "anchor": "10-3-9",
    "heading": "Temporary License Appeals.",
    "verbatim": "10-3-9. Temporary License Appeals.\nAny operator denied a temporary license, or aggrieved by the period of time allowed for correction, may appeal the denial or the time for correction, or both, as provided in Section 10-2-2, Section 111 \"Means of Appeal,\" B.R.C. 1981. As to an appeal of the time reasonably required to correct a violation, the board shall either affirm the city manager's originally prescribed time or grant a longer time to correct the alleged violation.\nOrdinance Nos. 5798 (1996); 7023 (1999); 7724 (2010); 7725 (2010)"
  },
  {
    "corpus": "BRC",
    "title": "10",
    "title_name": "Structures",
    "chapter": "3",
    "chapter_name": "Rental Licenses",
    "anchor": "10-3-10",
    "heading": "Time of License Expiration.",
    "verbatim": "10-3-10. Time of License Expiration.\nEvery rental license expires upon the earliest of the following dates:\n(a)\tThe expiration date on the license unless temporary authority to rent is allowed under Section 10-3-8, \"Temporary License,\" B.R.C. 1981, of this chapter;\n(b)\tThirty days after the date upon which transfer of ownership of the rental property occurs. However, for purposes of this section and Section 10-3-11, \"Change of Rental Property Owner or Agent,\" B.R.C. 1981, shall not include situations in which a rental property is transferred from ownership by one or more individuals into a limited liability company form of ownership, if all of the following conditions exist:\n(1)\tAt least one transferring owner is a member of the limited liability company;\n(2)\tNo exchange of consideration takes place as a condition of the transfer; and\n(3)\tThe transferring owners certify on forms approved by the city manager that there will be no significant change in the persons who manage the rental property or, in the alternative, in the persons who are responsible for managing the rental property;\n(c)\tThe effective date of any order or notice to vacate the rental property issued under any provision of law;\n(d)\tThe expiration of the temporary certificate of occupancy for the rental property if a permanent certificate of occupancy has not been issued; or\n(e)\tThe revocation of the certificate of occupancy for the rental property.\nOrdinance Nos. 5798 (1996); 7023 (1999); 7636 (2008); 7725 (2010)"
  },
  {
    "corpus": "BRC",
    "title": "10",
    "title_name": "Structures",
    "chapter": "3",
    "chapter_name": "Rental Licenses",
    "anchor": "10-3-11",
    "heading": "Change of Rental Property Ownership or Agent.",
    "verbatim": "10-3-11. Change of Rental Property Ownership or Agent.\n(a)\tWithin thirty days after transfer of ownership or change of local agent of a licensed property, the operator shall notify the city manager of the identity and mailing address of the new owner or new local agent.\n(b)\tWithin sixty days after transfer of ownership of a property for which there is a current and valid license, the new operator of the property shall apply for a new license under Section 10-3-6, \"License Application Procedure for Buildings Converted to Rental Property,\" B.R.C. 1981.\n(c)\tIssuance of any licenses requires meeting the energy efficiency requirements of Chapter 10-2, \"Property Maintenance Code,\" Appendix C, \"Energy Efficiency Requirements,\" B.R.C. 1981.\nOrdinance Nos. 5798 (1996); 7189 (2002); 7636 (2008); 7724 (2010); 7725 (2010); 7726 (2010); 7772 (2010); 8371 (2019)"
  },
  {
    "corpus": "BRC",
    "title": "10",
    "title_name": "Structures",
    "chapter": "3",
    "chapter_name": "Rental Licenses",
    "anchor": "10-3-12",
    "heading": "License Fees.",
    "verbatim": "10-3-12. License Fees.\n(a)\tApplicants for any rental housing license, and operators renewing an existing rental housing license, shall pay the license fees prescribed by Section 4-20-18, \"Rental License Fee,\" B.R.C. 1981, prior to issuance of any license application.\n(b)\tIf an operator of rental property legally changes the use of a structure by adding units for which such operator receives a license under this chapter separate from the license for the remainder of the rental property, the operator shall apply for a single rental license to cover the entire property no later than thirty days before the expiration date of the license that first expires. There shall be no additional fee assessed for the dwelling units or rooming units that were added to the structure at the time the separate licenses are consolidated.\n(c)\tIf an operator of rental property reduces the number of dwelling units or rooming units within a rental property, the operator is not entitled to a refund of any fee previously paid.\n(d)\tThe city manager shall charge no license fee for the following rental dwelling units, so long as such units have also been individually certified to the city manager as low income rental property by the housing authority of the City of Boulder, and such certification is valid at the time the fee would otherwise be due:\n(1)\tUnits owned by or leased and operated by the housing authority of the City of Boulder;\n(2)\tUnits owned by or leased and operated by an entity which has a current valid tax status determination by the United States Internal Revenue Service as a Section 501(c)(3) tax exempt organization and such units are permanently affordable, as that term is defined in Chapter 9-16, \"Definitions,\" B.R.C. 1981; or\n(3)\tUnits covered by an assistance payment contract under 49 U.S.C. § 1437(b), \"Lower-income housing assistance - authorization for contracts for assistance payments for existing dwellings.\"\n(4)\tIf a housing complex under common ownership operates a fixed number or percentage of units as qualifying units under this subsection, but the individual units occupied by low income tenants vary over time, the license and fee waiver allowed by this subsection shall be applied pro rata to the total amount.\nOrdinance Nos. 5798 (1996); 7023 (1999); 7725 (2010); 8366 (2020)"
  },
  {
    "corpus": "BRC",
    "title": "10",
    "title_name": "Structures",
    "chapter": "3",
    "chapter_name": "Rental Licenses",
    "anchor": "10-3-13",
    "heading": "Availability of License.",
    "verbatim": "10-3-13. Availability of License.\nNo operator who holds a rental license shall fail to make the rental license available to anyone within seventy-two hours of receiving a request. Posting of a rental license at the rental property is not required.\nOrdinance Nos. 5798 (1996); 7725 (2010)"
  },
  {
    "corpus": "BRC",
    "title": "10",
    "title_name": "Structures",
    "chapter": "3",
    "chapter_name": "Rental Licenses",
    "anchor": "10-3-14",
    "heading": "Local Agent Required.",
    "verbatim": "10-3-14. Local Agent Required.\nWhenever any rental property is required to be licensed under this chapter, and neither the owner nor the operator is a natural person domiciled within Boulder County, Colorado, the owner shall appoint a natural person who is capable of responding to the property within sixty minutes, to serve as the local agent of the owner and the operator for service of such notices as are specified in Section 10-2-2, \"Property Maintenance Code,\" Chapter 10-2.5, \"Abatement of Public Nuisance and Chronic Nuisance Property,\" Section 108, \"Unsafe Structures and Equipment,\" and Section 109, \"Emergency Measures,\" B.R.C 1981, and notices given to the local agent shall be sufficient to satisfy any requirement of notice to the owner or the operator. The owner shall notify the city manager in writing of the appointment within five days of being required to make such an appointment, and shall thereafter notify the city manager of any change of local agent within fifteen days of such change.\nOrdinance Nos. 5798 (1996); 7724 (2010); 7725 (2010); 8366 (2020); 8637 (2024)"
  },
  {
    "corpus": "BRC",
    "title": "10",
    "title_name": "Structures",
    "chapter": "3",
    "chapter_name": "Rental Licenses",
    "anchor": "10-3-15",
    "heading": "City Manager May Order Premises Vacated.",
    "verbatim": "10-3-15. City Manager May Order Premises Vacated.\n(a)\tWhenever the city manager determines that any rental housing is in violation of this chapter or of chapter 10-2, \"Property Maintenance Code,\" B.R.C. 1981, and has caused a summons and complaint requiring the operator to appear in municipal court to answer the charge of violation to issue, and the summons cannot be served upon the operator despite reasonable efforts to do so, or, having been served, the operator has failed to appear in the municipal court to answer the charges or at any other stage in the proceedings, or, having been convicted or entered a plea of guilty or no contest, the operator has failed to satisfy the judgment of the court or any condition of a deferred judgment, then the city manager may, after thirty days' notice and an opportunity for a hearing to the tenants and the operator, require that the premises be vacated and not be reoccupied until all of the requirements of the Property Maintenance Code and the rental licenses code have been satisfied and a rental housing license is in effect. No person shall occupy any premises as a tenant after receiving actual or constructive notice that the premises have been vacated under this section.\n(b)\tAny notice required by this section to be given to an operator is sufficient if sent by first class or certified mail to the address of the last known owner of the property as shown on the records of the Boulder County Assessor as of the date of mailing. Any notice to the tenant required by this section is sufficient if sent by first class or certified mail to or delivered to any occupant at the address of the premises and directed to \"All Tenants.\"\n(c)\tThe remedy provided in this section is cumulative and is in addition to any other action the city manager is authorized to take.\nOrdinance Nos. 5798 (1996); 7724 (2010); 7725 (2010)"
  },
  {
    "corpus": "BRC",
    "title": "10",
    "title_name": "Structures",
    "chapter": "3",
    "chapter_name": "Rental Licenses",
    "anchor": "10-3-16",
    "heading": "Administrative Remedy.",
    "verbatim": "10-3-16. Administrative Remedy.\n(a)\tIf the city manager finds that a violation of any provision of this chapter, Chapter 10-2, \"Property Maintenance Code,\" or Chapter 10-2.5, \"Abatement of Public Nuisance and Chronic Nuisance Property,\" B.R.C. 1981, exists, the manager, after notice to the operator and an opportunity for hearing under the procedures prescribed by Chapter 1-3, \"Quasi-Judicial Hearings,\" B.R.C. 1981, may take any one or more of the following actions to remedy the violation:\n(1)\tImpose a civil penalty according to the following schedule:\n(A)\tFor the first violation of the provision, $150;\n(B)\tFor the second violation of the same provision, $300; and\n(C)\tFor the third violation of the same provision, $1,000;\n(2)\tRevoke the rental license;\n(3)\tIf the city manager finds that a short-term rental license was issued to a licensee who is determined not to comply with subsections (1), (2) or (3) of Section 10-3-19(c), \"Short-Term Rentals,\" B.R.C. 1981, the city manager shall revoke the short-term rental license; and\n(4)\tIssue any order reasonably calculated to ensure compliance with this chapter, and Chapter 10-2, \"Property Maintenance Code,\" B.R.C. 1981.\n(b)\tIf the city manager finds that an affordable accessory unit was advertised, offered for rent or rented for an amount in excess of the affordability standard, in addition to the actions the manager may take under subsection (a), of this section, the manager shall impose a penalty equal to the amount charged in excess of the affordability standard during the term of the license, plus interest at the rate of twelve percent per annum, and shall pay such funds collected to the tenant who was charged in excess of the affordability standard.\n(c)\tIf notice is given to the city manager by the operator at least forty-eight hours before the time and date set forth in the notice of hearing on any violation that the violation has been corrected, the manager will reinspect the building. If the manager finds that the violation has been corrected, the manager may cancel the hearing.\n(d)\tThe city manager's authority under this section is in addition to any other authority the manager has to enforce this chapter, and election of one remedy by the manager shall not preclude resorting to any other remedy as well.\n(e)\tThe city manager may, in addition to taking other collection remedies, certify due and unpaid charges to the Boulder County Treasurer for collection as provided by Section 2-2-12, \"City Manager May Certify Taxes, Charges and Assessments to County Treasurer for Collection,\" B.R.C. 1981.\n(f)\tTo cover the costs of investigative inspections, the city manager will assess operators a $250 fee per inspection, where the city manager performs an investigative inspection to ascertain compliance with or violations of this chapter.\n(g)\tThe city manager shall not accept a new application from the same licensee for the same dwelling unit or units after revocation of a license:\n(1)\tFor at least six months following the revocation; and\n(2)\tUnless the applicant demonstrates compliance with all licensing requirements.\nOrdinance Nos. 5798 (1996); 7724 (2010); 7725 (2010); 7772 (2010); 8072 (2015); 8108 (2016); 8154 (2016); 8256 (2018); 8556 (2023); 8571 (2023); 8637 (2024)"
  },
  {
    "corpus": "BRC",
    "title": "10",
    "title_name": "Structures",
    "chapter": "3",
    "chapter_name": "Rental Licenses",
    "anchor": "10-3-17",
    "heading": "Penalty.",
    "verbatim": "10-3-17. Penalty.\n(a)\tThe penalty for violation of any provision of this chapter is a fine of at least $500 and not more than $2,000 per violation, or incarceration for not more than ninety days in jail, or both such fine and incarceration. In addition, upon conviction of any person for violation of this chapter, the court may issue a cease and desist order and any other orders reasonably calculated to remedy the violation. Violation of any order of the court issued under this section is a violation of this section and is punishable by a fine of not more than $4,000 per violation, or incarceration for not more than ninety days in jail, or both such fine and incarceration.\n(b)\tIt shall be a condition of any deferred prosecution or deferred or suspended sentence under this chapter that the defendant commit no violations of this chapter for at least one year from the date of such deferred prosecution or deferred or suspended sentence.\n(c)\tNotwithstanding subsection (a) of this section, the following specific sentencing considerations shall apply to fines imposed for violations:\n(1)\tThe court shall consider any evidence presented by the defendant that a potential fine would be confiscatory. A confiscatory fine is a fine that would deprive a normally capitalized owner of the ability to continue operating a rental housing business of the sort involved in the case before the court. No fine that is confiscatory shall be enforced by the court.\n(2)\tIn imposing a fine in any single case or in any consolidated cases, the court may weigh all factors normally and properly considered in connection with the imposition of fines, including the seriousness of the violation, the past record of the defendant, the economic circumstances of the defendant and all mitigating or aggravating factors relevant to the violation or to the defendant. In addition, in determining the amount of any fine, the court may consider:\n(A)\tThe imposition of a fine that would deprive the defendant of any illegal profit collected because of the occurrence of the violation or violations on the rental housing property;\n(B)\tThe imposition of a reasonable penalty in addition to any level of fine that is attributable to illegally obtained profit; and\n(C)\tThe imposition of such additional fine as is determined by the court to constitute a reasonable amount to be suspended in order to ensure compliance with any terms of probation imposed by the court.\n(d)\tNo fine imposed in a single case alleging multiple dates of violation, nor any fine in consolidated cases alleging multiple days of violation, shall exceed the maximum fine that might be imposed for fifteen separate violations unless the court finds special aggravating circumstances. Where special aggravating factors are at issue, the following procedures shall apply:\n(1)\tThe defendant shall be entitled to ten days' notice of any special aggravating factors upon which the prosecution intends to rely at the sentencing hearing or about which, based upon evidence previously presented, the court is concerned. If necessary in order to provide such notice, a defendant shall be entitled to a continuance of the sentencing hearing.\n(2)\tA judicial finding of the existence of special aggravating factors shall not mandate that the court impose any particular level of fine but will, rather, provide the sentencing court with discretion to determine a fine based upon all the criteria set forth in this subsection.\n(3)\tSpecial aggravating factors, for the purpose of this subsection, shall require a judicial finding of one or more of the following:\n(A)\tThe violations at issue were flagrant and intentional on the part of the defendant;\n(B)\tThe defendant, after learning of the violation, failed to attempt corrective action over a sustained period of time; or\n(C)\tA fine equivalent to the maximum fine permitted for fifteen separate violations would be inadequate to disgorge the defendant of illegal profits obtained as a consequence of the violations or would be inadequate to ensure that the violation is neither profitable nor revenue neutral for the offender.\nOrdinance Nos. 5798 (1996); 7725 (2010)"
  },
  {
    "corpus": "BRC",
    "title": "10",
    "title_name": "Structures",
    "chapter": "3",
    "chapter_name": "Rental Licenses",
    "anchor": "10-3-18",
    "heading": "Authority to Issue Rules.",
    "verbatim": "10-3-18. Authority to Issue Rules.\nThe city manager may adopt reasonable rules to implement this chapter.\nOrdinance Nos. 7636 (2008); 7725 (2010)"
  },
  {
    "corpus": "BRC",
    "title": "10",
    "title_name": "Structures",
    "chapter": "3",
    "chapter_name": "Rental Licenses",
    "anchor": "10-3-19",
    "heading": "Short-Term Rentals.",
    "verbatim": "10-3-19. Short-Term Rentals.\n(a)\tShort-term rentals are prohibited unless the city manager has issued a valid short-term rental license for the property.\n(b)\tThe city manager shall only issue a rental license for short-term rental to:\n(1)\tA natural person, whose name appears on the deed to the property;\n(2)\tA trust, if the beneficiary of the trust is a natural person; or\n(3)\tA not-for-profit corporation licensed pursuant to Section 501(c) of the Internal Revenue Code, provided, however, the city manager shall have discretion to reject any application for a not-for-profit corporation if the city manager deems the application to be inconsistent with the goals of this chapter, which include allowing not-for-profits the opportunity support their mission through short-term rentals, preserving long term rental units and preventing investor owned short-term rentals.\n(c)\tAny application for a rental license for short-term rental shall include the following:\n(1)\tIf the applicant is a natural person, the application must include a true copy of a Colorado driver's license or Colorado identification card showing the dwelling unit to be licensed is the applicant's address and a sworn statement that said dwelling unit is the applicant's principal residence;\n(2)\tIf the applicant is a trust, a true copy of a Colorado driver's license or Colorado identification card showing the dwelling unit to be licensed is a beneficiary's address and a sworn statement that said dwelling unit is a beneficiary's principal residence;\n(3)\tIf the applicant is a not-for-profit corporation, the application shall include proof of the corporation's status under Section 501(c) of the Internal Revenue Code and a statement of the manner in which short-term rentals serve the organization's charitable purpose;\n(4)\tA certification that the dwelling unit is equipped with operational smoke detectors, carbon monoxide detectors and other life safety equipment as may be required by the city manager; and\n(5)\tThe names and telephone numbers of two contacts who for owner-operated rentals can be permanent residents on the property and who are capable of responding to the property within sixty minutes.\n(d)\tIf the applicant is a natural person, the applicant's name must appear on the deed to the property on which the dwelling unit to be rented is located, and the applicant must possess at least a fifty percent fee simple ownership interest in the property.\n(e)\tIf the applicant is a trust, the trust must possess at least a fifty percent fee simple ownership interest in the property.\n(f)\tThe city manager shall not issue a license for short-term rental of a property in which an entity that is not tax exempt under Section 501(c) of the Internal Revenue Code holds a fee simple ownership interest.\n(g)\tThe city manager shall not issue a license for short-term rental of a permanently affordable dwelling unit.\n(h)\tShort-term rentals shall not be subject to the inspection requirements of Subsection 10-3-3(b), \"Terms of Licenses,\" B.R.C. 1981, except as set forth in subsection (o).\n(i)\tThe occupancy of a dwelling unit rented as a short-term rental shall not exceed the occupancy permitted pursuant to Chapter 10-2, \"Property Maintenance Code,\" B.R.C. 1981.\n(j)\tThe dwelling unit rented as a short-term rental shall be the licensee's principal residence.\n(k)\tNo person shall rent a dwelling unit in a manner that requires or encourages a person to sleep in an area that is not habitable as that term is used in the International Property Maintenance Code as adopted in Section 10-2-2, \"Adoption of the International Property Maintenance Code with Modifications,\" B.R.C. 1981.\n(l)\tNo person shall advertise a short-term rental, unless the advertisement includes the valid short-term rental license number once assigned by the city manager.\n(m)\tThe city manager shall not issue more than one short-term rental license to any applicant.\n(n)\tThe city manager may not issue more than one rental license pursuant to the standards of this chapter related to the use of a dwelling or dwelling unit. The city manager shall not issue a short-term rental license for and no person shall rent as a short-term rental any dwelling, dwelling unit, rooming unit, room or portion of any of the foregoing if the dwelling, dwelling unit, or rooming unit is otherwise licensed as a rental under this chapter or is subject to an affidavit of exemption filed with the city manager pursuant to Subsection 10-3-2(b), \"Rental License Required Before Occupancy and License Exemptions,\" B.R.C. 1981; and, if a dwelling, dwelling unit, rooming unit, room or any portion of the foregoing is licensed as a short-term rental, the city manager shall not issue a rental license for a rental other than short-term rental for and no person shall rent other than for short-term rental the dwelling, dwelling unit, rooming unit, room, or any portion of any of the forgoing.\n(o)\tAn accessory dwelling unit or a principal dwelling unit on a detached dwelling unit lot or parcel with an accessory unit may not be rented as a short-term rental unless all the following requirements are met:\n(1)\tBoth the accessory dwelling unit and the principal dwelling unit were legally established by February 1, 2019;\n(2)\tA current and valid short-term rental license exists for the unit;\n(3)\tIf the accessory dwelling unit is licensed for short-term rental, only the accessory dwelling unit and not any other dwelling unit on the same property may be licensed or used as a rental;\n(4)\tIf a principal dwelling unit is licensed for short-term rental, then no accessory dwelling unit on the same property may be licensed or used as a rental;\n(5)\tAn accessory dwelling unit may not be rented as a short-term rental for more than one hundred twenty days in any calendar year;\n(6)\tNotwithstanding the provisions of subsection (i), the occupancy of the accessory dwelling unit and the principal dwelling unit must meet the requirements of Subsection 9-8-5(b), B.R.C. 1981; and\n(7)\tLicensing Limitations and Requirements:\n(A)\tAfter February 1, 2019, no application for a new short-term rental license may be accepted. The city manager may renew unexpired short-term rental licenses pursuant to Section 10-3-7, \"License Renewal Procedure for Buildings Occupied as Rental Property,\" B.R.C. 1981. A license for which a complete renewal application is not filed within ninety days from the expiration date shall be considered expired.\n(B)\tAn applicant for a short-term rental license for a detached accessory dwelling unit, as that term is defined in Section 9-16-1, \"General Definitions,\" B.R.C. 1981, must submit an inspection report for the accessory structure containing the unit consistent with the requirements of Subsection 10-3-3(b), B.R.C. 1981.\n(C)\tNotwithstanding the provisions of Section 10-2-2, \"Adoption of the International Property Maintenance Code with Modifications,\" B.R.C. 1981, Appendix C, effective January 2, 2019, the energy efficiency requirements set forth in Section 10-2-2, Appendix C shall apply to detached accessory dwelling units, as that term is defined in Section 9-16-1, \"General Definitions,\" B.R.C. 1981, that are licensed for short term rental.\n(p)\tAny licensee that has submitted a sworn statement pursuant to paragraph (c)(1) or (2) of this section as part of its original application shall complete the following each year within thirty days of the anniversary of the issuance of the short-term rental license:\n(1)\tSubmit a sworn statement meeting the requirements of Paragraph 10-3-19(c)(1) or (2), B.R.C. 1981, affirming that the licensed dwelling unit continues to be the applicant or the applicant's principal beneficiary's principal residence; and\n(2)\tPay the fee described in Section 4-20-18, \"Rental Licensing Fees,\" B.R.C. 1981.\nOrdinance Nos. 8050 (2015); 8104 (2016); 8154 (2016); 8256 (2018); 8304 (2019); 8371 (2019); 8556 (2023); 8571 (2023); 8651 (2025)"
  },
  {
    "corpus": "BRC",
    "title": "10",
    "title_name": "Structures",
    "chapter": "3",
    "chapter_name": "Rental Licenses",
    "anchor": "10-3-20",
    "heading": "Reserved.",
    "verbatim": "10-3-20. Reserved.\nEditor's note(s)—Ord. No. 8651, § 59, adopted March 6, 2025, repealed § 10-3-20, which pertained to occupancy and derived from Ordinance Nos. 8050 (2015); 8072 (2015); 8108 (2016)."
  },
  {
    "corpus": "BRC",
    "title": "10",
    "title_name": "Structures",
    "chapter": "4",
    "chapter_name": "Condominium Conversions",
    "anchor": "10-4-1",
    "heading": "Legislative Intent.",
    "verbatim": "10-4-1. Legislative Intent.\nThe purpose of this chapter is to protect the tenants of dwellings whose owners contemplate converting the dwellings into condominiums for sale by providing such tenants with notice of that intent."
  },
  {
    "corpus": "BRC",
    "title": "10",
    "title_name": "Structures",
    "chapter": "4",
    "chapter_name": "Condominium Conversions",
    "anchor": "10-4-2",
    "heading": "Condominium Conversion.",
    "verbatim": "10-4-2. Condominium Conversion.\nCondominium conversion means the transfer of ownership of less than the total number of dwelling units in a multiple dwelling unit structure, where any ownership interest created by the transfer of ownership is in a number of dwelling units that is less than the total number of units in the structure in which the seller had an interest prior to the sale or, with respect to a mobile home park, the transfer of ownership of the mobile home park property so that it is jointly and severally owned by the owners of the mobile homes upon such property."
  },
  {
    "corpus": "BRC",
    "title": "10",
    "title_name": "Structures",
    "chapter": "4",
    "chapter_name": "Condominium Conversions",
    "anchor": "10-4-3",
    "heading": "Notice of Condominium Conversion.",
    "verbatim": "10-4-3. Notice of Condominium Conversion.\n(a)\tNo person with an ownership interest in more than ten dwelling units in one multiple dwelling unit structure, no owner of a mobile home park, and no officer or employee or agent of any such person shall transfer or contract to transfer the ownership of any such dwelling units or mobile home park for the purpose of converting an existing dwelling unit into a condominium unit or a mobile home park into condominium ownership where said dwelling unit or mobile home park is occupied by a tenant, until the tenant thereof and the housing authority of the City of Boulder have been given at least one hundred twenty days' prior written notice of the intent to sell said dwelling unit or mobile home park. If a tenant voluntarily vacates a dwelling unit after receiving said notice within the one hundred twenty day period, a transfer of title to that individual vacated unit may occur immediately upon the vacation. However, vacation of a dwelling unit after a rental increase or a request to vacate shall not be deemed to be a voluntary vacation.\n(b)\tThe written notice to the tenant required by subsection (a) of this section shall also contain the following language:\nIf you are sixty-two or over or have a low total household income, you may be qualified to receive assistance from the housing authority of the City of Boulder to remain in your apartment or mobile home. You may notify the housing authority within thirty days of this notice if you are interested in applying for assistance. The housing authority can be contacted at 441-3157, by mail at P.O. Box 791, Boulder, Colorado 80306, or in person at 1101 Arapahoe Avenue, Boulder, Colorado.\nOrdinance No. 5271 (1990)"
  },
  {
    "corpus": "BRC",
    "title": "10",
    "title_name": "Structures",
    "chapter": "5",
    "chapter_name": "Building Code",
    "anchor": "10-5-1",
    "heading": "Legislative Intent.",
    "verbatim": "10-5-1. Legislative Intent.\nThe purpose of this chapter is to protect the public health and safety by regulating the construction, alteration, repair, wrecking, and moving of structures in the city. The city council hereby adopts the 2024 edition of the International Building Code with certain amendments and deletions thereto found to be in the best interests of the residents of the city.\nOrdinance Nos. 4984 (1986); 5177 (1989); 5493 (1992); 5781 (1996); 7566 (2007); 7622 (2008); 7925 (2013); 8366 (2020); 8684 (2025)"
  },
  {
    "corpus": "BRC",
    "title": "10",
    "title_name": "Structures",
    "chapter": "5",
    "chapter_name": "Building Code",
    "anchor": "10-5-2",
    "heading": "Adoption of International Building Code With Modifications.",
    "verbatim": "10-5-2. Adoption of International Building Code With Modifications.\n(a)\tThe 2024 edition of the International Building Code of the International Code Council is hereby adopted by reference as the City of Boulder Building Code and has the same force and effect as though fully set forth in this chapter, except as specifically amended by the provisions of this chapter.\n(b)\tThe appendix chapters E \"SUPPLEMENTARY ACCESSIBILITY REQUIREMENTS\", I, \"PATIO COVERS,\" J, \"GRADING,\" and K, \"ADMINISTRATIVE PROVISIONS,\" and sections contained therein are adopted.\n(c)\tSection 101.1, \"Title,\" is repealed and reenacted to read:\n101.1 Title. These regulations shall be known as the Building Code of the City of Boulder or building code, hereinafter referred to as \"this code.\" Where other codes are referenced in this code, those code provisions shall not apply unless otherwise adopted by the City of Boulder. Where reference is made anywhere in this code to the \"Department\" or \"Department of Building Safety,\" it shall have the same meaning as the \"Division of Building Safety.\" Where reference is made anywhere in this code to the \"International Energy Conservation Code,\" it shall have the same meaning as the \"City of Boulder Energy Conservation Code.\"\n(d)\tSection 101.4, \"Referenced codes,\" is repealed and reenacted to read:"
  },
  {
    "corpus": "BRC",
    "title": "10",
    "title_name": "Structures",
    "chapter": "99",
    "chapter_name": ". FENCES AND WALLS.",
    "anchor": "10-5-3",
    "heading": "Adoption of Uniform Code for Abatement of Dangerous Buildings With Modifications.",
    "verbatim": "10-5-3. Adoption of Uniform Code for Abatement of Dangerous Buildings With Modifications.\nRepealed.\nOrdinance Nos. 7925 (2013); 8684 (2025)"
  },
  {
    "corpus": "BRC",
    "title": "10",
    "title_name": "Structures",
    "chapter": "99",
    "chapter_name": ". FENCES AND WALLS.",
    "anchor": "10-5-4",
    "heading": "Building Permit Fees.",
    "verbatim": "10-5-4. Building Permit Fees.\nBuilding permit fees are those prescribed by Subsection 4-20-4(c), B.R.C. 1981. Fees for other permits issued pursuant to this chapter and charges for services are those prescribed by Subsection 4-20-4(d), B.R.C. 1981.\nOrdinance Nos. 4984 (1986); 5493 (1992); 5781 (1996); 7566 (2007); 7697 (2009); 7925 (2013)"
  },
  {
    "corpus": "BRC",
    "title": "10",
    "title_name": "Structures",
    "chapter": "99",
    "chapter_name": ". FENCES AND WALLS.",
    "anchor": "10-5-5",
    "heading": "Wood Roof Covering Materials Prohibited.",
    "verbatim": "10-5-5. Wood Roof Covering Materials Prohibited.\n(a)\tNo person shall install or cause to be installed any wood roof covering materials, including, without limitation, wood shakes or wood shingles. This prohibition includes wood roof covering materials with fire retardant treatments of any kind.\n(b)\tNo person owning a building with wood roof covering materials shall fail to remove or cause to be removed from the building all wood roof covering materials before January 1, 2014, and to replace the removed roofing with approved roof covering materials which conform to the International Building Code as adopted, and no person shall thereafter take possession or ownership of a building with wood roof covering materials.\n(c)\tThe following additional definition applies to this section and to Chapter 15 of the building code:\n\"Wood roof covering material\" means an exterior surface material used as a top covering and made of wood. \"Wood,\" for the purposes of this definition, means any natural or composite material containing at least fifty percent wood by volume.\nOrdinance Nos. 5645 (1994); 5693 (1995); 5781 (1996); 7566 (2007); 7925 (2013)"
  },
  {
    "corpus": "BRC",
    "title": "10",
    "title_name": "Structures",
    "chapter": "6",
    "chapter_name": "Electrical Code7",
    "anchor": "10-6-1",
    "heading": "Legislative Intent.",
    "verbatim": "10-6-1. Legislative Intent.\nThe purpose of this chapter is to protect the public health and safety by regulating the installation, alteration, or repair of or addition to electrical conductors or equipment installed within or on any structure in the city. The city council hereby adopts the current National Electrical Code, as currently adopted by the State of Colorado or as is from time to time modified, reenacted or readopted by the State of Colorado.\nOrdinance No. 8209 (2017)"
  },
  {
    "corpus": "BRC",
    "title": "10",
    "title_name": "Structures",
    "chapter": "6",
    "chapter_name": "Electrical Code7",
    "anchor": "10-6-2",
    "heading": "Adoption of the National Electrical Code With Modifications.",
    "verbatim": "10-6-2. Adoption of the National Electrical Code With Modifications.\n(a)\tThe current National Electrical Code of the National Fire Protection Association, as currently adopted by the State of Colorado or as is from time to time modified, reenacted or readopted by the State of Colorado is hereby adopted by reference as the City of Boulder Electrical Code or electrical code and has the same force and effect as though fully set forth in this chapter, except as specifically amended by the provisions of this chapter.\n(b)\tThis code shall be administered in accordance with Chapter 1, Administration, of the 2024 edition of the International Building Code and Appendix K, Administrative Provisions, of the 2024 edition of the International Building Code, as adopted, respectively, with amendments, by Section 10-5-2, \"Adoption of the International Building Code With Modifications,\" B.R.C. 1981.\nOrdinance Nos. 8209 (2017); 8366 (2020); 8684 (2025)"
  },
  {
    "corpus": "BRC",
    "title": "10",
    "title_name": "Structures",
    "chapter": "6",
    "chapter_name": "Electrical Code7",
    "anchor": "10-6-3",
    "heading": "Reserved.",
    "verbatim": "10-6-3. Reserved.\nEditor's note(s)—Ord. No. 8684, § 12, effective August 1, 2025, repealed § 10-6-3, which pertained to arc-fault circuit-interrupter protection in existing dwelling units and derived from Ordinance Nos. 8209 (2017); 8366 (2020)."
  },
  {
    "corpus": "BRC",
    "title": "10",
    "title_name": "Structures",
    "chapter": "7",
    "chapter_name": "Energy Conservation Code",
    "anchor": "10-7-1",
    "heading": "Legislative Intent.",
    "verbatim": "10-7-1. Legislative Intent.\nThe purpose of this chapter is to protect the public health, safety, and welfare by encouraging the conservation of scarce energy resources through the regulation of building construction standards to minimize energy consumption for heating, cooling, lighting, and ventilating structures in the city and to encourage building design utilizing green building techniques.\nOrdinance Nos. 7566 (2007); 7925 (2013)"
  },
  {
    "corpus": "BRC",
    "title": "10",
    "title_name": "Structures",
    "chapter": "7",
    "chapter_name": "Energy Conservation Code",
    "anchor": "10-7-2",
    "heading": "Energy Conservation Code.",
    "verbatim": "10-7-2. Energy Conservation Code.\n(a)\tCouncil adopts by reference the 2024 City of Boulder Energy Conservation Code published by the International Code Council which shall have the same force and effect as though fully set forth in the Boulder Revised Code, 1981, except as specifically amended by the provisions of this chapter. This code shall also be known as the City of Boulder Energy Conservation Code. This chapter and the 2024 City of Boulder Energy Conservation Code shall be administered, applied, and interpreted in accordance with and as part of Chapter 10-5, \"Building Code,\" B.R.C. 1981.\n(b)\tSection C405.13, \"Electric vehicle (EV) charging for new construction,\" is repealed and reenacted to read as follows:\nC405.13 Electric vehicle (EV) charging for new construction. The building shall be provided with electric vehicle (EV) charging in accordance with this section and the National Electrical Code (NFPA 70). Where parking spaces are added or modified without an increase in building size, only the new parking spaces are subject to this requirement. The number of required EVSE installed spaces, EV ready spaces, EV capable spaces, and EV capable light spaces shall be determined based on the total number of provided motor vehicle parking spaces.\n(c)\tSection C406.2.2, \"More efficient HVAC performance,\" is repealed and reenacted to read as follows:\nC406.2.2 More efficient HVAC performance. To achieve credits for more efficient HVAC performance, all heating and cooling systems shall meet the minimum requirements of Section C403 and efficiency improvements shall be referenced to minimum efficiencies listed in tables referenced by Section C403.3.3. Where multiple efficiency requirements are listed, equipment shall meet the seasonal or part-load efficiencies, including SEER/SEER2, EER/integrated energy efficiency ratio (IEER), integrated part load value (IPLV), or AFUE. Equipment that is larger than the maximum capacity range indicated in tables referenced by Section C403.3.3 shall meet the efficiencies listed for the largest capacity for the associated equipment type shown in the table. Where multiple individual heating or cooling systems serve a project, the HVAC performance improvement of the project shall be the weighted average improvement based on individual system capacity. Projects will achieve HVAC efficiency credits for one or several of the following measures:\n1.\tC406.2.2.4 H04\n2.\tC406.2.2.5 H05\n(d)\tSection C406.2.2.2, \"H02 More efficient HVAC equipment heating performance,\" is repealed and reenacted to read as follows:\nC406.2.2.2 H02. Reserved.\n(e)\tSection C406.2.2.3, \"H03 More efficient HVAC equipment cooling and fan performance,\" is repealed and reenacted to read as follows:\nC406.2.2.3 H03. Reserved.\n(f)\tLines H02 and H03 in Table C406.2, \"Base Credit for Additional Conservation Measures,\" are repealed to read as follows:\nH02 Reserved\nH03 Reserved\nOrdinance Nos. 7172 (2001); 7566 (2007); 7620 (2008); 7925 (2013); 7963 (2014); 8166 (2017); 8366 (2020); 8629 (2024); 8696 (2025)"
  },
  {
    "corpus": "BRC",
    "title": "10",
    "title_name": "Structures",
    "chapter": "7",
    "chapter_name": "Energy Conservation Code",
    "anchor": "10-7-3",
    "heading": "Regulations.",
    "verbatim": "10-7-3. Regulations.\nThe city manager may make reasonable interpretive and administrative regulations to aid in applying this chapter under the procedures of Chapter 1-4, \"Rulemaking,\" B.R.C. 1981, including rules establishing methods for showing compliance with the requirements of this chapter.\nOrdinance No. 7925 (2013)"
  },
  {
    "corpus": "BRC",
    "title": "10",
    "title_name": "Structures",
    "chapter": "8",
    "chapter_name": "Fire Code",
    "anchor": "10-8-1",
    "heading": "Legislative Intent.",
    "verbatim": "10-8-1. Legislative Intent.\nThe purpose of this chapter is to protect public health and safety by regulating the use, condition, construction, alteration, and repair of property, structures, and occupancies in the city in order to prevent the ignition and spread of fire and risk of harm to persons or property from fire and other causes. The city council hereby adopts the 2024 edition of the International Fire Code with certain amendments, additions, and deletions thereto found to be in the best interests of the city. The standards provided in this chapter shall be used, insofar as they are applicable, in determining whether a condition is hazardous, whether any work that has been performed has been done in an approved manner, or whether any equipment is of an approved type or quality, and in any determination concerning fire hazards and fire safety in the city building code not specifically provided for therein.\nOrdinance Nos. 5781 (1996); 6015 (1998); 7566 (2007); 7925 (2013); 8366 (2020); 8684 (2025)"
  },
  {
    "corpus": "BRC",
    "title": "10",
    "title_name": "Structures",
    "chapter": "8",
    "chapter_name": "Fire Code",
    "anchor": "10-8-2",
    "heading": "Adoption of International Fire Code With Modifications.",
    "verbatim": "10-8-2. Adoption of International Fire Code With Modifications.\n(a)\tThe 2024 edition of the International Fire Code of the International Code Council is adopted by reference as the City of Boulder Fire Code and has the same force and effect as though fully set forth in this chapter, except as specifically amended by the provisions of this chapter.\n(b)\tThe Fire Code adopted by Subsection (a) of this section is amended in the following places:\n(1)\tSection 103.1 is repealed and reenacted to read:\n103.1 Community Risk Reduction. A Community Risk Reduction is established within the fire department under the direction of the manager, which shall consist of such fire department personnel as may be assigned thereto by the manager. The function of this division shall be to assist the manager in the administration and enforcement of the provisions of this code.\n(2)\tSection 104.5 is repealed and reenacted to read:\n104.5 Identification. For the purposes of this section, the term \"fire code official\" includes all firefighters appointed pursuant to Section 2-5-4, \"Identification Card for Firefighters,\" B.R.C. 1981.\n(3)\tSection 104.8 is repealed and reenacted to read:\n104.8 Liability.\nThe fire code shall not be construed to hold the City of Boulder or any of its employees or agents responsible for any damage to persons or property by reason of inspection or reinspection or failure to inspect or reinspect as herein provided or by reason of the approval or disapproval of any equipment as herein provided.\nNo employee of the city who enforces, attempts to enforce, or is authorized to enforce the fire code renders him or herself or the city liable to third parties for any damage or injury to the person or property of such third parties as a result of the enforcement or nonenforcement of the fire code. The city assumes no duty of care by virtue of the adoption of the fire code. No person is justified in relying upon the approval of a plan, the results of an inspection, or the issuance of a certificate of inspection or occupancy, and such approvals, inspections, and certificates are not a guarantee that the plan or work so approved, inspected, or certificated in fact complies with all requirements of the fire code. It is the duty of the person owning, controlling, or constructing any building or structure to ensure that the work is done in accordance with the requirements of the fire code, and it is such persons and not the city who are responsible for damages caused by negligent breach of such duty.\n(4)\tSection 105.5 is repealed and reenacted to read:\n105.5 Required operational permits. The fire code official may issue an operational permit for the following operations:\n(a)\t105.5.16, Explosives\n(b)\t105.5.25 Hot Work Operations (outside)\n(c)\t105.5.29 Lithium batteries\n(d)\t105.5.36, Open Burning\n(e)\t105.5.40, Outdoor assembly events\n(f)\t105.5.44, Pyrotechnic special effects material\n(g)\t105.5.51, Temporary membrane structures and tents\n(h)\t105.5.58 Valet trash and recycling collection in Group R-2 occupancies\n(5)\tSection 105.6 is repealed and reenacted to read:\n105.6 Required construction permits. All construction permits will be issued by the building official. Community Risk Reduction will be the approving authority for the following:\n(a)\t105.6.1, Automatic fire-extinguishing systems\n(b)\t105.6.2 Automatic sprinkler systems\n(c)\t105.6.3 Compressed gases\n(d)\t105.6.5 Emergency responder communication coverage system\n(e)\t105.6.7, Fire alarm and detection systems and related equipment\n(f)\t105.6.8, Fire pumps and related equipment\n(g)\t105.6.11 Gas detection systems\n(h)\t105.6.14 High-pile combustible storage\n(i)\t105.6.16 LP-Gas\n(j)\t105.6.24, Stand-pipe systems\n(k)\t105.6.26 Access control system\n(6)\tSection 112, \"Means of Appeals,\" is repealed and reenacted to read:\n112 Appeals.\n(a)\tAny appeal under this section shall be heard by the Board of Building Appeals established under Section 2-3-4, \"Board of Building Appeals,\" B.R.C. 1981, unless the city manager determines, due to the nature of the issues in a particular appeal, to appoint a hearing officer under Section 1-3-5, \"Hearings and Determinations,\" B.R.C. 1981.\n(b)\tAppeal of refusal to approve work or building permit. A person refused a building permit or refused approval of work done under a permit on the grounds that the proposed or completed construction fails to comply with this code or any other city building code may appeal the decision on the grounds that:\n1.\tThe denial was based on an erroneous interpretation of such code by the manager; or\n2.\tThe manager has erroneously failed to approve an alternate material or method pursuant to Section 104.2.3 of the fire code prior to its installation or use. In determining such an appeal, the board or hearing officer shall apply the standards of Section 104.2.3 of the fire code.\nThe manager has the burden of proof under paragraph 1. above. The appellant has the burden of proof on appeals brought pursuant to paragraph 2. The board or hearing officer shall determine the appeal and decide whether the manager's interpretation or application of such code was correct or in error at a hearing under the procedures described by Chapter 1-3, \"Quasi-Judicial Hearings,\" B.R.C. 1981.\n(c)\tAppeal of suspension or revocation of building permit or certificates. Any person whose building permit or certificate of occupancy or certificate of completion has been suspended or revoked may appeal such action by the city manager on the ground that the suspension or revocation was based on an error in fact or an erroneous application of this code to the facts. The manager has the burden of proving the facts upon which the manager relies at such a hearing.\n(d)\tAn application for appeal must be filed in writing with the city manager within fourteen days after the date of refusal of the building permit or approval of work performed under the permit or revocation or suspension of the building permit or certificate of occupancy or certificate of completion stating the basis for appeal.\n(e)\tAppeals Concerning Existing Conditions.\n1.\tAny aggrieved person who has been issued an order or other notice of violation under this fire code, other than a summons and complaint, under Sections 102.1 and 102.2 concerning legally existing conditions in a structured based upon the city manager's determination that such conditions constitute a distinct hazard to life or property, and who believes the alleged violation to be factually or legally contrary to the requirements of this fire code or rules and regulations issued pursuant to this fire code may appeal the order or notice. An appellant shall file the appeal with the board within thirty days from the date of service of the notice of alleged violation. The appellant may request enlargement of time to file if such request is made before the end of the time period. The manager may extend for a reasonable period the time to file with the board if the applicant shows good cause therefore.\n2.\tAny person aggrieved by a decision of the manager upon a reinspection that any or all of the violations alleged in the notice of violation have not been adequately corrected may appeal such determination by filing a notice of appeal within fourteen days of the date of the reinspection.\n3.\tThe appeal will be conducted under the procedures of Chapter 1-3, \"Quasi-Judicial Hearings,\" B.R.C. 1981. The burden of proof is on the manager to establish an alleged violation.\n4.\tIf the board of appeals or hearing officer affirms the determination by the manager, it shall grant the person a reasonable period of time to correct the violation appealed. Any subsequent determination by the manager as to whether the violations alleged in the notice of violation have been adequately corrected is final.\n5.\tIf no person appeals a notice of violation under this section, the provisions of the notice become final when the time for filing an appeal with the board has expired. An order appealed to court is final unless a stay is in effect.\n6.\tIf a person to whom the manager has issued a notice of violation does not appeal under this section, such person may not raise a defense to any subsequent prosecution in municipal court for a violation of an order that the conditions alleged to be violations in the notice of violation were not in fact or law violations.\n(f)\tAn applicant for an appeal shall pay the fee prescribed by Section 4-20-52, \"Fire Code Permit and Inspection Fees,\" B.R.C. 1981. The fee for an appeal heard by a hearing officer shall be the same as the fee for an appeal heard by the Board of Building Appeals.\n(g)\tThe manager may apply to the Board of Building Appeals, without fee, for an advisory opinion concerning alternative methods, applicability of specific requirements, approval of equipment and materials, and granting of special permission as contemplated in Section 104.2.3 or 104.2.4 of the fire code.\n(h)\tThe Board of Building Appeals or hearing officer has no authority to interpret Chapter 1 (the administrative requirements) of this code except as expressly provided in this section, nor, because this code sets minimum standards, to waive any requirement of this code.\n(i)\tAn aggrieved person seeking judicial review of a decision of the Board of Building Appeals or hearing officer made under this section shall file a complaint for such review within thirty days after the date of the decision under Colorado Rule of Civil Procedure 106(a)(4).\n(j)\tIf the city manager determines that the subject of an order or notice issued under this fire code constitutes an immediate hazard to the public health, safety, or welfare, the manager may order immediate compliance. Persons subject to such orders shall comply forthwith but shall be entitled to a prompt post-compliance appeal hearing before the Board of Building Appeals or a hearing officer under the procedures specified in this section.\nSection 113.1, \"Unlawful acts,\" is repealed and reenacted to read:\n113.1 Violations.\n(a)\tGeneral Provisions:\n(1)\tNo person shall violate a provision of this code or fail to comply therewith or with any of the requirements thereof. No person shall fail to comply with any order issued by the city manager under this code. No person shall erect, construct, enlarge, alter, extend, repair, move, remove, improve, convert, demolish, equip, use, occupy, maintain, or utilize any building, structure, occupancy, premises, or system in the city or cause or permit the same to be done except in conformity with all of the provisions of this code and in conformity with the terms and conditions of approval issued under this code, or of any directive of the code official.\n(2)\tIn accordance with the provisions of Section 5-2-11, \"Prosecution of Multiple Counts for Same Act,\" B.R.C. 1981, each day during which illegal construction, alteration, maintenance, occupancy, or use continues, constitutes a separate offense remediable through the enforcement provisions of this code.\n(3)\tThe owner, tenant, and occupant of a structure or land, and the agents of each of them, are jointly and severally liable for any violation of this code with respect to such structure or land.\n(4)\tThe remedies for any violation of any provision of this code or of any permit, certificate, or other approval issued under this code or other City of Boulder code or of any directive of the fire code official may be pursued singly or in combination.\n(5)\tIf any person fails or refuses to pay when due any charge imposed under this section, the fire code official may, in addition to taking other collection remedies, certify due and unpaid charges to the Boulder County Treasurer for collection as provided by Section 2-2-12, \"City Manager May Certify Taxes, Charges, and Assessments to County Treasurer for Collection,\" B.R.C. 1981.\n(6)\tThe fire code official may charge the cost of any action taken to correct or abate a violation, as authorized by this code, plus up to fifteen percent of such cost for administration, to the property owner. If any property owner fails or refuses to pay when due any charge imposed under this section, the fire code official may, in addition to taking other collection remedies, certify due any unpaid charges, including interest, to the Boulder County Treasurer, to be levied against the person's property for collection by the county in the same manner as delinquent general taxes upon such property are collected, under the procedures described by Section 2-2-12, \"City Manager May Certify Taxes, Charges, and Assessments to County Treasurer for Collection,\" B.R.C. 1981.\n(b)\tAdministrative Procedures and Remedies:\n(1)\tIf the fire code official finds that a violation of any provision of this code or any approval granted under this code exists, the city manager, after notice and an opportunity for hearing under the procedures prescribed by Chapter 1-3, \"Quasi-Judicial Hearings,\" B.R.C. 1981, may take any one or more of the following actions to remedy the violation:\n(A)\tImpose a civil penalty according to the following schedule:\n(i)\tFor the first violation of the provision or approval, $100;\n(ii)\tFor the second violation of the same provision or approval, $300; and\n(iii)\tFor the third violation of the same provisions or approval, $1,000.\n(B)\tFor a violation concerning the use of a residential building under a rental license, revoke such license;\n(C)\tRequire the filing of a declaration of use as provided in subsection (e); or\n(D)\tIssue an order reasonably calculated to ensure compliance with the provisions of this code or any approval granted under this code.\n(2)\tPrior to the hearing, the fire code official may issue an order that no person shall perform any work on any structure or land, except to correct any violation found by the fire code official to exist with respect to such structure or land.\n(3)\tIf notice is given to the fire code official at least forty-eight hours before the time and date set forth in the notice of hearing on any violation that the violation has been corrected, the fire code official will reinspect the structure or land. If the fire code official finds that the violation has been corrected, the manager may cancel the hearing.\n(4)\tNo person shall fail to comply with any action taken by the fire code official under this section.\n(c)\tCriminal Penalties. Violations of this code are punishable as provided in Section 5-2-4, \"General Penalties,\" B.R.C. 1981.\n(d)\tOther Remedies. The city attorney may maintain an action for damages, declaratory relief, specific performance, injunction, or any other appropriate relief in the District Court in and for the County of Boulder for any violation of any provision of this code or any approval granted under this code.\n(e)\tDeclaration of Use. If the fire code official determines that a person is using a structure in a way that might mislead a reasonable person to believe that such use is a use by right or otherwise authorized by this title, the fire code official may require such person to sign under oath a declaration of use that defines the limited nature of the use and to record such declaration in the office of the Boulder County Clerk and Recorder against the title to the land. In addition to all other remedies and actions that the code official is authorized to use under the Boulder Revised Code or other applicable federal, state, or local laws to enforce the provisions of this code, the city manager is authorized to withhold any approval affecting such structure or land, including, without limitation, a building permit, use review, site review, subdivision, floodplain development permit, or wetland permit, until such time as the person submits a declaration of use that is in a form acceptable to the fire code official.\nSection 113.3.3, \"Prosecution of violations,\" is repealed.\nSection 113.4.1, \"Abatement of violation,\" is repealed and reenacted to read:\n113.4.1 Abatement of violation. In addition to the imposition of the penalties described in Section 113.1, Violations, the fire code official is authorized to institute appropriate action to prevent unlawful construction or to restrain, correct, or abate a violation; or to prevent illegal occupancy of a structure or premises; or to stop an illegal act, conduct of business, or occupancy of a structure on or about any premises.\n(10)\tChapter 2, \"Definitions,\" is amended by the addition of the following additional definitions. For any definition that already exists, it is repealed and reenacted with the definition listed here:\nAccessible Private Drive means a twenty-foot unobstructed clear width with a twelve-foot hard, all-weather, drivable surface which can support forty tons on ten wheels and has an SU-30 turning radius for the fire department's fire apparatus.\nCeremonial Fire means a fire that is used as an indispensable part of a religious ceremony or ritual. The fire must be attended by a qualified individual recognized by the organization and conducted in a ceremonial fire oven or ceremonial fire pit.\nCeremonial Fire Chantico is a structure enclosed on three sides by brick, cinderblock, stone, or other non-combustible construction. The oven is covered on the top with non-combustible construction and contains a chimney at least two feet in height that has a spark arrestor conforming to nationally recognized standards.\nCeremonial Fire Pit is a three-foot-deep pit that does not exceed ten feet in diameter with a twenty-four-inch horseshoe shaped berm void of vegetation. A five-foot buffer zone surrounds the berm and is clear of vegetation and/or other combustibles.\nEmergency Vehicle Access Street means a street meeting the requirements of this code and the City of Boulder Design and Construction Standards.\nFire Access Distance means the distance between two hydrants, or the distance from a hydrant to any external portion of any building or buildings, or the distance from the centerline of a non-dead-end emergency vehicle access street to the point on the curb on such street from which access to such building is gained, measured along public or private (but accessible to fire equipment) roadways or fire lanes, as would be traveled by motorized firefighting equipment.\nFire code official means the city manager or the manager's delegate.\nFire Department or Municipal Fire Department means the Fire Department of the City of Boulder, Colorado.\nOpen Burning is the burning of materials where visible products of combustion are emitted directly into the ambient air without passing through a chimney from a fireplace built in compliance with the City of Boulder Building Code.\nPortable Appliance means any appliance that is designed to be moved or relocated on a daily basis without any special knowledge. This includes, but is not limited to, box or oscillating fans, power tools, vacuum cleaners, and floor polishers.\n(11)\t304.1.1 Valet trash is repealed and reenacted to read:\nValet trash collection shall be permitted only where approved. The owner and valet trash collection service provider shall comply with Appendix O as adopted and amended.\n(12)\t304.1.1.1 Permits Required is added to read:\nPermits required. An operational permit shall be obtained from the fire code official in accordance with Section 105.5.58 prior to contracting and using valet trash services. Operational permit will be issued to the owner or the owner's designated representative for the property where the services will be used.\n(13)\t307, \"Open burning, recreational fires, and portable outdoor fireplaces,\" is repealed and reenacted to read:\n307 Open burning and recreational fires.\n(1)\tNo person shall kindle or maintain outside of a habitable building or outside of an exterior fireplace built in accordance with the City of Boulder Building Code any bonfire or burn or permit to be burned any trash, paper, rubbish, wastepaper, wood, weeds, brush, plants, or other combustible or flammable material anywhere within the city limits or anywhere on city property outside of the city limits, except when:\n(a)\tThe burning is in the course of an agricultural operation in the growing of crops as a gainful occupation and presents no fire hazard to other property in the vicinity;\n(b)\tThe burning is a smokeless flare, or a safety flare used to indicate some danger to the public;\n(c)\tThe burning is a training fire conducted by the fire department, or is a training fire conducted by another fire department, or privately for industrial or commercial fire training purposes; or\n(d)\tThe burning is solely for the purpose of fuel mitigation to alleviate wildland fire potential or weed abatement to assist restoration of native plants.\n(e)\tThe burning is part of a \"ceremonial fire\" where all the following are met:\n1.\tA permit must be obtained from Boulder Fire Rescue Department;\n2.\tFire must be contained in a ceremonial fire pit or a ceremonial chantico;\n3.\tA water source with a garden hose attached and charged must be readily available and can reach all parts of the ceremonial fire;\n4.\tCeremonial fire must be extinguished if winds exceed 15 mph; and\n5.\tCeremonial fire must adhere to all state and county requirements for air quality and burn restrictions.\n(2)\tMobile or portable type outdoor fireplaces are prohibited to use within the city limits or anywhere on city property outside of the city limits.\n(14)\tSection 308.1.7 \"Sky lanterns\" is repealed and reenacted to read:\n308.1.7 Sky lanterns. No person shall use any sky lantern(s) within the City of Boulder, or anywhere on city-owned property outside of city limits, including Open Space and Mountain Parks land.\n(15)\t322.4 Battery charging areas: is amended by the addition of the following:\n9.\tThe indoor room or area shall be protected with an automatic fire sprinkler system designed as an ordinary group II hazard and a maximum sprinkler area coverage of 100 square feet.\n(16)\tA new Section 401.9, \"Fire alarm fees,\" is added to read:\n401.9 Fire alarm fees.\n(a)\tAfter the fire department has responded to two nuisance alarms from the fire alarm system from any property or address in any calendar year, the city manager may impose a charge for each additional response to an alarm which originates from the property during the same calendar year, in accordance with the schedule prescribed by Section 4-20-52, \"Fire Code Permit and Inspection Fees,\" B.R.C. 1981.\n(b)\tThe city manager may waive a charge imposed for a nuisance fire alarm response if the property owner of record demonstrates that such alarm was caused by a fire or the threat of a fire, or that such alarm was not under the property owner's control. It shall not be a defense that the alarm system is malfunctioning, unless the owner or manager is able to demonstrate that said alarm system is currently being serviced to remedy the problems being encountered.\n(c)\tIf any fee is not paid within thirty days after demand therefor has been mailed to the record owner of the building, the city manager may certify the amount due to the County Treasurer pursuant to Section 2-2-12, \"City Manager May Certify Taxes, Charges, and Assessments to County Treasurer for Collection,\" B.R.C. 1981.\n(17)\tSection 503.2.1, \"Dimensions,\" is repealed and reenacted to read:\n503.2.1 Dimensions. Fire apparatus access roads shall have an unobstructed width of not less than twenty feet (6,096 mm), except for approved security gates in accordance with Section 503.6, and an unobstructed vertical clearance of not less than fifteen feet (4,572 mm).\n(18)\tSection 507.5.1, \"Where required,\" is repealed and reenacted to read:\n507.5.1 Where required. Location and spacing of fire hydrants will be in accordance with the City of Boulder Design and Construction Standards.\n(19)\tSection 510.4.1.1 is repealed and reenacted to read:\n510.4.1.1 Minimum signal strength into the building.\nThe minimum downlink signal strength shall be sufficient to provide usable voice communications throughout the coverage area as specified by the fire code official. The downlink signal level shall be a minimum of -95 dBm throughout the coverage area and sufficient to provide not less than a Delivered Audio Quality (DAQ) of 3.0 throughout the coverage area using either narrow band analog, digital or wideband LTE signals or an equivalent bit error rate (BER), or signal-to-interference-plus-noise ratio (SINR) applicable to the technology for either analog or digital signals.\n(20)\tSection 510.4.1.2 is repealed and reenacted to read:\n510.4.1.2 Minimum signal strength out of the building. A minimum signal strength of -95 dBm shall be received by the agency's radio system.\n(21)\tSection 901.6, \"Inspection, testing and maintenance,\" is amended by the addition of the following:\nIf any building, structure, or portion of the same is protected by a fire detection, alarm, and extinguishing system, or the owner has agreed with the city manager so to protect the building or structure or portion thereof, then no person shall shut off or disable such system except as authorized under Section 11-1-45, \"Water to Be Shut Off for Failure to Pay,\" B.R.C. 1981, and no owner, manager, or tenant of such space shall fail to prevent the shutting off or disabling of such system. It is a specific defense to a charge of violation of this section that the system was shut off in order to perform maintenance work on the system, that it was shut off for the minimum period of time necessary to perform such work, and that maintenance personnel were on the premises performing such work during the entire time the system was shut off. The minimum penalty for violation of this section, no portion of which may be suspended, is a fine of $1,000.\n(22)\tSection 903 is amended by the addition of the following:\nAny new building or change of occupancy of an existing building that does not have approved fire department access as required by the fire code may be required by the fire code official to have an automatic fire sprinkler system installed regardless of the building size.\n(23)\tSection 903.1 is repealed and reenacted to read:\n903.1 General. An automatic sprinkler system shall be installed in the occupancies and locations as set forth in this section.\n(24)\tThe first sentence of Section 903.2 is repealed and reenacted to read:\nApproved automatic sprinkler system in new buildings and structures shall be provided in the locations described in Sections 903.2.1 through 903.2.15.\n(25)\tSection 903.2.1 is amended by the addition of the following:\n903.2.1 Group A. All basements classified as, or a part of, a Group A occupancy shall be provided with an automatic sprinkler system regardless of the gross square footage.\n(a)\tSection 903.2.1.1 Group A-1, #1 is repealed and reenacted to read:\n1.\tThe fire area exceeds 2,000 square feet (185.8 m2 )\n(b)\tSection 903.2.1.2 Group A-2, #1 is repealed and reenacted to read:\n1.\tThe fire area exceeds 2,000 square feet (185.8 m2)\n(c)\tSection 903.2.1.3 Group A-3, #1 is repealed and reenacted to read:\n1.\tThe fire area exceeds 2,000 square feet (185.8 m2)\n(d)\tSection 903.2.1.4 Group A-4, #1 is repealed and reenacted to read:\n1.\tThe fire area exceeds 2,000 square feet (185.8 m2)\n(26)\tSection 903.2.2, Group B is repealed and reenacted to read:\nAn automatic sprinkler system shall be provided for all new Group B occupancies greater than 2,000 square feet (185.8m2 ) and as required by Sections 903.2.2.1 and 903.2.2.2.\n(27)\tSection 903.2.3, Group E is repealed and reenacted to read:\nAn automatic sprinkler system shall be provided for Group E occupancies as follows:\n(a)\tThroughout all Group E fire areas greater than 2,000 square feet (185.8 m2 ) in area.\n(b)\tThe Group E fire area is located on a floor other than a level of exit discharge serving such occupancies.\n(c)\tThe Group E fire area has an occupant load of 300 or more.\n(d)\tAll basements classified as, or a part of, a Group E occupancy shall be provided with an automatic sprinkler system regardless of the gross square footage.\n(28)\tSection 903.2.4, Group F-1, #1 is repealed and reenacted to read:\n1.\tA group F-1 fire area exceeds 2,000 square feet (185.5 m2 )(29)\n(29)\t903.2.4.1, Woodworking operations, is repealed and reenacted to read:\nAn automatic sprinkler system shall be provided throughout all Group F-1 occupancy fire areas that contain woodworking operations in excess of 2,000 square feet (185.8 m2 ) in area that generate finely divided combustible waste or use finely divided combustible materials.\n(30)\t903.2.4.3, Group F-1 upholstered furniture or mattresses, is repealed and reenacted to read:\nAn automatic sprinkler system shall be provided throughout a Group F-1 fire area that exceeds 2,000 square feet (185.8 m2 ) used for the manufacture of upholstered furniture or mattresses.\n(31)\tSection 903.2.7, Group M, is repealed and reenacted to read:\nAn automatic sprinkler system shall be provided throughout buildings containing a Group M occupancy where one of the following conditions exists:\n1.\tA Group M fire area exceeds 2,000 square feet (185.8 m2 ).\n2.\tA Group M fire area is located more than three stories above grade plane.\n3.\tThe combined area of all Group M fire areas on all floors, including any mezzanines, exceeds 2,000 square feet (185.8 m2 ).\n(32)\t903.2.7.2 Group M upholstered furniture or mattresses is repealed and reenacted to read:\nAn automatic sprinkler system shall be provided throughout a Group M fire area where the area used for the display and sale of upholstered furniture or mattresses exceeds 2,000 square feet (185.8 m2 ).\n(33)\tSection 903.2.8, Group R, is amended by the addition of the following:\n(a)\tDetached one- and two-family dwellings and multiple single-family dwellings (townhomes) not more than three stories above grade plane in height with a separate means of egress and their accessory structure shall comply with the fire sprinkler system requirements of the City of Boulder Residential Building Code.\n(b)\tAn automatic sprinkler system installed in accordance with Section 903.3 shall be provided throughout all buildings with a Group R fire areas.\n(34)\tSection 903.2.9, Group S-1, is repealed and reenacted to read:\nAn automatic sprinkler system shall be provided throughout all buildings containing a Group S-1 occupancy where one of the following conditions exists:\n1.\tA Group S-1 fire area exceeds 2,000 square feet (185.8 m2 ).\n2.\tA Group S-1 fire area is located more than three stories above grade plane.\n3.\tThe combined area of all Group S-1 fire areas on all floors, including any mezzanines, exceeds 2,000 square feet (185.8 m2 ).\n4.\tA Group S-1 fire area used for the storage of commercial motor vehicles where the fire area exceeds 2,000 square feet (185.8 m2 ).\n5.\tA Group S-1 fire area used for the storage of lithium-ion or lithium metal batteries or any equipment containing lithium-ion or lithium metal batteries including vehicles, micro-mobility devise and energy storage systems.\n(35)\tSection 903.2.9.1, Repair garages, is repealed and reenacted to read:\nAn automatic sprinkler system shall be provided throughout all buildings used as repair garages in accordance with Section 406.8 of the International Building Code, as shown:\n1.\tBuildings having two or more stories above grade plane, including basement, with fire area containing a repair garage exceeding 2,000 square feet (185.8 m2 ).\n2.\tBuildings not more than one story above grade plane, with a fire area containing a repair garage exceeding 2,000 square feet (185.8 m2 ).\n3.\tBuildings with repair garages servicing vehicles parked in basements.\n4.\tA Group S-1 fire used for the repair of commercial motor vehicles where the fire area exceeds 2,000 square feet (185.8 m2 ).\n5.\tA Group S-1 fire area used for the storage of lithium-ion or lithium metal powered vehicles.\n(36)\tSection 903.2.9.4, Group S-1 upholstered furniture and mattresses, is repealed and reenacted to read.\nAn automatic sprinkler system shall be provided throughout a Group S-1 fire area where the area used for the storage of upholstered furniture or mattresses exceeds 2,000 square feet (185.8 m2 ).\nException: New self-service storage facilities not greater than on story above grade plane and separated by a fire barrier per the International Building Code every 2,000 square feet (185.8 m2 ).\n(37)\tSection 903.2.10, Group S-2 Parking Garages, is repealed and reenacted to read:\nAn automatic sprinkler system shall be provided throughout buildings classified as parking garages where any of the following conditions exist:\n1.\tWhere the fire area of the enclosed parking garage, in accordance with section 406.6 of the International Building Code, exceeds 2,000 square feet (185.8 m2 ).\n2.\tWhere the enclosed parking garage, in accordance with Section 406.6 of the International Building Code, is located beneath other groups.\nException: Enclosed parking garages located beneath Group R-3 occupancies.\n3.\tWhere the fire area of the open parking garage, in accordance with Section 406.5 of the International Building Code, exceeds 2,000 square feet (185.8 m2 ).\n(38)\tSection 903.2.10.1, Commercial parking garages, is repealed and reenacted to read:\nAn automatic sprinkler system shall be provided throughout buildings used for storage of commercial motor vehicles where the fire area exceeds 2,000 square feet (185.8 m2 ).\n(39)\tA new Section 903.2.13, \"Group U occupancies,\" is added to read:\n903.2.13 Group U occupancies. An automatic sprinkler system shall be provided throughout all new Group U occupancies greater than 2,000 gross square feet (185.8 m2 ).\n(40)\tA new Section 903.2.14 is added to read:\n903.2.14. Any occupancy, structure, or unit required to be protected by a sprinkler system by one provision of the fire code or the building code and falling within an exception to a requirement of such protection to any other provision of the fire code or building code, shall be so protected.\n(41)\tA new Section 903.2.15 is added to read:\n903.2.15. If the floor area of an addition to any existing occupancy as described in Sections 903.1 through 903.2.13 above is greater than either fifty percent of the existing gross floor area or 2,000 square feet, and the total altered structure would be required to be protected by a sprinkler system by this section if it were new construction, then the entire addition shall be protected throughout by an approved and supervised automatic sprinkler system, installed in accordance with Section 903.3.1. Said sprinkler system shall be continuous throughout the addition up to a fire barrier built in accordance with the building code for that occupancy.\n(42)\tSection 903.3.1.1.1 Exception 3 is repealed.\n(43)\tSection 903.3.1.2.3, Attics, #4 - Subsections 4.2 and 4.5 are repealed.\n(44)\tSection 903.3.5.2, Residential combination services, is repealed and reenacted to read:\n903.3.5.2 Residential combination services. Combination of domestic and fire service lines shall be in accordance with the City of Boulder Design and Construction Standard.\n(45)\tSection 903.4.2, \"Monitoring,\" is repealed and reenacted to read:\n903.4.2 Monitoring. Alarm, supervisory and trouble signals shall be distinctly different and shall be automatically transmitted to an Underwriters Laboratory listed supervising station.\n(46)\tSection 903.4.3, \"Alarms,\" is repealed and reenacted to read:\n903.4.3 Alarms. Approved audible and visual devices shall be connected to every new automatic sprinkler system. Such sprinkler water-flow alarm devices shall be activated by water flow equivalent to the flow of a single sprinkler of the smallest orifice size installed in the system. Alarm devices shall be provided throughout the interior of the building in accordance with NFPA 72 and at least one on the exterior of the building in an approved location. Where a fire alarm system is installed, actuation of the automatic sprinkler shall actuate the building fire alarm system.\nException: Automatic sprinkler systems protecting one-and two-family dwellings.\n(47)\tA new Section 903.7, \"Response time sprinkler requirement,\" is adopted to read:\n903.7 Response time sprinkler requirement.\n(a)\tIt is the city's goal, as reflected in the Boulder Valley Comprehensive Plan's urban fire service criteria, that land not be annexed unless the response travel time for service is normally four minutes or less. Nonetheless, there may be occasions when annexation outside the existing four-minute travel time but within six minutes or less is allowed due to special circumstances, in the city's best interest. Before such land is annexed, consideration must be given to the need for and provision of additional fire stations and equipment to serve properly the area being annexed and to bring it within the four-minute travel time eventually. Protection by a sprinkler system as required by subsection (c) below is a temporary substitute and is not intended to eliminate the requirement for additional fire stations and equipment.\n(b)\tLand used or to be used for residential purposes will not normally be annexed if it is outside the four-minute travel time unless excepted from this policy by subsection (d) below. All new dwelling units on land annexed outside the four-minute travel time shall be protected by an automatic fire sprinkler system.\n(c)\tOn land annexed after the effective date of this chapter and not excepted under subsection (d) below, all new nonresidential construction and any existing nonresidential structures shall be provided throughout with an approved and supervised fire sprinkler system installed in accordance with Section 903.3.1 adopted in Chapter 10-8, \"Fire Code,\" B.R.C. 1981, if such land is outside of the four-minute travel time from city fire stations housing at least one pumper which is rated at one thousand gallons per minute pumping capacity or greater, and which requires a crew of three or more for proper operation.\n(d)\tThe requirements of this Section may be waived by the city council by a provision doing so in an annexation agreement incorporated into an annexation ordinance if, in the opinion of the city council, it is in the city's best interest to do so because:\n(1)\tOf changed or special conditions;\n(2)\tThe land to be annexed is located on Arapahoe Avenue west of the city; or\n(3)\tThe land to be annexed is below the blue line, west of Broadway, south of Norwood Avenue, and north of Table Mesa Drive.\nExceptions (2) and (3) above reflect the fact that it is not anticipated that new fire stations will be constructed to bring these areas within the six-minute limit. In other areas, it is anticipated that new fire stations will eventually be constructed or upgraded to bring the service area within this limit.\n(48)\tA new Section 903.8, Fire suppression systems, is added to read:\n903.8 Fire suppression systems. All existing structures in the following categories shall be protected throughout by an approved and supervised automatic sprinkler system installed in accordance with the provisions of Section 903.3.1. Except that any structure or portion thereof required by this section to be so protected prior to the effective date of Ordinance No. 7566, shall be immediately so protected:\n(a)\tR-1 and R-2 occupancies greater than fifty-five feet high.\n(b)\tHotels and motels. Exceptions: One- and two-story structures, and three-story structures with an exterior exit balcony for all rooms above grade.\n(c)\tCongregate residences classified as Group R-4.\n(d)\tGroup I-1 and I-2 occupancies as defined in the fire code.\n(e)\tBasements greater than 2,000 gross square feet.\nException 1. Basements below R occupancies.\nException 2. Basements used exclusively for \"services to the building,\" such as electric meters, compressors, and so forth. But \"services to the building\" shall not include any storage (either combustible or noncombustible), nor routine human occupancy.\nException 3. Basements where there is provided at least 20 square feet of opening entirely above the adjoining ground level in each fifty lineal feet or fraction thereof of exterior wall in the basement on at least one side of the building. Openings shall have a minimum dimension of not less than 30 inches and shall be accessible to the fire department from the exterior and shall not be obstructed in a manner that firefighting or rescue cannot be accomplished from the exterior.\nWhen openings are provided on only one side and the opposite wall of said basement is more than seventy-five feet from such openings, said basement shall be provided with an approved automatic sprinkler system, or openings as specified above shall be provided on at least two sides of an exterior wall of the basement.\n(f)\tAll Group A occupancies used primarily for dining, drinking, or motion picture viewing shall be protected throughout by an approved and supervised automatic sprinkler system installed in accordance with the provisions of Section 903.3.1 when said Group A occupancy is greater than 2,000 gross square feet in size.\nFor Group A occupancies described in this part (f) not currently provided with complete automatic sprinkler protection, this paragraph shall take effect during a remodel or renovation which 1) requires one or more building permits with a combined valuation (labor and materials) of $30 per square foot or more within any calendar year, and 2) necessitates business closure for a combined period of five calendar days or more, in the aforementioned calendar year.\n(49)\tSection 907.6.6, Monitoring, is repealed and reenacted to read:\n907.6.6 Monitoring. Fire alarm systems shall be supervised by an Underwriters Laboratory listed supervising station or a Proprietary Supervising Station Alarm System meeting all of the requirements in NFPA 72, The National Fire Alarm and Signaling Code.\nException: Monitoring by a supervising station is not required for:\n(1)\tSingle and multiple-station smoke alarms required by Section 907.2.11.\n(2)\tAutomatic sprinklers systems in one- and two-family dwellings.\n(50)\tSection 1103.5, Sprinkler systems, is repealed and reenacted to read:\n1103.5 Sprinkler systems. The automatic sprinkler system requirements set forth in Sections 903.1 and 903.2 of this code shall be complied with in existing buildings where the occupancy or use, as defined in Chapter 2 of the Existing Building Code of the City of Boulder, changes in a fire area exceeding 2,000 square feet.\nException: Changes of occupancy or use which are a lower relative hazard per Table 1011.5 of the City of Boulder Existing Building Code and the new occupancy or use is not required to be provided with an automatic sprinkler system by other provisions of the City of Boulder Building Code or the City of Boulder Existing Building Code.\n(51)\tA new section 1108, Battery Storage, is added to read:\nBattery storage. Existing battery storage areas containing lithium-ion and lithium metal batteries shall comply with Section 320.\n(52)\tA new Section 1109, Micro Mobility Devices, is added to read:\nMicro Mobility Devices. Existing lithium-ion and lithium metal battery powered micro mobility devices shall be operated and maintained in accordance with Section 322.\n(53)\tSection 1205.2.1.1, Pathways to ridge, is repealed and reenacted to read:\n1205.2.1.1, Pathways to ridge. No fewer than two 30-inch-wide (914 mm) pathways on separate roof planes, from the lowest roof edge to ridge, shall be provided on all buildings. At least one pathway shall be provided on the street or driveway side of the roof. For each roof plane with a photovoltaic array, at least one 30-inch-wide (914 mm) pathway from lowest roof edge to ridge shall be provided on the same roof plane as the photovoltaic array, on an adjacent roof plane or straddling the same and adjacent roof plane.\nAll access pathways required under this section shall be provided in a structurally strong location on the building capable of supporting the live load of fire fighters accessing the roof.\n(54)\tSection 1205.2.1.2, Setbacks at ridge, is repealed and reenacted to read:\n1205.2.1.2, Setbacks at ridge. Not less than a 12-inch-wide setback is provided on each side of the horizontal ridge.\n(55)\tSection 1205.2.1.3, Alternative setbacks at ridge, is repealed.\n(56)\tSection 5307.1, General, is repealed and reenacted to read:\nGeneral. Compressed gases in storage or use not regulated by this material-specific provisions of Chapters 6, 54, 55 and 60 through 67, including asphyxiant, irritant and radioactive gasses, shall comply with this section in addition to other requirements of this chapter. The provisions of this chapter shall apply to new or existing systems.\n(57)\tSection 5307.3, Insulated liquid carbon dioxide systems used in beverage dispensing applications, is repealed and reenacted to read:\n5307.3 Liquid carbon dioxide systems used in beverage dispensing applications. Liquid carbon dioxide systems used in beverage dispensing applications. Liquid carbon dioxide systems with more than 100 pounds (45.4 kg) of carbon dioxide used in beverage dispensing applications shall comply with Section 5307.3.1.\n(58)\tSection 5601.2.4.2, \"Fireworks display,\" is amended by the addition of the following:\nThe city manager shall require a certificate of insurance to protect persons and property from death or injury as a result of the fireworks display, in an amount not less than $1,000,000 general liability per occurrence and $2,000,000 aggregate limit. The insurance shall cover any liability of the city, or any employee or agent thereof arising out of or connected with the permit and the fireworks display permitted thereunder. Before any permit for a fireworks display is issued, the applicant shall comply with the provisions of this section.\n(59)\tChapter 80, Referenced Standards, is amended by the addition of the following:\n8001 NFPA Standards. In every case where this code references a standard published by the National Fire Protection Association (NFPA), the most current edition of the referenced standard is hereby adopted. The most current edition of the referenced NFPA standard shall become effective on January 1st following the publication and release of the standard.\n(60)\tAppendix O is adopted and amended with the addition of the following sections:\nO102.4, Capacity limit, is amended by the addition of the following:\nO102.4.1 Quantities more than the capacity limit. Trash and recyclables not able to fit within the approved container with a closed lid, shall not be left within the corridor.\nA new section, O102.6 Container lids, is added:\nAll valet trash and recycling container lids shall be self-closing.\nO104, Additional Requirements, is amended by the addition of the following:\nO104.4. Automatic sprinkler systems. An automatic sprinkler system shall be installed in accordance with Chapter 9.\nO104.5. Door closing. Each dwelling unit shall have an operable self-closing door from the living space to the corridor. Doors shall close from a fully open position and latch automatically.\nO104.6. Emergency planning and preparedness. Each complex shall create an emergency guide describing the location, function, and use of fire protection equipment and appliance available for use by residents, including fire alarm systems, smoke alarms, and portable fire extinguishers. Guides shall include fire evacuation plans in accordance with Section 404.2.1 and fire safety plans in accordance with Section 404.2.2 for each dwelling and distributed to each resident.\nOrdinance Nos. 5562 (1993); 5622 (1994); 5781 (1996); 6015 (1998); 7371 (2004); 7566 (2007); 7577 (2007); 7925 (2013); 7963 (2014); 8242 (2018); 8366 (2020); 8684 (2025)"
  },
  {
    "corpus": "BRC",
    "title": "10",
    "title_name": "Structures",
    "chapter": "8",
    "chapter_name": "Fire Code",
    "anchor": "10-8-3",
    "heading": "Violations.",
    "verbatim": "10-8-3. Violations.\nRepealed.\nOrdinance Nos. 7566 (2007); 7925 (2013); 8366 (2020)"
  },
  {
    "corpus": "BRC",
    "title": "10",
    "title_name": "Structures",
    "chapter": "9",
    "chapter_name": "Mechanical Code",
    "anchor": "10-9-1",
    "heading": "Legislative Intent.",
    "verbatim": "10-9-1. Legislative Intent.\nThe purpose of this chapter is to protect the public health and safety by regulating the installation, alteration, and repair of heating, ventilating, cooling, and refrigeration devices in structures in the city. The city council hereby adopts the 2024 edition of the International Mechanical Code with certain amendments and deletions thereto found to be in the best interests of the residents of the city.\nOrdinance Nos. 4984 (1986); 5177 (1989); 5493 (1992); 5781 (1996); 7566 (2007); 7925 (2013); 8366 (2020); 8684 (2025)"
  },
  {
    "corpus": "BRC",
    "title": "10",
    "title_name": "Structures",
    "chapter": "9",
    "chapter_name": "Mechanical Code",
    "anchor": "10-9-2",
    "heading": "Adoption of the International Mechanical Code With Modifications.",
    "verbatim": "10-9-2. Adoption of the International Mechanical Code With Modifications.\n(a)\tThe 2024 edition of the International Mechanical Code, including Appendix A thereto, of the International Code Council, is hereby adopted by reference as the Mechanical Code of the City of Boulder or mechanical code and has the same force and effect as though fully set forth in this chapter, except as specifically amended by the provisions of this chapter.\n(b)\tExcept as specified below, Chapter 1 is repealed. This code shall be administered in accordance with Chapter 1, \"Administration,\" of the International Building Code as adopted, with amendments, by Section 10-5-2, \"Adoption Of International Building Code With Modifications,\" B.R.C. 1981.\n(1)\tSection 101.2, \"Scope,\" is adopted as an administrative provision.\n(2)\tSection 101.2.1, \"Appendices,\" is adopted as an administrative provision. Appendix A is adopted as a part of this code.\n(3)\tSection 101.3, \"Purpose,\" is adopted as an administrative provision.\n(c)\tSection 301.10, \"Electrical,\" is repealed and reenacted to read:\n301.10 Electrical. Electrical wiring, controls, and connections to equipment and appliances regulated by this code shall be in accordance with Chapter 10-6, \"Electrical Code,\" B.R.C. 1981.\n(d)\tA new Section 306.6, \"Rooftop equipment support and clearances,\" is added:\n306.6 Rooftop equipment support and clearances.\n(1)\tMechanical equipment placed, replaced, or resting over roofing shall be supported by curbs or legs which shall be flashed to the roofing and made watertight. Mechanical equipment shall include, but not be limited to, heating equipment, cooling and refrigeration equipment, ventilating fans, blowers, and other similar devices located on the roof.\n(2)\tFlat roofs. On roofs having a pitch of less than 2 in 12, mechanical equipment shall be supported on a solid curb greater in size than the equipment which it serves. Curbs can be manufactured or built-in-place. If built-in-place, the curb shall be covered with metal of at least 26 gauge. All seams and miter corners of the metal shall be riveted and soldered so as to be weather-tight. The curb shall be a minimum of 9 inches above the finished roof.\n(A)\tDucts less than four feet in width shall have at least twelve inches clearance from the finished roof surface to the bottom of the duct.\n(B)\tDucts between four feet and eight feet in width shall have at least twenty-four inches clearance from the finished roof surface to the bottom of the duct.\n(C)\tDucts over eight feet in width shall have at least thirty-six inches clearance from the finished roof surface to the bottom of the duct.\n(3)\tPitched Roofs. On roofs having a slope over a 2 and 12, mechanical equipment may be set on legs which provide a minimum of 11 inches clearance between the finished roof surface and the equipment frame.\nSmoke detectors must be capable of being tested from a remote and readily accessible location.\nOrdinance Nos. 4984 (1986); 5177 (1989); 5493 (1992); 5781 (1996); 7566 (2007); 7925 (2013); 8366 (2020); 8684 (2025)"
  },
  {
    "corpus": "BRC",
    "title": "10",
    "title_name": "Structures",
    "chapter": "9",
    "chapter_name": "Mechanical Code",
    "anchor": "10-9-3",
    "heading": "Mechanical Permit Fees.",
    "verbatim": "10-9-3. Mechanical Permit Fees.\nMechanical permit fees are those prescribed by Subsection 4-20-13(c), B.R.C. 1981.\nOrdinance Nos. 4984 (1986); 5493 (1992); 5781 (1996); 7566 (2007); 7925 (2013)"
  },
  {
    "corpus": "BRC",
    "title": "10",
    "title_name": "Structures",
    "chapter": "10",
    "chapter_name": "Plumbing Code",
    "anchor": "10-10-1",
    "heading": "Legislative Intent.",
    "verbatim": "10-10-1. Legislative Intent.\nThe purpose of this chapter is to protect the public health and safety by regulating the installation, alteration, and repair of plumbing devices in structures in the city. The city council hereby adopts the 2024 edition of the International Plumbing Code with certain amendments and deletions thereto found to be in the best interests of the residents of the city.\nOrdinance Nos. 4984 (1986); 5177 (1989); 5493 (1992); 5781 (1996); 7566 (2007); 7925 (2013); 8366 (2020); 8684 (2025)"
  },
  {
    "corpus": "BRC",
    "title": "10",
    "title_name": "Structures",
    "chapter": "10",
    "chapter_name": "Plumbing Code",
    "anchor": "10-10-2",
    "heading": "Adoption of the International Plumbing Code With Modifications.",
    "verbatim": "10-10-2. Adoption of the International Plumbing Code With Modifications.\n(a)\tThe 2024 edition of the International Plumbing Code, published by the International Code Council, including Appendix E, \"Sizing of Water Piping System,\" is hereby adopted by reference as the City of Boulder Plumbing Code or plumbing code, and has the same force and effect as though fully set forth in this chapter, except as specifically amended by the provisions of this chapter.\n(b)\tExcept for Sections 101, 102, and 107, Chapter 1 is repealed. This code shall be administered in accordance with Chapter 1, \"Administration,\" of the International Building Code as adopted, with amendments, by Section 10-5-2, \"Adoption of International Building Code With Modifications,\" B.R.C. 1981.\n(c)\tSection 101.1, \"Title,\" is repealed and reenacted to read:\n101.1 Title. These regulations shall be known as the Plumbing Code for the City of Boulder or plumbing code and will be referenced herein as \"this code.\"\n(d)\tThe Exception to Section 301.3, \"Connections to drainage system,\" is deleted in its entirety.\n(e)\tSection 312.5, \"Water supply system test,\" is amended by deleting the words \"for piping systems other than plastic\" and by modifying the test pressure required from 50 psi (344 kPa) to 100 psi (688 kPa).\n(f)\tSection 403.2 Separate Facilities is amended to add the following Exception 5.\n5.\tSeparate facilities are not required when multiple fixture all gender facilities are provided. Multiple fixture all gender facilities are not required; they are an alternative to be determined by the property owner or the owners' agent.\n(g)\tSection 403.4 \"Signage\" is repealed and reenacted to read:\n403.4 Signage. Required public facilities shall be provided with signs that designate which genders the facility accommodates as required by Section 2902.2. Signs shall be readily visible and located near the entrance to each toilet facility. Signs for accessible toilet facilities shall comply with Section 1111.\nException: Toilet facilities with only one water closet shall not be identified for exclusive use by any gender and shall be deemed to meet the requirements of this section. Signage shall be provided in accordance with the requirements of the City of Boulder Building Code.\n(h)\tSection 403.4.1 Directional signage. Directional signage indicating the route to the required public toilet facilities shall be posted in a lobby, corridor, aisle or similar space, such that the sign can be readily seen from the main entrance to the building or tenant space.\n(i)\tSection 403.4.2 All gender signage. Single-user toilet facilities provided in accordance with Section 403.1.2, and family or assisted-use toilet facilities provided in accordance with Section 403.2.1, shall be provided with signs which clearly indicate the facilities are available for use by all genders.\n(j)\tSection 403.4.2.1 Existing single-user toilet facilities. After December 31, 2020, all existing single-user toilet facilities and family or assisted-use toilet facilities, shall be provided with signage in accordance with Section 403.4.2.\n(k)\tTABLE 404.4 Maximum Flow Rates and Consumption for Plumbing Fixtures and Fixture Fittings,\" is repealed and reenacted to read:\nTABLE 404.4\nMAXIMUM FLOW RATES AND CONSUMPTION FOR PLUMBING FIXTURES AND FIXTURE FITTINGS\nFor SI: 1 gallon = 3.785L, 1 gallon per minute = 3.785 L/m, \n1 pound per square inch = 6.895 kPa.\na.\tA handheld shower spray is a shower head.\nb.\tConsumption tolerances shall be determined from referenced standards.\n(l)\tSection 605.3 is amended by adding a new paragraph to read:\nWater service line pipe between the water meter and building shall be Type K copper if it is in the public right-of-way, a public utility easement, or on other public property.\n(m)\tSection 610, \"Disinfection of potable water system,\" is repealed.\n(n)\tSection 712.4.2, \"Capacity,\" is amended by the addition of a new sentence to read:\nSewage pumps and sewage ejectors serving public fixtures shall be provided with dual pumps and ejectors arranged to operate independently in case of overload or failure.\n(o)\tSection 903.1, \"Vent Terminal Required,\" is repealed and reenacted to read:\n903.1 Vent Terminal Required. Open vent pipes that extend through a roof shall be terminated not less than 6 inches above the roof.\n(p)\tThe Exception to Section 1003.4 is repealed and reenacted to read:\nException: For elevators without firefighter's emergency operation, an oil separator is not required for drainage from hydraulic elevator pits where an approved oil sensing system is installed.\n(q)\tSection 1101.3, \"Prohibited drainage,\" is repealed and reenacted to read:\n1101.3 Prohibited drainage. No rain, surface, or subsurface water shall be connected to or discharged into any drainage system, unless first approved by the code official.\n(r)\tSection 1106.1, \"General,\" is repealed and reenacted to read:\n1106.1 General. The size of the vertical conductors and leaders, building storm drains, building storm sewers, and any horizontal branches of such drains or sewers shall be based on the 100-year hourly rainfall rate of 2.5 inches per hour or other approved local weather data.\n(s)\tChapter 13, \"NONPOTABLE WATER SYSTEMS,\" is deleted in its entirety.\n(t)\tChapter 14, \"SUBSURFACE GRAYWATER SOIL ABSORPTION SYSTEMS,\" is deleted in its entirety.\n(u)\tTable E103.3(2), \"Load Values Assigned to Fixtures,\" is amended by the addition of a new sentence to read:\nFor the purpose of determining the largest instantaneous demand required in order to size a water meter, this table is repealed and replaced by Chapter 11-1-35, \"Meter Size Requirements,\" B.R.C. 1981.\n(v)\tTable E103.3(3), \"Table for Estimating Demand,\" is amended by the addition of a new sentence to read:\nFor the purpose of determining the largest instantaneous demand required in order to size a water meter, this table is repealed and replaced by Chapter 11-1-35, \"Meter Size Requirements,\" B.R.C. 1981.\nOrdinance Nos. 4879 (1985); 4984 (1986); 5050 (1987); 5177 (1989); 5493 (1992); 5781 (1996); 6065 (1999); 6065 (1999); 7024 (1999); 7566 (2007); 7925 (2013); 8166 (2017); 8209 (2017); 8366 (2020); 8565 (2023); 8684 (2025)"
  },
  {
    "corpus": "BRC",
    "title": "10",
    "title_name": "Structures",
    "chapter": "12",
    "chapter_name": "Mobile Homes",
    "anchor": "10-12-1",
    "heading": "Legislative Intent.",
    "verbatim": "10-12-1. Legislative Intent.\nThe purpose of this chapter is to protect the public health, safety, and welfare of the residents of the city by regulating the construction, alteration, extension, location, installation, use and maintenance of all mobile homes and mobile home parks in the city. Mobile homes, manufactured housing, and factory-built housing are important and effective ways to meet Boulder's affordable housing needs. Moving mobile homes is costly and it is challenging to find an alternative mobile home park with vacancies willing to accept a mobile home. In some instances, a mobile homeowner may not be able to move their mobile home because of the mobile home's age and condition. A mobile homeowner may be forced to sell their home for an unreasonably low price due to the abbreviated timeline to move it or the inability to do so. This chapter is intended to supplement the State of Colorado's Mobile Home Park Act which provides broader protections for owners of mobile homes. Nothing in this chapter shall be construed to discriminate against mobile homes as housing.\nOrdinance No. 8383 (2020); 8684 (2025)"
  },
  {
    "corpus": "BRC",
    "title": "10",
    "title_name": "Structures",
    "chapter": "12",
    "chapter_name": "Mobile Homes",
    "anchor": "10-12-2",
    "heading": "Definitions.",
    "verbatim": "10-12-2. Definitions.\nThe following words used in this chapter have the following meanings unless the context clearly indicates otherwise:\nAccessory structure means any structural addition to a mobile home or a mobile home space, including without limitation, awnings, carports, porches, storage cabinets and similar appurtenant structures.\nCamper means a unit containing cooking or sleeping facilities that is designed to be loaded onto or affixed to the bed or chassis of a truck to provide temporary living quarters for recreational camping or travel use.\nMobile home means a transportable, detached dwelling unit, suitable for year-round occupancy that contains the same water supply, waste disposal and electrical conveniences as immobile housing, that has no foundation other than wheels or removable jacks for conveyance on highways, and that may be transported to a site as one or more modules, but the term does not include \"travel trailers,\" \"campers,\" \"camper buses,\" or \"motor homes,\" or modular homes designed to be placed on a foundation.\nMobile home park means any lot or tract of land designed, used, or intended to provide a location or accommodation for one or more mobile homes and upon which any mobile home or homes are parked or located, whether or not the lot or tract or any part thereof is held or operated for profit, but the term excludes automobile or mobile homes sales lots on which mobile homes are parked only for inspection and sale.\nMobile home space means a plot of ground within a mobile home park designed for the accommodation of one mobile home and its accessory structures.\nMotor home means a motor vehicle containing cooking or sleeping facilities and designed as temporary living quarters for recreational camping or travel use and includes, without limitation, vehicles designated as \"camper buses\" and those that may have been originally designed for use as vans or buses but that have been converted to use as living quarters.\nPark owner means the owner of a mobile home park, or any agent, representative or employee of an owner of a mobile home park.\nResident means the owner of a mobile home located in a mobile home park with a valid lease agreement.\nTravel trailer means a portable structure, mounted on wheels and designed to be towed by a motor vehicle, that contains cooking or sleeping facilities to provide temporary living quarters for recreational camping or travel.\nOrdinance Nos. 8043 (2015); Ord. No. 8651 (2025)"
  },
  {
    "corpus": "BRC",
    "title": "10",
    "title_name": "Structures",
    "chapter": "12",
    "chapter_name": "Mobile Homes",
    "anchor": "10-12-3",
    "heading": "Application of Chapter to Existing Mobile Homes and Mobile Home Parks.",
    "verbatim": "10-12-3. Application of Chapter to Existing Mobile Homes and Mobile Home Parks.\n(a)\tAny mobile home park in existence in the city on July 5, 1973, or annexed to the city after such date that complies with all applicable legal requirements then in effect is deemed to be legally nonconforming and is not subject to the provisions of this chapter except those concerning blocking and tying down of mobile homes (Section 10-12-8, \"Blocking and Tie-Down Required,\" B.R.C. 1981), use of gas fuel, fire protection (Paragraphs 10-12-21(a)(7), (a)(8) and (a)(10), B.R.C. 1981), limitation on park owner's right to prohibit sales (Section 10-12-25) and limitation on required upgrades to existing mobile homes (Section 10-12-26). But any person who alters or extends such a legally nonconforming mobile home park shall conform to all applicable provisions of this chapter for such alterations and extensions.\n(b)\tAn individual mobile home may be replaced or relocated within a legally nonconforming mobile home park if such mobile home is blocked and tied down in compliance with the requirements of Section 10-12-8, \"Blocking and Tie-Down Required,\" B.R.C. 1981, and if gas connections are made in compliance with the requirements of Paragraphs 10-12-21(a)(7) and (a)(8), B.R.C. 1981.\n(c)\tAny mobile home in existence in the city on July 5, 1973 or annexed to the city after such date that complied with all applicable legal requirements then in effect is considered to be legally nonconforming and is not subject to the provisions of this chapter except the requirements relating to blocking and tying down of mobile homes (Section 10-12-8, \"Blocking and Tie-Down Required,\" B.R.C. 1981).\n(d)\tIf any such legally nonconforming mobile home is removed from its location, whether within a mobile home park or elsewhere, the mobile home may not be replaced or relocated except in conformity with all applicable requirements of this chapter. If the use of such a legally nonconforming mobile home is discontinued for a period of twelve consecutive months or more, no person shall occupy the mobile home until it conforms with all requirements of this chapter.\n(e)\tNo person may replace an existing mobile home located on a mobile home space that is not large enough to provide the minimum requirements of Section 9-7-13, \"Mobile Home Park Form and Bulk Standards,\" B.R.C. 1981, by a larger mobile home, but such person may replace such existing mobile home with a mobile home of the same or smaller length and width dimensions.\n(f)\tNo person shall replace an existing mobile home located on a lot outside a mobile home park with a larger mobile home, but such person may replace such mobile home with a mobile home of the same or smaller length and width, if the replacement is made within thirty days after the removal of the existing mobile home.\nOrdinance Nos. 5462 (1992); 5562 (1993); 7684 (2009); 8043 (2015)"
  },
  {
    "corpus": "BRC",
    "title": "10",
    "title_name": "Structures",
    "chapter": "12",
    "chapter_name": "Mobile Homes",
    "anchor": "10-12-4",
    "heading": "Enforcement.",
    "verbatim": "10-12-4. Enforcement.\n(a)\tThe city manager may enter any mobile home park in the city to inspect and investigate conditions relating to the enforcement of this chapter at all reasonable times.\n(b)\tFor alleged violations of the provisions of this chapter, other than Section 10-12-25, \"Limitation on Prohibition of Sales,\" B.R.C. 1981 and Section 10-12-26 \"Limitation on Required Upgrades to Existing Mobile Homes\", whenever, after inspection of any mobile home or mobile home park, the city manager finds any violation of this chapter, the manager shall give to the owner of the mobile home or the mobile home park a notice that specifies:\n(1)\tThe provisions of this chapter that are alleged to be violated;\n(2)\tA reasonable period of time in which to correct the alleged violation; and\n(3)\tThe right to appeal the violation notice within thirty days from the date of its issuance and specifying the appeal forum under the procedures prescribed by Section 10-12-24, \"Appeals and Variances,\" and Chapter 1-3, \"Quasi-Judicial Hearings,\" B.R.C. 1981.\n(c)\tThe city manager shall reinspect the mobile home or the mobile home park for which a notice of violation was issued upon expiration of the period of time stated in the violation notice for correction of the alleged violation.\n(d)\tFor alleged violations of Section 10-12-25, \"Limitation on Park Owner's Right to Prohibit Sales,\" B.R.C. 1981 and Section 10-12-26, \"Limitations on Required Upgrades to Mobile Homes,\" B.R.C. 1981:\n(1)\tIf the city manager finds that a violation of any provision of Section 10-12-25 or Section 10-12-26, the manager, shall issue a notice of violation and provide an opportunity for hearing under the procedures prescribed by Chapter 1-3, \"Quasi-Judicial Hearings,\" B.R.C. 1981.\n(2)\tIf after hearing all of the evidence, the city manager finds a violation, the city manager may take any one or more of the following actions to remedy the violation:\n(A)\tImpose a civil penalty of not more than $2,000 per violation; or\n(B)\tIssue an order reasonably calculated to ensure compliance with the provisions of Section 10-12-25 or Section 10-12-26.\n(3)\tNo person shall fail to comply with any action taken by the manager under this section.\n(4)\tThe city attorney is authorized to bring a civil action to enforce any order issued by the city manager under this section. If the city is the prevailing party in such civil action, the defendant shall be responsible for the city's costs and attorneys' fees.\n(5)\tCriminal Penalties. Violations of Section 10-12-25 or Section 10-12-26 also are punishable as provided in Section 5-2-4, \"General Penalties,\" B.R.C. 1981.\n(6)\tAny person injured by a violation of any provision of Section 10-12-25 or Section 10-12-26 may maintain an action for damages, declaratory relief, specific performance, injunction or any other appropriate relief in the District Court in and for the County of Boulder against the person causing the violation. If a plaintiff, who was a resident at the time of the cause of action arose, prevails, plaintiff shall be entitled to an award of attorney's fees. Upon filing such an action, plaintiff shall send notice thereof to the city, but nothing in this title authorizes the city or its employees or agents to be named as a defendant in such litigation.\nOrdinance Nos. 8043 (2015); 8383 (2020)"
  },
  {
    "corpus": "BRC",
    "title": "10",
    "title_name": "Structures",
    "chapter": "12",
    "chapter_name": "Mobile Homes",
    "anchor": "10-12-5",
    "heading": "Residential Mobile Homes Required to be in Mobile Home Park.",
    "verbatim": "10-12-5. Residential Mobile Homes Required to be in Mobile Home Park.\n(a)\tExcept as provided in this section, no person shall park or locate any mobile home or use a mobile home as a dwelling permanently, temporarily or for indefinite periods of time, unless the mobile home is located in a mobile home park.\n(b)\tA person may park or stop a mobile home on any street, alley, or public or private property in the city for not more than seventy-two hours but only if the home is not occupied and only if the parking or stopping complies with all traffic and parking provisions of this code and any other ordinance of the city and any signs and instructions posted on the property on which the mobile home is parked.\n(c)\tA person may park a mobile home for inspection and sale on a mobile home sales lot, but no person shall fail adequately to secure all mobile homes so parked on such lots against damage and overturning by high winds.\n10-12-6 Reserved.\nEditor's note(s)—Ord. No. 8684, § 22, effective August 1, 2025, repealed § 10-12-6, which pertained to nonresidential use of mobile home and derived from Ordinance No. 7946 (2013)."
  },
  {
    "corpus": "BRC",
    "title": "10",
    "title_name": "Structures",
    "chapter": "12",
    "chapter_name": "Mobile Homes",
    "anchor": "10-12-7",
    "heading": "Accessory Structures.",
    "verbatim": "10-12-7. Accessory Structures.\n(a)\tThe following accessory structures to an individual mobile home are permitted if they comply with all applicable provisions of this code and other ordinances of the city: unenclosed carports and porches; awnings; and detached storage cabinets that do not exceed one hundred fifty square feet in floor area. Such structures:\n(1)\tShall not obstruct required openings for light and ventilation of the mobile home or prevent inspection of mobile home equipment and utility connections; and\n(2)\tShall be located at least ten feet from any adjacent mobile home.\n(3)\tThe requirements of this subsection may be modified as part of a site review approval under the provisions of Section 9-2-14, \"Site Review,\" B.R.C. 1981.\n(b)\tExisting accessory structures not in compliance with the requirements of this section may remain in place only until the mobile home to which the structures are accessory is removed or replaced. When such mobile home is replaced, no person owning or occupying the mobile home or using the accessory structure shall fail to remove all such accessory structures or bring them into compliance with the applicable provisions of this chapter.\nOrdinance Nos. 4907 (1985); 5562 (1993)"
  },
  {
    "corpus": "BRC",
    "title": "10",
    "title_name": "Structures",
    "chapter": "12",
    "chapter_name": "Mobile Homes",
    "anchor": "10-12-8",
    "heading": "Foundations.",
    "verbatim": "10-12-8. Foundations.\n(a)\tMobile Homes must be installed in compliance with the Colorado Department of Local Affairs, Division of Housing, handbook and must bear the state insignia prior to receiving a certificate of occupancy.\nOrdinance No. 8684 (2025)\n10-12-9 Reserved.\nEditor's note(s)—Ord. No. 8684, § 24, effective August 1, 2025, amended § 10-12-9 in its entirety to read as herein set out. Former § 10-12-9, pertained to anchorage."
  },
  {
    "corpus": "BRC",
    "title": "10",
    "title_name": "Structures",
    "chapter": "12",
    "chapter_name": "Mobile Homes",
    "anchor": "10-12-10",
    "heading": "Piers and Footings.",
    "verbatim": "10-12-10. Piers and Footings.\nMobile homes must be installed in compliance with the Colorado Department of Local Affairs, Division of Housing, Installation Handbook\nOrdinance No. 8684 (2025)"
  },
  {
    "corpus": "BRC",
    "title": "10",
    "title_name": "Structures",
    "chapter": "12",
    "chapter_name": "Mobile Homes",
    "anchor": "10-12-11",
    "heading": "Cabanas and Awnings.",
    "verbatim": "10-12-11. Cabanas and Awnings.\n(a)\tCabanas, awnings and similar accessory structures shall comply with the city building code, Chapter 10-5, \"Building Code,\" B.R.C. 1981.\n(b)\tOther adjacent structures such as storage bins, antennas and refuse containers shall be secured and approved as required by the city manager.\n10-12-12 Reserved.\nEditor's note(s)—Ord. No. 8684, § 24, effective August 1, 2025, repealed § 10-12-12, which pertained to alternative tie-down and blocking methods."
  },
  {
    "corpus": "BRC",
    "title": "10",
    "title_name": "Structures",
    "chapter": "12",
    "chapter_name": "Mobile Homes",
    "anchor": "10-12-13",
    "heading": "Mobile Home Park Environmental Standards.",
    "verbatim": "10-12-13. Mobile Home Park Environmental Standards.\n(a)\tEach mobile home park shall be located on a well-drained site and located so that its drainage will not constitute an unreasonable hazard or nuisance to persons, property or water supply in the immediate vicinity. The site shall be free of marshes, swamps or other potential breeding places for insects or rodents; not be subject to undue flooding or fire or safety hazards; and not be exposed to nuisances such as noise, smoke, fumes or odors. The topography of the site shall minimize the need to grade, facilitate useable mobile home placement and provide for convenient maintenance. Initial site grades shall not exceed eight percent.\n(b)\tThe requirements of subsection (a) of this section may be modified as part of a site review approval under the provisions of Section 9-2-14, \"Site Review,\" B.R.C. 1981.\n(c)\tWhere the mobile home park site is being annexed to the city or is subject to city regulation by use of city utility services, the mobile home park owner shall pay the park land acquisition and development fee required by that section after a consideration of recommendations by the planning board and the parks and recreation advisory board.\n(d)\tRepealed.\nOrdinance Nos. 4907 (1985); 5562 (1993)"
  },
  {
    "corpus": "BRC",
    "title": "10",
    "title_name": "Structures",
    "chapter": "12",
    "chapter_name": "Mobile Homes",
    "anchor": "10-12-14",
    "heading": "Nonresidential Uses in Mobile Home Parks.",
    "verbatim": "10-12-14. Nonresidential Uses in Mobile Home Parks.\n(a)\tNo person shall use any part of a mobile home park for nonresidential purposes except such uses that are required for the direct benefit and well-being of park residents and for the management and maintenance of the park, including, without limitation, convenience stores, personal service shops and day care nurseries provided for the exclusive convenience and use of the residents, as permitted under Section 9-6-1, \"Schedule of Permitted Land Uses,\" B.R.C. 1981, and approved as part of the site plan under the provisions for special use review use of Section 9-2-15, \"Use Review,\" B.R.C. 1981, or approved as part of a site review approval under the provisions of Section 9-2-14, \"Site Review,\" B.R.C. 1981.\n(b)\tIf any such nonresidential uses are located in a mobile home, the mobile home shall meet the tie-down requirements of Section 10-12-8, \"Blocking and Tie-Down Required,\" B.R.C. 1981.\nOrdinance Nos. 4803 (1984); 4907 (1985); 5562 (1993)"
  },
  {
    "corpus": "BRC",
    "title": "10",
    "title_name": "Structures",
    "chapter": "12",
    "chapter_name": "Mobile Homes",
    "anchor": "10-12-15",
    "heading": "Repealed.",
    "verbatim": "10-12-15. Repealed.\nOrdinance No. 4907 (1985)"
  },
  {
    "corpus": "BRC",
    "title": "10",
    "title_name": "Structures",
    "chapter": "12",
    "chapter_name": "Mobile Homes",
    "anchor": "10-12-16",
    "heading": "Travel Trailer and Camper Areas in Mobile Home Parks.",
    "verbatim": "10-12-16. Travel Trailer and Camper Areas in Mobile Home Parks.\n(a)\tIf areas are to be provided within the mobile home park for the accommodation of travel trailers, campers, motor homes and camper buses for temporary occupancy, such areas shall be located where the parking, use and occupancy of such vehicles does not constitute a nuisance to other residents of the mobile home park and shall be screened from the remainder of the mobile home park spaces in order to reduce undue noise and other disturbance. Such areas shall be located convenient to community service and sanitary facilities, and utilities provided on the spaces shall comply with all applicable health and safety regulations of this code and other ordinances of the City.\n(b)\tAnchors and cables with turnbuckles shall be provided for tying down travel trailers as required by Sections 10-12-8, \"Blocking and Tie-Down Required,\" and 10-12-9, \"Anchorage,\" B.R.C. 1981.\nOrdinance No. 5271 (1990)"
  },
  {
    "corpus": "BRC",
    "title": "10",
    "title_name": "Structures",
    "chapter": "12",
    "chapter_name": "Mobile Homes",
    "anchor": "10-12-17",
    "heading": "Repealed.",
    "verbatim": "10-12-17. Repealed.\nOrdinance No. 4907 (1985)"
  },
  {
    "corpus": "BRC",
    "title": "10",
    "title_name": "Structures",
    "chapter": "12",
    "chapter_name": "Mobile Homes",
    "anchor": "10-12-18",
    "heading": "Windbreaks.",
    "verbatim": "10-12-18. Windbreaks.\n(a)\tWhere any mobile home park is located on flat open land, without natural barriers to strong winds (such as hills, bluffs or large stands of trees), windbreaks shall be provided to protect mobile homes from the effects of such winds.\n(b)\tWindbreaks shall be designed and located in relation to wind velocities and directions and the existing and proposed topography and vegetation and shall be approved by the planning department.\n(c)\tOne or more of the following techniques shall be used in providing windbreak screening:\n(1)\tLandscape buffering: a combination of trees and \"understory\" shrubbery of dense deciduous or evergreen plant material with mature shrub heights ranging from four to twelve feet or clustered or row-planted tree or shrub hedges;\n(2)\tEarth berming combined with landscape buffering; or\n(3)\tOpaque fencing (eighty-five percent or more capacity) or wood or masonry screening, complying with building and zoning code requirements.\n(4)\tOther techniques may be utilized as part of a site review under the provisions of Section 9-2-14, \"Site Review,\" B.R.C. 1981.\n(d)\tAll plant material used for windbreak protection shall be of an established variety known to provide wind resistance in the Boulder area and conforming to the American Association of Nurserymen specifications and standards.\nOrdinance Nos. 4907 (1985); 5562 (1993)"
  },
  {
    "corpus": "BRC",
    "title": "10",
    "title_name": "Structures",
    "chapter": "12",
    "chapter_name": "Mobile Homes",
    "anchor": "10-12-19",
    "heading": "Mobile Home Park Streets and Walkways.",
    "verbatim": "10-12-19. Mobile Home Park Streets and Walkways.\n(a)\tThe mobile home park site shall have at least two exits to a public street or highway and access roads to each mobile home space.\n(b)\tAll streets and access ways providing ingress to and egress from the mobile home park and circulation within the mobile home park shall be constructed in compliance with the City of Boulder Design and Construction Standards and shall be completed within a period of two years after the date of issuance of the mobile home park permit.\n(c)\tThe minimum distance from the curb shall be twenty-eight feet for one-way streets and thirty-six feet for two-way streets. The minimum corner radii of all streets shall be one hundred feet. If off-street parking areas are provided exceeding those required by Section 9-7-13, \"Mobile Home Park Form and Bulk Standards,\" B.R.C. 1981, and no on-street parking will be permitted in the mobile home park, the city manager may reduce the street width.\n(d)\tIf any streets, easements or other lands are required to be dedicated to the City for public use, the developer shall submit the necessary legal documents or file a plat of the mobile home park covering the dedication of such property before or at the time of final approval of the mobile home park permit, issued under Section 4-14-3, \"Mobile Home Park Permit,\" B.R.C. 1981.\n(e)\tPaved walkways at least four feet wide shall be provided from all mobile home spaces to service buildings and other community areas and along all access roads. Pedestrian circulation areas shall be lighted at night with light fixtures consistent with the standards of Section 9-9-16, \"Lighting, Outdoor,\" B.R.C. 1981, and creating a light level of 3.0 footcandles at the ground in all pedestrian circulation areas.\n(f)\tThe requirements of this section may be modified as part of a site review under the provisions of Section 9-2-14, \"Site Review,\" B.R.C. 1981.\nOrdinance Nos. 4907 (1985); 5562 (1993); 5986 (1998); 7684 (2009); 8283 (2018)"
  },
  {
    "corpus": "BRC",
    "title": "10",
    "title_name": "Structures",
    "chapter": "12",
    "chapter_name": "Mobile Homes",
    "anchor": "10-12-20",
    "heading": "Storage Areas.",
    "verbatim": "10-12-20. Storage Areas.\nStorage areas for boats, boat trailers, travel trailers, tent trailers, horse trailers and detachable pickup campers shall be provided within the mobile home park in an amount equal to one hundred square feet per mobile home space. Such areas shall be screened from adjacent residential properties and public streets by opaque fencing or landscaping and shall be provided with tie-down anchors."
  },
  {
    "corpus": "BRC",
    "title": "10",
    "title_name": "Structures",
    "chapter": "12",
    "chapter_name": "Mobile Homes",
    "anchor": "10-12-21",
    "heading": "Utilities and Other Public Improvements.",
    "verbatim": "10-12-21. Utilities and Other Public Improvements.\n(a)\tUtilities and public improvements shall meet the following conditions:\n(1)\tAll utility lines and service lines within the mobile home park are placed underground.\n(2)\tThe mobile home park and all individual mobile homes therein are connected to the City water system, which is used exclusively. Private wells may be used for irrigation purposes if they comply with requirements of state law.\n(3)\tThe mobile home park and all individual mobile homes therein are connected to the City's wastewater utility system in compliance with Chapter 11-2, \"Wastewater Utility,\" B.R.C. 1981, and all sanitary sewer service lines and appurtenances are maintained and operated so as not to create a nuisance or health hazard.\n(4)\tAll plumbing in the mobile home park complies with the City plumbing code, Chapter 10-10, \"Plumbing Code,\" B.R.C. 1981, and mobile home drains are watertight and self-draining.\n(5)\tAn electrical outlet supplying at least one hundred twenty/two hundred forty volts for utility company three-wire meters, with a minimum of fifty amps capacity, is provided for each mobile home space in compliance with the city electric code, Chapter 10-6, \"Electrical Code,\" B.R.C. 1981, and electrical outlets are weatherproofed and power lines and service connections to the mobile home are located in safe conduits below ground level.\n(6)\tThe storage, collection and disposal of refuse in the mobile home park is managed so as to create no health hazards, rodent harborage, insect breeding areas, accident hazards or air pollution. All refuse is stored in fly-tight, water-tight, rodent-proof containers, provided in sufficient number and capacity to prevent refuse from overflowing or blowing away. Trash container racks or holders are provided at permanent locations convenient to mobile home spaces in areas appropriately screened. Containers are anchored to prevent tipping or spilling due to winds or animals. No incinerators are provided. Refuse is collected at regular intervals, but no less often than twice per week.\n(7)\tMobile homes using liquefied petroleum gas for cooking and heating comply with applicable laws and regulations of the State of Colorado regarding liquefied petroleum gases and the city mechanical code, Chapter 10-9, \"Mechanical Code,\" B.R.C. 1981.\n(8)\tIf the mobile home park is connected to a natural gas supply, a readily accessible and identified shut-off valve controlling the flow of gas to the entire gas piping system is installed near the point of connection to the service piping, and each mobile home space has an approved gas shut-off valve installed upstream of the mobile home gas outlet located on the outlet riser at a height of not less than four inches above ground level and not located under any mobile home. Whenever the mobile home lot outlet is not in use, the outlet is equipped with an approved cap or plug to prevent accidental discharge of gas. Approved flexible connections are installed between the gas meter and the gas piping serving the mobile home.\n(9)\tAll piping from outside fuel storage tanks or cylinders to heating units in mobile homes is of standard weight wrought iron or steel pipe or brass or copper pipe of iron pipe size and is permanently installed and securely fastened in place. All fuel storage tanks or cylinders are securely fastened in place and are not located inside or beneath the mobile home or closer than five feet to any mobile home exit.\n(10)\tOil is stored in tanks or containers not exceeding one hundred twenty gallons in capacity, mounted on an incombustible frame at the rear of the mobile home, vented and provided with a stop cock at the outlet of the container and another stop cock on the fuel line where it enters the mobile home. Where feasible, the oil storage facility is placed underground.\n(11)\tEvery mobile home park is equipped with fire extinguishing equipment prescribed and located in accordance with the requirements of the city fire code, Chapter 10-8, \"Fire Code,\" B.R.C. 1981. Fires are made only in stoves and other equipment intended for such use.\n(b)\tNo mobile home park owner or operator shall connect or permit the connection of any fuel heating unit in a mobile home until such heating unit is inspected and approved by the city manager and the manager issues a permit therefor.\nOrdinance No. 7925 (2013)"
  },
  {
    "corpus": "BRC",
    "title": "10",
    "title_name": "Structures",
    "chapter": "12",
    "chapter_name": "Mobile Homes",
    "anchor": "10-12-22",
    "heading": "Mobile Home Park Sanitary Facilities.",
    "verbatim": "10-12-22. Mobile Home Park Sanitary Facilities.\n(a)\tEvery mobile home park shall have sanitary facilities in a service building or office building accessible to all mobile homes within the park.\n(b)\tAny mobile home park that provides accommodations for travel trailers shall provide at least the following toilet and bathing facilities, located in a building that is convenient to the area designed for travel trailer use and not more than two hundred feet from such area:"
  },
  {
    "corpus": "BRC",
    "title": "10",
    "title_name": "Structures",
    "chapter": "12",
    "chapter_name": "Mobile Homes",
    "anchor": "10-12-23",
    "heading": "Permanent Buildings.",
    "verbatim": "10-12-23. Permanent Buildings.\n(a)\tThe buildings containing the management office and other common facilities (repair shops, storage areas, sanitary and laundry facilities, indoor recreation areas and commercial areas) shall be conveniently located for their intended uses and may be consolidated if a single location will adequately serve all mobile home spaces. All buildings containing such common facilities shall be located at least fifteen feet from any mobile home space and conform to all applicable requirements of the city building code, Chapter 10-5, \"Building Code,\" B.R.C. 1981, and other ordinances of the city.\n(b)\tWhere outside drying areas are provided adjacent to service buildings, they shall be screened from view so that they do not detract from the appearance of the mobile home park and are not objectionable to residents of neighboring properties. A minimum of two thousand five hundred square feet of drying area shall be provided for each one hundred mobile home spaces. But if drying areas are provided on individual mobile home spaces, the minimum area required by this subsection may be reduced by the amount of area actually provided on individual mobile home spaces.\n(c)\tThe requirements of this section may be modified as part of a site review under the provisions of Section 9-2-14, \"Site Review,\" B.R.C. 1981.\nOrdinance Nos. 4907 (1985); 5562 (1993)"
  },
  {
    "corpus": "BRC",
    "title": "10",
    "title_name": "Structures",
    "chapter": "12",
    "chapter_name": "Mobile Homes",
    "anchor": "10-12-24",
    "heading": "Appeals and Variances.",
    "verbatim": "10-12-24. Appeals and Variances.\n(a)\tAny person to whom a notice of violation has been issued under Section 10-12-4, \"Enforcement,\" B.R.C. 1981, may appeal the notice to the municipal court on the grounds that the notice is legally or factually incorrect or both. Any such appeal shall be taken in the manner set forth in this section, and any hearing held in connection therewith shall be conducted under the procedures prescribed in Chapter 1-3, \"Quasi-Judicial Hearings,\" B.R.C. 1981. A person who believes that an administrative interpretation of the terms of this chapter is legally incorrect may appeal such interpretation to the board of building appeals (regarding Sections 10-12-8, \"Blocking and Tie-Down Required,\" 10-12-9, \"Anchorage,\" 10-12-10, \"Piers and Footings,\" 10-12-11, \"Cabanas and Awnings,\" 10-12-12, \"Alternative Tie-Down and Blocking Methods,\" and 10-12-21, \"Utilities and Other Public Improvements,\" B.R.C. 1981).\n(1)\tA variance request from the requirements relating to construction of buildings or utilities or blocking and tying down of mobile homes, Sections 10-12-8, \"Blocking and Tie-Down Required,\" 10-12-9, \"Anchorage,\" 10-12-10, \"Piers and Footings,\" 10-12-11, \"Cabanas and Awnings,\" 10-12-12, \"Alternative Tie-Down and Blocking Methods,\" and 10-12-21, \"Utilities and Other Public Improvements,\" B.R.C. 1981, shall be made to the board of building appeals.\n(2)\tA person shall file the appeal, request for variance or both in the alternative to the applicable authority within thirty days from the date of service of the notice of alleged violation. If a person makes such request before the end of the time period and shows good cause therefor, the manager may extend for a reasonable period the time to file.\n(3)\tThe fee for filing a variance request with the board of building appeals is that prescribed by Subsection 4-20-47(a) or (b), B.R.C. 1981.\n(4)\tThe fee for appeals to the municipal court is that prescribed by Subsection 4-20-55(a)(7) for administrative hearings.\n(b)\tEvery variance request that involves a modification, enlargement, or expansion of an approved mobile home park or modification of any conditions placed upon the use at the time of initial approval of the mobile home park permit is subject to the requirements regarding uses permitted by use review in Section 9-2-15, \"Use Review,\" B.R.C. 1981.\n(c)\tIf an applicant requests that the board of building appeals grant a variance from the requirements of this chapter, the board shall not grant a variance unless it finds that each of the following conditions exists:\n(1)\tThere are unique physical circumstances or conditions, such as irregularity, narrowness, or shallowness of the site, or exceptional topographical or other physical conditions peculiar to the affected property;\n(2)\tBecause of such physical circumstances or conditions, the property cannot reasonably be developed in conformity with the provisions of this chapter;\n(3)\tSuch circumstances or conditions have not been created by the applicant;\n(4)\tIf granted, the variance will not adversely affect the character of the neighborhood in which the mobile home park is proposed to be located nor substantially or permanently impair the appropriate use and development of the adjacent property; and\n(5)\tIf granted, the variance is the minimum variance that will afford relief and is the least modification possible of the ordinance provisions in question.\n(d)\tIf an applicant requests that the board of building appeals grant a variance from the requirements of Sections 10-12-8, \"Blocking and Tie-Down Required,\" 10-12-9, \"Anchorage,\" 10-12-10, \"Piers and Footings,\" 10-12-11, \"Cabanas and Awnings,\" 10-12-12, \"Alternative Tie-Down and Blocking Methods,\" and 10-12-21, \"Utilities and Other Public Improvements,\" B.R.C. 1981, the board may grant a variance under the standards and procedures prescribed by the city building code, Chapter 10-5, \"Building Code,\" B.R.C. 1981.\n(e)\tThe board of building appeals may grant a variance subject to any conditions that it deems necessary or desirable to make the variance compatible with the purposes of this chapter.\n(f)\tUnless used by the applicant, a variance granted by the board of building appeals automatically expires one hundred and eighty days after the date it was granted or within such time as the board may prescribe unless an extension of the variance is obtained within such period after a showing of good cause upon application for such extension made before the expiration of the variance.\n(g)\tThe order of the city manager becomes the final agency action of the city if:\n(1)\tThe applicant fails to appeal the manager's notice of violation to the municipal court within the prescribed time limit;\n(2)\tThe applicant fails to request a variance or interpretation from the board of building appeals within the prescribed time limit.\nOrdinance Nos. 4803 (1984); 4879 (1985); 5562 (1993); 8383 (2020)"
  },
  {
    "corpus": "BRC",
    "title": "10",
    "title_name": "Structures",
    "chapter": "12",
    "chapter_name": "Mobile Homes",
    "anchor": "10-12-25",
    "heading": "Limitation on the Prohibition Sales of Mobile Homes.",
    "verbatim": "10-12-25. Limitation on the Prohibition Sales of Mobile Homes.\n(a)\tNo person, including without limitation a park owner, shall prohibit, interfere with, discourage or act to delay the sale or purchase of a mobile home or require an owner of a mobile home within a mobile home park to remove a mobile home from the park at the time such mobile home is sold provided that the purchaser shall enter into and be bound by the rental agreement of the park owner.\n(b)\tAll mobile homes not constructed in compliance with United States Department of Housing and Urban Development regulations shall be inspected no more than six months prior to the proposed sale, which inspection shall be conducted by an appropriately licensed inspector using the City of Boulder Baseline Inspection Checklist (as modified). The city manager shall publish a modified City of Boulder Baseline Checklist suitable for mobile home inspection, which shall include a review of the installation and placement of the home. The seller of any such mobile home shall provide a copy of the inspection report to the buyer of the home, before a sale is completed.\n(c)\tAny purchaser of a mobile home sold by a resident may become a resident of the mobile home park provided the purchaser meets the entry requirements for the mobile home park that are applied by the park owner equally to all purchasers and prospective residents so long as such requirements are not in violation of federal or state law and have previously been provided to the resident. Within three business days of a request, a park owner shall provide a potential purchaser written information about the park rules, lease, entry requirements for residency, application to become a park resident, and an email address for correspondence. Upon receipt of a completed application, the park owner will have a total of ten business days in which to process the application, deny or approve the application, and deliver a written notice granting approval or stating the reasons for denial to the applicant. If the park owner fails to deliver notice of the denial or approval within ten business days, the application shall be deemed to be approved unless such failure results from events beyond the reasonable control of the park owner.\n(d)\tNo park owner shall unreasonably interfere with the listing for sale or transfer of a home by providing false information to a buyer or seller, taking actions that unreasonably delay the seller, steering potential buyers to purchase other mobile homes in the community, or otherwise discouraging prospective buyers from purchasing a home.\n(e)\tA park owner shall have five business days after receiving notification of an intent to sell to inspect the outside premises and provide the seller and potential buyer with the following notice pursuant to the requirements of Section 10-12-31, B.R.C. 1981:\nYou have notified us of your intent to sell your mobile home. In the City of Boulder, mobile home sellers have certain rights and responsibilities. For information, please refer to the following resources:\n(1)\tBoulder Revised Code Section 10-12-25 - Limitation on the Prohibition Sales of Mobile Homes;\n(2)\tBoulder Revised Code Section 10-12-26 - Limitation on Required Upgrades to Existing Mobile Homes; and\n(3)\tThe city housing webpage: https://bouldercolorado.gov/services/manufactured-home-community-resources.\n(f)\tPark owners may not require interior inspections or inspection reports as a condition of sale. If the park owner requires repairs, maintenance or other work, the park owner shall provide written notice of the requirements reasonably clear, specific and complete for the seller to understand within five business days after the inspection. If the park owner fails to provide written notice within five business days of inspection, then no repairs, maintenance or work shall be required, except as permitted under subsection (g) of this section. Thereafter, reinspection of the mobile home for compliance with requirements shall occur within three business days of a request by the seller.\n(g)\tThe notice of required repairs, maintenance or other work may only be updated if one of the following conditions apply:\n(1)\tAt six-month intervals; or\n(2)\tIf the home is removed from and later returned to the market; or\n(3)\tIf such changes are required due to changes in conditions and are necessary for health or safety of residents; or\n(4)\tTo comply with new rules or regulations adopted by the park or new city or county regulations.\n(h)\tSome or all of the required repairs, maintenance or other work may be assumed in writing by the buyer. No park owner shall deny an application for residency because a buyer assumes responsibility for repairs, maintenance or other work.\nOrdinance Nos. 8043 (2015); 8432 (2021)"
  },
  {
    "corpus": "BRC",
    "title": "10",
    "title_name": "Structures",
    "chapter": "12",
    "chapter_name": "Mobile Homes",
    "anchor": "10-12-26",
    "heading": "Limitation on Required Upgrades to Existing Mobile Homes.",
    "verbatim": "10-12-26. Limitation on Required Upgrades to Existing Mobile Homes.\n(a)\tNo person, including without limitation a park owner, shall require a resident to perform repairs, maintenance or other work on a mobile home or accessory structure provided, however, that these activities do not include maintenance, repair and upkeep associated with ensuring that the mobile home's exterior and any accessory structure's condition comply with this chapter and the park's rules and regulations, if the home owner agreed to abide by such rules and regulations as part of a rental agreement, and the rental agreement and rules and regulations are not in conflict with Federal or State law.\n(b)\tIf a buyer assumes items noticed by a park owner for required repairs, maintenance or other work, the assumption shall be in writing and provided to the park owner by the seller. The buyer shall have sixty days to complete required repairs, maintenance or other work unless the park owner and buyer agree to a longer time period.\n(c)\tIf the homeowner has agreed to any lease terms or rules and regulations regarding park owner approval of improvements, those rules and regulations must be in writing, clear in purpose and direction, properly noticed to all homeowners, and enforced equally and in a non-discriminatory/non-retaliatory manner. When a homeowner requests clarification, the park owner shall, within three business days, provide a reasonably clear, specific and complete response so the homeowner may complete the required repairs, maintenance or other work.\n(d)\tNo park owner shall deny an application for residency, or otherwise hinder a home sales transaction, on the grounds that a buyer, not the seller, would be responsible for one or more repairs, maintenance or other work required by the park owner.\nOrdinance Nos. 8043 (2015); 8432 (2021)"
  },
  {
    "corpus": "BRC",
    "title": "10",
    "title_name": "Structures",
    "chapter": "12",
    "chapter_name": "Mobile Homes",
    "anchor": "10-12-27",
    "heading": "Trees.",
    "verbatim": "10-12-27. Trees.\nTrees in mobile home parks are the responsibility of park owners. No park owner shall require a resident to bear the expense of maintenance of trees in a mobile home park.\nOrdinance No. 8043 (2015)"
  },
  {
    "corpus": "BRC",
    "title": "10",
    "title_name": "Structures",
    "chapter": "12",
    "chapter_name": "Mobile Homes",
    "anchor": "10-12-28",
    "heading": "Right to Privacy.",
    "verbatim": "10-12-28. Right to Privacy.\n(a)\tPurpose. The purpose of this section is to establish expectations related to the right to privacy of mobile home park tenants from improper intrusions by landlords and operators.\n(b)\tPark owners and their agents shall respect the privacy of homeowners residing in their communities, and shall have no right of entry to a mobile home, without the prior written consent of the homeowner or occupant, except in the case of emergency or when the mobile home has been abandoned. Such consent may be revoked in writing by the homeowner/occupant at any time.\n(c)\tUnless otherwise prohibited by law, park owners and their agents shall have a right of entry upon the land upon which the mobile home is situated for the maintenance of utilities, to insure compliance with applicable codes, statutes, ordinances, administrative rules, and the rental agreement and the rules of the community, and protection of the mobile home park at any reasonable time or in an emergency, but not in a manner or at a time which would interfere with the occupant's quiet enjoyment.\n(d)\tPark owners and their agents shall make a reasonable effort to notify the Resident of their intention of entry upon the land upon which a mobile home is situated, at least 48 hours prior to entry.\nOrdinance No. 8216 (2017)"
  },
  {
    "corpus": "BRC",
    "title": "10",
    "title_name": "Structures",
    "chapter": "12",
    "chapter_name": "Mobile Homes",
    "anchor": "10-12-29",
    "heading": "Retaliation Prohibited.",
    "verbatim": "10-12-29. Retaliation Prohibited.\n(a)\tProtected Actions: Every Resident shall have the rights described in this section. A Park Owner shall not take any retaliatory actions against a Resident for any of the following actions:\n(1)\tThe Resident has expressed an intention to complain or has complained to a governmental agency about conditions in the manufactured housing community;\n(2)\tThe Resident has made any complaint in good faith to the Park Owner;\n(3)\tThe Resident has filed or expressed an intention to file a lawsuit or administrative action against the Park Owner;\n(4)\tThe Resident has expressed an intent to organize or has organized or is a member of an association of Residents;\n(5)\tThe Resident has expressed intent to abate rent or has abated rent for the actual or reasonable cost of a contractor to conduct repairs; or\n(6)\tThe Resident has performed or expressed intent to perform any other act for the purpose of asserting, protecting, or invoking the protection of any right secured to Residents under any federal, state, or local law.\n(b)\tA Park Owner or an agent of a Park Owner shall not take any of the following actions in response to any protected actions described in this section:\n(1)\tIncrease a Resident's rent or decrease the services that a Resident receives;\n(2)\tAlter or refuse to renew an existing rental agreement, impose a fee, change community rules, enforce community rules in an unreasonable or non-uniform manner; or\n(3)\tBring or threaten to bring any legal action, including, but not limited to an action for eviction.\n(c)\tAny attempt to evict a Resident, except for nonpayment of rent, within six months after the Resident has taken any action identified in subsection (a) above, shall create a rebuttable presumption that the eviction action is in retaliation against the Resident.\n(d)\tNo Park Owner shall harass or threaten any Resident association or engage in any unfair or deceptive conduct. Community owners shall not prohibit Resident associations from publishing and distributing information about their association meetings and shall not discourage Residents from belonging to a Resident association.\n(e)\tResidents shall have the right to meet and establish an association of Residents. Meetings of Residents or associations of Residents relating to mobile home living and affairs in their park or for social or educational purposes, including without limitation forums for or speeches by public officials or candidates for public office in their common area, community hall, or recreation hall, if such a facility or similar facility exists, shall not be subject to prohibition by the landlord or operator if the common area or hall is reserved and used in compliance with the park rules and such meetings are held at reasonable hours and when the facility is not otherwise in use.\nOrdinance No. 8216 (2017)"
  },
  {
    "corpus": "BRC",
    "title": "10",
    "title_name": "Structures",
    "chapter": "12",
    "chapter_name": "Mobile Homes",
    "anchor": "10-12-30",
    "heading": "Mediation of Disputes.",
    "verbatim": "10-12-30. Mediation of Disputes.\n(a)\tPrior to city enforcement staff issuing a notice of violation for any provision of this chapter for which probable cause exists code enforcement may refer the matter to mediation. If referred to mediation, Park Owners and Residents should make a good-faith attempt to mediate the dispute with an independent third party, or to settle the dispute through industry mediation procedures.\n(b)\tFailure of either party to participate in mediation, after a request has been served, may be considered by the municipal court when determining any resulting penalty.\n(c)\tA Request to Mediate shall be considered served upon a Resident when it has been mailed to the Resident by first class mail. A Request to Mediate to the Park Owner shall be considered served by delivery by or on behalf of the initiating party to any agent of the Park Owner during regular office hours at the office in the Mobile Home Park.\n(d)\tIf mediation is desired by the parties, enforcement staff may elect to stay any enforcement proceedings from fifteen days, or until such other date that the parties have chosen for mediation.\n(e)\tThe Request to Mediate shall state the reasons for the mediation, including reference to the provision in this chapter under which the dispute arises.\n(f)\tThe request shall also contain the name and address of the mediation service where the mediation shall take place.\nOrdinance Nos. 8216 (2017); 8383 (2020)"
  },
  {
    "corpus": "BRC",
    "title": "10",
    "title_name": "Structures",
    "chapter": "12",
    "chapter_name": "Mobile Homes",
    "anchor": "10-12-31",
    "heading": "Services to Tenants with a First Language Other than English (Limited Proficiency in the English Language).",
    "verbatim": "10-12-31. Services to Tenants with a First Language Other than English (Limited Proficiency in the English Language).\nLandlords shall include the following provision, in languages other than English determined by the City Manager, with the lease, rules and regulations and any notice required by the lease:\nTo: \nFrom: \nDate: \nRegarding: Language Supports Available\nYou have been served with an important legal notice by your Mobile Home Park landlord. If you do not speak English and need assistance reading and understanding the attached notice, the City of Boulder will provide you with assistance. Please contact the City of Boulder Language Access Program immediately for interpretation assistance.\nOrdinance No. 8383 (2020)"
  },
  {
    "corpus": "BRC",
    "title": "10",
    "title_name": "Structures",
    "chapter": "12",
    "chapter_name": "Mobile Homes",
    "anchor": "10-12-32",
    "heading": "Required Information to New Tenants: A Landlord shall Provide New Tenants with the Following Information in Writing.",
    "verbatim": "10-12-32. Required Information to New Tenants: A Landlord shall Provide New Tenants with the Following Information in Writing.\n(a)\tA list of every increase in rent during the last five years for the manufactured home lot.\n(b)\tThe amount of any charges for late payment and dishonored checks.\n(c)\tRestrictions on occupancy by pets.\n(d)\tAny recreational facilities and other amenities provided to the tenant and any deposits or fees required for their use.\nOrdinance No. 8383 (2020)"
  },
  {
    "corpus": "BRC",
    "title": "10",
    "title_name": "Structures",
    "chapter": "12",
    "chapter_name": "Mobile Homes",
    "anchor": "10-12-33",
    "heading": "Required Information to Tenants: A Landlord shall Provide Tenants with the Following Information in Writing.",
    "verbatim": "10-12-33. Required Information to Tenants: A Landlord shall Provide Tenants with the Following Information in Writing.\n(a)\tNotice of any substantive change to the location or dimensions of a lot. Sixty days in advance of such change when practicable.\nOrdinance No. 8383 (2020)"
  },
  {
    "corpus": "BRC",
    "title": "10",
    "title_name": "Structures",
    "chapter": "12",
    "chapter_name": "Mobile Homes",
    "anchor": "10-12-34",
    "heading": "Landlord to Issue Receipt of Payment of Rent to Tenant when Requested.",
    "verbatim": "10-12-34. Landlord to Issue Receipt of Payment of Rent to Tenant when Requested.\nUpon receiving any payment made in person by a tenant with cash or a money order, a landlord shall contemporaneously provide the tenant with a receipt indicating the amount the tenant paid and the date of payment. If the landlord receives a payment that is not delivered in person by the tenant with cash or a money order, if requested by the tenant, the landlord shall, within seven days after the request, provide the tenant with a receipt indicating the amount the tenant paid, the recipient, and the date of payment, unless there is already an existing procedure that provides a tenant with a record of the payment received that indicates the amount the tenant paid, the recipient, and the date of payment. A landlord may provide the tenant with an electronic receipt, unless the tenant requests a paper receipt, in which case the landlord shall provide the tenant with a paper receipt. For purposes of this section, a receipt may be included as part of a billing statement. The landlord shall contemporaneously issue a receipt to any tenant paying rent in person who is in receipt of a notice of nonpayment of rent.\nOrdinance No. 8383 (2020)"
  },
  {
    "corpus": "BRC",
    "title": "10",
    "title_name": "Structures",
    "chapter": "12",
    "chapter_name": "Mobile Homes",
    "anchor": "10-12-35",
    "heading": "Rulemaking Authority.",
    "verbatim": "10-12-35. Rulemaking Authority.\nThe city manager may promulgate such rules as the manager considers necessary to implement and enforce this chapter. All such rules shall be adopted in accordance with the procedures set forth in Chapter 1-4, \"Rulemaking,\" B.R.C. 1981.\nOrdinance No. 8383 (2020)"
  }
]