[
  {
    "corpus": "BRC",
    "title": "12",
    "title_name": "Human Rights",
    "chapter": "1",
    "chapter_name": "Prohibition of Discrimination in Housing, Employment, and Public Accommodations",
    "anchor": "12-1-1",
    "heading": "Definitions.",
    "verbatim": "12-1-1. Definitions.\nThe following terms used in this chapter have the following meanings unless the context clearly requires otherwise:\nAge means age forty years and older.\nCisgender means having a gender identity and gender expression that align with the gender assigned at birth.\nDiscriminate means to refuse or deny equal terms, conditions, or privileges.\nEmployer means any person employing any person in any capacity.\nEmployment agency means any person undertaking, with or without compensation, to procure employees or opportunities to work for any person or holding itself out as equipped to do so.\nGender identity means an innate sense of one's own gender, including but not limited to, cisgender and transgender.\nGender expression means external appearance, characteristics or behaviors typically associated with a specific gender.\nGenetic characteristics means all characteristics of an individual that can be transmitted through the person's chromosomes.\nHousing means any building, structure, vacant land, or part thereof during the period it is advertised, listed, or offered for sale, lease, rent, or transfer of ownership, but does not include transfer of property by will or gift.\nImmigration status means an individual's classification under the laws of United States related to citizenship, alienage and residency, including but not limited to, an undocumented individual, lawful permanent resident, asylee, refugee, nonimmigrant, native-born citizen, naturalized citizen and an individual with temporary protected status.\nLabor organization means any organization, or committee or part thereof, that exists for the purpose in whole or in part of collective bargaining, dealing with employers concerning grievances, terms or conditions of employment, or other mutual aid or protection in connection with employment.\nMarital status means both the individual status of being single, divorced, separated, or widowed and the relational status of cohabitating and being married or unmarried.\nMinor child means a person under eighteen years of age.\nPansexual means sexual orientation that is not limited with regard to sex, gender, or gender identity.\nPerson or individual means any individual, group, association, cooperation, joint apprenticeship committee, joint stock company, labor union, legal representative, mutual company, partnership, receiver, trustee, and unincorporated organization and other legal, commercial, or governmental entity.\nPhysical ormental disability means a physical or mental impairment that substantially limits one or more major life activities, a record of such impairment, or being regarded as having such impairment. The term excludes current use of alcohol or drugs or other disabilities that prevent a person from acquiring, renting, or maintaining property, that would constitute a direct threat to the property or safety of others, or that would prevent performance of job responsibilities.\nPlace of accommodation means any place of business engaged in any sales to the general public and any place that offers services, facilities, privileges, or advantages to the general public or that receives financial support through solicitation of the general public or through governmental subsidy of any kind.\nReligious expression means any external manifestation of a person's religious beliefs, including but not limited to attending worship services, praying, wearing religious garb, symbols, head coverings of all kinds, hair including shaving or hair length observances, displaying religious objects, adhering to certain dietary rules or refraining from certain activities.\nSex means the biological categories of male, female, or intersex, as determined by primary and secondary sex characteristics, hormones, or chromosomes. A person may transition sex through gender confirmation surgery or hormone replacement therapy so that a person's current sex is not the same that was assigned at birth.\nSexual orientation means the type of sexual, romantic, emotional, physical or spiritual attraction a person feels for others, often based on the gender relationship between the person and the people to whom they are attracted, and including, without limitation, heterosexual, homosexual, gay, lesbian, bisexual, or pansexual.\nSource of income means any verifiable money, compensation or housing assistance that is lawful in the State of Colorado and paid to or on behalf of a renter or buyer including, but not limited to money or compensation from any occupation or activity, from any contract, agreement, loan or settlement, from any court-ordered payment such as child support, from any payment received from an annuity or life insurance policy, or from any federal, state or local payment, including a disability benefit and housing choice voucher, any other rent subsidy or rent assistance program and related program requirements, or other public assistance.\nTransgender means having a gender identity or gender expression that differs from that which was assigned at birth, whether or not the person has physically transitioned sex and without regard to whether the person uses the term \"transgender\" to self-identify. Transgender includes, without limitation, trans woman, trans man, and non-binary.\nOrdinance Nos. 4969 (1986); 5061 (1987); 7040 (2000); 7905 (2013); 8249 (2018); 8336 (2019)"
  },
  {
    "corpus": "BRC",
    "title": "12",
    "title_name": "Human Rights",
    "chapter": "1",
    "chapter_name": "Prohibition of Discrimination in Housing, Employment, and Public Accommodations",
    "anchor": "12-1-2",
    "heading": "Discrimination in Housing Prohibited.",
    "verbatim": "12-1-2. Discrimination in Housing Prohibited.\n(a)\tIt is an unfair housing practice, and no person:\n(1)\tWho has the right of ownership or possession or the right of transfer, sale, rental, or lease of any housing or any agent of such person shall:\n(A)\tRefuse to show, sell, transfer, rent, or lease, or refuse to receive and transmit any bona fide offer to buy, sell, rent, or lease, or otherwise to deny to or withhold from any individual such housing because of the race, creed, color, sex, sexual orientation, gender identity, gender expression, genetic characteristics, marital status, religion, religious expression, national origin, ancestry, pregnancy, parenthood, custody of a minor child, mental or physical disability, source of income, or immigration status unless otherwise required by law, of that individual or such individual's friends or associates;\n(B)\tDiscriminate against any individual because of the race, creed, color, sex, sexual orientation, gender identity, gender expression, genetic characteristics, marital status, religion, religious expression, national origin, ancestry, pregnancy, parenthood, custody of a minor child, mental or physical disability, source of income, or immigration status unless otherwise required by law, of the individual or such individual's friends or associates in the terms, conditions, or privileges pertaining to any facilities or services in connection with a transfer, sale, rental, or lease of housing; or\n(C)\tCause to be made any written or oral inquiry or record concerning the race, creed, color, sex, sexual orientation, gender identity, gender expression, genetic characteristics, marital status, religion, religious expression, national origin, ancestry, pregnancy, parenthood, custody of a minor child, mental or physical disability, source of income, or immigration status unless otherwise required by law, of an individual seeking to purchase, rent, or lease any housing or of such individual's friends or associates, but nothing in this section prohibits using a form or making a record or inquiry for the purpose of required government reporting or for a program to provide opportunities for persons who have been traditional targets of discrimination on the bases here prohibited;\n(2)\tTo whom application is made for financial assistance for the acquisition, construction, rehabilitation, repair, or maintenance of any housing shall:\n(A)\tMake or cause to be made any written or oral inquiry concerning the race, creed, color, sex, sexual orientation, gender identity, gender expression, genetic characteristics, marital status, religion, religious expression, national origin, ancestry, pregnancy, parenthood, custody of a minor child, mental or physical disability, source of income, or immigration status unless otherwise required by law, of an individual seeking such financial assistance, such individual's friends or associates, or prospective occupants or tenants of such housing, or\n(B)\tDiscriminate against any individual because of the race, creed, color, sex, sexual orientation, gender identity, gender expression, genetic characteristics, marital status, religion, religious expression, national origin, ancestry, pregnancy, parenthood, custody of a minor child, mental or physical disability, source of income, or immigration status unless otherwise required by law, of such individual, such individual's friends or associates, or prospective occupants or tenants in the term, conditions or privileges relating to obtaining or use of any such financial assistance;\n(3)\tShall include in any transfer, sale, rental or lease of housing any restrictive covenant limiting the use of housing on the basis of race, creed, color, sex, sexual orientation, gender identity, gender expression, genetic characteristics, marital status, religion, religious expression, national origin, ancestry, pregnancy, parenthood, custody of a minor child, mental or physical disability, source of income, or immigration status unless otherwise required by law, or shall honor or exercise or attempt to honor or exercise any such restrictive covenant pertaining to housing;\n(4)\tShall print or cause to be printed or published any notice or advertising relating to the transfer, sale, rental or lease of any housing that indicates any preference, limitation, specification or discrimination based on race, creed, color, sex, sexual orientation, gender identity, gender expression, genetic characteristics, marital status, religion, religious expression, national origin, ancestry, pregnancy, parenthood, custody of a minor child, mental or physical disability, source of income, or immigration status unless otherwise required by law;\n(5)\tShall aid, abet, incite, compel or coerce the doing of any act prohibited by this section or obstruct or prevent any person from complying with the provisions of this section or attempt either directly or indirectly to commit any act prohibited by this section;\n(6)\tFor the purpose of promoting housing sales, rentals or leases in a geographic area, shall initiate, instigate or participate in any representation, advertisement or contract, directly or indirectly, within such geographic area that changes have occurred, will occur or may occur in the composition of the geographic area with respect to race, creed, color, sex, sexual orientation, gender identity, gender expression, genetic characteristics, marital status, religion, religious expression, national origin, ancestry, pregnancy, parenthood, custody of a minor child, mental or physical disability, source of income, or immigration status unless otherwise required by law, of the owners or occupants or that such changes will or may result in lowering property values, in increased criminal or antisocial behavior, or in declining quality of schools in the geographic area;\n(7)\tShall discharge, demote or discriminate in matters of compensation against any employee or agent because of said employee's or agent's obedience to the provisions of this section;\n(8)\tShall:\n(A)\tOffer, solicit, accept, use or retain a listing of housing with the understanding that an individual may be discriminated against in the purchase, lease or rental thereof on the basis of race, creed, color, sex, sexual orientation, gender identity, gender expression, genetic characteristics, marital status, religion, religious expression, national origin, ancestry, pregnancy, parenthood, custody of a minor child, mental or physical disability, source of income, or immigration status unless otherwise required by law, of such individual or such individual's friends or associates;\n(B)\tDeny any individual access to or participation in any multiple-listing service, real estate brokers' organization or other service, organization or facility relating to the business of selling or renting housing; or\n(C)\tDiscriminate against such individual on the basis of race, creed, color, sex, sexual orientation, gender identity, gender expression, genetic characteristics, marital status, religion, religious expression, national origin, ancestry, pregnancy, parenthood, custody of a minor child, mental or physical disability, source of income, or immigration status unless otherwise required by law, of such individual or such individual's friends or associates;\n(9)\tShall establish unreasonable rules or conditions of occupancy that have the effect of excluding pregnant women, parents or households with minor children.\n(b)\tThe provisions of subsection (a) of this section do not apply to prohibit:\n(1)\tAny religious or denominational institution or organization that is operated, supervised or controlled by a religious or denominational organization from limiting admission or giving preference to persons of the same religion or denomination or from making such selection of buyers, lessees or tenants as will promote a bona fide religious or denominational purpose.\n(2)\tOwner.\n(A)\tAn owner or lessee from limiting occupancy of a single dwelling unit occupied by such owner or lessee as his or her residence.\n(B)\tAn owner from limiting occupancy of rooms or dwelling units in buildings occupied by no more than two families living independently of each other if the owner actually maintains and occupies one of such rooms or dwelling units as his or her residence.\n(C)\tAn owner or lessor of a housing facility devoted entirely to housing individuals of one sex from limiting lessees or tenants to persons of that sex, provided that people shall be allowed to use a housing facility that is consistent with their gender identity. In housing facilities where undressing in the presence of others occurs, owners or lessors shall make reasonable accommodations to allow access consistent with an individual's gender identity.\n(3)\tThe transfer, sale, rental, lease or development of housing designed or intended for the use of the physically or mentally disabled, but this exclusion does not permit discrimination on the basis of race, creed, color, sexual orientation, gender identity, gender expression, genetic characteristics, marital status, religion, religious expression, ancestry or national origin.\n(4)\tCompliance with any provisions of Chapter 10-2, \"Property Maintenance Code,\" B.R.C. 1981, concerning permitted occupancy of dwelling units.\n(5)\tDiscrimination on the basis of pregnancy, parenthood or custody of a minor child in:\n(A)\tAny owner-occupied lot containing four or fewer dwelling units;\n(B)\tAny residential building in which the owner or lessor publicly establishes and implements a policy of renting or selling exclusively to persons fifty-five years of age or older, but only as long as such policy remains in effect;\n(C)\tAny residential institution, as defined in Section 9-16-1, \"General Definitions,\" B.R.C. 1981;\n(D)\tAny dwelling unit rented, leased or subleased for no more than eighteen months while the owner or lessee is temporarily absent, when the owner or lessee leaves a substantial amount of personal possessions on the premises;\n(E)\tAny residential building located on real estate whose title was, as of November 17, 1981, encumbered by a restrictive covenant limiting or prohibiting the residence of minor children on such property, but only so long as such covenant remains in effect; and\n(F)\tUp to one-third of the buildings in a housing complex consisting of three or more buildings; for purposes of this subparagraph, housing complex means a group of buildings each containing five or more units on a contiguous parcel of land owned by the same person or persons.\n(c)\tThe provisions of subsection (a) of this section shall not be construed to require an owner or lessor of property to make any improvement to a housing facility beyond minimal building code standards applicable to the housing facility in question and approved by a state or local agency with responsibility to approve building plans and designs.\nOrdinance Nos. 4803 (1984); 5061 (1987); 5117 (1988); 7040 (2000); 7724 (2010); 8249 (2018); 8336 (2019); 8651 (2025)"
  },
  {
    "corpus": "BRC",
    "title": "12",
    "title_name": "Human Rights",
    "chapter": "1",
    "chapter_name": "Prohibition of Discrimination in Housing, Employment, and Public Accommodations",
    "anchor": "12-1-3",
    "heading": "Discrimination in Employment Practices Prohibited.",
    "verbatim": "12-1-3. Discrimination in Employment Practices Prohibited.\n(a)\tIt is a discriminatory or unfair employment practice, and no person:\n(1)\tShall fail or refuse to hire, shall discharge, shall promote or demote, or shall discriminate in matters of compensation, terms, conditions or privileges of employment against any individual otherwise qualified or to limit, segregate or classify employees or applicants for employment in any way that would deprive or tend to deprive any individual of employment opportunities or otherwise adversely affect such individual's status as an employee because of the race, creed, color, sex, sexual orientation, gender identity, gender expression, genetic characteristics, marital status, religion, religious expression, national origin, ancestry, age, mental or physical disability, source of income, or immigration status unless otherwise required by law, of such individual or such individual's friends or associates; but with regard to mental or physical disability, it is not a discriminatory or unfair employment practice for a person to act as provided in this paragraph if there is no reasonable accommodation that such person can make with regard to the disability, the disability actually disqualifies the individual from the job, and the disability has a significant impact on the job;\n(2)\tShall refuse to list and properly classify for employment or refer an individual for employment in a known available job for which such individual is otherwise qualified because of the race, creed, color, sex, sexual orientation, gender identity, gender expression, genetic characteristics, marital status, religion, religious expression, national origin, ancestry, age, mental or physical disability, source of income, or immigration status unless otherwise required by law, of such individual or such individual's friends or associates or to comply with a request from an employer for referral of applicants for employment if the request indicates either directly or indirectly that the employer discriminates in employment on the basis of race, creed, color, sex, sexual orientation, gender identity, gender expression, genetic characteristics, marital status, religion, religious expression, national origin, ancestry, age, mental or physical disability, source of income, or immigration status unless otherwise required by law; but with regard to mental or physical disability, it is not a discriminatory or unfair employment practice for an employment agency to refuse to list and properly classify for employment or refuse to refer an individual for employment in a known available job for which such individual is otherwise qualified if there is no reasonable accommodation that the employer can make with regard to the disability, the disability actually disqualifies the individual from the job, and the disability has a significant impact on the job;\n(3)\tShall exclude or expel any individual otherwise qualified from full membership rights in a labor organization, otherwise discriminate against any members of such labor organization in the full enjoyment of work opportunity, or limit, segregate or classify its membership or applicants for membership, or classify or fail or refuse to refer for employment such individual in any way that deprives such individual of employment opportunities, limits employment opportunities or otherwise adversely affects such individual's status as an employee or applicant for employment because of the race, creed, color, sex, sexual orientation, gender identity, gender expression, genetic characteristics, marital status, religion, religious expression, national origin, ancestry, age, mental or physical disability, source of income, or immigration status unless otherwise required by law, of such individual or such individual's friends or associates;\n(4)\tShall print or circulate or cause to be printed or circulated any statement, advertisement or publication, or to use any form of application for employment or membership, or to make any inquiry in connection with prospective employment or membership that expresses, either directly or indirectly, any limitation, specification or discrimination on the basis of race, creed, color, sex, sexual orientation, gender identity, gender expression, genetic characteristics, marital status, religion, religious expression, national origin, ancestry, age, mental or physical disability, source of income, or immigration status unless otherwise required by law, or intent to make any such limitation, specification or discrimination, unless based upon a bona fide occupational qualification;\n(5)\tShall establish, announce or follow a policy of denying or limiting, through a quota system or otherwise, opportunities for employment or membership in a group on the basis of race, creed, color, sex, sexual orientation, gender identity, gender expression, genetic characteristics, marital status, religion, religious expression, national origin, ancestry, age, mental or physical disability, source of income, or immigration status unless otherwise required by law;\n(6)\tShall aid, abet, incite, compel or coerce the doing of any act defined in this section to be a discriminatory or unfair employment practice, obstruct or prevent any person from complying with the provisions of this section, or attempt, either directly or indirectly, to commit any act defined in this section to be a discriminatory or unfair employment practice;\n(7)\tThat is an employer, labor organization or joint labor-management committee controlling apprenticeship or other training or retraining, including on-the-job training programs shall discriminate against any individual on the basis of the race, creed, color, sex, sexual orientation, gender identity, gender expression, genetic characteristics, marital status, religion, religious expression, national origin, ancestry, age, mental or physical disability, source of income, or immigration status unless otherwise required by law, of such individual or such individual's friends or associates in admission to or employment in any program established to provide apprenticeship or other training; but with regard to mental or physical disability, it is not a discriminatory or unfair employment practice to withhold the right to be admitted to or to participate in any such program if there is no reasonable accommodation that can be made with regard to the disability, the disability actually disqualifies the individual from the program, and the disability has a significant impact on participation in the program;\n(8)\tShall use in the recruitment or hiring of individuals any employment agency, placement service, training school or center, labor organization or any other employee referral source known by such person to discriminate on the basis of race, creed, color, sex, sexual orientation, gender identity, gender expression, genetic characteristics, marital status, religion, religious expression, national origin, ancestry, age, mental or physical disability, source of income, or immigration status unless otherwise required by law;\n(9)\tShall use in recruitment, hiring, upgrading or promoting any test that such person knows or has reason to know tends to discriminate on the basis of race, creed, color, sex, sexual orientation, gender identity, gender expression, genetic characteristics, marital status, religion, religious expression, national origin, ancestry, age, mental or physical disability, source of income, or immigration status unless otherwise required by law; but it is not a discriminatory or unfair employment practice to provide employment opportunities for classes of individuals that have been the traditional targets of discrimination or to use a form or make a record or inquiry for the purpose of required government reporting, and with regard to mental or physical disability, it is not a discriminatory or unfair employment practice for a person to act as prohibited in this subsection if there is no reasonable accommodation that the employer can make with regard to the disability, the disability actually disqualifies the individual from the job, and the disability has a significant impact on the job; and\n(10)\tSeeking employment, shall publish or cause to be published an advertisement with a specification or limitation based upon race, creed, color, sex, sexual orientation, gender identity, gender expression, genetic characteristics, marital status, religion, religious expression, national origin, ancestry, age, mental or physical disability, source of income, or immigration status unless otherwise required by law, unless based upon a bona fide occupational qualification.\n(b)\tThe provisions of subsection (a) of this section do not apply to prohibit a religious organization or institution from restricting employment opportunities to persons of the religious denomination or persons of other defined characteristics and advertising such restriction if a bona fide religious purpose exists for the restriction.\n(c)\tThe provisions of subsection (a) of this section concerning discrimination based on marital status do not apply to the provision of employee health or disability insurance.\nOrdinance Nos. 5061 (1987); 5468 (1992); 7040 (2000); 8249 (2018); 8336 (2019); 8379 (2020)"
  },
  {
    "corpus": "BRC",
    "title": "12",
    "title_name": "Human Rights",
    "chapter": "1",
    "chapter_name": "Prohibition of Discrimination in Housing, Employment, and Public Accommodations",
    "anchor": "12-1-4",
    "heading": "Discrimination in Public Accommodations Prohibited.1",
    "verbatim": "12-1-4. Discrimination in Public Accommodations Prohibited.1\n(a)\tIt is a discriminatory practice, and no person shall:\n(1)\tRefuse, withhold from or deny to any individual because of the race, creed, color, sex, sexual orientation, gender identity, gender expression, genetic characteristics, marital status, religion, religious expression, national origin, ancestry, mental or physical disability, source of income or immigration status of such individual or such individual's friends or associates, the full and equal enjoyment of the goods, services, facilities, privileges, advantages or accommodations of a place of public accommodation;2 or\n(2)\tPublish, circulate, issue, display, post or mail any written or printed communication, notice or advertisement that indicates that the full and equal enjoyment of the goods, services, facilities, privileges, advantages or accommodations of a place of public accommodation will be refused, withheld from or denied an individual or that such individual's patronage or presence at a place of public accommodation is unwelcome, objectionable, unacceptable or undesirable because of the race, creed, color, sex, sexual orientation, gender identity, gender expression, genetic characteristics, marital status, religion, religious expression, national origin, ancestry, mental or physical disability, source of income or immigration status of such individual or such individual's friends or associates.\n(b)\tThe provisions of subsection (a) of this section do not apply to prohibit:\n(1)\tPersons from restricting admission to a place of public accommodation to individuals of one sex if such restriction bears a bona fide relationship to the goods, services, facilities, privileges, advantages or accommodations of such place of public accommodation;3 or\n(2)\tAny religious or denominational institution that is operated, supervised or controlled by a religious or denominational organization from limiting admission to persons of the same religion or denomination as will promote a bona fide religious or denominational purpose.\n(c)\tNotwithstanding any other provision of this chapter, individuals shall be allowed to use the gender-segregated facilities that are consistent with their gender identity. Gender-segregated facilities include, but are not limited to, restrooms, locker rooms, dressing rooms, and dormitories. In gender-segregated facilities where undressing in the presence of others occurs, individuals shall be entitled to reasonable accommodations to allow access consistent with an individual's gender identity.\nOrdinance Nos. 5061 (1987); 7040 (2000); 8249 (2018); 8336 (2019)\n1 See 42 U.S.C. § 2000a.\n2 § 24-34-601(1), C.R.S.\n3 § 24-34-601(3), C.R.S."
  },
  {
    "corpus": "BRC",
    "title": "12",
    "title_name": "Human Rights",
    "chapter": "1",
    "chapter_name": "Prohibition of Discrimination in Housing, Employment, and Public Accommodations",
    "anchor": "12-1-5",
    "heading": "Prohibition on Retaliation for and Obstruction of Compliance With Chapter.",
    "verbatim": "12-1-5. Prohibition on Retaliation for and Obstruction of Compliance With Chapter.\n(a)\tNo person shall use a threat, communicated by physical, oral or written means, of harm or injury to another person, such other person's reputation or such person's property, or discriminate against any person because such person has entered into a conciliation agreement under this chapter, because the final or any other ruling in any proceeding brought under this chapter has been in such other person's favor, because such other person has opposed a discriminatory practice, or because such other person has made a charge, filed a complaint, testified, assisted or participated in an investigation, proceeding or hearing before a person charged with the duty to investigate or hear complaints relating to problems of discrimination, but this section does not apply when the threat involves knowingly placing or attempting to place a person in fear of imminent bodily injury by use of a deadly weapon;\n(b)\tNo person shall willfully obstruct, hinder or interfere with the performance or the proper exercise of a duty, obligation, right or power of the city manager, the municipal court or other official or body charged with a duty, obligation, right or power under this chapter."
  },
  {
    "corpus": "BRC",
    "title": "12",
    "title_name": "Human Rights",
    "chapter": "1",
    "chapter_name": "Prohibition of Discrimination in Housing, Employment, and Public Accommodations",
    "anchor": "12-1-6",
    "heading": "Provisions of This Chapter Supplement Other Code Sections.",
    "verbatim": "12-1-6. Provisions of This Chapter Supplement Other Code Sections.\nAnything to the contrary notwithstanding, the substantive terms of this chapter and the remedies herein provided supplement those terms and remedies contained in this code and other ordinances of the city."
  },
  {
    "corpus": "BRC",
    "title": "12",
    "title_name": "Human Rights",
    "chapter": "1",
    "chapter_name": "Prohibition of Discrimination in Housing, Employment, and Public Accommodations",
    "anchor": "12-1-7",
    "heading": "City Manager May Appoint Person to Assist in Enforcement.",
    "verbatim": "12-1-7. City Manager May Appoint Person to Assist in Enforcement.\nThe city manager may appoint a person to carry out any or all of the duties, obligations, rights or powers under the provisions of this chapter, who may have such job title as the manager designates."
  },
  {
    "corpus": "BRC",
    "title": "12",
    "title_name": "Human Rights",
    "chapter": "1",
    "chapter_name": "Prohibition of Discrimination in Housing, Employment, and Public Accommodations",
    "anchor": "12-1-8",
    "heading": "Administration and Enforcement of Chapter.",
    "verbatim": "12-1-8. Administration and Enforcement of Chapter.\n(a)\tAny person claiming to be aggrieved by a violation of this chapter may file a written complaint under oath with the city manager:\n(1)\tWithin one year of any alleged violation of section 12-1-2, \"Discrimination in Housing Prohibited,\" B.R.C. 1981; within one hundred eighty days of any alleged violation of section 12-1-3, \"Discrimination in Employment Practices Prohibited,\" B.R.C. 1981; or within sixty days of any alleged violation of section 12-1-4, \"Discrimination in Public Accommodations Prohibited,\" B.R.C. 1981; and\n(2)\tThe complaint shall state:\n(A)\tThe name of the alleged violator, or facts sufficient to identify such person;\n(B)\tAn outline of the material facts upon which the complaint is based;\n(C)\tThe date of the alleged violation;\n(D)\tThat any conduct of the complainant was for the purpose of obtaining the housing, employment or public accommodation in question and not for the purpose of harassment or entrapment of the person against whom the complaint is made; and\n(E)\tThat a complaint concerning this same matter has not been filed with another agency or that any complaint concerning this matter filed with another agency has been dismissed by such agency without a final judgment on the merits.\n(b)\tThe city manager shall furnish a copy of the complaint to the person against whom the complaint is made.\n(c)\tBefore conducting a full investigation of the complaint, the city manager may attempt to negotiate a settlement of the dispute between the parties, if the manager deems that such an attempt is practicable.\n(d)\tIf the city manager does not deem it practicable to attempt a preinvestigation settlement or if such settlement attempt is unsuccessful, the manager shall conduct an investigation to determine whether there is probable cause to believe the allegations of the complaint.\n(1)\tIf the city manager determines there is no probable cause, the manager shall dismiss the complaint and take no further action thereon other than that of informing the concerned persons that the complaint has been dismissed.\n(2)\tIf the city manager determines that there is a sufficient basis in fact to support the complaint, the manager shall endeavor to eliminate the alleged violation by a conciliation agreement, signed by all parties and the manager, whereunder the alleged violation is eliminated and the complainant is made whole to the greatest extent practicable.\n(3)\tThe city manager shall furnish a copy of such signed conciliation agreement to the complainant and the person charged. The terms of a conciliation agreement may be made public, but no other information relating to any complaint, its investigation or its disposition may be disclosed without the consent of the complainant and the person charged.\n(4)\tA conciliation agreement need not contain a declaration or finding that a violation has in fact occurred.\n(5)\tA conciliation agreement may provide for dismissal of the complaint without prejudice.\n(e)\tIf a person who has filed a complaint with the city manager is dissatisfied with a decision by the manager to dismiss the complaint under paragraph (d)(1) of this section or if conciliation attempts as provided in paragraph (d)(2) of this section are unsuccessful to resolve the complaint, the aggrieved party may request a hearing before the City of Boulder Human Relations Commission, which shall hold a hearing on the appeal. If the commission finds violations of this chapter, it may issue such orders as it deems appropriate to remedy the violations, including, without limitation, orders:\n(1)\tRequiring the person found to have violated this chapter to cease and desist from the discriminatory practice;\n(2)\tProviding for the sale, exchange, lease, rental, assignment or sublease of housing to a particular person;\n(3)\tRequiring an employer to: reinstate an employee; pay backpay for discriminatory termination of employment, layoff or denial of promotion opportunity; make an offer of employment in case of discriminatory refusal of employment; make an offer of promotion in the case of discriminatory denial of promotion opportunity; or take other appropriate equitably remedial action;\n(4)\tRequiring that a person make available a facility of public accommodation in the case of discriminatory denial of the use of such facility;\n(5)\tRequiring that a person found to have violated this chapter report compliance with the order or orders issued pursuant to this section; and\n(6)\tRequiring that a person found to have violated any provisions of this chapter make, keep and make available to the commission such reasonable records as are relevant to determine whether such person is complying with the commission's orders.\n(f)\tNo person shall fail to comply with an order of the human relations commission.\n(g)\tThe city manager may initiate and file a complaint pursuant to this section based on the information and belief that a violation of this chapter has occurred. The manager may file such a complaint pursuant to the following standards:\n(1)\tThe manager has supervised any investigative testing used;\n(2)\tAny investigative testing is not designed to induce a person to behave in other than such person's usual manner; and\n(3)\tThe case is not brought for the purpose of harassment.\n(h)\tNo complaint shall be accepted against the City or a city-appointed agency unless there is no state or federal protection for the human rights violation set forth in the complaint.\nOrdinance Nos. 4879 (1985); 7040 (2000)"
  },
  {
    "corpus": "BRC",
    "title": "12",
    "title_name": "Human Rights",
    "chapter": "1",
    "chapter_name": "Prohibition of Discrimination in Housing, Employment, and Public Accommodations",
    "anchor": "12-1-9",
    "heading": "Judicial Enforcement of Chapter.",
    "verbatim": "12-1-9. Judicial Enforcement of Chapter.\n(a)\tThe city manager may file a criminal complaint in municipal court seeking the imposition of the criminal penalties provided in section 5-2-4, \"General Penalties,\" B.R.C. 1981, for violations of this chapter.\n(b)\tThe city manager may seek judicial enforcement of any orders of the human relations commission.\n(c)\tAny party aggrieved by any final action of the human relations commission may seek judicial review thereof in the District Court in and for the County of Boulder by filing a complaint pursuant to the Colorado Rules of Civil Procedure 106(a)(4).\nOrd. No. 7838 (2012)"
  },
  {
    "corpus": "BRC",
    "title": "12",
    "title_name": "Human Rights",
    "chapter": "1",
    "chapter_name": "Prohibition of Discrimination in Housing, Employment, and Public Accommodations",
    "anchor": "12-1-10",
    "heading": "City Contractors Shall Not Discriminate.",
    "verbatim": "12-1-10. City Contractors Shall Not Discriminate.\nThe city manager shall require that all contractors providing goods or services to the City certify their compliance with the provisions of this chapter."
  },
  {
    "corpus": "BRC",
    "title": "12",
    "title_name": "Human Rights",
    "chapter": "1",
    "chapter_name": "Prohibition of Discrimination in Housing, Employment, and Public Accommodations",
    "anchor": "12-1-11",
    "heading": "Authority to Adopt Rules.",
    "verbatim": "12-1-11. Authority to Adopt Rules.\nThe city manager and the human relations commission are authorized to adopt rules to implement the provisions of this chapter."
  },
  {
    "corpus": "BRC",
    "title": "12",
    "title_name": "Human Rights",
    "chapter": "1",
    "chapter_name": "Prohibition of Discrimination in Housing, Employment, and Public Accommodations",
    "anchor": "12-1-12",
    "heading": "Gender Identity in Sports.",
    "verbatim": "12-1-12. Gender Identity in Sports.\nSports organizations may segregate on the basis of sex, but such organizations shall allow transgender people to participate with the sex-segregated group that is consistent with their gender identity. It shall be an affirmative defense that the sports organization is, or is a member of, a statewide, national, or international organization with its own bona fide rules which prohibit such participation.\nOrdinance No. 8336 (2019)\nEditor's note(s)—Ord. No. 8336 (2019), § 5, adopted September 17, 2019, amended § 12-1-12 in its entirety to read as herein set out. Former § 12-1-12, pertained to gender variance exemptions, and derived from Ordinance No. 7040 (2000)."
  },
  {
    "corpus": "BRC",
    "title": "12",
    "title_name": "Human Rights",
    "chapter": "1",
    "chapter_name": "Prohibition of Discrimination in Housing, Employment, and Public Accommodations",
    "anchor": "12-1-13",
    "heading": "Elements of Proof.",
    "verbatim": "12-1-13. Elements of Proof.\nProof of the characteristics of the victim, while admissible to prove intent, and to determine reasonable accommodation for disabilities and for transgender individuals, shall not otherwise be required as an element of proof in and of itself. The essential elements of proof shall be of discriminatory intent and of a nexus between such intent and an action or refusal or failure to act identified in this chapter.\nOrdinance No. 7040 (2000); 8336 (2019)"
  },
  {
    "corpus": "BRC",
    "title": "12",
    "title_name": "Human Rights",
    "chapter": "1",
    "chapter_name": "Prohibition of Discrimination in Housing, Employment, and Public Accommodations",
    "anchor": "12-1-14",
    "heading": "Applicability of Chapter.",
    "verbatim": "12-1-14. Applicability of Chapter.\nThe requirements of this chapter supplement those imposed by the laws and regulations of the State of Colorado. If there is a conflict between such requirements, those which provide more protection for protected individuals shall control.\nOrdinance No. 8336 (2019)"
  },
  {
    "corpus": "BRC",
    "title": "12",
    "title_name": "Human Rights",
    "chapter": "1",
    "chapter_name": "Prohibition of Discrimination in Housing, Employment, and Public Accommodations",
    "anchor": "12-1-15",
    "heading": "Statute of Limitations.",
    "verbatim": "12-1-15. Statute of Limitations.\nThe statute of limitations within which a prosecution must be instituted for a violation of this Chapter 12-1 shall be tolled for one year from the date a complaint that complies with Section 12-1-8, \"Administration and Enforcement of Chapter,\" B.R.C. 1981, is filed.\nOrdinance No. 8336 (2019)"
  },
  {
    "corpus": "BRC",
    "title": "12",
    "title_name": "Human Rights",
    "chapter": "2",
    "chapter_name": "Landlord - Tenant Relations, Eviction Prevention and Rental Assistance Services",
    "anchor": "12-2-1",
    "heading": "Legislative Intent.",
    "verbatim": "12-2-1. Legislative Intent.\nThe purpose and intent of this chapter is to supplement the provisions of state law governing the rights and duties of landlords and tenants of residential property in the City, including without limitation the following:\n(a)\tRequirements related to the provision of leases to residential tenants;\n(b)\tDisclosure and other requirements that landlords are required to provide to residential tenants in leases;\n(c)\tRequirements related to the ownership of security deposits and payment of interest;\n(d)\tThe provision of legal representation and rental assistance to tenants in legal and administrative proceedings where such housing is imperiled;\n(e)\tDescribing the programs that can be used to provide rental assistance to persons that may be vulnerable to eviction;\n(f)\tDescribing the policy that Boulder tenants have a right to legal representation in eviction and administrative proceedings where they face the loss of housing;\n(g)\tSetting minimum standards for the City to provide representation to tenants to assist in the fair administration of justice;\n(h)\tSetting minimum standards for the administration of a rental assistance program to tenants faced with such proceedings;\n(i)\tImplementing the programs that are described in the ballot question approved by the voters in the November 3, 2020 election and further described in Ordinance 8412; and\n(j)\tEstablishing standards and criteria for the development of programs that are intended to provide assistance in all aspects and costs associated with the prevention of evictions, including the costs of dispute resolution and the costs of representing tenants that may face eviction.\nOrdinance Nos. 8412 (2020); 8462 (2021)"
  },
  {
    "corpus": "BRC",
    "title": "12",
    "title_name": "Human Rights",
    "chapter": "2",
    "chapter_name": "Landlord - Tenant Relations, Eviction Prevention and Rental Assistance Services",
    "anchor": "12-2-2",
    "heading": "Definitions.",
    "verbatim": "12-2-2. Definitions.\nThe following terms used in this chapter have the following meanings unless the context clearly indicates otherwise:\nBank means a bank, credit union or similar institution that accepts deposits of money and insures such funds through the Federal Deposit Insurance Corporation, the National Credit Union Association or similar institution.\nCovered proceeding means legal proceedings to evict a tenant from their place of residence pursuant to C.R.S. 13-40-101 et seq., counterclaims related thereto, the termination of Section 8 housing assistance, any related proceeding to assist a tenant to remain housed, and appeals arising from any of the foregoing.\nInterest means simple interest on the full amount of the security deposit on deposit.\nLegal representation means full scope representation provided by a licensed attorney to a tenant in a covered proceeding. This includes, but is not limited to, filing responsive pleadings, appearing on behalf of the tenant in court, administrative proceedings, or alternative dispute resolution, and providing legal advice, advocacy, and assistance associated with such matters, and necessary fees and costs related thereto.\nSecurity deposit means any advance or deposit of money, regardless of its denomination, the primary function of which is to secure the performance of a rental agreement for residential premises or any part thereof.\nTenant means any occupant of residential property, including but not limited to, any building, structure, vacant land, or part thereof offered for lease or rent for residential purposes, who is a respondent or defendant, or who has legal standing to be a respondent or defendant, in a covered proceeding.\nOrdinance Nos. 7320 (2004); 8412 (2020); 8462 (2021)"
  },
  {
    "corpus": "BRC",
    "title": "12",
    "title_name": "Human Rights",
    "chapter": "2",
    "chapter_name": "Landlord - Tenant Relations, Eviction Prevention and Rental Assistance Services",
    "anchor": "12-2-3",
    "heading": "Leases to be Provided.",
    "verbatim": "12-2-3. Leases to be Provided.\nAny person renting residential property for thirty days or more shall enter into a written lease relating to such rental within thirty days of the commencement of such rental, and the lessor shall provide a copy of such lease to each lessee thereof within seven working days of final execution of the lease or within fifteen working days of the signature thereof by any lessee, whichever is sooner. Prior to issuance of a summons and complaint under this section, the complaining witness or a peace officer of the City must first request a copy of the lease, and the person renting the residential property shall have five working days from the date of mailing or personal delivery of such request to provide a copy of the lease.\nOrdinance No. 4969 (1986)"
  },
  {
    "corpus": "BRC",
    "title": "12",
    "title_name": "Human Rights",
    "chapter": "2",
    "chapter_name": "Landlord - Tenant Relations, Eviction Prevention and Rental Assistance Services",
    "anchor": "12-2-4",
    "heading": "Written Disclosures Required.",
    "verbatim": "12-2-4. Written Disclosures Required.\n(a)\tNo operator shall allow any person to occupy a rental property as a tenant or lessee or otherwise for valuable consideration unless and until that operator has satisfied each of the following conditions:\n(1)\tThe operator has executed and provided to the tenant a copy of a written lease, rental agreement, set of site rules or other written instrument containing the following information:\n(A)\tThe maximum occupancy levels permitted in the rental unit;\n(B)\tNotice of the provisions contained in Sections 5-3-11, \"Nuisance Party Prohibited,\" 5-6-6, \"Fireworks,\" 5-4-12, \"Depositing Trash on Property in Violation of Sign,\" and 5-4-16, \"Outdoor Furniture Restrictions,\" and Chapter 5-9, \"Noise,\" B.R.C. 1981;\n(C)\tNotice of the provisions contained in Sections 6-2-3, \"Growth or Accumulation of Weeds Prohibited,\" 6-3-3, \"Trash Accumulation Prohibited,\" 6-3-12, \"Bear-Resistant Containers Required,\" and 8-2-13, \"Duty to Keep Sidewalks Clear of Snow,\" B.R.C. 1981; Section 6-3-3(b), relating to the responsibility of every owner, manager or operator of rental property to maintain a valid contract with a commercial trash hauler providing for the removal of accumulated trash from the property, and Paragraph 7-6-13(a)(1), B.R.C. 1981, concerning parking prohibited on sidewalks;\n(D)\tThe names of those individuals permitted, pursuant to the tenancy agreement, to occupy the rental unit;\n(E)\tNotification to tenants that violation of the city's noise regulation requirements or residency within the rental unit of persons other than those lawfully occupying the unit pursuant to the tenancy agreement is cause for the termination of the tenancy;\n(F)\tNotification that interest must be paid to tenants upon any security deposit collected pursuant to the provisions of Sections 12-2-2, \"Definitions,\" and 12-2-7, \"Interest Rate On Security Deposits,\" B.R.C. 1981;\n(G)\tNotification to tenants of the date and nature of any violations of law during the preceding twenty-four months for which the owner, manager or operator has received written notice of violation pursuant to Section 10-2.5-6, \"Required Procedures Prior to Commencement of Public Nuisance Action,\" B.R.C. 1981;\n(H)\tNotification of the provisions contained in Section 5-10-6, \"Marijuana Odor Emissions,\" and Paragraphs 6-14-13(a)(6) and 6-16-13(a)(4), B.R.C. 1981, prohibiting possession of more than six marijuana plants without a license; and\n(I)\tNotification to tenants of their right to legal representation and the availability of rental assistance provided in Section 12-2-9(a), B.R.C. 1981, including a complete copy of the text of that section, with the use of the language in the form created, this section being mandatory.\n(b)\tThe city manager shall approve a form that, if fully executed, will satisfy the requirements of subsection (a) of this section. Use of the approved form shall not be mandatory and individual operators may utilize other writings in lieu of such form so long as those writings satisfy the requirements of subsection (a) of this section.\n(c)\tNo operator shall allow any person to occupy a rental property as a tenant or lessee or otherwise for valuable consideration unless and until that operator has established and maintained an accurate listing of the identities of each of the persons who are authorized to reside in the subject rental unit.\n(d)\tThe maximum penalty for any violation or violations of this section that are charged as part of a single court proceeding shall be $500.\n(e)\tThe requirements of paragraph (a)(1) are not intended to change the legal rights of any operator, tenant or lessee other than the obligation of operators to provide the written disclosure required by this section.\nOrdinance Nos. 7158 (2002); 7320 (2004); 7515 (2007); 7659 (2009); 7685 (2009); 8122 (2016); 8412 (2020)"
  },
  {
    "corpus": "BRC",
    "title": "12",
    "title_name": "Human Rights",
    "chapter": "2",
    "chapter_name": "Landlord - Tenant Relations, Eviction Prevention and Rental Assistance Services",
    "anchor": "12-2-5",
    "heading": "Ownership of Security Deposit and Payment of Interest.",
    "verbatim": "12-2-5. Ownership of Security Deposit and Payment of Interest.\nAny security deposit for residential property subject to regulation under state law shall be and remain the sole property of the tenant advancing same, and such security deposit plus interest shall not be retained by the person having custody of it after the termination of the tenancy except for actual cause, pursuant to the provisions of state law dealing with retention of security deposits. This section does not create a fiduciary relationship between the parties, but creates a duty to account for interest upon the termination of the tenancy.\nOrdinance No. 7158 (2002)"
  },
  {
    "corpus": "BRC",
    "title": "12",
    "title_name": "Human Rights",
    "chapter": "2",
    "chapter_name": "Landlord - Tenant Relations, Eviction Prevention and Rental Assistance Services",
    "anchor": "12-2-6",
    "heading": "Return of Accrued Interest - Enforcement.",
    "verbatim": "12-2-6. Return of Accrued Interest - Enforcement.\n(a)\tNo person having custody of a security deposit for residential property shall fail to return accrued interest on the security deposit within one month after termination of the lease or surrender and acceptance of the premises, whichever occurs last, and according to the provisions of state law concerning the return of the related security deposit, notice of any deductions therefrom, and the legality of such deductions. Any additional accrued interest shall be returned at the time of the return of the related security deposit, subject to the same provisions of state law.\n(b)\tFailure of any person having custody of a security deposit to provide the same notice required by state law for the retention of a security deposit with respect to the interest thereon shall work a forfeiture of such person's right to withhold any portion of the interest.\n(c)\tThe willful and wrongful retention of interest on a security deposit in violation of this chapter shall render the person having custody of the security deposit liable to the tenant for $100 or treble the amount so retained, whichever is greater, together with reasonable attorneys' fees and court costs; except that the tenant has the obligation to give notice to such persons of the tenant's intention to file legal proceedings a minimum of seven days prior to filing the action.\n(d)\tIn any court action brought by a tenant under this chapter, the person having custody of the security deposit shall bear the burden of proving that retention of the interest on a security deposit or any portion thereof was not in violation of this chapter.\n(e)\tNothing in this chapter shall preclude a tenant from filing a claim under part 1, article 12, title 38, C.R.S., and a claim under this chapter in the same lawsuit.\n(f)\tThis section and Section 12-2-5, \"Ownership of Security Deposit and Payment of Interest,\" B.R.C. 1981, do not apply to any security deposit paid to a mobile home park on account of the lease of a mobile home space.\nOrdinance Nos. 4969 (1986); 7158 (2002)"
  },
  {
    "corpus": "BRC",
    "title": "12",
    "title_name": "Human Rights",
    "chapter": "2",
    "chapter_name": "Landlord - Tenant Relations, Eviction Prevention and Rental Assistance Services",
    "anchor": "12-2-7",
    "heading": "Interest Rate on Security Deposits.",
    "verbatim": "12-2-7. Interest Rate on Security Deposits.\n(a)\tThe rate of interest to be paid upon the refund of security deposits shall be determined by the manager by averaging the interest rates being paid on one-year certificates of deposit by three banks doing business within the city that, in the view of the manager, provide indicia of being significant participants in the local banking industry. This average interest rate will be calculated as of December 15 of each year or, if that date falls on a weekend or holiday, on the first business day thereafter. The manager's determination of the rate shall be final. The rate shall be published in a newspaper of general circulation or posted on a city internet site that is accessible to members of the general public. The average interest rate so determined shall be rounded no more than two places to the right of the decimal point. It shall become the rate of interest paid on any security deposit that is provided to a landlord during the calendar year starting on January 1 of the year immediately following the date of the manager's determination.\n(b)\tFor the year 2004, the rate of interest shall be determined by the manager using the method set forth in subsection (a) of this section, within ten days of March 19, 2004. Within three days of that determination, the interest rate so determined shall be published or posted and shall, thereafter, apply to any security deposit provided to a landlord as a consequence of a lease or rental agreement that is entered into after the date on which the manager's determination is published or posted. In every subsequent year, the manager's determination shall be made pursuant to the provisions of subsection (a) of this section.\n(c)\tInterest on security deposits for multi-year tenancies shall be calculated separately each year of tenancy in the manner provided in this section. The manager shall retain and make available a list of all prior year interest rates and shall provide a standard formula for the calculation of interest rates on multi-year tenancies.\n(d)\tPayments of interest on security deposits made pursuant to lease or rental agreements entered into prior to March 19, 2004, shall be paid at the rate of five and one-half percent per annum simple interest on the full amount of the security deposit.\nOrdinance No. 7320 (2004)"
  },
  {
    "corpus": "BRC",
    "title": "12",
    "title_name": "Human Rights",
    "chapter": "2",
    "chapter_name": "Landlord - Tenant Relations, Eviction Prevention and Rental Assistance Services",
    "anchor": "12-2-8",
    "heading": "Waiver Void.",
    "verbatim": "12-2-8. Waiver Void.\nAny provision, whether oral or written, in or pertaining to a rental agreement whereby any provision of this chapter is waived shall deemed to be against public policy and shall be void.\nOrdinance Nos. 7158 (2002); 7320 (2004)\n12-2-9 Eviction Prevention and Rental Assistance Services.\n(a)\tProvision of Legal Representation and Rental Assistance. The City of Boulder shall establish, run, and fully fund a program to provide legal representation and/or rental assistance for all tenants within the city who face a covered proceeding.\n(1)\tThis legal representation is available to a tenant threatened with an action that may result in an eviction or a notice to quit, demand for compliance, or demand for possession pursuant to C.R.S. § 13-40-101, et seq., C.R.S. § 38-12-202, et. seq. or a notice of termination of Section 8 housing assistance, and shall last at least until such time as the notice to quit, demand for possession, or unlawful detainer complaint is withdrawn, the case is dismissed, a final judgment in the matter is entered, or the Section 8 housing assistance termination proceedings are concluded. The legal representation may also include an action to suppress records of a prior eviction proceeding. The city manager may adopt criteria and standards related to the screening of clients, or otherwise, to provide legal representation in order to implement the requirements of this chapter.\n(2)\tWritten notification of this right to legal representation and how to access it must be provided by the landlord to a tenant along with the notice to quit or demand for compliance or possession pursuant to C.R.S. § 13-40-101, et seq., C.R.S. § 38-12-202, et. seq. or a notice of termination of Section 8 housing assistance. The notice must be in the same form as required by Section 12-2-4(a)(1)(I), B.R.C. 1981.\n(b)\tImplementation. The city manager shall promptly take all necessary steps to fully implement the provisions of this section as soon as practicable, but not more than twelve months after the effective date of this chapter. The City shall have no obligation to provide legal services under this section where a state or federal program provides full scope legal representation to a tenant facing eviction proceedings as a matter of right.\n(c)\tTenants' Committee. A tenants' committee is created to ensure that the legislative intent of this section is fulfilled. Specifically, the tenants' committee will advise the legal services and assistance coordinator and the legal service providers engaged to provide the services and administer the rental assistance program provided for herein, and will advise the city manager on its opinion of the merit and fitness of the tenants' legal services and assistance coordinator for the purpose of informing and guiding the city manager in appointing and retaining the tenants' legal services and assistance coordinator. The tenants' committee shall consist of five members who are tenants in the City of Boulder and do not own real property. The City shall endeavor to ensure that the committee membership is reflective of the racial, gender, and sexual orientation of the City's tenants. Committee members shall be disqualified and replaced as soon as practicable in the event that they cease to be qualified to serve on the committee. Committee members are to be paid a stipend of $1,000 per year to be adjusted annually for inflation. The city manager's office and city attorney's office shall provide staff support to the committee and tenants' legal services and assistance coordinator.\n(d)\tTenants' Legal Services and Assistance Coordinator. The tenants' legal services and assistance coordinator shall serve at the pleasure of the city manager and can be selected from the City of Boulder's internal staff. The tenants' legal services and assistance coordinator shall be responsible for contracting with and supervising legal service providers, including but not limited to non-profits, private law firms, and private attorneys, to ensure the provision of the legal representation provided for herein and the day-to-day responsibilities related thereto. The tenants' legal services and assistance coordinator shall also be responsible for administering a rental assistance program for tenants involved in a covered proceeding. The tenants' legal services and assistance coordinator may partner with non-profit organizations to facilitate the rental assistance program as well if it serves the purpose of maximizing the efficacy and reach of the rental assistance program. The tenants' legal services and assistance coordinator shall make its best efforts to allocate and facilitate the provision of legal representation and/or rental assistance to tenants in covered proceedings to maximize the housing security of said tenants. The tenants' legal services and assistance coordinator shall keep the tenants' committee informed as to its fulfilment of its responsibilities and shall be responsive to requests for information and inquiries from the tenants' committee.\n(e)\tReporting. No later than September 1, 2021 and annually by each September 1 thereafter, the tenants' legal service and assistance coordinator shall submit to the mayor, and city manager, and post online, a review of the program established pursuant to this section and information regarding its implementation, to the extent such information is available, including, but not limited to:\n(1)\tThe estimated number of individuals who experienced a covered proceeding;\n(2)\tThe number of individuals who received legal representation and/or rental assistance disaggregated by the following characteristics of such individuals:\n(A)\tPostal code of residence;\n(B)\tAge of head of household;\n(C)\tHousehold size;\n(D)\tEstimated length of tenancy;\n(E)\tApproximate household income;\n(F)\tReceipt of ongoing public assistance at the time such legal services were initiated;\n(G)\tTenancy in rent-regulated housing; and\n(H)\tTenancy in housing operated by the Boulder City Housing Authority.\n(3)\tOutcomes immediately following the provision of full legal representation, as applicable and available, including, but not limited to, the number of:\n(A)\tCase dispositions where a case was dismissed or was otherwise decided substantially in favor of the tenant;\n(B)\tCase dispositions where judgment for possession in favor of landlord was entered;\n(C)\tCase dispositions where a stipulation agreement, or other similar agreement, was made preventing the entry of judgment for possession;\n(D)\tCase dispositions where a stipulation agreement, or other similar agreement, was made providing a tenant with an opportunity to vacate a judgement for possession at a later date;\n(E)\tCase dispositions where a tenant was required to vacate a residence, but was provided additional time to vacate and, in such cases, the amount of additional time provided to such tenants;\n(F)\tCase dispositions that otherwise resulted in a tenant vacating a residence prior to the end of their lease term; and\n(G)\tInstances where the attorney was discharged or withdrew.\n(4)\tOrders for possession filed in county court, writs of restitution issued in county court in forcible entry and detainer proceedings, and residential evictions conducted by the county sheriff.\n(f)\tFunding. The spending obligations required by this section are to be funded through the no eviction without representation by the tax levied pursuant to Chapter 3-20 \"Rental License Excise Tax,\" B.R.C. 1981.\n(g)\tAmendment and Rulemaking. The Boulder City Council may amend this section, and the city manager may supplement the provisions of this section through rulemaking, if such amendment or rulemaking serves the purpose of ensuring and effectuating the provision of legal representation and/or rental assistance to tenants faced with legal proceedings imperiling their homes.\n(h)\tSeverability. If any provision of this section or any application thereof to any person or circumstance is held invalid, such invalidity shall not affect any provision or application of this section that can be given effect without the invalid provision or application. To this end, the provisions of this section are severable.\nOrdinance Nos. 8412 (2020); 8452 (2021); 8462 (2021)"
  },
  {
    "corpus": "BRC",
    "title": "12",
    "title_name": "Human Rights",
    "chapter": "3",
    "chapter_name": "Drug Testing",
    "anchor": "12-3-1",
    "heading": "Definitions.",
    "verbatim": "12-3-1. Definitions.\nThe following terms used in this chapter have the following meanings unless the context clearly indicates otherwise:\nCommercial vehicle means any vehicle which meets the definition set forth in the Colorado Department of Public Safety Minimum Standards for the Operation of Commercial Vehicles.\nEmployee means a person treated as an employee for purposes of federal income tax withholding: a) who is assigned or anticipated to be assigned to an immediate supervisor located in the city and does not have a principal out of home office located outside of the city, or b) who is assigned or anticipated to be assigned more than thirty-three percent of the time on the job for a period of more than three months to a job located in the city.\nEmployer means a person who pays wages or salary to an employee, an agent of such a person or a person in a position of authority over an employee.\nOrdinance No. 5688 (1994)"
  },
  {
    "corpus": "BRC",
    "title": "12",
    "title_name": "Human Rights",
    "chapter": "3",
    "chapter_name": "Drug Testing",
    "anchor": "12-3-2",
    "heading": "Post-Employment Drug Testing Requirements.",
    "verbatim": "12-3-2. Post-Employment Drug Testing Requirements.\nExcept as provided in Section 12-3-4, \"Exemptions,\" B.R.C. 1981, no employer shall request or require from an employee any urine, blood or other bodily fluid or tissue test for any drug or alcohol or determine an employee's eligibility for promotion, additional compensation, transfer, disciplinary or other personnel action, or the receipt of any benefit, based in whole or in part on the result of such test, unless all of the following conditions are met:\n(a)\tAt the time of the request or requirement, the employer has individualized reasonable suspicion, based on specific, objective, clearly expressed facts, to believe that the employee is under the influence of a drug or alcohol on the job, or his or her job performance is currently adversely affected by use of a drug or alcohol, or the employee has agreed to the test as a part of an employee assistance program after a finding or admission of prior drug or alcohol abuse;\n(b)\tPrior to the administration of any drug or alcohol test, the employer adopts a written testing policy and makes it available to all employees. But a copy need not be provided directly to each employee, so long as a copy is made available freely for inspection by employees at any reasonable time during working hours, without personal identification of the employees. Such testing policy must, as a minimum, set forth all of the following information:\n(1)\tThe employees subject to testing under the policy;\n(2)\tThe circumstances under which drug or alcohol testing may be requested or required;\n(3)\tThe right of an employee to refuse to undergo drug or alcohol testing and the consequence of refusal;\n(4)\tAny disciplinary or other personnel action that may be taken based on a confirmatory test verifying a positive test result on an initial screening test;\n(5)\tThe right of an employee to obtain, immediately upon request to the employer's custodian thereof, a copy of all records maintained of his or her initial positive confirmatory test results, and to submit written information explaining any such results;\n(6)\tAny other appeal procedure available; and\n(7)\tA copy of this chapter;\n(c)\tThe collection of any urine specimen is accomplished without direct observation of the genitals by any person other than the employee being tested;\n(d)\tA sufficient specimen is collected to perform two tests, and the one untested specimen is maintained until a negative test result is obtained, or, in case of a positive result, for a period of not less than one year following the date on which the specimen is collected;\n(e)\tNo portion of any specimen is tested for pregnancy, and except for pre-employment physicals, no portion of any specimen is examined for evidence of any other medical condition, other than for the presence of alcohol or drugs;\n(f)\tThe collection, storage and transportation of the specimen is accomplished in tamper-proof containers;\n(g)\tChain-of-custody documentation identifies how the specimen was handled, stored and tested, at all times;\n(h)\tPositive test results are confirmed by means of gas chromatography/mass spectrometry or an alternate method of equal or greater sensitivity and accuracy;\n(i)\tThe employer permits the employee, at the employee's request and expense, to contract with a laboratory meeting the National Institute of Drug Abuse Standards to have a second confirmatory test performed on an untested portion of the original specimen, subject to the same chain-of-custody assurances provided for the original test; and\n(j)\tThe release of the test results is prohibited, except as authorized by the person tested, or to those employees of the employer with reasonable business need to know, or as required by a court of law.\nOrdinance No. 5688 (1994)"
  },
  {
    "corpus": "BRC",
    "title": "12",
    "title_name": "Human Rights",
    "chapter": "3",
    "chapter_name": "Drug Testing",
    "anchor": "12-3-3",
    "heading": "Job Applicant Drug Testing Requirements.",
    "verbatim": "12-3-3. Job Applicant Drug Testing Requirements.\nExcept as provided in Section 12-3-4, \"Exemptions,\" B.R.C. 1981, no employer shall conduct a drug or alcohol test as part of a pre-employment screening or pre-employment physical except under the following circumstances:\n(a)\tThe employer includes notice that a drug or alcohol test will be part of the pre-employment screening process or pre-employment physical in the application for employment, or if no application form is required, in all advertisements soliciting applicants for employment, and all applicants for employment are personally informed of the requirement for a drug or alcohol test at the first formal interview;\n(b)\tThe drug or alcohol test is required only of Colorado residents who are the single finalist for the position or out-of-state resident finalists for the position who come to Colorado for an interview, if the same test is required of all finalists for that position; and\n(c)\tSubsections 12-3-2(b) through (j), B.R.C. 1981, are complied with concerning job applicants as well as employees.\nOrdinance Nos. 5271 (1990); 5688 (1994)"
  },
  {
    "corpus": "BRC",
    "title": "12",
    "title_name": "Human Rights",
    "chapter": "3",
    "chapter_name": "Drug Testing",
    "anchor": "12-3-4",
    "heading": "Exemptions.",
    "verbatim": "12-3-4. Exemptions.\nThe following are exempt from this chapter:\n(1)\tUnited States government;\n(2)\tColorado state government;\n(3)\tThe University of Colorado;\n(4)\tBoulder County government;\n(5)\tBoulder Valley School District; and\n(6)\tTesting of an employee operating a commercial vehicle weighing over twenty six thousand pounds and for which a Commercial Driver's License is required, or which transports sixteen or more passengers, including the driver, under the Controlled Substances Testing Provisions set forth in the U.S. Department of Transportation regulations for commercial vehicles.\nOrdinance No. 5688 (1994)"
  },
  {
    "corpus": "BRC",
    "title": "12",
    "title_name": "Human Rights",
    "chapter": "3",
    "chapter_name": "Drug Testing",
    "anchor": "12-3-5",
    "heading": "Employers' Rights.",
    "verbatim": "12-3-5. Employers' Rights.\n(a)\tNothing in this chapter restricts an employer's ability to prohibit the use of, possession of or trafficking in, illegal drugs during work hours, or restricts an employer's ability to discipline an employee for being under the influence of, using, possessing or trafficking in, illegal drugs during work hours or on the employer's premises. Nothing in this chapter restricts an employer's ability to prohibit the use of alcohol during work hours, or restricts an employer's ability to discipline an employee for being under the influence of alcohol during work hours or on the employer's premises.\n(b)\tNothing in this chapter prevents an employer from conducting routine medical examinations of employees or medical screening in order to monitor exposure to toxic or other unhealthy substances encountered in the work place or in the performance of an employee's job responsibilities. But no employer shall extend medical screening beyond the specific substance being monitored, and any inadvertently obtained information concerning drug or alcohol use shall be maintained in confidence in the medical record and not disclosed to any employer. No employer shall use any such evidence to determine promotion, additional compensation, transfer, termination, disciplinary or other personnel action or the receipt of any benefit.\n(c)\tIt is an affirmative defense that a person was required to conduct drug or alcohol testing or take disciplinary action against an employee based on such testing in order to comply with a statute or regulation of the United States or the State of Colorado or any of their agencies or any agency interpretation of such statute or regulation. It is a specific defense that a person, based on specific, objective, clearly expressed facts, was reasonably required to conduct such testing or take such action in order to compete effectively to obtain a contract with the United States or the State of Colorado or any of their agencies.\nOrdinance No. 5688 (1994)"
  },
  {
    "corpus": "BRC",
    "title": "12",
    "title_name": "Human Rights",
    "chapter": "3",
    "chapter_name": "Drug Testing",
    "anchor": "12-3-6",
    "heading": "Enforcement.",
    "verbatim": "12-3-6. Enforcement.\n(a)\tThe penalty for violation of any provision of this chapter is a fine of not more than $1,000.00 per violation. In addition, upon conviction of any person for violation of this chapter, the court may issue a cease and desist order and any other orders reasonably calculated to remedy the violation. Violation of any order of the court under this section is a violation of this section and is punishable by a fine of not more than $2,000.00 per violation, or incarceration for not more than ninety days in jail, or both such fine and incarceration.\n(b)\tAny person who commits or proposes to commit an act in violation of this chapter also may be enjoined therefrom by the municipal court or by any other court of competent jurisdiction.\n(c)\tAn action for injunctive relief under this chapter may be brought by the city attorney, upon ascertaining that a violation is likely to occur. Nothing in this chapter shall be construed to create a private right of action for damages.\nOrdinance No. 5639 (1994)"
  },
  {
    "corpus": "BRC",
    "title": "12",
    "title_name": "Human Rights",
    "chapter": "4",
    "chapter_name": "Domestic Partners",
    "anchor": "12-4-1",
    "heading": "Purpose.",
    "verbatim": "12-4-1. Purpose.\nThe city values the dignity and worth of all people and is committed to promoting justice, equity and inclusiveness. The city finds that domestic partnerships exist in many different forms, including unmarried couples in either same or opposite sex relationships who are living together. In order to promote equal respect and fair treatment and to protect the public health safety and welfare, it is the policy of the city to allow any two unrelated adults in a committed relationship who meet the domestic partnership criteria to register with the city and to obtain a certificate attesting to their status or to receive a certificate documenting their status but not be formally registered in the city's domestic partnership registry."
  },
  {
    "corpus": "BRC",
    "title": "12",
    "title_name": "Human Rights",
    "chapter": "4",
    "chapter_name": "Domestic Partners",
    "anchor": "12-4-2",
    "heading": "Definitions.",
    "verbatim": "12-4-2. Definitions.\nThe following terms used in this chapter have the following meanings unless the context clearly indicates otherwise:\nCommon household means a place where both domestic partners reside. The legal right to occupy the common household need not be joint.\nMarriage, as used in this chapter, shall mean a marriage as defined in § 14-2-104, C.R.S."
  },
  {
    "corpus": "BRC",
    "title": "12",
    "title_name": "Human Rights",
    "chapter": "4",
    "chapter_name": "Domestic Partners",
    "anchor": "12-4-3",
    "heading": "Requirements for Domestic Partnerships.",
    "verbatim": "12-4-3. Requirements for Domestic Partnerships.\n(a)\tIn addition to freely declaring that both persons entering a domestic partnership are each other's sole domestic partner, an individual must:\n(1)\tBe an unmarried person eighteen years of age or older and competent to contract;\n(2)\tNot have been prohibited from marrying his or her domestic partner under the law of this state by reason of a blood relationship to the domestic partner or by reason of adoption;\n(3)\tShare a \"common household\", as defined herein, with his or her domestic partner;\n(4)\tNot have a different domestic partner under the provisions of this chapter or any other comparable domestic partnership provision;\n(5)\tExecute, with his or her domestic partner, a certificate of domestic partnership, attesting to the foregoing requirements and that the parties are in a relationship of mutual support, caring and commitment with the present intention to remain in that relationship; and\n(6)\tNot have terminated the domestic partnership.\n(b)\tNo person shall make any misrepresentations in order to obtain a certificate of domestic partnership nor shall any person make any misrepresentations in connection with the process of the registration of a domestic partnership."
  },
  {
    "corpus": "BRC",
    "title": "12",
    "title_name": "Human Rights",
    "chapter": "4",
    "chapter_name": "Domestic Partners",
    "anchor": "12-4-4",
    "heading": "Creation and Termination of Domestic Partnerships.",
    "verbatim": "12-4-4. Creation and Termination of Domestic Partnerships.\n(a)\tCreation: A domestic partnership is established when both parties execute a certificate of domestic partnership, attesting to the foregoing facts of section 12-4-3, \"Requirements For Domestic Partnerships,\" B.R.C. 1981, before the city manager.\n(b)\tTermination: A domestic partnership ends when either of the domestic partners dies, marries or executes a certificate of termination, stating that one or more of the criteria listed in subsection (a) of this section no longer apply, subject to the following conditions:\n(1)\tThe domestic partnership shall terminate as of the date of the death or marriage of either partner, or as of the date of executing the certificate of termination; and,\n(2)\tIn the event that only one of the partners executes the certificate of termination, then that partner shall, in such certificate, attest to the fact that he or she has sent a copy of the certificate of termination to the other partner at the other partner's last known address, registered mail, return receipt requested.\n(c)\tCertification of Creation and Termination: To be effective, certificates of domestic partnership and certificates of termination must be certified by the city manager. Certificates of domestic partnership and certificates of termination may be filed with the city manager. The city manager shall assess a fee for certifying such certificates, and provide one certified copy to one or both of the parties.\n(d)\tPrior Registry: Domestic partnerships declared under the City of Boulder's prior domestic registry may be terminated under the provisions of this section.\n(e)\tSubsequent Domestic Partnerships: No person shall enter into a domestic partnership after termination until at least ninety days after the termination of any such prior domestic partnership.\n(f)\tFee: An applicant for a certificate documenting the creation or termination of a domestic partnership shall pay the fee in section 4-20-59, \"Domestic Partnership Registration Fees,\" B.R.C. 1981.\n(g)\tAdministration: The city manager may make available forms for creating and terminating domestic partnerships, which forms shall meet all requirements for registering a domestic partnership pursuant to this chapter. In addition to meeting the foregoing requirements of this chapter, any forms provided by the city manager shall include a statement that under current law registering a domestic partnership under the provisions of this chapter does not alter the parties' contract or property rights."
  },
  {
    "corpus": "BRC",
    "title": "12",
    "title_name": "Human Rights",
    "chapter": "4",
    "chapter_name": "Domestic Partners",
    "anchor": "12-4-5",
    "heading": "Recognition of Domestic Partnerships Registered in Previous Registry and Other Jurisdictions.",
    "verbatim": "12-4-5. Recognition of Domestic Partnerships Registered in Previous Registry and Other Jurisdictions.\nFor the purposes of this chapter, the city recognizes the domestic partnerships that are:\n(a)\tPrior Registry: Registered under the City of Boulder's prior domestic registry;\n(b)\tGovernmentally Sanctioned: Are governmentally sanctioned civil unions or same sex marriages; or\n(c)\tDomestic Partnerships of Other Jurisdictions: Publicly documented and created under other laws of other jurisdictions that meet requirements that are similar to the requirements of section 12-4-3, \"Requirements For Domestic Partnerships,\" B.R.C. 1981."
  },
  {
    "corpus": "BRC",
    "title": "12",
    "title_name": "Human Rights",
    "chapter": "4",
    "chapter_name": "Domestic Partners",
    "anchor": "12-4-6",
    "heading": "Private Registry of Domestic Partnerships.",
    "verbatim": "12-4-6. Private Registry of Domestic Partnerships.\nNothing contained in this chapter shall be construed to prevent the city manager to continue the practice of allowing private registration of domestic partnership between two individuals. However, any privileges granted by the registration pursuant to section 12-4-4, \"Creation and Termination of Domestic Partnerships,\" B.R.C. 1981, shall accrue to such privately registered domestic partnerships upon the presentation of such private registration certified by the city manager."
  },
  {
    "corpus": "BRC",
    "title": "12",
    "title_name": "Human Rights",
    "chapter": "4",
    "chapter_name": "Domestic Partners",
    "anchor": "12-4-7",
    "heading": "Rules and Rulemaking.",
    "verbatim": "12-4-7. Rules and Rulemaking.\n(a)\tRulemaking Authority: The city manager may promulgate such rule as the manager considers necessary to implement and enforce this chapter. All such rules shall be adopted in accordance with the procedures set forth in chapter 1-4, \"Rulemaking,\" B.R.C. 1981.\n(b)\tViolation of Rules Prohibited: No person shall violate any rule issued by the city manager under this section."
  },
  {
    "corpus": "BRC",
    "title": "12",
    "title_name": "Human Rights",
    "chapter": "12",
    "chapter_name": "-6 Minimum Wage",
    "anchor": "12-6-1",
    "heading": "Purpose and Legislative Intent.",
    "verbatim": "12-6-1. Purpose and Legislative Intent.\n(a)\tPurpose. The purpose of this chapter is to recognize the importance of addressing living affordability in the City of Boulder; to ensure all workers within the city are paid a sufficient wage relative to the cost of living; to do so in a manner that is mindful of the larger market in which the city is situated; and to administer a local minimum wage requirement in a manner that respects, serves, and protects the interests of both employers and employees within the city.\n(b)\tLegislative Intent. The City Council recites the following legislative findings and statements of intent that were taken into consideration in the adoption of this chapter:\n(1)\tThe City Council of the City of Boulder recognizes that the cost of living in Boulder exceeds the average cost of living in the State of Colorado.\n(2)\tDespite the statewide minimum wage increases, the present rate does not adequately provide enough financial support for the health and wellbeing of the city's working residents.\n(3)\tAccording to a 2024 study conducted by ECOnorthwest, twenty-two percent of city residents live below the Federal Poverty Level and approximately thirty-seven percent of employment in the City of Boulder is in low-wage industries, including service and retail industries.\n(4)\tTo address this concern, the City of Boulder seeks to raise the local wage to an amount that aids working residents within the city to afford basic living necessities. Doing so will allow for greater prosperity for workers in Boulder and combat economic and social inequities, as well as racial and gender wage gaps.\n(5)\tRaising the minimum wage would place the city on par with other local jurisdictions within the state which have raised their wages to increase affordability.\n(6)\tThe State of Colorado allows local jurisdictions to establish a minimum wage for individuals performing work while physically within the jurisdiction under Title 29, Article 1, Part 14 of the Colorado Revised Statutes. Pursuant to this statute, the City of Boulder has the authority to set a minimum wage exceeding the state minimum wage as long as the city abides by the state's qualifications and restrictions on applicability.\n(7)\tEnforcement of this chapter shall be through the Colorado Department of Labor and Employment.\n(8)\tAddressing the minimum wage for the working residents of the city of Boulder is a matter of significant local concern.\nOrdinance No. 8664 (2024)"
  },
  {
    "corpus": "BRC",
    "title": "12",
    "title_name": "Human Rights",
    "chapter": "12",
    "chapter_name": "-6 Minimum Wage",
    "anchor": "12-6-2",
    "heading": "Definitions.",
    "verbatim": "12-6-2. Definitions.\nEmployee or Worker means an individual performing, or expected to perform, four or more hours of work for an employer in any given week within the city. The terms employee or worker does not include:\n(1)\tA person traveling through the city's jurisdiction from a point of origin outside of the city to a destination outside of the city, with no employment-related or commercial stops in the city, except for refueling or the employee's personal meals or errands; or\n(2)\tA person providing volunteer services that are uncompensated except for reimbursement of expenses such as meals, parking or transportation; or\n(3)\tAn independent contractor, as defined in federal law.\nEmployer means an individual, person, partnership, firm, corporation, association, organization or any other person, group, collective or entity that employs one or more employees, or any successor thereof.\nFood and beverage worker means a worker for any business or enterprise that prepares and offers for sale food or beverages for consumption either on or off an employer's physical premises.\nTips means an optional verifiable sum presented directly and customarily by customers as a gratuity in recognition of some service performed for customers by the person receiving the tip. Tips include, but are not limited to:\n(1)\tTips received directly from customers;\n(2)\tTips received electronically from employers;\n(3)\tTips received from other employees through tip-sharing arrangements;\n(4)\tCharged tips, like credit and debit card charges, that are distributed to employees by employers; and\n(5)\tNoncash forms of tips, including tickets, passes, or other goods or commodities that customers give to employees.\nWork means any services performed physically within the geographic boundaries of the city on behalf of or for the benefit of an employer whether on an hourly, piecework, commission, time, task, or other basis.\nOrdinance No. 8664 (2024)"
  },
  {
    "corpus": "BRC",
    "title": "12",
    "title_name": "Human Rights",
    "chapter": "12",
    "chapter_name": "-6 Minimum Wage",
    "anchor": "12-6-3",
    "heading": "Minimum Wage Required.",
    "verbatim": "12-6-3. Minimum Wage Required.\n(a)\tEvery employer must ensure its employees are paid not less than the City of Boulder Minimum Wage. An increase in the City of Boulder Minimum Wage takes effect on the same date as a secured increase to the statewide minimum wage required under section 15 of article XVII of the state constitution.\n(b)\tThe City of Boulder Minimum Wage is as follows, exclusive of fringe benefits and any other deductions or credits, except as otherwise described in this chapter:\n(1)\tBeginning January 1, 2025: $15.57 per hour;\n(2)\tBeginning January 1, 2026: $16.82 per hour;\n(3)\tBeginning January 1, 2027: $18.17 per hour;\n(4)\tBeginning January 1, 2028, and on January 1 of each subsequent calendar year, the City of Boulder Minimum Wage shall increase by an amount corresponding to the prior year increase, if any, in the Consumer Price Index, for all items, published annually for the Denver-Aurora-Lakewood Area.\n(c)\tTips regularly and actually received by a food and beverage worker may be applied to an employer's obligation to pay the food and beverage worker the City of Boulder Minimum Wage. However, no more than $3.02 per hour in tip income (\"Tip Credit\") may be used to partially offset payment of this wage.\n(d)\tNothing in this chapter shall lessen any other obligation applicable to an employer to pay a minimum wage under any other law, rule, or regulation, including but not limited to federal and state minimum wage laws or that arise from or in connection with federal or state funding. In the event of a conflict with any other applicable wage requirement, the greater wage rate must be paid.\nOrdinance No. 8664 (2024)"
  },
  {
    "corpus": "BRC",
    "title": "12",
    "title_name": "Human Rights",
    "chapter": "12",
    "chapter_name": "-6 Minimum Wage",
    "anchor": "12-6-4",
    "heading": "Employer Responsibilities.",
    "verbatim": "12-6-4. Employer Responsibilities.\n(a)\tEmployers must post notice with letters no less than one inch high of the currently effective City of Boulder Minimum Wage in a prominent place that is easily accessible to all employees. Employers must display the posting in English and Spanish. If the display of a physical notice is not feasible, including the situation when an employee does not have a regular workplace or job site, employers must provide the required information on an individual basis, in an employee's primary language, in paper or electronic form that is reasonably conspicuous and accessible. Notice shall include how to contact the Colorado Department of Labor and employment to file a complaint.\n(b)\tEmployers must make, retain, and make available to the city or to the Colorado Department of Labor and Employment, upon request, payroll records adequate to determine compliance with this chapter for a minimum of three years for each record.\nOrdinance No. 8664 (2024)"
  },
  {
    "corpus": "BRC",
    "title": "12",
    "title_name": "Human Rights",
    "chapter": "12",
    "chapter_name": "-6 Minimum Wage",
    "anchor": "12-6-5",
    "heading": "Violations; Enforcement; Penalties.",
    "verbatim": "12-6-5. Violations; Enforcement; Penalties.\n(a)\tIt is unlawful and a violation of this chapter to commit, authorize, allow, aid, abet, or conceal a violation of this chapter.\n(b)\tThe Colorado Department of Labor and Employment is fully authorized to investigate and issue orders to remedy violations of this chapter.\n(c)\tAny person claiming to be aggrieved by a violation of this chapter may file or pursue a complaint with the Colorado Department of Labor and Enforcement against an employer alleged to have violated this chapter within two years of any alleged violation, except that violations under this chapter for a willful violation may be brought within three years after the date of the violation. Nothing in this chapter shall preclude an individual from pursuing or participating in any other enforcement action or other remedy available under State of Colorado law.\n(d)\tA violation of this chapter shall be considered sufficient \"cause\" to suspend or revoke a city business license pursuant to the procedures set forth in Section 4-1-10, \"Revocation or Suspension of Licenses,\" of this code.\nOrdinance No. 8664 (2024)"
  },
  {
    "corpus": "BRC",
    "title": "12",
    "title_name": "Human Rights",
    "chapter": "12",
    "chapter_name": "-6 Minimum Wage",
    "anchor": "12-6-6",
    "heading": "City Manager Rules.",
    "verbatim": "12-6-6. City Manager Rules.\nThe city manager is authorized to adopt rules and regulations necessary to interpret, further define or implement the provisions of this chapter.\nOrdinance No. 8664 (2024)"
  }
]