[
  {
    "corpus": "BRC",
    "title": "13",
    "title_name": "ELECTIONS AND CAMPAIGN DISCLOSURE",
    "chapter": "1",
    "chapter_name": "Elections",
    "anchor": "13-1-1",
    "heading": "Legislative Intent.",
    "verbatim": "13-1-1. Legislative Intent.\n(a)\tThe purposes of this chapter are (1) to establish procedures for regular and special elections of the home rule City of Boulder; and (2) to set the date upon which a proposed ballot measure is final for its submission to the voters. This chapter does not apply to initiatives concerning the amendment or abolition of the charter.\n(b)\tThe procedures for regular and special elections are intended to be consistent with the Municipal Election Code of 1965 as adopted by the state of Colorado, except as necessary to comply with provisions of the charter or to meet a specific need of the city as determined by the city council.\nOrdinance Nos. 8317 (2019); 8319 (2019)"
  },
  {
    "corpus": "BRC",
    "title": "13",
    "title_name": "ELECTIONS AND CAMPAIGN DISCLOSURE",
    "chapter": "1",
    "chapter_name": "Elections",
    "anchor": "13-1-2",
    "heading": "General Municipal Elections.",
    "verbatim": "13-1-2. General Municipal Elections.\n(a)\tThe Municipal Election Code of 1965, § 31-10-101, et seq., as it may be amended, is adopted by reference and incorporated to have the same force and effect as if printed in full in this code, except as specifically amended by the charter or provisions of this chapter.\n(b)\tUnless the context or ordinance requires otherwise, general municipal elections as defined in Section 22 of the Charter shall be held as specified for regular municipal elections in the Municipal Election Code.\nOrdinance No. 8317 (2019)"
  },
  {
    "corpus": "BRC",
    "title": "13",
    "title_name": "ELECTIONS AND CAMPAIGN DISCLOSURE",
    "chapter": "1",
    "chapter_name": "Elections",
    "anchor": "13-1-3",
    "heading": "Responsibility of the City Clerk.",
    "verbatim": "13-1-3. Responsibility of the City Clerk.\nThe city clerk shall administer the requirements of this chapter and comply with all laws regulating the conduct of elections.\nOrdinance No. 8317 (2019)"
  },
  {
    "corpus": "BRC",
    "title": "13",
    "title_name": "ELECTIONS AND CAMPAIGN DISCLOSURE",
    "chapter": "1",
    "chapter_name": "Elections",
    "anchor": "13-1-4",
    "heading": "Initiative and Referendum.",
    "verbatim": "13-1-4. Initiative and Referendum.\n(a)\tThe Boulder Home Rule Charter affords the people the power at their option to propose Charter amendments, legislative ordinances, including ordinances granting franchises or privileges, and other legislative measures, and to adopt the same at the polls, such power being known as the initiative. The Charter provides the people with the power to refer to the ballot any measure adopted by the Boulder City Council such power being known as referendum. The Charter provides the people with the power to seek to remove any elected official by placing a measure to do so on the ballot, such power being known as the power to recall. All aspects of the exercise of the initiative, referendum and recall power reserved to the people by the Charter of the City of Boulder shall be governed exclusively by the provisions of the Charter, this code, and any other applicable ordinance of the city, and no statute of the state purporting to regulate in any way the exercise of the initiative or referendum shall govern the exercise of the initiative or referendum, except for those criminal provisions of state law not in conflict with any provision of the Charter or this code which prohibit fraud or deception in the circulation or signing of initiative or referendum petitions, or respecting affidavits concerning said petitions. The power to propose Charter amendments shall be governed by the Colorado Constitution and any state statute adopted thereunder. In the event of a conflict between the requirements of any state law and any provision of this Charter, state law shall control.\n(b)\tSignatures Required.\n(1)\tTo qualify for placement on the ballot, a petition for initiative, legislative ordinances, ordinances granting franchises or privileges, and other legislative measures shall have a number of signatures equal to at least ten percent of the average of the number of registered electors of the city who voted in the previous two municipal candidate elections.\n(2)\tTo qualify for placement on the ballot, a petition for referendum shall have a number of signatures equal to at least ten percent of the average of the number of registered electors of the city who voted in the previous two municipal candidate elections.\n(3)\tTo qualify for placement on the ballot, a petition for recall shall have a number of signatures equal to at least twenty percent of the average of the number of registered electors of the city who voted in the previous two municipal candidate elections.\n(c)\tDeadlines\n(1)\tFor initiated matters including legislative ordinances, ordinances granting franchises or privileges, and other legislative measures all signatures shall be submitted no later than one hundred fifty days prior to the November election.\n(2)\tFor referenda, all signatures shall be submitted within thirty days after final passage of the measure sought to be referred.\n(3)\tFor recalls, all signatures shall be submitted within thirty days after approval of the petition for recall.\nOrdinance Nos. 8317 (2019); 8403 (2020)"
  },
  {
    "corpus": "BRC",
    "title": "13",
    "title_name": "ELECTIONS AND CAMPAIGN DISCLOSURE",
    "chapter": "1",
    "chapter_name": "Elections",
    "anchor": "13-1-5",
    "heading": "Special Provisions Concerning Filling Council Vacancies by Special Election.",
    "verbatim": "13-1-5. Special Provisions Concerning Filling Council Vacancies by Special Election.\n(a)\tThe city council may, in the resolution calling for a special election to fill a council vacancy, specify a number of days before the election that the early voters' polling place shall be open, and may also specify additional hours during which such early voters' polling places shall be open. Such a provision is only effective for a special election which is not conducted as a coordinated election.\n(b)\tThe term of a council member elected in a special election held pursuant to Charter Section 8 to fill a council vacancy shall expire at 10:00 a.m. on the third Tuesday in November following the next general municipal election.\nOrdinance No. 8317 (2019)"
  },
  {
    "corpus": "BRC",
    "title": "13",
    "title_name": "ELECTIONS AND CAMPAIGN DISCLOSURE",
    "chapter": "1",
    "chapter_name": "Elections",
    "anchor": "13-1-6",
    "heading": "Fixing of Ballot Title.",
    "verbatim": "13-1-6. Fixing of Ballot Title.\nBallot titles for city ballot measures shall be considered fixed upon the final vote of the council after final reading of a motion, resolution, or ordinance which officially submits a specific ballot measure in the form it is to appear on the ballot for a vote of the electors at the next election. The date the election is called for consideration of city ballot measures shall not change the date upon which the ballot title is fixed as provided in this section.\nOrdinance Nos. 8317 (2019); 8319 (2019)"
  },
  {
    "corpus": "BRC",
    "title": "13",
    "title_name": "ELECTIONS AND CAMPAIGN DISCLOSURE",
    "chapter": "1",
    "chapter_name": "Elections",
    "anchor": "13-1-7",
    "heading": "Online Petitions.",
    "verbatim": "13-1-7. Online Petitions.\n(a)\tThe city manager is authorized to implement an online petition system for the collection of endorsements for initiatives, referenda, or recall, to circulate and submit online versions of petitions, previously approved as to form by the clerk, through an internet-based system as authorized in Sections 38, 45 and 56 of the Boulder Home Rule Charter.\n(b)\tThe online petition system shall provide a secure, transparent, and easy to use alternative circulation method, increased accessibility to the ballot, enhanced voter accessibility options, and improved voter validation.\n(c)\tThe online petition system shall not be used for petitions seeking to amend the Boulder Home Rule Charter. Charter amendments are governed by state law, which does not allow for online petition endorsement.\n(d)\tThe online petition system shall:\n(1)\tMaintain compliance with applicable provisions in the Charter, this code and state statutes concerning the circulation and determination of sufficiency of petitions for initiative, referendum, and recall.\n(2)\tServe as a method for the collection of endorsements from registered electors for petitions for initiative, referendum, and recall and will not supplant existing method of collecting signatures with hardcopy petitions.\n(3)\tPreserve the integrity and security of the endorsement process to ensure that petitions are endorsed only by registered electors of the City of Boulder.\n(4)\tProvide protection against tampering, fraudulent use, and illegal manipulation of approved petitions by secure access to the digital petition through electronic security measures such as two-factor authentication.\n(5)\tInclude a warning, similar to that required by state law for paper petitions, adapted for online endorsements.\n(6)\tBe accessible on publicly available computers.\n(7)\tInclude safeguards to prevent any person from endorsing any petition more than once or from endorsing a petition if that person is not registered to vote at a residential address in the City of Boulder.\n(e)\tExcept as permitted herein no other form of digital or electronic petition endorsement or signing is authorized.\n(f)\tAny information contained in the online petition application shall only be maintained securely with appropriate data protections.\n(g)\tNo person shall endorse any petition more than once.\n(h)\tNo person shall cause any fraudulent endorsement of any petition.\n(i)\tNo person shall endorse any petition unless that person is registered to vote at a residential address in the City of Boulder.\n(j)\tNo person shall offer anything of value in return for the endorsement of petition.\n(k)\tAny person may assist a person with the use of the online petition system.\n(l)\tThe city manager may issue rules necessary to implement this section.\nOrdinance Nos. 8403 (2020); 8449 (2021)"
  },
  {
    "corpus": "BRC",
    "title": "13",
    "title_name": "ELECTIONS AND CAMPAIGN DISCLOSURE",
    "chapter": "2",
    "chapter_name": "Campaign Finance, Disclosure and Reporting Requirements",
    "anchor": "13-2-1",
    "heading": "Legislative Intent.",
    "verbatim": "13-2-1. Legislative Intent.\n(a)\tThe provisions of this chapter have been modeled on the Federal Election Campaign Act and the Colorado Fair Campaign Practices Act and in accordance with an initiative passed by the people of the city in 1999. Modifications have been made where necessary to meet specific needs of the city, to clarify and make more specific various requirements, and to comply with the evolving law in this area.\n(b)\tThe purposes of this chapter include the following:\n(1)\tAssisting electors in making informed election decisions by requiring disclosure of information from candidates for city office and from persons supporting or opposing such candidates and/or ballot measures. The purpose of disclosure is to provide for transparency in the collection and disbursement of monies spent on campaigns and not to regulate speech;\n(2)\tLimiting contributions to candidates running for mayor or City Council and committees formed to support or oppose such candidates. This limit is meant to ensure that large campaign contributions do not cause corruption or the appearance of corruption in the election process, are not used to buy political access or to influence governmental actions, and to ensure that access to large amounts of money will not be a prime requirement for participation in the political process. This chapter does not limit contributions made to committees supporting or opposing ballot measures;\n(3)\tAssuring the public that there is transparency of the companies or individuals that are providing financial support or otherwise backing electioneering communications and express advocacy materials, while not putting an onerous burden on contributors;\n(4)\tProviding public financing for candidate campaigns that is contingent on candidates who receive public funds complying with expenditure limits. These measures are meant to reduce candidates' need to focus on fundraising and also to reduce the amount of money that is needed to run an effective campaign, which benefits the recipients of matching funds as well as other candidates and the citizens generally; and\n(5)\tProviding members of the public with information regarding financial dealings of candidates, the mayor and council members that might affect their ability to make impartial decisions.\n(c)\tThe provisions of this chapter are exclusive and supersede any state statute on the subject, whether in conflict herewith or not, including, without limitation, Article 1-45, C.R.S., unless the provisions of such statute are expressly made applicable by reference in this chapter.\nOrdinance Nos. 8317 (2019); 8568 (2023)"
  },
  {
    "corpus": "BRC",
    "title": "13",
    "title_name": "ELECTIONS AND CAMPAIGN DISCLOSURE",
    "chapter": "2",
    "chapter_name": "Campaign Finance, Disclosure and Reporting Requirements",
    "anchor": "13-2-2",
    "heading": "Definitions.",
    "verbatim": "13-2-2. Definitions.\nThe following terms used in this chapter have the following meanings unless the context clearly indicates otherwise:\nAdvertisement means any notice, announcement, bulletin, materials, display, handout or similar materials, or radio or video messages, distributed or posted to convey support for or opposition to a candidate or ballot measure.\nBallot measure means any amendment to the city charter, and any initiative, referendum, or recall for which petitions have been properly certified by the city clerk for submission to the city council, or any ordinance, issue, or question - put to a vote of the electors of the City of Boulder under the provisions of the city charter. For purposes of this chapter only, \"ballot measure\" also includes any initiative, referendum, or recall for which a petition committee has submitted a proposed petition to the city clerk. Such term does not include any question placed on the ballot by the United States, the State of Colorado, or any political subdivision thereof other than the city.\nBallot measure committee means any person who accepts contributions, or any two or more persons who make expenditures, for the purpose of supporting or opposing a ballot measure at a city election, regardless of whether they have obtained the consent of the proponents of the ballot measure.\nCandidate means any natural person whose petition of nomination for mayor or City Council, whether at a regular, special, or recall election, has been certified as sufficient by the city clerk pursuant to Section 26 of the city Charter. A person is no longer a candidate after the date of the election for which the person filed a petition.\nCandidate committee means a person, including the candidate, or persons with the common purpose of receiving contributions or making expenditures under the authority of a candidate. The term official candidate committee is synonymous with candidate committee.\nCandidate forum means provisions or broadcasts of a forum for candidates which:\n(a)\tIs conducted after expiration of the time during which candidates may be certified;\n(b)\tIs open to all candidates for mayor or for City Council without discrimination;\n(c)\tProvides all candidates equal time to express their positions;\n(d)\tIs not sponsored by a committee; and\n(e)\tIf rebroadcasted, includes the full statements of all participants.\nCommittee means a candidate committee, an unofficial candidate committee, or a ballot measure committee, unless the context indicates that it can mean only one or two of these types of committees.\nContribution means:\n(a)\tAny payment, loan, pledge, or advance of money, including, without limitation, checks received but not deposited or payments made by credit card, or guarantee of a loan, made to or for the benefit of any candidate or committee;\n(b)\tAny payment made to a third party for the benefit of any candidate or committee, including, without limitation, the use of a credit card to secure such benefit;\n(c)\tAnything of value given, directly or indirectly, to a candidate for the purpose of promoting the candidate's election, including, without limitation, commercial services such as banking, printing, and mailing services;\n(d)\tWith regard to a contribution for which the contributor receives compensation or consideration of less than equivalent value to such contribution, including, without limitation, items of perishable or nonpermanent value, goods, supplies, services, or participation in a campaign-related event, an amount equal to the value in excess of such compensation or consideration; or\n(e)\tA contribution in kind.\nContribution does not include services provided without compensation by individuals volunteering their time on behalf of a candidate or committee.\nContribution in kind means the fair market value of a gift or loan of any item of real or personal property, other than United States currency, made to or for any candidate or committee for the purpose of influencing the passage or defeat of any issue or the election or defeat of any candidate. Personal services are a contribution in kind by the person paying compensation therefor. In determining the value to be placed on contributions in kind, a reasonable estimate of fair market value shall be used by the candidate or committee. Contributions of foreign currency or cryptocurrency are contributions in kind. Contribution in kind does not include an endorsement of a candidate or an issue by any person, nor does it include the payment of compensation for legal or accounting services rendered to a candidate if the person paying for the services is the regular employer of the individual rendering the services and the services are solely for the purpose of ensuring compliance with the provisions of this title.\nDistributing, distribution, or distributed refers to any communication broadcast by television, radio, cable or satellite to residents of the city; printed in a newspaper, magazine, or other periodical, or billboard, that reaches residents of the city; directly mailed or delivered by hand to personal residences in the city; or delivered for a fee digitally or by telephone, or similar means or communication targeted to residents of the city.\nElection cycle means the period from the day after an election until the day of the election in the following year.\nElectioneering communications means any communication that is:\n(a)\tTaken as a whole and in context unambiguously referring, in writing or pictorially, to any candidate;\n(b)\tDistributed before the end of the election cycle and after the first date a city council candidate nomination petition could be certified about any candidate; and\n(c)\tDistributed to an audience that includes residents of the city;\nElectioneering communication does not include:\n(a)\tAny communication by persons, other than committees, made in the regular course and scope of their business;\n(b)\tAny communication made by a membership organization solely to members or such organization and their families;\n(c)\tAny communication that refers to a candidate or ballot measure only as part of the popular name of a bill or statute;\n(d)\tThe original broadcast or distribution of any news articles, editorial endorsements, opinions, commentary writings, or letters to the editor, through media not owned or controlled by a candidate, committee, or a person contributing over $1,000 towards the original broadcast or printing; or\n(e)\tCandidate forums.\nEntity means any person or group of persons, other than one natural person, that makes contributions or expenditures, including without limitation corporations, partnerships, limited liability companies, limited liability partnerships, commissions, enterprises, or any other formal or informal associations or organizations.\nExcepted investment means a mutual fund, common trust fund of a bank, pension, or deferred compensation plan, any other investment fund, or a ten percent or less interest in the stock of a company, which for funds or stocks is widely held; publicly traded (or available) or widely diversified; and which for funds under circumstances where the investor neither exercises control over nor has the ability to exercise control over the financial interests held by the fund. A fund is widely diversified when it holds no more than five percent of the value of its portfolio in the securities of any one issuer (other than the U.S. Government).\nExpenditure means the payment, distribution, loan, or advance of any money, whether in cash, by check, as a credit card charge, or otherwise. Expenditure also includes the payment, distribution, loan, or advance of any money by a person for the benefit of a candidate or committee that is made with the prior knowledge and consent of an agent of the candidate or committee. An expenditure occurs when the actual payment is made or when a contract is agreed upon, whichever comes first. Consent may be implied from collaboration and need not be express.\nExpress Advocacy means any communication that contains words urging election or defeat, such as \"vote for,\" \"support,\" \"cast your ballot for,\" \"vote against,\" \"defeat,\" \"reject,\" \"Smith for Congress,\" \"endorse,\" or any communication, by words or symbols, which is the functional equivalent of express advocacy because it is susceptible to no other reasonable interpretation than as an appeal to vote for or against a specific candidate or ballot measure.\nFair market value means the amount a willing buyer and a willing seller would pay for the product or service when neither was under any obligation to do so.\nIncome means money received for the provision of goods or services, not including the unrealized appreciation of any asset, income from any excepted fund, or interest earned from any commercial bank, savings and loan, or credit union.\nIndependent expenditure means an expenditure by any person for the purpose of creating or disseminating express advocacy or electioneering communications, which expenditure is not controlled by, coordinated with, or made upon consultation with any committee or any agent of such committee. Independent expenditure does not include expenditures made by persons in the regular course and scope of their business, including political messages sent solely to members.\nLoan means providing something of value, including money, to another, with a promise, express or implied, that money will be paid in the future for the item of value.\nNatural person means a human being.\nOfficial candidate committee means a person, including the candidate, or persons with the common purpose of receiving contributions or making expenditures under the authority of a candidate.\nOther household income means any income earned by a spouse, domestic partner, or partner in a civil union who resides in the same household as the reporting person that is reportable by a candidate or incumbent for federal or state income tax purposes.\nOther household member means a spouse, domestic partner, or partner in a civil union who resides in the same household as the reporting person.\nPerson means the same as the definition in Chapter 1-2-1.\nPublished means a writing presented for distribution in exchange for money or other item of value.\nReportable interest means:\n(a)\tIn the case of a corporation, either more than ten percent of the total combined voting power of all classes of stock of the corporation entitled to vote, or more than ten percent of the capital, profits, or beneficial interest in the voting stock of the corporation;\n(b)\tIn the case of a partnership, association, trust, or other entity, more than ten percent of the capital, profits, or beneficial interest in such partnership, association, trust, or other entity; or\n(c)\tAny interest in any entity that owns real property, if more than fifty percent of the entity's holdings are in Boulder County.\nSolicitation means a written or oral or other endeavor to obtain, seek or plead for money or other item of value.\nTop contributors means the persons from whom the ballot measure committee paying for a communication has received its three largest cumulative contributions of $1,000 or more for a communication that includes express advocacy as of the date of the first broadcast or other distribution of the communication.\nUnofficial candidate committee means any natural person who accepts contributions, or any two or more persons who make expenditures, for the purpose of supporting or opposing a candidate for mayor or City Council. An unofficial candidate committee ceases to be independent if its expenditures are in any way, directly or indirectly, controlled by, coordinated with, or made upon consultation with any candidate or candidate committee or agent thereof.\nOrdinance Nos. 8317 (2019); 8568 (2023)"
  },
  {
    "corpus": "BRC",
    "title": "13",
    "title_name": "ELECTIONS AND CAMPAIGN DISCLOSURE",
    "chapter": "2",
    "chapter_name": "Campaign Finance, Disclosure and Reporting Requirements",
    "anchor": "13-2-3",
    "heading": "Participants.",
    "verbatim": "13-2-3. Participants.\n(a)\tCandidates.\n(1)\tOfficial Candidate Committee. A candidate is deemed to have an official candidate committee even if none has been formed. A candidate may hold any position in the candidate's official campaign committee. No candidate shall have more than one candidate committee. If more than one committee acts under the authority of or in coordination with a candidate, all shall be deemed the candidate's official candidate committee and shall file combined reports as required by this title and all shall jointly be subject to the limitations of this title.\n(2)\tPublic Matching Funds.\n(A)\tEligibility. A candidate who meets the following requirements shall be eligible to receive matching funds: (1) The candidate raises at least ten percent of the expenditure limit from contributions of no more than $25; (2) The candidate accepts contributions only from natural persons, and (3) The candidate signs a contract with the city committing that the candidate will:\ni.\tLimit his or her expenditures to $20,740;\nii.\tContribute to his or her campaign no more than twenty percent of the expenditure limit from his or her own personal wealth; and\niii.\tReturn at least fifty percent of any unexpended funds to the city, but not more than the matching funds received.\n(B)\tMatch Amount. The city will allocate and provide matching funds, up to fifty percent of the expenditure limit as herein defined, to any city council candidate who meets the eligibility requirements set forth above. Only actual currency or its equivalent shall be matched with public funds. Neither loans nor contributions in kind or amounts exceeding $100 from the candidate's personal wealth shall be eligible for matching funds.\n(C)\tDisbursements. After meeting the eligibility requirements, any candidate may request matching funds from the city no more frequently than once per week in amounts no less than $500. The final request for matching funds must be submitted to the city no later than fourteen days before the election and may be for less than $500.\n(D)\tInflation Adjustment. The city clerk shall adjust the limit set forth in subsection (2)(A) of this section based upon the percentage change over a two-year period in the United States Bureau of Labor Statistics Consumer Price Index for Denver-Boulder-Greeley, all urban consumers, or its successor index, rounded to the nearest dollar. The first adjustment shall be done in the first quarter of 2021 and then every two years thereafter.\n(b)\tPersons Who Support or Oppose Candidates or Ballot Measures.\n(1)\tUnofficial Candidate Committee. Any persons meeting the definition of an unofficial candidate committee are deemed to have formed a committee and must adhere to the requirements of this chapter.\n(2)\tBallot Measure Committee. Any persons meeting the definition on a ballot measure committee are deemed to have formed a committee and must adhere to the requirements of this chapter.\n(3)\tIndividuals. Any person making an independent expenditure in excess of $200 to support or oppose one or more candidates, or in excess of $1,000 to support or oppose a ballot measure, shall be subject to the reporting and disclosure requirements set forth below in this chapter.\n(4)\tCoordination. Expenditures by any person or committee on behalf of a candidate that are, in any way, directly or indirectly, controlled by, coordinated with, or made upon consultation with any candidate or candidate committee or agent thereof shall be considered a contribution to the candidate and subject the candidate and the contributor to any applicable limitations contained in this chapter. Such expenditures also count toward the expenditure limit of any candidate who has received public funding under this chapter.\nOrdinance No. 8317 (2019)"
  },
  {
    "corpus": "BRC",
    "title": "13",
    "title_name": "ELECTIONS AND CAMPAIGN DISCLOSURE",
    "chapter": "2",
    "chapter_name": "Campaign Finance, Disclosure and Reporting Requirements",
    "anchor": "13-2-4",
    "heading": "Campaign Activities.",
    "verbatim": "13-2-4. Campaign Activities.\n(a)\tContribution Limitations.\n(1)\tNo person shall make contributions to any official candidate committee or unofficial candidate committee that, in the aggregate, exceeds $100 with respect to any election cycle in which such candidate or committee is participating for a municipal election. Persons are not limited in the amount that may be contributed to ballot measure committees.\n(2)\tAny expenditure that is controlled by, or coordinated with, a committee or agent of a committee, is deemed to be both a contribution by the maker of the expenditure and an expenditure by the committee.\n(3)\tContributions to unofficial candidate committees are subject to the $100 limitation per person per committee regardless of how many candidates the unofficial candidate committee supports or opposes.\n(4)\tThe recipient of any contribution which would cause the total amount of contributions from a single person to exceed $100 per committee limitation shall promptly return any such excess to the donor.\n(5)\tNo person shall make contributions of coin or paper currency for the benefit of any ballot measure committee that, in the aggregate, exceeds $100 per election cycle.\n(6)\tA committee may not make a contribution to another committee.\n(b)\tContributions in Name of Another Prohibited. No person shall make a contribution in the name of another person or knowingly permit such person's name to be used to effect such a contribution, and no person shall knowingly accept a contribution made by one person in the name of another person.\n(c)\tAnonymous Contributions.\n(1)\tAnonymous contributions to any official candidate committee or unofficial candidate committee may not be retained or expended by the committee. If anonymous contributions are received by such a committee, they shall be disposed of as follows:\n(A)\tIf the candidate has accepted public financing under this chapter, all anonymous contributions to the candidate or the candidate's committee shall be forwarded to the city clerk with the next required report, noted in the report, and deposited in the general fund of the city.\n(B)\tUnofficial candidate committees and candidate committees of candidates who have not accepted public financing under this chapter shall be allowed to donate anonymous contributions to any charitable organization recognized by the Internal Revenue Service pursuant to Section 501(c)(3) of the Internal Revenue Code or to the city, and the distribution of such funds shall be indicated on the next report required to be filed pursuant to Section 13-2-6(c).\n(C)\tIf an anonymous contribution is donated to a charitable organization recognized by the Internal Revenue Service pursuant to Section 501(c)(3) of the Internal Revenue Code, the candidate or committee shall retain the envelope or other container in which it arrived, together with any other material which arrived with it, a photocopy of the contribution itself (showing only the amount and serial number of any bills), and shall retain such information as candidate or committee records for at least six months after the election, and shall make such records available to the city clerk upon request.\n(2)\tIf an anonymous contribution is received by a ballot measure committee, the committee shall retain the envelope or other container in which it arrived, together with any other material which arrived with it, and a photocopy of the contribution itself (showing the amount and serial number of any bills) as committee records for at least six months after the election, and shall make such records available to the city clerk upon request.\n(d)\tUnexpended Campaign Contributions. Candidates receiving matching funds must return at least fifty percent of any unexpended funds to the city, but not more than the matching funds received. Any remaining unexpended contributions to candidates or committees may be donated to any charitable organization recognized by the Internal Revenue Service pursuant to Section 501(c)(3) of the Internal Revenue Code or returned to the contributor, and the distribution of such funds shall be indicated on the final report of the committee required to be filed pursuant to Section 13-2-6(c)(2).\n(e)\tCampaign Advertising Requirements. No person who sells space in a newspaper or magazine to a candidate or committee to use in connection with a municipal election may charge an amount for such space which exceeds the amount charged for comparable use of such space for other purposes.\n(f)\tMisrepresentation of Campaign Authority. No candidate or any agent of a candidate or committee shall make any fraudulent misrepresentation as speaking or writing or otherwise acting for or on behalf of any other candidate or committee on a matter which is damaging to such other candidate or committee; or willfully and knowingly participate in or conspire to participate in any plan, scheme or design to do so.\n(g)\tNo Personal Use. Committee funds shall not be used for personal purposes not reasonably related to supporting or opposing the election of a candidate or the adoption of a ballot measure.\n(h)\tCity Resources. City resources shall not be used to make any contribution to a committee or to fund express advocacy after a ballot title is fixed as described in Section 13-1-6, B.R.C. 1981, for a ballot measure or after a person is certified as a candidate for candidate elections. Nothing in this subsection shall be construed as prohibiting the city from expending city resources to dispense a factual summary, which shall include arguments both for and against the proposal, on any ballot measure. Notwithstanding the foregoing, city council may pass a resolution or take a position of advocacy for or against a ballot measure, and city resources may be used to report city council's action through established, customary means other than paid advertising.\nOrdinance Nos. 8317 (2019); 8319 (2019)"
  },
  {
    "corpus": "BRC",
    "title": "13",
    "title_name": "ELECTIONS AND CAMPAIGN DISCLOSURE",
    "chapter": "2",
    "chapter_name": "Campaign Finance, Disclosure and Reporting Requirements",
    "anchor": "13-2-5",
    "heading": "Disclosure Requirements.",
    "verbatim": "13-2-5. Disclosure Requirements.\n(a)\tElection Materials and Advertising Contain Sponsor's Name.\n(1)\tA committee that distributes an advertisement shall include therein the words \"Paid for by\" followed by the name of the committee. An unofficial candidate committee that distributes an advertisement shall include therein the words \"Not affiliated with any candidate or candidate committee.\"\n(2)\tA ballot measure committee that distributes an advertisement supporting or opposing a ballot measure shall include therein the words \"Major funding from\" followed by the names of the top contributors to the committee paying for the advertisement. If two or more contributors of identical amounts qualify as top contributors, all the contributors of that amount shall be listed.\n(3)\tA person, other than a committee, who makes an independent expenditure shall include in the advertisement the words \"Paid for by\" followed by the name of the person.\n(4)\tAn advertisement that is distributed as video shall include the disclosures required by this section at the beginning or end of the advertisement, displayed for at least five seconds of a broadcast of thirty seconds or less or for at least ten seconds of a broadcast that lasts longer than thirty seconds on the entire bottom one-third of the television or video display screen, with the type size of the smallest letters no less than four percent of the height of the television or video display screen. The written disclosures shall be underlined, except for the names of the top contributors.\n(A)\tThe top contributors to a ballot measure committee, if any, shall each be disclosed on a separate horizontal line centered horizontally, in descending order, beginning with the top contributor who made the largest cumulative contributions on the first line.\n(B)\tIf using a type size of four percent of the height of the television or video display screen causes the name of any of the top contributors to exceed the width of the screen or causes the disclosures to exceed one-third of the television or video display screen, the type size of the name of the contributor shall be reduced until the top contributor's name fits within one-third of the television or video display screen, but in no case shall the type size be smaller than two and one-half percent of the height of the screen.\n(5)\tAn advertisement in printed form shall include the required disclosure on a solid background with the words in a contrasting color in an Arial equivalent font within a box and set apart from any other print on the advertisement. Display of the disclosure shall be in one of the following forms:\n(A)\tA print advertisement that is distributed shall include the disclosures required by this section, with a type size of at least ten-point; or\n(B)\tA print advertisement that is larger than those designed to be individually distributed, including, but not limited to, yard signs or billboards, shall display the disclosure with a total height of at least five percent of the height of the advertisement. The text may be adjusted so it does not appear on separate horizontal lines, with the top contributors separated by a comma; or\n(C)\tFor a print advertisement of twenty square inches or less paid for by a ballot issue committee, the disclosure is only required to include the single top contributor of $1,000 or more.\n(6)\tAn advertisement that is distributed by audio shall include the disclosures required by this section at the beginning or end of the advertisement, read in a clearly spoken manner and in a pitch and tone substantially similar to the rest of the advertisement, and shall last no less than three seconds. Notwithstanding the definition of \"top contributors,\" radio and prerecorded telephonic advertisements made by a ballot measure committee shall disclose only the top two contributors of $1,000 or more unless the advertisement lasts fifteen seconds or less or the disclosure statement would last more than eight seconds, in which case only the single top contributor of $1,000 or more shall be disclosed.\n(b)\tSolicitation for Candidate Campaign Funds. Whenever any person makes an expenditure for the purpose of soliciting any contribution through any broadcasting station, newspaper, magazine, outdoor advertising facility, direct mailing, or any other type of advertisement, such communication:\n(1)\tIf authorized by a candidate or committee or any agent thereof, shall clearly state that the communication has been so authorized;\n(2)\tIf not authorized by a candidate or committee, or its agents, shall clearly state the name of the person who paid for the communication and state that the communication is not authorized by any candidate or committee.\nOrdinance Nos. 8317 (2019); 8319 (2019)"
  },
  {
    "corpus": "BRC",
    "title": "13",
    "title_name": "ELECTIONS AND CAMPAIGN DISCLOSURE",
    "chapter": "2",
    "chapter_name": "Campaign Finance, Disclosure and Reporting Requirements",
    "anchor": "13-2-6",
    "heading": "Reporting Requirements.",
    "verbatim": "13-2-6. Reporting Requirements.\n(a)\tPersons required by this chapter to prepare and file statements shall do so on the basis of information that is complete and current at least as of 5:00 p.m. on the calendar day before the filing date. A statement due on a weekend or holiday shall be filed on the next business day.\n(b)\tCommittee Statements of Organization.\n(1)\tInitial Filing. A committee's initial Statement of Organization shall be filed:\n(A)\tNo more than three days after a candidate's petition of nomination for mayor or City Council has been certified as sufficient by the city clerk pursuant to Section 26 of the city Charter, the candidate shall file a statement of organization of the committee formed to assist the candidate in being elected to the office of mayor or City Council. This statement shall be filed even if the candidate has not formed a committee and shall be amended later if a committee is formed or the information required changes.\n(B)\tNo more than three days after an unofficial candidate committee accepts a contribution or makes or obligates itself to make an expenditure, the committee shall file a statement of organization as set forth below in this chapter.\n(C)\tNo more than three days after a ballot measure committee accepts a contribution or makes an expenditure, the committee shall file a statement of organization as set forth below in this chapter.\n(D)\tOnce a committee files a statement of organization, it cannot add or change the ballot measure(s) or candidate(s) supported or opposed.\n(2)\tInformation Required. The statement of organization for all committees shall include the name and address of the committee and the names and addresses of all persons acting as officers of the committee, including committee chairperson(s) and treasurer. In addition, statements shall include the following information:\n(A)\tThe statement of organization for the official candidate committee shall include the name and address of the candidate.\n(B)\tThe statement of organization for an unofficial candidate committee shall include the names of the candidate(s) the committee supports or opposes and a statement of whether the committee supports or opposes each candidate.\n(C)\tThe statement of organization for a ballot measure committee shall include the names of all ballot measure(s) the committee supports or opposes and a statement of whether the committee supports or opposes each measure.\n(3)\tUpdates. Committees shall file a statement with any changes to the information required by this section no more than three days after such change occurs.\n(c)\tContributions and Expenditures.\n(1)\tInformation Required. In accordance with the schedule below, committees shall file regular reports from the date of the prior report to the end of the reporting period unless the statement is the first one required containing the following information:\n(A)\tThe names and addresses of each person making contributions to the treasurer's knowledge, and the amount, cumulative total to-date value, dates, and nature of such contributions since the last report required.\n(B)\tFor anonymous contributions, a statement of all such contributions received together with their disposition.\n(C)\tThe names and addresses of each person to whom an expenditure has been made and the amount, cumulative total to-date value, date, and nature of such expenditure. For expenditures for joint advertising by multiple committees, each committee must disclose the total cost of the joint advertisement along with the amount each paid for its portion of the advertisement. The amount expended must be proportional to the committee's portion of the advertising.\n(2)\tSchedule of Reports. All committees shall file Statements of Contributions and Expenditures on the following schedule:\n(A)\tInitial Submission:\n(i)\tOfficial candidate committees shall file three days after the candidate's petition of nomination for mayor or City Council has been certified as sufficient by the city clerk pursuant to Section 26 of the city Charter. This statement shall cover all contributions and expenditures made in anticipation of candidacy.\n(ii)\tUnofficial candidate committees and ballot measure committees shall file three days after the committee accepts a contribution or makes or obligates itself to make an expenditure. This statement shall cover all contributions and expenditures made to date.\n(B)\tSubsequent Reports. Reports are due on the following schedule and shall include all contributions and expenditures made that were not included in a prior filed report:\n(i)\tOn the forty-second day prior to the election.\n(ii)\tOn the twenty-eighth day prior to the election.\n(iii)\tOn the twenty-first day prior to the election.\n(iv)\tOn the fourteenth day prior to the election.\n(v)\tBy 5:00 p.m. on the Thursday before the election. This statement shall also identify anticipated contributions and expenditures for the remainder of the campaign, if any, before or after the election.\n(vi)\tOn or before the thirtieth day after the election: If a balance remains on the candidate's or committee's books, this statement shall also include the intended disposition of that balance.\n(vii)\tNot more than sixty days after the election: Committees with a balance remaining on the 30-day report shall file a final statement showing the actual disposition of that balance.\n(3)\tIndependent Expenditure Reports of Unofficial Candidate Committees. If an unofficial candidate committee makes an independent expenditure in excess of $5,000 on or before the twenty-first day prior to the election, the committee shall file a statement of expenditure giving the names and addresses of each person to whom such an expenditure has been made, and the amount, date, and purpose of such expenditure within three business days after obligating funds for the first such expenditure.\n(4)\tOther Independent Expenditure Reports. If a person, other than an unofficial candidate committee, makes an independent expenditure in excess of $1,000 to support or oppose a ballot measure, or in excess of $200 to support or oppose the election of a candidate, the person shall file a statement of expenditure giving the names and addresses of each person to whom such an expenditure has been made, and the amount, date, and nature of such expenditure and any other reportable expenditure not previously reported according to the schedule established in Section 13-2-6(c).\n(d)\tInterest Disclosure Statement.\n(1)\tReporting schedule.\n(A)\tOn or before September 10, any person having been certified as a candidate shall file a statement of financial disclosure as set forth below. Candidates shall report any changes to the information reported below in subsections (2)(A), (C), and (D), of this provision, within fifteen days after the change has occurred.\n(B)\tOn or before April 15 of each year, the mayor and every member of the City Council shall file a statement of financial disclosure as set forth below. The mayor and council members shall report any changes to the information reported below in subsections (2)(A), (C), and (D), of this provision, within fifteen days of the end of the calendar quarter in which the change occurred.\n(2)\tAny person required to file a financial disclosure statement required by this chapter shall file a statement on a form provided by the city clerk, that includes the following information:\n(A)\tThe reporting person's employer and occupation.\n(B)\tThe source of any income in excess of $1,000 per year, including, without limitation, other household income, capital gains, whether or not taxable, dividends, interest, wages, salaries, rents, profits, and retirement accounts.\n(C)\tThe name, location, and nature of activity of any business entities or enterprises, with holdings of real or personal property or with business dealings in the area encompassed by the Boulder Valley Comprehensive Plan, in which the reporting person or other household member has any financial interest or is actively engaged as an officer, director, or partner, and the nature of the reporting person's or other household member's interest or activity. A reporting person or other household member is not required to report any financial interest in any business entity in which the reporting person's or other household member's only interest is through an investment in an excepted investment. A charitable donation is not a financial interest.\n(D)\tThe location of any real property within Boulder County in which the reporting person or other household member has an interest or, if the reporting person or other household member has a reportable interest in an entity or enterprise disclosed pursuant to paragraph (b)(3) above, in which the entity or enterprise has any interest and the nature of such interest.\n(E)\tAny other information that the reporting person feels would be helpful or should be disclosed.\n(3)\tEach financial disclosure statement shall include all information current on the date of filing, except for the sources of income required by subsection (d)(2)(B) of this section shall be reported as of the end of the previous calendar year.\n(4)\tWhen reporting information regarding the activities of a third party, a reporting person is required to report only information about which he or she has actual knowledge. Notwithstanding any other provision of this chapter, no reporting person or other household member is required to disclose any confidential relationship protected by law.\nOrdinance Nos. 8317 (2019); 8319 (2019); 8568 (2023)"
  },
  {
    "corpus": "BRC",
    "title": "13",
    "title_name": "ELECTIONS AND CAMPAIGN DISCLOSURE",
    "chapter": "2",
    "chapter_name": "Campaign Finance, Disclosure and Reporting Requirements",
    "anchor": "13-2-7",
    "heading": "Filing, Preservation and Public Inspection of Statements.",
    "verbatim": "13-2-7. Filing, Preservation and Public Inspection of Statements.\n(a)\tRecordkeeping.\n(1)\tCopies of documents supporting the contributions and expenditures included in any statements required by this section shall be maintained by the person or committee and provided to the city clerk in the event of an audit.\n(2)\tIndividuals and unofficial candidate committees who make an expenditure on behalf of any candidate who has received public funding under this chapter shall keep records of the time, place, and general subject matter of all consultation with any person about the substance, venue, and timing of the expenditure, which records shall be given to the city clerk if the clerk makes a demand for same. The clerk is authorized to make such a demand any time the clerk has a reasonable suspicion that the expenditures were controlled by or coordinated with or made upon consultation with any candidate or candidate's committee or agent thereof.\n(b)\tPersons required by this chapter to file statements or deliver notices shall file such statements or notices with the city clerk on forms that the clerk provides and preserve such records for a period of six months from the date of the election.\n(c)\tThe city clerk shall preserve all statements filed under this chapter for a period of six months from the date of the election or, in the case of a successful candidate, until six months after the person finally leaves office, or as specified in the city's Records Retention Schedule, whichever is longer. Such statements constitute a part of the public records of the city and shall be available for public inspection during normal business hours.\nOrdinance No. 8317 (2019)"
  },
  {
    "corpus": "BRC",
    "title": "13",
    "title_name": "ELECTIONS AND CAMPAIGN DISCLOSURE",
    "chapter": "3",
    "chapter_name": "Compliance and Enforcement for Campaign Violations",
    "anchor": "13-3-1",
    "heading": "Legislative Intent.",
    "verbatim": "13-3-1. Legislative Intent.\nThe provisions of this chapter are intended to assist with the enforcement of the regulatory provisions of Chapter 13-2, \"Campaign Finance, Disclosure and Reporting Requirements,\" B.R.C. 1981. The provisions of this chapter (a) provide procedures for citizen enforcement of complaints before the city clerk or a hearing officer and quasi-judicial review of that decision; (b) identify cures, remedial orders, and penalties that may be imposed by the city; and (c) make clear the city retains its power to enforce any code provision in a civil or criminal action. The procedures set forth in this chapter are not exclusive and shall supplement other applicable enforcement provisions, including those in Title 5, B.R.C. 1981.\nOrdinance No. 8317 (2019)"
  },
  {
    "corpus": "BRC",
    "title": "13",
    "title_name": "ELECTIONS AND CAMPAIGN DISCLOSURE",
    "chapter": "3",
    "chapter_name": "Compliance and Enforcement for Campaign Violations",
    "anchor": "13-3-2",
    "heading": "Allegation of Election Code Violation by Registered Elector.",
    "verbatim": "13-3-2. Allegation of Election Code Violation by Registered Elector.\n(a)\tA registered elector of the city may file a complaint with the city clerk alleging that any provision of Chapter 13-2, \"Campaign Finance, Disclosure and Reporting Requirements,\" B.R.C. 1981, of this title has been violated. The complaint shall be in writing and must be submitted no later than forty-five days following any election in which it is alleged that the violation occurred. The complaint shall:\n(1)\tIdentify the particular provisions of Chapter 13-2, \"Campaign Finance, Disclosure and Reporting Requirements\" that allegedly were violated;\n(2)\tIdentify the person violating the stated provisions (the \"respondent\");\n(3)\tState the factual basis for that allegation;\n(4)\tIdentify any relevant documents or other evidence;\n(5)\tIdentify any witnesses or persons with relevant knowledge; and\n(6)\tState whether the person filing the complaint (the \"complainant\") is willing to pursue the complaint through a hearing process as provided for in this chapter if the city clerk determines a hearing is necessary.\n(b)\tThe city clerk will notify the respondent and may provide the respondent an opportunity to provide information or otherwise respond to the allegations of the complaint.\nOrdinance No. 8317 (2019)"
  },
  {
    "corpus": "BRC",
    "title": "13",
    "title_name": "ELECTIONS AND CAMPAIGN DISCLOSURE",
    "chapter": "3",
    "chapter_name": "Compliance and Enforcement for Campaign Violations",
    "anchor": "13-3-3",
    "heading": "Review of Complaint.",
    "verbatim": "13-3-3. Review of Complaint.\nThe city clerk will evaluate the complaint and all information in the clerk's possession related to the complaint to determine whether there is probable cause to believe that further investigation would disclose a violation by the respondent. The city clerk may, at the clerk's discretion, consult with the city attorney or delegated legal counsel regarding this review. Such determination shall be made based upon the complaint, any information provided by the complainant or the respondent, and upon such additional information as the clerk may determine to be pertinent.\nOrdinance No. 8317 (2019)"
  },
  {
    "corpus": "BRC",
    "title": "13",
    "title_name": "ELECTIONS AND CAMPAIGN DISCLOSURE",
    "chapter": "3",
    "chapter_name": "Compliance and Enforcement for Campaign Violations",
    "anchor": "13-3-4",
    "heading": "Action by City Clerk.",
    "verbatim": "13-3-4. Action by City Clerk.\n(a)\tIf the city clerk determines that the violation, if any, can be cured, the city clerk shall provide written notice to the complainant and the respondent of the potential cure. After the cure is implemented in accordance with the direction of the city clerk, the city clerk shall provide written notice that no violation exists to the complainant and the respondent.\n(b)\tIf the city clerk determines that no probable cause exists that further investigation would disclose a violation by the respondent, the city clerk shall close the file with regard to the matter. In that event, the city clerk shall notify both the complainant and the respondent in writing. A determination by the city clerk that there is no probable cause that further investigation would disclose a violation shall be final and no appeal or review from such determination shall be permitted.\n(c)\tIf the city clerk determines that there is probable cause that there may be a violation and can make the decision on the allegation without a hearing, the city clerk shall provide a written determination to the complainant and the respondent.\n(d)\tIf the city clerk determines that there is probable cause that there may be a violation and additional facts are necessary to make a final determination on the violation, and the complainant is willing to present the case to prove the violation, a hearing shall be held as provided herein.\nOrdinance No. 8317 (2019)"
  },
  {
    "corpus": "BRC",
    "title": "13",
    "title_name": "ELECTIONS AND CAMPAIGN DISCLOSURE",
    "chapter": "3",
    "chapter_name": "Compliance and Enforcement for Campaign Violations",
    "anchor": "13-3-5",
    "heading": "Power of City Clerk to Offer Cure or Issue Remedial Order.",
    "verbatim": "13-3-5. Power of City Clerk to Offer Cure or Issue Remedial Order.\nAt any point prior to or during the investigation of a complaint, if the city clerk determines that an alleged violation can be cured or handled by remedial action, the city clerk may direct the respondent to cure the violation or take remedial action within seventy-two hours, including, without limitation, the following:\n(a)\tFiling a corrected disclosure form;\n(b)\tPublishing corrective advertising;\n(c)\tRefunding any contributions obtained in violation of Chapter 13-2; and\n(d)\tRefunding to the city any public monies inappropriately obtained for the financing of election activities.\nIn the event the respondent timely complies with the cure or remedial action required, any investigation of a complaint shall be terminated, and the final written decision of the city clerk shall be provided to the complainant and respondent.\nOrdinance No. 8317 (2019)"
  },
  {
    "corpus": "BRC",
    "title": "13",
    "title_name": "ELECTIONS AND CAMPAIGN DISCLOSURE",
    "chapter": "3",
    "chapter_name": "Compliance and Enforcement for Campaign Violations",
    "anchor": "13-3-6",
    "heading": "Hearings on Complaints.",
    "verbatim": "13-3-6. Hearings on Complaints.\n(a)\tThe purpose of hearings on complaints will be to determine whether sufficient evidence of a violation by the respondent exists to warrant finding a violation occurred and imposing a penalty.\n(b)\tThe hearing may be held before the city clerk or a hearing officer appointed by the city manager who may be a city employee. A hearing officer shall be appointed when the dispute involves the city clerk's decisions regarding the administration or enforcement of this article. Any hearing shall be held in conformance with this chapter.\n(c)\tThe hearing officer has the authority provided in Section 1-3-5, \"Hearings and Determinations,\" to conduct the hearing and any decision shall be in accordance with the intent of Chapter 13-2 and this chapter.\nOrdinance No. 8317 (2019)"
  },
  {
    "corpus": "BRC",
    "title": "13",
    "title_name": "ELECTIONS AND CAMPAIGN DISCLOSURE",
    "chapter": "3",
    "chapter_name": "Compliance and Enforcement for Campaign Violations",
    "anchor": "13-3-7",
    "heading": "Remedies Not Exclusive.",
    "verbatim": "13-3-7. Remedies Not Exclusive.\nThe procedures set forth by these provisions shall not impair the right of any interested party, including the city clerk, the city attorney or a complainant, to notify the district attorney or the police of crimes that might be investigated or potentially prosecuted by those agencies, or pursue in municipal or state court such remedies as may be appropriate, including but not limited to prosecution under Title 5, B.R.C. 1981. This chapter shall not be construed as to require administrative proceedings before such criminal or civil action.\nOrdinance No. 8317 (2019)"
  },
  {
    "corpus": "BRC",
    "title": "13",
    "title_name": "ELECTIONS AND CAMPAIGN DISCLOSURE",
    "chapter": "3",
    "chapter_name": "Compliance and Enforcement for Campaign Violations",
    "anchor": "13-3-8",
    "heading": "No Appeal to City Council.",
    "verbatim": "13-3-8. No Appeal to City Council.\nNo decision by the city clerk made pursuant to this chapter shall be reviewed or reversed by the city council. The city council shall not become involved in the handling of any matter brought or investigated pursuant to these provisions. Nothing in this chapter shall be deemed to create a right of appeal to the city council by a complainant or person named in a complaint.\nOrdinance No. 8317 (2019)"
  },
  {
    "corpus": "BRC",
    "title": "13",
    "title_name": "ELECTIONS AND CAMPAIGN DISCLOSURE",
    "chapter": "3",
    "chapter_name": "Compliance and Enforcement for Campaign Violations",
    "anchor": "13-3-9",
    "heading": "Confidentiality of Investigation.",
    "verbatim": "13-3-9. Confidentiality of Investigation.\nThe contents of files relating to pending inquiries or investigations into possible violations of the provisions of chapter 13-2, \"Campaign Finance, Disclosure and Reporting Requirements,\" and preliminary reports or drafts relating to the results of investigations, shall not be made public. The complaint, any written direction by the city clerk to a respondent to cure a violation, the final results of the clerk's inquiry or investigation, and the clerk's final decision on a complaint shall be made public unless there is a good cause. Good cause shall include but not be limited to interference with pending litigation, criminal prosecution or disclosure of a person's identity where such disclosure could affect the safety of that person. Any person may appeal to the municipal court a decision to release or not to release such information. The city council finds that other disclosures could compromise criminal justice investigations and undermine the purposes of this title 13 for compliance with the election and campaign disclosure requirements. Further, the city council finds that such disclosures would be contrary to the public interest because such disclosures might have the effect of politically damaging a person or interest in a case in which the final disposition of an investigation would not sustain a finding of misconduct. The release of interim findings or draft reports might in that manner interfere with the appropriate workings of the democratic process.\nOrdinance No. 8317 (2019)"
  },
  {
    "corpus": "BRC",
    "title": "13",
    "title_name": "ELECTIONS AND CAMPAIGN DISCLOSURE",
    "chapter": "3",
    "chapter_name": "Compliance and Enforcement for Campaign Violations",
    "anchor": "13-3-10",
    "heading": "Campaign Finance Violations and Penalty.",
    "verbatim": "13-3-10. Campaign Finance Violations and Penalty.\n(a)\tCriminal Acts and Penalties. It shall be unlawful to:\n(1)\tFile any statement required by Chapter 13-2 that the person knows contains false information;\n(2)\tFail to file a required statement within seventy-two hours of having been notified by the city clerk pursuant to this chapter;\n(3)\tFail to provide required information necessary to complete a required statement within seventy-two hours of having been notified by the city clerk pursuant to this chapter;\n(4)\tKnowingly misstate or misrepresent the names of the persons required to be disclosed by Chapter 13-2; or\n(5)\tFail to comply with any of the requirements of Chapter 13-2.\n(b)\tCivil Action by Registered Elector. In lieu of filing a complaint with the city as provided in Section 13-3-2 above, any registered elector of the city may bring a civil action including, without limitation, an action for injury, and may sue for injunctive relief to enjoin violations or to compel compliance with Chapter 13-2 , provided such person first files with the city attorney a written request for the city attorney to commence action. The request to the city attorney shall include a statement of grounds for believing a cause of action exists. The city attorney shall respond within ten days after receipt of the request indicating whether the city attorney intends to file a civil action. If the city attorney indicates in the affirmative and files suit within thirty days thereafter, no other civil action for the same violation may be brought by any registered elector unless the action brought by the city attorney is dismissed without prejudice.\n(c)\tPenalties. In addition to any other applicable remedy at law or in equity, the following shall apply:\n(1)\tAny official or unofficial candidate committee that knowingly accepts a contribution in excess of $100, or exceeds the expenditure limit in violation of Chapter 13-2, is liable in a civil action initiated by the city attorney or by a registered elector of the city for an amount up to $500, or three times the amount by which the contribution or expenditure limit is exceeded, whichever is greater. In determining the amount of civil liability, the hearing officer or court may take into account the seriousness of the violation and culpability of the defendant.\n(2)\tThe penalties in Section 5-2-4, \"General Penalties,\" B.R.C 1981.\nOrdinance No. 8317 (2019)"
  }
]