[
  {
    "corpus": "BRC",
    "title": "14",
    "title_name": "ARTS",
    "chapter": "1",
    "chapter_name": "Arts Grant Program",
    "anchor": "14-1-1",
    "heading": "Legislative Intent.",
    "verbatim": "14-1-1. Legislative Intent.\nAn arts grant program is hereby created, whose purpose is to encourage and financially support local arts organizations in order to stimulate, promote, and sustain the arts, culture, and creativity for the benefit of the people of the city.\nOrdinance No. 8207 (2017)"
  },
  {
    "corpus": "BRC",
    "title": "14",
    "title_name": "ARTS",
    "chapter": "1",
    "chapter_name": "Arts Grant Program",
    "anchor": "14-1-2",
    "heading": "Eligible Programs and Projects.",
    "verbatim": "14-1-2. Eligible Programs and Projects.\n(a)\tIndividuals and organizations are eligible to apply for grants from the city for programs, projects, and operational support that stimulates or promotes arts, culture, and creativity for the people of the city, including, without limitation:\n(1)\tVisual arts and crafts;\n(2)\tMusic;\n(3)\tTheater;\n(4)\tLiterary arts;\n(5)\tDance;\n(6)\tTime-based media, film/video, digital art, and web-based art;\n(7)\tEducational activities including lectures, classes and field trips;\n(8)\tFestivals, exhibitions, and art in public places;\n(9)\tHistory and heritage;\n(10)\tDesign, architecture, and landscape; and\n(11)\tThe contemplative arts.\n(b)\tAny performance, production, lecture, class, reading, exhibition, festival, film, organization, or other program funded in whole or in part by a grant under this chapter shall primarily be located, held, or shown within the Boulder Valley as defined by the then current version of the Boulder Valley Comprehensive Plan.\nOrdinance No. 8207 (2017)"
  },
  {
    "corpus": "BRC",
    "title": "14",
    "title_name": "ARTS",
    "chapter": "1",
    "chapter_name": "Arts Grant Program",
    "anchor": "14-1-3",
    "heading": "Application for Arts Grants.",
    "verbatim": "14-1-3. Application for Arts Grants.\n(a)\tAn applicant for grants under this chapter shall file an application with the City of Boulder Arts Commission upon forms prescribed by the commission for that purpose.\n(b)\tAn applicant shall verify its application as to the truth and correctness of all facts and information presented.\nOrdinance No. 8207 (2017)"
  },
  {
    "corpus": "BRC",
    "title": "14",
    "title_name": "ARTS",
    "chapter": "1",
    "chapter_name": "Arts Grant Program",
    "anchor": "14-1-4",
    "heading": "Functions of Boulder Arts Commission.",
    "verbatim": "14-1-4. Functions of Boulder Arts Commission.\n(a)\tThe commission shall work with arts and culture staff to develop and recommend criteria, guidelines, and processes necessary for the administration of the Arts Grant Program, including but not limited to, application requirements, procedures and review, and appeals process.\n(b)\tThe commission may consult with advisors in reviewing and evaluating grant applications. Advisors shall be individuals deemed by the commission to have special knowledge or expertise in the arts, culture, creativity, or the community.\n(c)\tThe commission has final authority for approval of arts grant funding distributions. The commission may delegate authority for funding distributions to the city manager.\n(d)\tAny appeal of the decision of the commission shall conform to the process established by the commission.\nOrdinance No. 8207 (2017)"
  }
]