[
  {
    "corpus": "BRC",
    "title": "7",
    "title_name": "Vehicles, Pedestrians, and Parking",
    "chapter": "1",
    "chapter_name": "Definitions",
    "anchor": "7-1-1",
    "heading": "Definitions.",
    "verbatim": "7-1-1. Definitions.\n(a)\tThe following words and phrases used in this title have the following meanings unless the context clearly indicates otherwise:\nAbandoned vehicle means any vehicle other than a bicycle that is left in one location on public property or on private property without the consent of the owner thereof for twenty-four hours more than the time limited by any signs, parking payment apparatus or technology, or pavement markings that apply to that location, or a continuous period of more than seventy-two hours at any other unregulated location.\nAlley means a street or way within a block set apart for public use, vehicular travel, and local convenience to provide access to the rear or side of abutting lots or buildings.\nAntique vehicle means a vehicle registered with and licensed as an antique vehicle by the Division of Motor Vehicles of the Colorado State Department of Revenue or the department of motor vehicles of any other state.\nAuthorized emergency vehicle means every vehicle equipped with audible or visual signals meeting the requirements of § 42-4-213, C.R.S., as amended, and operated by a city police officer, city firefighter, or any peace officer, every other vehicle defined as an authorized emergency vehicle by state law, and every bicycle operated by a uniformed peace officer.\nAuthorized service vehicle means such highway or traffic maintenance vehicles as are publicly owned and operated on a highway by or for a governmental agency, the function of which requires the use of service vehicle warning lights as prescribed by state law and such other vehicles having a public service function, including, without limitation, public utility vehicles and tow trucks, as determined by the State Department of Highways under § 42-4-214(5) C.R.S., as amended. Some vehicles may be designated as both an authorized emergency vehicle and an authorized service vehicle.\nBicycle means a vehicle propelled solely by human power applied to pedals upon which any person may ride having two tandem wheels or two parallel wheels and one forward wheel, all of which are more than fourteen inches in diameter.\nBike lane or bicycle lane means that portion of a roadway designated for use by bicycles and distinguished from the portion of the roadway for other vehicular traffic by a paint stripe and other traffic control device. It extends from the stripe to the right-hand edge of the roadway, unless a second stripe delineates a parking lane or lane of vehicular travel adjacent to the right-hand edge of the roadway, in which event the bicycle lane extends from stripe to stripe.\nBus means a motor vehicle owned or operated by a public authority and designed for carrying more than ten passengers.\nBus stop means an area extending eight feet into the roadway from the curb and extending along the curb between the traffic control signs designating it as such. Where a traffic control sign indicates the bus stop but does not indicate its extent, it extends for fifty feet before the sign. Where the curb is indented on a street where parking is prohibited and a traffic control sign indicates a bus stop in the indented area, the bus stop extends along the entire indented area. For the purposes of this paragraph, signs erected at the curb bearing the words Regional Transportation District, or \"The Ride,\" or the letters R.T.D., or \"The Hop,\" or a symbol for a bus are traffic control signs designating a bus stop.\nCenter or centerline means a continuous or broken line marked upon the surface of a roadway by paint or otherwise to indicate the portion of the roadway allocated to traffic proceeding in opposite directions, and if the line is not so painted or otherwise marked, it is an imaginary line in the roadway equally distant from each curb. In the event that a street includes two or more separate one-way roadways, centerline means the left curb of each such roadway.\nChild care center means a facility required to be licensed under the \"Child Care Licensing Act,\" article 26-6, C.R.S.\nChild restraint system means any device that is designed to protect, hold, or restrain a child in a motor vehicle in such a way as to prevent or minimize injury to the child in the event of a motor vehicle accident and that conforms to all applicable federal motor vehicle safety standards.\nCommercial vehicle means any self-propelled or towed vehicle bearing an apportioned plate or having a manufacturer's recommended gross vehicle weight rating of ten thousand one pounds or more, which vehicle is used in commerce on the public highways of this state or is used to transport sixteen or more passengers, including the driver.\nConstruction zone means a portion of a street designated by the city manager or, in the case of state highways, by either the manager or the Colorado Department of Transportation, where maintenance, repair, or construction activities are occurring or will be occurring within four hours. Such designation shall be by an appropriate sign erected or placed in a conspicuous place before the area where the activity is taking place or will be taking place, and shall notify the public that increased penalties for speeding violations are in effect in such zone. The manager or the department shall erect or place a second sign after the zone indicating that the increased penalties for speeding violations are no longer in effect. Such signs may be displayed on any fixed, variable, or movable stand, and may be placed on a moving vehicle if required for the work, which may include, but shall not be limited to, highway painting work.\nControlled access street means any street that is a state highway and those portions of any other street, bounded by intersecting streets, that have no established curbcuts.\nCrosswalk means, where unmarked, that portion of a roadway included within the prolongation or connection of the lateral lines of a sidewalk, sidewalks, or path or paths, and, where marked, that portion of a roadway indicated for pedestrian crossing by traffic control markings.\nCurb or curb line means the raised concrete or asphalt edge separating the roadway of a street from the sidewalk, boulevard strip, median strip, path, or other areas, and includes its prolongation across an intersection or junction. Where no curb exists, the edge of that portion of the street improved, designed, or ordinarily used for motor vehicular travel is the curb.\nDriver means every person who drives or is in actual physical control of the steering, accelerating, or braking controls of a vehicle or the rider of an animal. No person shall be deemed not to be the driver or to drive because a vehicle is out of control except immediately following a collision not proximately caused by a traffic violation of such driver. A person dismounted from a bicycle, moped, or motorcycle and pushing it on foot is a pedestrian, not a driver.\nDriving lane means a lane available for vehicular traffic, but does not include within its meaning a parking lane, a paved shoulder if the vehicle is a motor vehicle, or a restricted lane if the vehicle being driven is not permitted to be driven within that restricted lane.\nEarphones means any headset, radio, tape player, or other similar device, which is designed to provide the listener with radio programs, music, or other recorded information through a device which covers all or a portion of both ears.\nElectric assisted bicycle means a vehicle having two tandem wheels or two parallel wheels and one forward wheel, fully operable pedals, and an electric motor not exceeding seven hundred fifty watts of power. Electric assisted bicycles are further required to conform to one of two classes as follows:\n(1)\tClass 1 electric assisted bicycle means an electric assisted bicycle equipped with an electric motor that provides assistance only when the rider is pedaling and that ceases to provide assistance when the bicycle reaches a speed of twenty miles per hour.\n(2)\tClass 2 electric assisted bicycle means an electric assisted bicycle equipped with an electric motor that provides assistance regardless of whether the rider is pedaling but ceases to provide assistance when the bicycle reaches a speed of twenty miles per hour.\nElectric scooter means a device:\n(a)\tWeighing less than one hundred pounds;\n(b)\tWith handlebars and an electric motor;\n(c)\tThat is powered by an electric motor; and\n(d)\tThat has a maximum speed of twenty miles per hour on a paved surface when powered solely by the electric motor.\nFirefighter means any person commissioned as such under the provisions of Section 2-5-4, \"Identification Card for Firefighters,\" B.R.C. 1981, and any member of another fire department who is acting under the direction of the City of Boulder Fire Department and is identifiable as a firefighter.\nFlagger means an employee of a public authority, other than a peace officer or firefighter, acting within the scope of such employee's duties. It also means such employees of private enterprises working on or adjacent to a street or on any street construction project under contract with a public authority or by permit who have been trained and appointed for special traffic duty as street or highway flaggers by the city or the state. Such employees are flaggers only when reasonably recognizable as such by wearing the badge, insignia, or uniform of their office.\nGross vehicle weight rating or GVWR means the value specified by the manufacturer as the maximum loaded weight of a single or a combination (articulated) vehicle, or registered gross weight, whichever is greater. The GVWR of a combination (articulated) vehicle, commonly referred to as the gross combination weight rating or GCWR, is the GVWR of the power unit plus the GVWR of any towed unit.\nHoliday means New Year's Day, Martin Luther King, Jr. Day, President's Day, Memorial Day, Independence Day, Veterans' Day, Labor Day, Colorado Day, Thanksgiving Day, Christmas Day, and such additional entire days declared as holidays by city ordinance or state or federal statute. Where the holiday observed differs from the day of the historical event commemorated, the day observed is the holiday for the purposes of traffic law enforcement.\nHuman powered vehicle means every vehicle, except a bicycle and electric assisted bicycle, propelled solely by human energy including by way of example but not limitation, roller skates, skateboard, and roller ski, but not including any ski, coaster, sled, toboggan, toy vehicle, or child's tricycle.\nInoperable motor vehicle means any motor vehicle or trailer that does not have a current license plate and validation sticker lawfully affixed thereto or that is apparently inoperable due to being wrecked, dismantled, or partially dismantled or having essential parts missing.\nIntersection means the area embraced within the prolongation or connection of the lateral curblines of two streets that join one another at, or approximately at, right angles or the area within which vehicles traveling upon different streets joining at any other angle may come in conflict, whether or not one such street crosses the other, but the term does not include the junction of any alley with a street. If a street includes two roadways thirty feet or more apart, every crossing of each roadway of such divided street by an intersecting street is a separate intersection. If such intersecting street also includes two roadways thirty feet or more apart, every crossing of such streets is a separate intersection. The farthest applicable points shall be used when measuring.\nJunction means the intersection of a street with a driveway, alley, parking lot, or any similar established point of entry or exit onto or from a street other than onto or from another street.\nLane means the portion of a roadway used for the movement of a single line of vehicles. Unless otherwise indicated by traffic control devices, every undivided roadway on which lanes are not marked or on which the only pavement marking is a centerline shall be deemed to be a two-way street with one lane for vehicular travel in each direction separated by the centerline. The marked or unmarked portion of a street on which parking is permitted is not a separate lane for vehicular travel but is a parking lane.\nLightweight electric vehicle means any device capable of moving itself, or of being moved, from place to place upon wheels that is powered by a battery and weighing less than fifty pounds, including by way of example but not limitation an electric scooter, electric skateboard, electric unicycle, and self-balancing single-wheel electric personal transport board. Lightweight electric vehicle shall not include a toy vehicle.\nLow-power scooter means:\n(a)\tA self-propelled vehicle designed primarily for use on the roadways with not more than three wheels in contact with the ground, no manual clutch, and either of the following:\n(1)\tA cylinder capacity not exceeding fifty cubic centimeters if powered by internal combustion; or\n(2)\tA wattage not exceeding four thousand four hundred seventy-six if powered by electricity.\n(b)\t\"Low-power scooter\" does not include a toy vehicle, bicycle, electric assisted bicycle, electric scooter, or any device designed to assist people with mobility impairments who use pedestrian rights-of-way.\nLow-speed electric vehicle means a vehicle that:\n(a)\tIs self-propelled utilizing electricity as its primary propulsion method;\n(b)\tHas at least three wheels in contact with the ground;\n(c)\tDoes not use handlebars to steer;\n(d)\tExhibits the manufacturer's compliance with 49 C.F.R. 565 or displays a seventeen-character vehicle identification number as provided in 49 C.F.R. 565; and\n(e)\tWhose maximum speed is not greater than twenty-five miles per hour.\nSuch vehicles are motor vehicles and are authorized to operate upon the streets of the city subject to the provisions of this title.\nMall means the Downtown Boulder Mall as defined in Section 1-2-1, \"Definitions,\" B.R.C. 1981.\nMoped means a vehicle having two or three wheels, equipped with operable pedals and a helper motor powered by a combustible engine, and not licensed or required to be licensed as a motorcycle, motor-driven cycle, motor scooter, or motor-bicycle under the state vehicle licensing laws.\nMotor vehicle means any self-propelled vehicle other than a moped, electric assisted bicycle, or motorized wheelchair.\nMotorcycle means every motor vehicle designed to travel with not more than three wheels in contact with the ground, except a moped or farm tractor.\nMotorized wheelchair means a self-propelled vehicle similar in size to a wheelchair and designed for and used by a person with a mobility impairment.\nMulti-use path means a way publicly maintained that has been designated for use by pedestrians, bicycles, human powered vehicles, and lightweight electric vehicles by a traffic control device or other sign or by regulation and that is separated from the roadway for other vehicular traffic by open space, a curb or another barrier. Whenever this code or any ordinance of the city refers to a path, it is deemed to include a multi-use path.\nOwner means jointly and severally the person who holds the legal title of a vehicle, the person in whose name the vehicle is registered with the state or any other state for licensing purposes, and any person otherwise having lawful use or control or the right to use or control a vehicle for a period of thirty days or more.\nPark means, when prohibited, the stopping of a vehicle, whether occupied or not, other than very briefly for the purpose of and while actually engaged in loading or unloading passengers while the vehicle is occupied.\nParking payment apparatus or technology means any device or technology used to accept payment for parking, such as parking meters, pay stations, mobile devices, or other methods approved by the city manager.\nPath means a way publicly maintained that has been designated for use by bicycles only or by bicycles and pedestrians by a traffic control device or other sign or by regulation and that is separated from the roadway for other vehicular traffic by open space, a curb or another barrier.\nPedestrian means:\n(1)\tA person afoot or using a wheelchair or motorized wheelchair; or\n(2)\tA person specifically assigned the rights of a pedestrian by any provision of this title.\nPrivate driveway means every surface designed for vehicular travel and not owned by a public authority.\nPrivate sidewalk means any walk not within a street that is paved or otherwise improved, designed, or ordinarily used for pedestrians.\nProximate cause means that which, in natural and continuous sequence, unbroken by an efficient, intervening cause, produced the result complained of and without which the result would not have occurred.\nPublic authority means the City of Boulder, State of Colorado, or the United States, any of their agencies or instrumentalities, and any body or official thereof possessing power or authority delegated by the public authority.\nRailroad grade crossing means the intersection of a street and the tracks of a railroad.\nRailroad sign or signal means any sign, signal, or device erected by a public authority or by any railroad and intended to give notice of the presence of railroad tracks or the approach of a railroad train.\nRight-of-way means the right of one user of a street to proceed unimpeded in a lawful manner in preference to another person who is approaching under such circumstances of direction, speed, and proximity as to give rise to danger of collision unless one grants precedence to the other. A speed no more than ten miles per hour in excess of the speed limit prescribed by Section 7-4-58, \"Speeding,\" B.R.C. 1981, does not cause a forfeiture of the right-of-way, and all persons are presumed to be driving at no more than such a speed until the contrary is established by a preponderance of credible evidence.\nRoadway means that portion of a street from curb to curb. If a street includes two or more separate roadways, roadway refers to any such roadway separately, but not to all such roadways collectively.\nRotary traffic island means a median island located in the center portion of an intersection.\nSafe, safely, andin safety mean:\n(1)\tWithout hazard to person or property;\n(2)\tWithout in any way interfering with, impeding, hindering, obstructing, or taking the right-of-way from any other vehicle or pedestrian;\n(3)\tIn an attentive, careful, and prudent manner; and\n(4)\tAt a speed such that recovery from errors in judgment is possible.\nSafety belt means a system utilizing a lap belt, a shoulder belt, or any other belt or combination of belts installed in a motor vehicle to restrain drivers and passengers, which system conformed to federal motor vehicle safety standards at the time of its installation.\nSchool bus means every motor vehicle operated for the transportation of children to or from school and owned by a public authority or privately owned and operated for compensation. The term compensation does not include informal or intermittent arrangements, such as sharing of actual gasoline expense or participation in a carpool.\nSchool zone means any portion of a street designated by an official traffic control device as a school zone, during the time when a lower speed limit for that zone is in effect as indicated on or by such device, or during any other time indicated by a traffic control device as a time for increased vigilance in such zone, and, for the purposes of increased penalties, if the sign also indicates that penalties will be doubled.\nSeating position means any motor vehicle interior space intended by the motor vehicle manufacturer to provide seating accommodation while the motor vehicle is in motion.\nShared street means a roadway that minimizes demarcations between vehicle traffic and pedestrians by removing features such as curbs, road surface markings, and certain regulations. Through a variety of treatments, including landscaping, traffic calming, pavement features, and pedestrian amenities, it is made accessible and designed to be shared by all modes of transportation. The street is intended to be used for open space and pedestrian circulation as well as typical transportation purposes conducted in a safe manner by all modes of transportation. Many of the rules restricting a pedestrian or cyclist's use of the roadway are suspended on this roadway.\nSidewalk means that portion of the sidewalk areas paved or otherwise improved, designed, or ordinarily used for pedestrians and every such walk parallel and adjacent to a roadway, and every other paved exterior walkway publicly maintained.\nSidewalk area means the area between the curb of a street and the adjacent property lines.\nState highway means a street designated as part of the state highway system under the provisions of § 43-2-134, C.R.S., as amended. Designation of the street as a state highway on any map published by the state or the city or marked as such by signs is prima facie evidence of such designation.\nState traffic control manual means the most recent edition of the Manual on Uniform Traffic Control Devices for Streets and Highways, including any supplement thereto, as adopted by the Colorado State Highway Commission.\nStop means, when required, complete cessation from movement. When prohibited, the term means any halting, even momentarily, of a vehicle except when necessary to avoid conflict with other traffic or in compliance with the directions of a police officer, firefighter, or any other person authorized under this title to control traffic or any traffic control device.\nStreet means the entire width between the property boundary lines of every way publicly maintained when any part thereof is open to the use of the public for purposes of vehicular travel and includes, without limitation, alleys or the entire width of every way declared to be a public highway by any law.\nSunrise and sunset mean the time given at latitude 40 degrees north for the day of the year in the current Nautical Almanac, plus one hour during daylight saving time.\nTime means, whenever certain hours are named herein or on any traffic control sign or parking payment apparatus or technology, mountain standard time or mountain daylight time, depending on the date, as prescribed by state law. Mountain standard time is coordinated universal time minus seven hours. Mountain daylight time is coordinated universal time minus six hours.\nTowing carrier means a person regularly engaged in the business of towing motor vehicles and licensed by the Colorado Public Utilities Commission.\nToy vehicle means any vehicle that has wheels and is not designed for use on streets or for off-road use. \"Toy vehicle\" includes, but is not limited to, gas-powered or electric-powered vehicles commonly known as mini-bikes, \"pocket\" bikes, and kamikaze boards. \"Toy vehicle\" does not include lightweight electric vehicles, off-highway vehicles, or snowmobiles.\nTraffic means pedestrians, ridden or herded animals, and vehicles, either singly or together, which using any street, trail, or path for purposes of travel.\nTraffic circle means an intersection containing a rotary traffic island, and includes that portion of the intersection open and available for counterclockwise vehicular traffic flow around the central island.\nTraffic control device means any traffic control sign, signal, marking or device, not inconsistent with this title, placed or displayed by authority of the traffic engineer or of any public official or public body having authority over a street, drive, way, trail, path, or parking area for the purpose of regulating, warning, or guiding traffic or the parking of vehicles. Where this title does not prescribe the meaning of a device, it has the meaning ascribed to it by the state traffic control manual, and where no such meaning is given, it has the meaning a reasonable person would give it.\nTraffic control marking means a marking on the pavement of a street placed by a public authority to regulate, warn, or guide traffic.\nTraffic control sign means sign on above, or adjacent to a street, trail, or path placed by a public authority to regulate, warn, or guide traffic.\nTraffic control signal means a device on, above, or adjacent to a street placed by a public authority by which traffic is alternately directed to proceed and stop by means of the display of colored lights or symbols.\nTraffic engineer means the city manager, any city employee designated by the manager to act as traffic engineer or assistant traffic engineer, and the supervisors of any person so designated.\nTrailer means any wheeled vehicle, without motive power, that is designed to be drawn by a motor vehicle.\nVehicle means any device that is capable of moving itself, or of being moved, from place to place upon wheels or endless tracks, excepting devices used exclusively upon stationary rails or tracks.\n(b)\tWords defined in Chapter 1-2, \"Definitions,\" B.R.C. 1981, have the meanings there expressed if not differently defined by this chapter.\nOrdinance Nos. 5058 (1987); 5241 (1989); 5271 (1990); 5638 (1994); 5681 (1994); 5686 (1994); 5848 (1996); 5920 (1997); 6033 (1998); 7021 (1999); 7294 (2003); 7572 (2008); 7941 (2013); 7996 (2014); 8423 (2020); 8447 (2021); 8575 (2023); 8642 (2024)"
  },
  {
    "corpus": "BRC",
    "title": "7",
    "title_name": "Vehicles, Pedestrians, and Parking",
    "chapter": "2",
    "chapter_name": "General Provisions",
    "anchor": "7-2-1",
    "heading": "Legislative Intent.",
    "verbatim": "7-2-1. Legislative Intent.\nThe purpose of this title is to protect the health, safety, welfare, and convenience of the public by regulating the movement and stopping of pedestrians and ridden or herded animals on streets, and the equipment, movement, stopping, parking, storage, and towing of vehicles."
  },
  {
    "corpus": "BRC",
    "title": "7",
    "title_name": "Vehicles, Pedestrians, and Parking",
    "chapter": "2",
    "chapter_name": "General Provisions",
    "anchor": "7-2-2",
    "heading": "Short Title.",
    "verbatim": "7-2-2. Short Title.\nThis title may be referred to as the \"Boulder Traffic Ordinance.\""
  },
  {
    "corpus": "BRC",
    "title": "7",
    "title_name": "Vehicles, Pedestrians, and Parking",
    "chapter": "2",
    "chapter_name": "General Provisions",
    "anchor": "7-2-3",
    "heading": "Application of Title.",
    "verbatim": "7-2-3. Application of Title.\n(a)\tRegulation of vehicles under this title applies everywhere to the maximum extent of the jurisdiction of the city, except for those provisions, sections, or chapters that by their terms apply only to certain areas.\n(b)\tRegulation of pedestrians and ridden or herded animals under this title applies to streets, including, without limitation, sidewalks and sidewalk areas."
  },
  {
    "corpus": "BRC",
    "title": "7",
    "title_name": "Vehicles, Pedestrians, and Parking",
    "chapter": "2",
    "chapter_name": "General Provisions",
    "anchor": "7-2-4",
    "heading": "Penalties.",
    "verbatim": "7-2-4. Penalties.\n(a)\tViolations of any of the provisions of those sections of this title for which no specific penalty has been provided are traffic infractions. Every person who is convicted of a traffic infraction, who admits liability for a traffic infraction, or against whom a judgment is entered for a traffic infraction is subject to a fine or penalty of at least $10 but not more than $500.\n(b)\tThe minimum and maximum fine or monetary penalty for any moving traffic infraction committed in a school zone or posted construction zone shall be double that otherwise provided in this section, but not to exceed $500.\nOrdinance Nos. 6033 (1998); 7409 (2005); 7824 (2012)"
  },
  {
    "corpus": "BRC",
    "title": "7",
    "title_name": "Vehicles, Pedestrians, and Parking",
    "chapter": "2",
    "chapter_name": "General Provisions",
    "anchor": "7-2-5",
    "heading": "Overlapping Prohibitions.",
    "verbatim": "7-2-5. Overlapping Prohibitions.\nCertain traffic misconduct is prohibited under more than one section of this title. The fact that the section a defendant is charged with violating is less specific, carries a greater maximum penalty or carries greater collateral consequences than some other section is not a basis for dismissal or acquittal as long as the elements of the section cited are proven. If the judge finds that the sole basis for the finding of guilt of or liability for a more general charge, one that carries a greater maximum penalty or one that carries greater penalty point collateral consequences against the driving privilege under the statutes of the state was conduct that satisfied the elements of the other charge and no more, the sentence may not exceed the maximum applicable to the other charge, and upon application of a convicted defendant at the time of sentencing, the judge shall amend the judgment to reflect the other charge. Inattentive driving and reckless driving are never \"other\" charges within the meaning of this section, nor is Paragraph 7-4-58(b)(4), B.R.C. 1981, such an other charge of Paragraph 7-4-56(a)(2), B.R.C. 1981.\nOrdinance No. 7424 (2005)"
  },
  {
    "corpus": "BRC",
    "title": "7",
    "title_name": "Vehicles, Pedestrians, and Parking",
    "chapter": "2",
    "chapter_name": "General Provisions",
    "anchor": "7-2-6",
    "heading": "Necessity.",
    "verbatim": "7-2-6. Necessity.\n(a)\tConduct that would otherwise constitute a violation of this title is justifiable and not a violation when:\n(1)\tIt is a reasonable emergency response compelled by the necessity of avoiding an imminent traffic hazard that is about to occur by reason of a traffic situation occasioned or developed through no misconduct, fault or omission of the driver;\n(2)\tThe driver had been obeying all relevant traffic laws prior to the time such driver discovered or reasonably should have discovered the hazard; and\n(3)\tThe hazard was of sufficient gravity that, according to all ordinary standards of careful driving, the desirability and urgency of avoiding the hazard through violating the traffic law by the means employed clearly outweigh the desirability of avoiding the hazard through lawful driving alternatives.\n(b)\tBefore evidence relating to a defense under this section is presented to a jury, the defendant shall first make a detailed offer of proof to the judge, who shall rule as a matter of law whether the claimed facts or circumstances would, if established, establish the defense. If the judge admits such evidence, the judge shall again rule as a matter of law on the sufficiency of the evidence that if believed by the jury would establish the defense.\n(c)\tA defense under this section is a specific defense."
  },
  {
    "corpus": "BRC",
    "title": "7",
    "title_name": "Vehicles, Pedestrians, and Parking",
    "chapter": "2",
    "chapter_name": "General Provisions",
    "anchor": "7-2-7",
    "heading": "Mechanical Failure No Defense.",
    "verbatim": "7-2-7. Mechanical Failure No Defense.\nThe driver of a vehicle has a responsibility to the public to guarantee that the vehicle is at all times in proper mechanical condition so that the driver is able to steer, start, proceed, stop, signal, see and be seen properly, and otherwise to comply with the traffic law. Consequently, mechanical failure, however unexpected, is no defense to a charge of violation of this title except insofar as it serves to negate a reckless, knowing or intentional mental state where such is an element of the violation."
  },
  {
    "corpus": "BRC",
    "title": "7",
    "title_name": "Vehicles, Pedestrians, and Parking",
    "chapter": "2",
    "chapter_name": "General Provisions",
    "anchor": "7-2-8",
    "heading": "Repealed.",
    "verbatim": "7-2-8. Repealed.\nEditor's note(s)—Ord. No. 8447, § 4, adopted April 13, 2021, repealed § 7-2-8, which pertained to bicycle school for children."
  },
  {
    "corpus": "BRC",
    "title": "7",
    "title_name": "Vehicles, Pedestrians, and Parking",
    "chapter": "2",
    "chapter_name": "General Provisions",
    "anchor": "7-2-9",
    "heading": "Driving, Stopping or Parking in Space.",
    "verbatim": "7-2-9. Driving, Stopping or Parking in Space.\nIf any provision of this title prohibits driving, stopping or parking a vehicle in any space, a violation occurs if any part of the vehicle is in such space. If any provision of this title requires that driving, stopping or parking occur within any space, a violation occurs if any part of the vehicle is not in such space."
  },
  {
    "corpus": "BRC",
    "title": "7",
    "title_name": "Vehicles, Pedestrians, and Parking",
    "chapter": "2",
    "chapter_name": "General Provisions",
    "anchor": "7-2-10",
    "heading": "Traffic Control Device Required.",
    "verbatim": "7-2-10. Traffic Control Device Required.\n(a)\tEvery provision of this title for which a traffic control device is required shall be enforced against an alleged violator if, at the time and place of the alleged violation, the device was of the proper type, in proper position, sufficiently legible to be seen by an ordinarily observant person, and placed by a public authority. Whenever a particular section does not state that a device is required, such section is effective even though no device was in place.\n(b)\tAny traffic control device placed in substantial compliance with the position required by the state traffic control manual is in proper position. Where no position is required, any position recommended by the state traffic control manual and any other reasonable position is a proper position.\n(c)\tEvery traffic control device on a street or other land in which a public authority has an interest shall be presumed to be an official traffic control device of proper type and in proper position and sufficiently legible to be seen by an ordinarily observant person and placed by a public authority unless the contrary is established by a preponderance of credible evidence.\n(d)\tEvery traffic control device alongside of or on a sidewalk or path intended to regulate bicycle, pedestrian or any other traffic thereon is in proper position and of the proper type if, at the time and place of the alleged violation, it was in a reasonable position, its command was clear, it was sufficiently legible to be seen by an ordinarily observant person, and it was placed by a public authority.\nOrdinance No. 5241 (1989)"
  },
  {
    "corpus": "BRC",
    "title": "7",
    "title_name": "Vehicles, Pedestrians, and Parking",
    "chapter": "2",
    "chapter_name": "General Provisions",
    "anchor": "7-2-11",
    "heading": "Public Employees to Obey Traffic Regulations.",
    "verbatim": "7-2-11. Public Employees to Obey Traffic Regulations.\nThe provisions of this title apply to all persons regardless of their public or private employment or the public or private ownership of any vehicle involved, subject only to any specific exceptions set forth in this title."
  },
  {
    "corpus": "BRC",
    "title": "7",
    "title_name": "Vehicles, Pedestrians, and Parking",
    "chapter": "2",
    "chapter_name": "General Provisions",
    "anchor": "7-2-12",
    "heading": "Exemptions for Authorized Emergency Vehicles.",
    "verbatim": "7-2-12. Exemptions for Authorized Emergency Vehicles.\n(a)\tThe driver of an authorized emergency vehicle, while responding to an emergency call, while in pursuit of an actual or suspected violator of the law, or while responding to but not returning from a fire alarm may exercise the privileges set forth in this section. The driver of any authorized emergency vehicle may:\n(1)\tPark or stop, irrespective of the provisions of this title;\n(2)\tProceed past a red or stop traffic control signal or sign, but only after slowing down as may be necessary for reasonably safe operation;\n(3)\tExceed a speed limit so long as life or property is not unreasonably endangered thereby; and\n(4)\tDisregard regulations governing direction of movement, turning in specified directions, or driving in a particular place.\n(b)\tThe provisions of this section and Section 7-2-13, \"Exemptions for Maintenance Vehicles,\" B.R.C. 1981, do not relieve the privileged driver of the duty to drive with due regard for the safety of all persons, nor do such provisions protect the driver from the consequences of such driver's reckless disregard for the safety of others.\n(c)\tThe exemptions granted in this section apply only while the authorized emergency vehicle, other than a bicycle, is making use of audible or visible signals meeting the requirements of § 42-4-213 or 42-4-222, C.R.S., as amended, unless using such visual signals would cause an obstruction to the normal flow of traffic. But an authorized emergency vehicle being operated as a police vehicle while responding to or in actual pursuit of a suspected violator of any provision of this title, Title 5, \"General Offenses, B.R.C. 1981, or Title 18, Colorado Revised Statutes, need not display or make use of audible or visible signals as long as such pursuit is being made to obtain verification of or evidence of the guilt of the suspected violator. Where paragraph (a)(1) of this section is concerned, only such lights or other measures need to be taken as are reasonably necessary to warn of the special hazard, if any, presented by such parking or stopping.\nOrdinance Nos. 5848 (1996); 5920 (1997); 7996 (2014)"
  },
  {
    "corpus": "BRC",
    "title": "7",
    "title_name": "Vehicles, Pedestrians, and Parking",
    "chapter": "2",
    "chapter_name": "General Provisions",
    "anchor": "7-2-13",
    "heading": "Exemptions for Maintenance Vehicles.",
    "verbatim": "7-2-13. Exemptions for Maintenance Vehicles.\nDrivers of authorized service vehicles and vehicles engaged in the construction or maintenance of public streets or traffic control devices or authorized to work in the right-of-way under Chapter 4-18, \"Street, Sidewalk and Public Property Use Permits,\" B.R.C. 1981, may, when and where reasonably necessary for such purposes, disregard the provisions of this title concerning parking and stopping, driving too slowly, direction of movement, turning in specified directions, lane usage and similar provisions as long as life or property is not unreasonably endangered thereby."
  },
  {
    "corpus": "BRC",
    "title": "7",
    "title_name": "Vehicles, Pedestrians, and Parking",
    "chapter": "2",
    "chapter_name": "General Provisions",
    "anchor": "7-2-14",
    "heading": "Permit Required for Parades, Processions and Sound Trucks.",
    "verbatim": "7-2-14. Permit Required for Parades, Processions and Sound Trucks.\n(a)\tNo person in a funeral or other procession or a parade, except the military, police or fire forces of the city, the state or the United States, shall occupy, march, drive or proceed upon or along any street except in accordance with a permit issued under this section.\n(b)\tNo sound truck or other vehicle equipped with an amplifier or loudspeaker shall use such equipment while upon a street for the purpose of selling, offering for sale or advertising in any fashion except in accordance with a permit issued under this section.\n(c)\tUpon application the city manager shall issue a funeral, procession, parade or sound truck permit if the manager finds that:\n(1)\tSuch activity will not violate Chapter 5-9, \"Noise,\" B.R.C. 1981;\n(2)\tThere is no reason to believe that such activity cannot be carried out in safety;\n(3)\tSuch activity will not unreasonably interfere with the efficient movement of traffic; and\n(4)\tThe activity is not for an illegal purpose.\nThe manager may prescribe the form of the application and may require information reasonably necessary to make the required findings. The manager may place in the permit such restrictions on the time, place and manner of carrying out the activity as the manager finds reasonably necessary to meet the requirements of this section."
  },
  {
    "corpus": "BRC",
    "title": "7",
    "title_name": "Vehicles, Pedestrians, and Parking",
    "chapter": "2",
    "chapter_name": "General Provisions",
    "anchor": "7-2-15",
    "heading": "Certain Devices Banned from Roadway and Required to Yield to Pedestrians.",
    "verbatim": "7-2-15. Certain Devices Banned from Roadway and Required to Yield to Pedestrians.\n(a)\tNo person upon any ski, coaster, sled, toboggan, toy vehicle, child's tricycle or any similar device shall go upon a roadway except while crossing the roadway on a crosswalk in conformance with the rules applicable to pedestrians. When so crossing, persons have the rights and duties of pedestrians. This subsection does not apply on any roadway set aside as a play street as provided by Section 7-4-48, \"Driving On Restricted Street Prohibited,\" B.R.C. 1981, and so designated by signs.\n(b)\tNo person shall ride or operate a snowmobile on any street except upon specific request of a public authority in a time of emergency.\n(c)\tIt is a specific defense to a charge of violating any of the provisions of this section that the person was on skis, was skiing in safety on a roadway in a residential, public or industrial district zoned RR-1, RR-2, RE, RL, MH, RM, RMX, RH-1, RH-2, RH-4, RH-5, MU-1, MU-3, P, IM, IG, IS or IMS and was not on a roadway that was part of a state highway, a divided street or a street with four or more lanes for moving motor vehicular traffic.\n(d)\tA person upon any of the devices listed in subsection (a) of this section shall yield the right-of-way to any pedestrian upon a sidewalk, in a crosswalk or on a multi-use path.\nOrdinance Nos. 5039 (1987); 5241 (1989); 5920 (1997); 5930 (1997); 7522 (2007); 8447 (2021)"
  },
  {
    "corpus": "BRC",
    "title": "7",
    "title_name": "Vehicles, Pedestrians, and Parking",
    "chapter": "2",
    "chapter_name": "General Provisions",
    "anchor": "7-2-16",
    "heading": "Method of Riding on Certain Vehicles.",
    "verbatim": "7-2-16. Method of Riding on Certain Vehicles.\n(a)\tA person driving a motorcycle, moped, or low-power scooter shall ride only upon the permanent and regular seat attached thereto. Such driver shall not carry any other person; nor shall any other person ride on a motorcycle, moped, or low-power scooter unless it is designed to carry more than one person, in which event a passenger may ride upon the permanent seat, if designed for two persons, or upon another permanent or regular seat firmly attached to such vehicle at the rear or side of the driver.\n(b)\tA person shall ride upon a motorcycle, moped, or low-power scooter only while sitting astride the seat, facing forward, with one leg on either side of the motorcycle, moped, or low-power scooter.\n(c)\tNo person shall drive a motorcycle, moped, or low-power scooter while carrying packages, bundles or other articles that prevent such person from keeping both hands on the handlebars.\n(d)\tNo person shall drive a motorcycle, moped, or low-power scooter while carrying a passenger in a position that will interfere with the operation or control of the motorcycle, moped, or low-power scooter or the view of the operator, and no person shall ride in such a position.\n(e)\tNo person shall drive a motorcycle while carrying a passenger unless the motorcycle is equipped with footrests for the passenger or the passenger is riding in a sidecar or enclosed cab.\nOrdinance No. 8447 (2021)"
  },
  {
    "corpus": "BRC",
    "title": "7",
    "title_name": "Vehicles, Pedestrians, and Parking",
    "chapter": "2",
    "chapter_name": "General Provisions",
    "anchor": "7-2-17",
    "heading": "Clinging to Vehicles Prohibited.",
    "verbatim": "7-2-17. Clinging to Vehicles Prohibited.\n(a)\tNo person riding upon any motorcycle, moped, bicycle, roller skates, skateboard, roller ski, ski, coaster, sled, toboggan, toy vehicle, child's tricycle, human powered vehicle, lightweight electric vehicle, low-power scooter, or any similar device shall attach the device or the person's self to any vehicle moving on a street.\n(b)\tIt is a specific defense to a charge of violating this section that the device was a bicycle trailer attached to a bicycle and designed for such attachment.\nOrdinance Nos. 5241 (1989); 8447 (2021)"
  },
  {
    "corpus": "BRC",
    "title": "7",
    "title_name": "Vehicles, Pedestrians, and Parking",
    "chapter": "2",
    "chapter_name": "General Provisions",
    "anchor": "7-2-18",
    "heading": "Permitting Clinging Prohibited.",
    "verbatim": "7-2-18. Permitting Clinging Prohibited.\nNo person shall drive a vehicle on a street while he or she knows or reasonably should know that acts in violation of Section 7-2-17, \"Clinging to Vehicles Prohibited,\" B.R.C. 1981, are occurring with respect thereto."
  },
  {
    "corpus": "BRC",
    "title": "7",
    "title_name": "Vehicles, Pedestrians, and Parking",
    "chapter": "2",
    "chapter_name": "General Provisions",
    "anchor": "7-2-19",
    "heading": "Riding on Portion of Motor Vehicle not Designed for Passengers Prohibited.",
    "verbatim": "7-2-19. Riding on Portion of Motor Vehicle not Designed for Passengers Prohibited.\nNo person shall sit, ride, hang on or otherwise attach him or herself to the outside, top, hood or fender or to any other portion of a motor vehicle in motion on a street, other than on a seat in the specific enclosed portion of such motor vehicle intended for passengers or while in a sitting position in the cargo area of a motor vehicle if such area is fully or partially enclosed on all four sides. Employees while engaged in the necessary discharge of the duties of their lawful employment and persons riding in parades or processions for which a permit has been issued under Section 7-2-14, \"Permit Required for Parades, Processions and Sound Trucks,\" B.R.C. 1981, are exempted from the prohibitions of this Section and Sections 7-2-20, \"Riding in Trailers Prohibited,\" and 7-2-21, \"Permitting Illegal Riding Prohibited,\" B.R.C. 1981.\nOrdinance No. 5241 (1989)"
  },
  {
    "corpus": "BRC",
    "title": "7",
    "title_name": "Vehicles, Pedestrians, and Parking",
    "chapter": "2",
    "chapter_name": "General Provisions",
    "anchor": "7-2-20",
    "heading": "Riding in Trailers Prohibited.",
    "verbatim": "7-2-20. Riding in Trailers Prohibited.\nNo person shall occupy a trailer while it is being moved on a street by a motor vehicle."
  },
  {
    "corpus": "BRC",
    "title": "7",
    "title_name": "Vehicles, Pedestrians, and Parking",
    "chapter": "2",
    "chapter_name": "General Provisions",
    "anchor": "7-2-21",
    "heading": "Permitting Illegal Riding Prohibited.",
    "verbatim": "7-2-21. Permitting Illegal Riding Prohibited.\nNo person shall drive a vehicle while he or she knows or reasonably should know that acts which are in violation of Section 7-2-19, \"Riding on Portion of Motor Vehicle Not Designed for Passengers Prohibited,\" or 7-2-20, \"Riding in Trailers Prohibited,\" B.R.C. 1981, are occurring on or about the vehicle."
  },
  {
    "corpus": "BRC",
    "title": "7",
    "title_name": "Vehicles, Pedestrians, and Parking",
    "chapter": "2",
    "chapter_name": "General Provisions",
    "anchor": "7-2-22",
    "heading": "Boarding or Alighting from Moving Vehicles Prohibited.",
    "verbatim": "7-2-22. Boarding or Alighting from Moving Vehicles Prohibited.\nNo person shall board or alight from any motor vehicle while such vehicle is in motion on a street."
  },
  {
    "corpus": "BRC",
    "title": "7",
    "title_name": "Vehicles, Pedestrians, and Parking",
    "chapter": "2",
    "chapter_name": "General Provisions",
    "anchor": "7-2-23",
    "heading": "Opening and Closing Vehicle Doors.",
    "verbatim": "7-2-23. Opening and Closing Vehicle Doors.\nNo person shall open any door on a vehicle unless it is done in safety, nor shall any person leave a door open on a side of a vehicle available to moving traffic for a period of time longer than necessary to load or unload passengers."
  },
  {
    "corpus": "BRC",
    "title": "7",
    "title_name": "Vehicles, Pedestrians, and Parking",
    "chapter": "2",
    "chapter_name": "General Provisions",
    "anchor": "7-2-24",
    "heading": "Spilling Load on Street Prohibited.",
    "verbatim": "7-2-24. Spilling Load on Street Prohibited.\nNo person shall drive, move, stop or park any vehicle on any street unless such vehicle is constructed and loaded and the load thereof securely covered to prevent any of its load from dropping, sifting, leaking or otherwise escaping therefrom. This section does not apply to the operation of equipment for street maintenance."
  },
  {
    "corpus": "BRC",
    "title": "7",
    "title_name": "Vehicles, Pedestrians, and Parking",
    "chapter": "2",
    "chapter_name": "General Provisions",
    "anchor": "7-2-25",
    "heading": "Removal of Injurious Material from Street Required.",
    "verbatim": "7-2-25. Removal of Injurious Material from Street Required.\n(a)\tAny person who drops, throws or deposits upon a street any glass bottle, glass, nail, tack, wire, flammable or burning substance or any other substance or object likely to injure or damage other traffic or permits the same to be done shall immediately remove the same or cause it to be removed.\n(b)\tAny person removing a wrecked or damaged vehicle from a highway shall remove from the street any glass or other injurious substance dropped from the vehicle."
  },
  {
    "corpus": "BRC",
    "title": "7",
    "title_name": "Vehicles, Pedestrians, and Parking",
    "chapter": "2",
    "chapter_name": "General Provisions",
    "anchor": "7-2-26",
    "heading": "Display of Unauthorized Sign, Signal or Marking Prohibited.",
    "verbatim": "7-2-26. Display of Unauthorized Sign, Signal or Marking Prohibited.\n(a)\tNo person shall place, maintain or display upon or in view of any street, at a place where it could be mistaken for or confused with a traffic control device governing such street, any unauthorized sign, signal, marking or device that purports to be, is an imitation of or resembles a traffic control device or railroad sign or signal; that attempts to direct the movement of traffic; except for official government notices, uses any words, phrases, symbols or characters implying the existence of danger or the need for stopping or maneuvering of a vehicle; or creates any other unsafe distraction for vehicle operators; that obstructs the view of or interferes with the effectiveness of any traffic control device or any railroad sign or signal; or that obstructs the view of vehicle operators entering a public roadway from any parking area, service drive, private driveway, alley or other thoroughfare.\n(b)\tNo person shall place or maintain upon any traffic control sign or signal or parking payment apparatus or technology any advertising.\n(c)\tThis section shall not be deemed to prohibit the use of motorist services information of a general nature on official highway guide signs if such signs do not indicate the brand, trademark or name of any private business or commercial enterprise offering the service, nor shall this section be deemed to prohibit the erection upon private property adjacent to streets of signs permitted under Section 9-9-21, \"Signs,\" B.R.C. 1981, giving useful directional information and of a type that cannot be mistaken for traffic control signs.\n(d)\tEvery such sign, signal, marking or device prohibited by this section constitutes a public nuisance, and the city manager is empowered to remove the same or cause it to be removed without notice, after which the manager shall afford to the owner the opportunity for a hearing to contest the removal, under the procedures prescribed by Chapter 1-3, \"Quasi-Judicial Hearings,\" B.R.C. 1981.\nOrdinances No. 6017 (1998); 8642 (2024)"
  },
  {
    "corpus": "BRC",
    "title": "7",
    "title_name": "Vehicles, Pedestrians, and Parking",
    "chapter": "2",
    "chapter_name": "General Provisions",
    "anchor": "7-2-27",
    "heading": "Interference With Traffic Control Device.",
    "verbatim": "7-2-27. Interference With Traffic Control Device.\n(a)\tNo person shall, without lawful authority, attempt to or in fact alter, deface, injure, knock down, change signal timing or remove any traffic control device, any railroad sign or signal or any inscription, shield or insignia thereon or any part thereof.\n(b)\tAny person who violates any provision of this section commits the offense of interference with a traffic control device and upon conviction thereof shall be punished by a fine of no more than $1,000, jail for no more than ninety days or both such fine and jail.\nOrdinance No. 7409 (2005)"
  },
  {
    "corpus": "BRC",
    "title": "7",
    "title_name": "Vehicles, Pedestrians, and Parking",
    "chapter": "2",
    "chapter_name": "General Provisions",
    "anchor": "7-2-28",
    "heading": "Obedience to Traffic Control Device.",
    "verbatim": "7-2-28. Obedience to Traffic Control Device.\nNo person shall disobey the instructions of any traffic control device."
  },
  {
    "corpus": "BRC",
    "title": "7",
    "title_name": "Vehicles, Pedestrians, and Parking",
    "chapter": "2",
    "chapter_name": "General Provisions",
    "anchor": "7-2-29",
    "heading": "Parking Payment Apparatus Tampering Prohibited.",
    "verbatim": "7-2-29. Parking Payment Apparatus Tampering Prohibited.\n(a)\tNo person shall:\n(1)\tDeposit in any parking payment apparatus or technology anything other than a form of payment approved by the city manager or a lawful form of payment of the United States accepted by the parking payment apparatus or technology;\n(2)\tDeposit in any parking payment apparatus or technology any physical form of payment that is bent, torn, cut, battered or otherwise misshapen;\n(3)\tTamper with or open a parking payment apparatus or technology; or\n(4)\tKnowingly manipulate a parking payment apparatus or technology in such a way as to cause it to fail to show the correct amount of unexpired time.\n(b)\tThe provisions of this section do not apply to public employees on official business repairing or maintaining the parking payment apparatus or technology.\nOrdinance No. 8642 (2024)"
  },
  {
    "corpus": "BRC",
    "title": "7",
    "title_name": "Vehicles, Pedestrians, and Parking",
    "chapter": "2",
    "chapter_name": "General Provisions",
    "anchor": "7-2-30",
    "heading": "Misuse of Handicapped Parking.",
    "verbatim": "7-2-30. Misuse of Handicapped Parking.\nNo person shall display the placard or license mentioned in subsection 7-6-22(a), B.R.C. 1981, if such person does not then have an impairment that substantially limits such person's ability to move from place to place and a valid license or placard issued by the Colorado Department of Revenue with respect thereto."
  },
  {
    "corpus": "BRC",
    "title": "7",
    "title_name": "Vehicles, Pedestrians, and Parking",
    "chapter": "2",
    "chapter_name": "General Provisions",
    "anchor": "7-2-31",
    "heading": "Driver to Exercise Due Care.",
    "verbatim": "7-2-31. Driver to Exercise Due Care.\nNo provision of this title relieves a driver from the duty to exercise due care to avoid colliding with a pedestrian on a roadway or to sound the horn when necessary and exercise proper precaution upon observing any child or any apparently intoxicated, handicapped or incapacitated person upon a roadway."
  },
  {
    "corpus": "BRC",
    "title": "7",
    "title_name": "Vehicles, Pedestrians, and Parking",
    "chapter": "2",
    "chapter_name": "General Provisions",
    "anchor": "7-2-32",
    "heading": "Use of Seatbelt Required.",
    "verbatim": "7-2-32. Use of Seatbelt Required.\n(a)\tUnless exempted pursuant to subsection (b) of this section, every driver in a motor vehicle shall wear a fastened safety belt while the motor vehicle is being operated on a street, and no such driver shall fail to ensure that every front seat passenger in such vehicle is wearing a fastened safety belt.\n(b)\tThe requirement of subsection (a) of this section shall not apply to:\n(1)\tA child required by Section 7-2-33, \"Child Restraint System Required,\" B.R.C. 1981, to be restrained by a child restraint system;\n(2)\tA member of an ambulance team, other than the driver, while involved in patient care;\n(3)\tA police officer exempted under regulations issued by the chief of police pursuant to subsection 2-4-4(b), B.R.C. 1981;\n(4)\tA person with a physically or psychologically disabling condition whose physical or psychological disability prevents appropriate restraint by a safety belt system if such person possesses a written statement by a physician certifying the condition, as well as stating the reason why such restraint is inappropriate;\n(5)\tA person driving or riding in a motor vehicle not equipped with a safety belt system due to the fact that federal law does not require such vehicle to be equipped with a safety belt system;\n(6)\tA rural letter carrier of the United States Postal Service while performing duties as a rural letter carrier;\n(7)\tA person operating a noncommercial motor vehicle for commercial or residential delivery or pickup service, except that such person shall be required to wear a fastened safety belt during the time period prior to the first delivery or pickup of the day and during the time period following the last delivery or pickup of the day; and\n(8)\tThe driver and passengers of a motorcycle, a public or private bus or on any motor vehicle not required to be licensed for travel on public roads under the laws of this state.\n(c)\tNo driver of a motor vehicle shall be cited for a violation of this section unless the driver was stopped by a peace officer for an alleged violation of law other than a violation of this section.\nOrdinance Nos. 5058 (1987); 5920 (1997)"
  },
  {
    "corpus": "BRC",
    "title": "7",
    "title_name": "Vehicles, Pedestrians, and Parking",
    "chapter": "2",
    "chapter_name": "General Provisions",
    "anchor": "7-2-33",
    "heading": "Child Restraint System Required.",
    "verbatim": "7-2-33. Child Restraint System Required.\n(a)\tEvery child who is less than four years of age, weighs less than forty pounds and is being transported in a privately owned, noncommercial passenger vehicle or in a vehicle operated by a child care center shall be provided with a child restraint system suitable for the child's size and shall be properly fastened into such child restraint system in a seating position equipped with a safety belt or other means to secure said system according to the manufacturer's instructions.\n(b)\tEvery child, who is at least four years of age but less than sixteen years of age or who is less than four years of age and weighs forty pounds or more, being transported in a privately owned noncommercial vehicle or in a vehicle operated by a child care center, shall be provided with a safety belt system and shall be properly fastened into the safety belt system according to the manufacturer's instructions.\n(c)\tNo person shall use a safety belt or child restraint system, whichever is applicable under the provisions of this section, for children less than sixteen years of age in a motor vehicle unless it conforms to all applicable federal motor vehicle safety standards.\n(d)\tNo driver transporting children subject to the requirements of this section shall fail to ensure that such children are provided with and that they properly use the required child restraint or safety belt system.\n(e)\tThe requirements of this section shall not apply to a child that:\n(1)\tIs being transported in a privately owned noncommercial motor vehicle in which all seating positions equipped with safety belts or child restraint systems are occupied;\n(2)\tIs being transported in a motor vehicle as a result of a medical emergency;\n(3)\tIs being transported in a commercial motor vehicle that is operated by a child care center; or\n(4)\tIs the driver of a motor vehicle and is subject to the safety belt requirements provided in Section 7-2-32, \"Use of Seatbelt Required,\" B.R.C. 1981.\nOrdinance Nos. 5058 (1987); 5920 (1997)"
  },
  {
    "corpus": "BRC",
    "title": "7",
    "title_name": "Vehicles, Pedestrians, and Parking",
    "chapter": "2",
    "chapter_name": "General Provisions",
    "anchor": "7-2-34",
    "heading": "Use of Earphones Prohibited.",
    "verbatim": "7-2-34. Use of Earphones Prohibited.\nNo person shall drive a vehicle while wearing earphones.\nOrdinance No. 5241 (1989)"
  },
  {
    "corpus": "BRC",
    "title": "7",
    "title_name": "Vehicles, Pedestrians, and Parking",
    "chapter": "3",
    "chapter_name": "Condition of Vehicles",
    "anchor": "7-3-1",
    "heading": "Unsafe Vehicle.",
    "verbatim": "7-3-1. Unsafe Vehicle.\nNo person shall drive or move upon a street any vehicle or combination of vehicles with brakes, steering or a suspension whose condition is so unsafe as to endanger any person or property or that fails to comply with any state statute or regulation, including, without limitation, the Rules and Regulations Governing the Safety Standards and Specifications of All Commercial Vehicles, Volume 8, Colorado Code of Regulations 1507-1, as promulgated by the Colorado Department of Safety as the same may be amended from time to time, governing such equipment.\nOrdinance No. 5638 (1994)"
  },
  {
    "corpus": "BRC",
    "title": "7",
    "title_name": "Vehicles, Pedestrians, and Parking",
    "chapter": "3",
    "chapter_name": "Condition of Vehicles",
    "anchor": "7-3-2",
    "heading": "Required and Prohibited Equipment.",
    "verbatim": "7-3-2. Required and Prohibited Equipment.\nNo person shall drive or move upon a street any motor vehicle or moped or combination of vehicles:\n(a)\tThat lacks any equipment, including, without limitation, head lamps, turn signals and lamps, projecting load flag or light, stop lights, tail lamps, identification lamps, clearance lights, reflectors, horns, mirrors, windshield wipers, tires, safety glazing material, windshield, emergency lighting equipment, fire extinguishers, suspension system and slow moving vehicle identification emblem, as required by parts 2, 3 or 4 of article 4, title 42, C.R.S., as amended, or by § 42-4-1903, C.R.S., as amended, or any state regulation governing such equipment.\n(b)\tWhile required equipment as set forth in subsection (a) of this section does not otherwise comply with such statutes or regulations; or\n(c)\tWith equipment prohibited by such statutes or regulations.\nOrdinance Nos. 4817 (1984); 5546 (1993); 5848 (1996); 7334 (2004)"
  },
  {
    "corpus": "BRC",
    "title": "7",
    "title_name": "Vehicles, Pedestrians, and Parking",
    "chapter": "3",
    "chapter_name": "Condition of Vehicles",
    "anchor": "7-3-3",
    "heading": "Height, Length and Weight of Vehicles.",
    "verbatim": "7-3-3. Height, Length and Weight of Vehicles.\n(a)\tNo person shall drive, move, stop, or park on any street any vehicle or vehicles of a size, weight, or load that exceeds that permitted for such vehicle or vehicles under §§ 42-4-502 through 42-4-509, C.R.S., as amended.\n(b)\tIt is a specific defense to a charge of violating this section that the driving, moving, stopping and parking was on a state highway and in compliance with the terms of a permit issued in accordance with § 42-4-510, C.R.S., as amended.\n(c)\tIt is a specific defense to a charge of violating this section that the driving, moving, stopping, and parking occurred on a street that was not a state highway, and\n(1)\tWas in compliance with a permit issued under the provisions of subsection (d) of this section; or\n(2)\tWas in compliance with a permit or exclusion under § 42-4-510, C.R.S., as amended, and that the vehicle was being driven on a street that is also a state highway as provided in § 43-2-135, C.R.S.\n(d)\tThe city manager shall issue a one time permit allowing a vehicle or vehicles that are, when loaded, oversize or overweight or both to travel so loaded over city streets upon application therefor if the manager finds that:\n(1)\tThe trip can be accomplished in reasonable safety;\n(2)\tThe trip can be accomplished without unreasonable interference with the efficient movement of traffic;\n(3)\tThe trip can be accomplished without damage to street foundations, surfaces, structures and utilities under and over streets and without undue damage to trees; and\n(4)\tThe oversize or overweight load cannot reasonably be moved other than in an oversize or overweight condition over city streets.\nThe manager may prescribe the form of the application and may require information that the manager determines is reasonably necessary to make the required findings. The manager may place such restrictions on the time and route and impose such other requirements that the manager finds reasonably necessary to meet the requirements of this section and may require the posting of a reasonable bond when the manager finds there is a reasonable possibility of damage.\n(e)\tThis section does not apply to the operation of authorized emergency vehicles, buses, implements of husbandry and farm tractors temporarily moved upon a street, vehicles operated by a public utility when required for emergency repair of public service facilities or properties, fire apparatus, self-propelled construction equipment or highway maintenance equipment. Nothing in this section shall be deemed to relieve any person from civil liability for damage done.\nOrdinance Nos. 5848 (1996); 7996 (2014)"
  },
  {
    "corpus": "BRC",
    "title": "7",
    "title_name": "Vehicles, Pedestrians, and Parking",
    "chapter": "3",
    "chapter_name": "Condition of Vehicles",
    "anchor": "7-3-4",
    "heading": "Adequate Muffling of Noise Required.",
    "verbatim": "7-3-4. Adequate Muffling of Noise Required.\n(a)\tEvery motor vehicle, low-powered scooter, or moped driven upon a street and propelled by a combustion engine shall be equipped with a muffler and exhaust system in constant operation and properly maintained to prevent any noise:\n(1)\tIn excess of that emitted by the exhaust system of such vehicle as originally installed by the manufacturer of such vehicle; or\n(2)\tThat is excessive or unusual.\n(b)\tNo motor vehicle, moped, or low-power scooter driven on a street shall be equipped with any muffler cut off or bypass.\n(c)\tNo motor vehicle, moped, or low-power scooter driven on a street shall emit sound in excess of that allowed in Chapter 5-9, \"Noise,\" B.R.C. 1981.\n(d)\tNo person shall own and no person shall drive any motor vehicle, moped, or low-power scooter that is in violation of any of the provisions of this section.\nOrdinance No. 8447 (2021)"
  },
  {
    "corpus": "BRC",
    "title": "7",
    "title_name": "Vehicles, Pedestrians, and Parking",
    "chapter": "3",
    "chapter_name": "Condition of Vehicles",
    "anchor": "7-3-5",
    "heading": "Visible Emissions Prohibited.",
    "verbatim": "7-3-5. Visible Emissions Prohibited.\n(a)\tNo driver and no owner of any motor vehicle, moped, low-power scooter propelled by a combustion engine, or diesel-fueled locomotive for switching and railroad yard use shall fail to prevent the emission into the atmosphere from such vehicle of any visible air pollutant in excess of that specified below:\n(1)\tVehicles powered by any fuel except diesel: no emissions permitted.\n(2)\tVehicles powered by diesel fuel: ten consecutive seconds at thirty percent opacity or greater.\n(3)\tLocomotives: ten consecutive seconds at forty percent opacity or greater.\n(b)\tVisible air pollutants that are the direct result of cold engine startup are excepted from the prohibitions of this section.\n(c)\tFor the purposes of this section, the following terms have the meanings specified:\nAir pollutant means any fume, smoke, particulate matter, vapor or gas or any combination thereof, but does not include water vapor or steam condensate.\nCold engine startup means the operation of any engine before it reaches its normal operating temperature while the vehicle is stationary at a location where the vehicle and its engine has been stopped for at least one hour immediately prior to the emission.\nOpacity means the degree to which an air pollutant emission obscures the view of an observer or reduces the transmission of light. Any person certified by the Colorado Department of Health after completion of a course in observing and grading visible emissions in terms of opacity is competent to express an opinion on degree of opacity in any proceeding.\n(d)\tOnly one complaint may be filed under this section against a vehicle for any calendar day.\n(e)\tThe penalty for violation of any provision of this section is a fine of no more than $500.\nOrdinance Nos. 7409 (2005); 8339 (2019); 8447 (2021)"
  },
  {
    "corpus": "BRC",
    "title": "7",
    "title_name": "Vehicles, Pedestrians, and Parking",
    "chapter": "3",
    "chapter_name": "Condition of Vehicles",
    "anchor": "7-3-6",
    "heading": "Headlights Must Be On.",
    "verbatim": "7-3-6. Headlights Must Be On.\nBetween sunset and sunrise and at any other time when, due to insufficient light or unfavorable atmospheric conditions, persons and vehicles on the street are not clearly discernable at a distance of one thousand feet ahead, the following requirements and prohibitions shall apply:\n(a)\tExcept as provided in Subsection (b) of this Section 7-3-6, no person shall drive a motor vehicle or moped upon a street unless the vehicle displays the lighted headlights and other illuminated lights required by Part 2, Article 4, Title 42, C.R.S., as amended. Such lamps shall be displayed while the vehicle is being driven or is stopped but need not be displayed while the vehicle is parked in a legal parking space. Failure to display at least one headlight and one tail light constitutes a violation of this section without need to refer to the above-mentioned statutes. But a moped need not display a tail light if it is equipped with a reflector at the rear meeting the requirements of Section 7-5-11, \"Bicycle Headlight and Reflector Required,\" B.R.C. 1981. No person shall drive a lightweight electric vehicle upon a street, within a bicycle lane, or upon a sidewalk or multi-use path where such vehicles are permitted unless the vehicle meets the lighting requirements of Subsection (a) of this Section 7-3-6. But if the lightweight electric vehicle is not equipped with an electric lighting system, the driver at all times mentioned in this Section 7-3-6 shall be equipped with at least one lamp displaying a white light visible from a distance of not less than five hundred feet to the front of the vehicle and at least one lamp displaying a red light visible from a distance of not less than five hundred feet to the rear of the vehicle. Such lamps shall be located at a height of not more than eighty-four inches nor less than twenty inches measured from the center of the lamp to the level ground upon which the driver is seated or stands.\nOrdinance No. 8447 (2021)"
  },
  {
    "corpus": "BRC",
    "title": "7",
    "title_name": "Vehicles, Pedestrians, and Parking",
    "chapter": "3",
    "chapter_name": "Condition of Vehicles",
    "anchor": "7-3-7",
    "heading": "Headlights Must Be Dimmed.",
    "verbatim": "7-3-7. Headlights Must Be Dimmed.\n(a)\tWhile a driver of a vehicle approaches an oncoming vehicle within five hundred feet on a roadway, such driver shall use low beams only, as these are prescribed in part 2, article 4, of title 42, C.R.S., as amended, for the type of vehicle involved.\n(b)\tWhile following another vehicle within two hundred feet in the rear, a driver shall use such low beams only.\n(c)\tThe driver of a parked vehicle shall use such low beams only."
  },
  {
    "corpus": "BRC",
    "title": "7",
    "title_name": "Vehicles, Pedestrians, and Parking",
    "chapter": "3",
    "chapter_name": "Condition of Vehicles",
    "anchor": "7-3-8",
    "heading": "Lights on Parked Vehicles.",
    "verbatim": "7-3-8. Lights on Parked Vehicles.\nWhile a vehicle equipped with all reflectors required by law is parked in a place where vehicles may lawfully be parked, no lights need be displayed upon such vehicle."
  },
  {
    "corpus": "BRC",
    "title": "7",
    "title_name": "Vehicles, Pedestrians, and Parking",
    "chapter": "3",
    "chapter_name": "Condition of Vehicles",
    "anchor": "7-3-9",
    "heading": "Obstruction to Driver's View or Driving Mechanism Prohibited.",
    "verbatim": "7-3-9. Obstruction to Driver's View or Driving Mechanism Prohibited.\n(a)\tNo person shall drive a vehicle while it is so loaded or while there are in the front seat or seats such number of persons so situated as to obstruct the view of the driver to the front or to the sides of the vehicle or as to interfere with the driver's control over the driving mechanism of the vehicle.\n(b)\tNo passenger in a vehicle shall ride in such position as to interfere with the driver's view to the front or to the sides or as to interfere with the driver's control over the driving mechanism of the vehicle, nor shall any passenger in a bus stand forward of any safety line on the floor of the bus.\n(c)\tNo person shall drive any vehicle upon a street unless the driver's vision is normal through the windshield, front right, front left and rear windows and any required mirrors. Vision is normal if the swept area of the windshield, and all other windows and mirrors, are clear of snow, ice, frost, condensation, dirt and any other material that inhibits vision and if such windshield, windows and mirrors are free of any sign, poster or other nontransparent material that obstructs the driver's view, other than a certificate required to be so displayed by law."
  },
  {
    "corpus": "BRC",
    "title": "7",
    "title_name": "Vehicles, Pedestrians, and Parking",
    "chapter": "3",
    "chapter_name": "Condition of Vehicles",
    "anchor": "7-3-10",
    "heading": "Television Screen in Front Seat Prohibited.",
    "verbatim": "7-3-10. Television Screen in Front Seat Prohibited.\nNo person shall drive any vehicle equipped with any television viewer, screen or other means of visually receiving a television broadcast that is located in the vehicle at any point forward of the back of the driver's seat or that is visible to the driver while operating the vehicle."
  },
  {
    "corpus": "BRC",
    "title": "7",
    "title_name": "Vehicles, Pedestrians, and Parking",
    "chapter": "3",
    "chapter_name": "Condition of Vehicles",
    "anchor": "7-3-11",
    "heading": "Protective Eyecover Required.",
    "verbatim": "7-3-11. Protective Eyecover Required.\nNo person shall drive any motorcycle on any street unless such person, and any passenger on the motorcycle, is wearing goggles, eyeglasses or a face shield with a lens of safety glass or plastic."
  },
  {
    "corpus": "BRC",
    "title": "7",
    "title_name": "Vehicles, Pedestrians, and Parking",
    "chapter": "3",
    "chapter_name": "Condition of Vehicles",
    "anchor": "7-3-12",
    "heading": "Unauthorized Display of Public Insignia Prohibited.",
    "verbatim": "7-3-12. Unauthorized Display of Public Insignia Prohibited.\nNo vehicle shall display any official designation, sign, insignia or counterfeit thereof of any public authority without the permission of such authority and no person shall own or drive any vehicle with such unauthorized marking."
  },
  {
    "corpus": "BRC",
    "title": "7",
    "title_name": "Vehicles, Pedestrians, and Parking",
    "chapter": "3",
    "chapter_name": "Condition of Vehicles",
    "anchor": "7-3-13",
    "heading": "Wheel and Axle Loads.",
    "verbatim": "7-3-13. Wheel and Axle Loads.\n(a)\tNo person shall move or operate any vehicle, and no owner of any vehicle shall fail to prevent the movement or operation of any vehicle, on any street if the gross weight upon any wheel of the vehicle exceeds any of the following:\n(1)\tWhen the wheel is equipped with a steel-tire, five hundred pounds per inch of cross-sectional width of tire.\n(2)\tWhen the wheel is equipped with a solid rubber or cushion tire, eight thousand pounds.\n(3)\tWhen the wheel is equipped with a pneumatic tire, nine thousand pounds.\n(b)\tNo person shall move or operate any vehicle, and no owner of any vehicle shall fail to prevent the movement or operation of any vehicle, on any street if the gross weight upon any single axle of a vehicle exceeds either of the following:\n(1)\tWhen the wheels attached to the axle are equipped with solid rubber or cushion tires, sixteen thousand pounds.\n(2)\tWhen the wheels attached to the axle are equipped with pneumatic tires, twenty thousand pounds. But this paragraph does not apply to vehicles equipped with a self-compactor which is used solely for transporting trash.\n(c)\tNo person shall move or operate any vehicle, and no owner of any vehicle shall fail to prevent the movement or operation of any vehicle, on any street if the gross weight upon any tandem axle equipped with pneumatic tires exceeds forty thousand pounds.\n(d)\tFor the purposes of this section, a single axle is defined as all wheels whose centers are included within two parallel transverse vertical planes not more than forty inches apart, extending across the full width of the vehicle.\n(e)\tFor the purposes of this section, a tandem axle is defined as two or more consecutive axles, the centers of which may be included between parallel vertical planes spaced more than forty inches and not more than ninety-six inches apart, extending across the full width of the vehicle.\n(f)\tFor the purposes of this section and Section 7-3-14, \"Gross Weight of Vehicles and Loads,\" B.R.C. 1981, axle scales and the method of weighing vehicles that is commonly referred to as \"split weighing\" or \"fore and aft draft weighing,\" for obtaining a vehicle's axle weights and gross weight, is authorized as an acceptable and accurate method of weighing for law enforcement purposes and statistical data gathering.\nOrdinance No. 5638 (1994)"
  },
  {
    "corpus": "BRC",
    "title": "7",
    "title_name": "Vehicles, Pedestrians, and Parking",
    "chapter": "3",
    "chapter_name": "Condition of Vehicles",
    "anchor": "7-3-14",
    "heading": "Gross Weight of Vehicles and Loads.",
    "verbatim": "7-3-14. Gross Weight of Vehicles and Loads.\n(a)\tNo person shall move or operate any vehicle, and no owner of any vehicle shall fail to prevent the movement or operation of any vehicle, on any street if the gross weight thereof exceeds any of the limits specified below:\n(1)\tThe gross weight of a single vehicle having two axles shall not exceed thirty-six thousand pounds.\n(2)\tThe gross weight of a single vehicle having three or more axles shall not exceed fifty-four thousand pounds.\n(3)\tThe maximum gross weight of any vehicle, or combination of vehicles, shall not exceed the lesser of eighty-five thousand pounds or that determined by the formula:\nW = 1,000 (L plus 40)\nW = The gross weight in pounds\nL = The length in feet between the centers of the first and last axles of such vehicle or combination of vehicles\nFor the purpose of calculating the maximum allowable gross weight of any combination of vehicles, the length of any vehicle in the combination which has a gross weight of less than ten percent of the overall gross weight of the combination of vehicles shall not be included in calculating \"L,\" but this provision concerning weight calculation shall not apply to specialized trailers of fixed public utilities.\n(4)\tNotwithstanding any other provision of this title, no vehicle or combination of vehicles shall be moved or operated or be permitted to be moved or operated, on any street or bridge when the gross weight thereof exceeds any posted weight limit for such street or bridge, unless the vehicle is operating in accordance with a valid permit issued by the Colorado Department of Transportation or Colorado State Patrol pursuant to § 42-4-510, C.R.S., or by the city manager pursuant to subsection 7-3-3(d), B.R.C. 1981.\n(b)\tNo person shall move or operate any vehicle, and no owner of any vehicle shall fail to prevent the movement or operation of any vehicle, on any street if it exceeds the maximum weight allowed pursuant to a valid permit issued by the Colorado Department of Transportation or Colorado State Patrol pursuant to § 42-4-510, C.R.S., or by the city manager pursuant to subsection 7-3-3(d), B.R.C. 1981. If the vehicle exceeds its permit weight, the penalty shall be calculated as if no permit had been issued.\n(c)\tThe limitations provided in this section shall be strictly construed and enforced.\nOrdinance Nos. 5638 (1994); 5848 (1996)"
  },
  {
    "corpus": "BRC",
    "title": "7",
    "title_name": "Vehicles, Pedestrians, and Parking",
    "chapter": "3",
    "chapter_name": "Condition of Vehicles",
    "anchor": "7-3-15",
    "heading": "Vehicles Weighed, Excess Removed.",
    "verbatim": "7-3-15. Vehicles Weighed, Excess Removed.\n(a)\tAny police officer who reasonably suspects that the weight of a vehicle and load is unlawful is authorized to require the driver to stop, and upon probable cause may require the driver to submit to a weighing of the same, either by requiring that such vehicle be driven to the nearest certified public scales, or by requiring that such vehicle be driven to the nearest portable or stationary scales operated by the port-of-entry, the Colorado State Patrol, or the city, in the event such scales are within a five-mile radius of the location of such stop.\n(b)\tExcept as provided in subsection (c) of this section, whenever an officer, upon weighing a vehicle and load, determines that the weight is unlawful, such officer may require the driver to stop the vehicle in a suitable place and remain standing until such portion of the load is removed or shifted as may be necessary to reduce the gross weight of such vehicle or the weight upon a wheel or a single axle or a tandem axle of such vehicle, to limits permitted under this chapter. All material so unloaded shall be cared for by the owner or operator of such vehicle at the risk of such owner or operator.\n(c)\tWhenever an officer, upon weighing a vehicle and load, determines that the weight is unlawful and the load consists of either explosives or hazardous materials, as defined in § 42-1-102, C.R.S., such officer shall permit the driver of such vehicle to proceed to its destination without requiring the driver to unload or shift the excess portion of such load, unless nonexplosive and nonhazardous materials may be removed or shifted to cure the illegality.\n(d)\tNo driver of a vehicle, when directed by a police officer, shall fail or refuse to stop and submit the vehicle and load to a weighing or fail or refuse when directed by an officer to allow the unloading or shifting of the load of the vehicle to the gross weight of such vehicle or the weight upon any wheel or single axle or tandem axle of such vehicle permitted in this chapter, or otherwise fail or refuse to comply with the provisions of this section.\n(e)\tAny person who violates any provision of this section commits the offense of aggravated excess weight, and upon conviction thereof shall be punished by a fine of no more than $1,000, jail of no more than ninety days or both such fine and jail.\nOrdinance Nos. 5638 (1994); 7409 (2005)"
  },
  {
    "corpus": "BRC",
    "title": "7",
    "title_name": "Vehicles, Pedestrians, and Parking",
    "chapter": "3",
    "chapter_name": "Condition of Vehicles",
    "anchor": "7-3-16",
    "heading": "Inspection of Unsafe Vehicles.",
    "verbatim": "7-3-16. Inspection of Unsafe Vehicles.\n(a)\tUniformed police officers, at any time upon reasonable suspicion, may require the driver of any vehicle other than a commercial vehicle to stop, and upon probable cause may require the driver to submit such vehicle and its equipment to an inspection and such test with reference thereto as may be appropriate. The fact that a vehicle is an older model vehicle shall not alone constitute reasonable suspicion.\n(b)\tIn the event any such vehicle is, in the reasonable judgment of such police officer, in such condition that further operation would be hazardous, the officer may require that the vehicle be moved at the operator's expense and not operated under its own power or that it be driven to the nearest garage or other place of safety.\nOrdinance No. 5638 (1994)"
  },
  {
    "corpus": "BRC",
    "title": "7",
    "title_name": "Vehicles, Pedestrians, and Parking",
    "chapter": "3",
    "chapter_name": "Condition of Vehicles",
    "anchor": "7-3-17",
    "heading": "Inspection and Immobilization of Commercial Vehicles.",
    "verbatim": "7-3-17. Inspection and Immobilization of Commercial Vehicles.\n(a)\tA police officer may, at any time, require the driver of any commercial vehicle to stop so that the officer may inspect the vehicle and all required documents for compliance with the Rules and Regulations Governing the Safety Standards and Specifications of All Commercial Vehicles, Volume 8, Colorado Code of Regulations 1507-1, as promulgated by the Colorado Department of Safety, and as the same may be amended from time to time.\n(b)\tA police officer may immobilize, impound or otherwise direct the disposition of a commercial vehicle when it is determined that the motor vehicle or operation thereof is unsafe and when such immobilization, impoundment or disposition is appropriate under the Rules and Regulations Governing the Safety Standards and Specifications of All Commercial Vehicles, Volume 8, Colorado Code of Regulations 1507-1, as promulgated by the Colorado Department of Safety, and as the same may be amended from time to time.\nOrdinance No. 5638 (1994)"
  },
  {
    "corpus": "BRC",
    "title": "7",
    "title_name": "Vehicles, Pedestrians, and Parking",
    "chapter": "3",
    "chapter_name": "Condition of Vehicles",
    "anchor": "7-3-18",
    "heading": "Overweight Vehicle Penalty.",
    "verbatim": "7-3-18. Overweight Vehicle Penalty.\n(a)\tThe penalty for exceeding the wheel or axle load limits of Section 7-3-13, \"Wheel and Axle Loads,\" B.R.C. 1981, or the gross weight limits of Section 7-3-14, \"Gross Weight of Vehicles and Loads,\" B.R.C. 1981, shall be as follows:\nIf one vehicle or combination of vehicles exceeds more than one weight limit in any one occurrence, only the penalty for the greatest violation may be imposed.\n(b)\tThe clerk of the municipal court shall separately account for the surcharge, and shall remit it periodically to the court administrator for the 20th Judicial District for credit to the victims and witness assistance and law enforcement fund established pursuant to state law."
  },
  {
    "corpus": "BRC",
    "title": "7",
    "title_name": "Vehicles, Pedestrians, and Parking",
    "chapter": "4",
    "chapter_name": "Operation of Vehicles",
    "anchor": "7-4-1",
    "heading": "Obedience to Green Signal Required.",
    "verbatim": "7-4-1. Obedience to Green Signal Required.\n(a)\tA driver facing a circular green traffic control signal indication may proceed straight through or make any otherwise legal turning movement.\n(b)\tA driver facing a green arrow traffic control signal indication, shown alone or in combination with another indication, shall enter the intersection only to make the movement indicated by such arrow or any otherwise legal turning movement.\n(c)\tA driver proceeding on a circular green or green arrow traffic control signal indication shall yield the right-of-way to all traffic within the intersection or any adjacent crosswalk at the time such signal is displayed.\nOrdinance No. 5241 (1989)"
  },
  {
    "corpus": "BRC",
    "title": "7",
    "title_name": "Vehicles, Pedestrians, and Parking",
    "chapter": "4",
    "chapter_name": "Operation of Vehicles",
    "anchor": "7-4-2",
    "heading": "Steady Yellow Signal.",
    "verbatim": "7-4-2. Steady Yellow Signal.\nA driver facing a steady circular yellow or yellow arrow traffic control signal indication is thereby warned that the related green movement is being terminated and that a red indication will be exhibited immediately thereafter."
  },
  {
    "corpus": "BRC",
    "title": "7",
    "title_name": "Vehicles, Pedestrians, and Parking",
    "chapter": "4",
    "chapter_name": "Operation of Vehicles",
    "anchor": "7-4-3",
    "heading": "Obedience to Red Signal Required.",
    "verbatim": "7-4-3. Obedience to Red Signal Required.\n(a)\tA driver facing a steady circular red traffic control signal indication alone shall stop at a clearly marked stop line or, if none, then before entering the crosswalk on the near side of the intersection, or, if none, then before entering the intersection and shall remain stopped until an indication to proceed is shown. Under no circumstances shall any driver wherever located cross the curb line at the near side of an intersection while facing such red signal. But:\n(1)\tSuch a driver, after coming to a stop and yielding the right-of-way to pedestrians within or approaching any adjacent crosswalk and to other traffic within or approaching the intersection, may make a right turn unless a traffic control sign or other provision of this title prohibits such turn.\n(2)\tSuch a driver, while on a one-way street and after coming to a stop, may make a left turn onto a one-way street upon which the direction of traffic is to the left of the driver after yielding to pedestrians within or approaching any adjacent crosswalk and to other traffic within or approaching the intersection, unless a traffic control sign prohibits such turn.\n(b)\tA driver facing a steady red arrow signal indication shall not enter the intersection to make the movement indicated by such arrow and, unless entering such intersection to make any otherwise legal movement, shall stop and remain stopped as provided in subsection (a) of this section, without exceptions (1) and (2)."
  },
  {
    "corpus": "BRC",
    "title": "7",
    "title_name": "Vehicles, Pedestrians, and Parking",
    "chapter": "4",
    "chapter_name": "Operation of Vehicles",
    "anchor": "7-4-4",
    "heading": "Non-Intersection Signal.",
    "verbatim": "7-4-4. Non-Intersection Signal.\n(a)\tIf a traffic control signal is in place other than at an intersection, the provisions of this section and all other sections dealing with traffic control signals are applicable except those which by their nature can have no application.\n(b)\tBut where a traffic control signal controls traffic at the junction of a street with a private drive, parking lot entrance, alley or the mall, the same shall be considered an intersection for the purposes of this and all other sections dealing with traffic control signals, and the prolongation of each side of the curb cut defines the intersection."
  },
  {
    "corpus": "BRC",
    "title": "7",
    "title_name": "Vehicles, Pedestrians, and Parking",
    "chapter": "4",
    "chapter_name": "Operation of Vehicles",
    "anchor": "7-4-5",
    "heading": "Obedience to Lane Use Signal Required.",
    "verbatim": "7-4-5. Obedience to Lane Use Signal Required.\nLane use control signals placed over individual lanes of a street apply as follows:\n(a)\tDownward-pointing green arrow (steady): A driver facing such signal may enter or travel in any lane over which the signal is exhibited.\n(b)\tYellow \"X\" (steady): A driver facing such signal is thereby warned that the related green arrow movement is being terminated and shall vacate in safety the lane over which the signal is located.\n(c)\tYellow \"X\" (flashing): A driver facing such signal may enter or travel in the lane over which the signal is located for the purpose of making a left turn or a passing maneuver, in safety, but for no other purpose.\n(d)\tRed \"X\" (steady): No driver shall enter or travel in any lane over which such signal is exhibited."
  },
  {
    "corpus": "BRC",
    "title": "7",
    "title_name": "Vehicles, Pedestrians, and Parking",
    "chapter": "4",
    "chapter_name": "Operation of Vehicles",
    "anchor": "7-4-6",
    "heading": "Stop and Yield for Flashing Red Signal Required.",
    "verbatim": "7-4-6. Stop and Yield for Flashing Red Signal Required.\n(a)\tA driver facing a traffic control signal while the red lens of the signal is illuminated with rapid intermittent flashes shall stop at a clearly marked stop line or, if none, then before entering the crosswalk on the near side of the intersection, or, if none, then before entering the intersection, before proceeding into the intersection. A driver so required to stop shall yield the right-of-way to pedestrians within or approaching any adjacent crosswalk and to any vehicle within or approaching the intersection on another roadway.\n(b)\tThis section does not apply to railroad signs or signals."
  },
  {
    "corpus": "BRC",
    "title": "7",
    "title_name": "Vehicles, Pedestrians, and Parking",
    "chapter": "4",
    "chapter_name": "Operation of Vehicles",
    "anchor": "7-4-7",
    "heading": "Flashing Yellow Signal.",
    "verbatim": "7-4-7. Flashing Yellow Signal.\n(a)\tA driver facing a traffic control signal when the circular yellow lens of the signal is illuminated with rapid intermittent flashes is thereby warned:\n(1)\tAt an intersection, that cross traffic has a flashing red light.\n(2)\tAt any other location, that a special hazard exists, and drivers of all vehicles shall proceed past such signal and through the hazardous location only with caution.\n(b)\tA driver facing a traffic control signal when the yellow arrow lens of the signal is illuminated with rapid intermittent flashes is thereby warned that opposing traffic has the right-of-way and the driver should proceed with caution.\n(c)\tThis section does not apply to railroad signs or signals.\nOrdinance Nos. 7824 (2012); 7996 (2014)"
  },
  {
    "corpus": "BRC",
    "title": "7",
    "title_name": "Vehicles, Pedestrians, and Parking",
    "chapter": "4",
    "chapter_name": "Operation of Vehicles",
    "anchor": "7-4-8",
    "heading": "Malfunctioning Traffic Control Signal.",
    "verbatim": "7-4-8. Malfunctioning Traffic Control Signal.\n(a)\tIf a driver approaches or is stopped at an intersection while a malfunctioning traffic control signal is in place:\n(1)\tIf no uncovered signal lens facing the driver is illuminated, the signal shall be considered a flashing red signal as described in Section 7-4-6, \"Stop and Yield for Flashing Red Signal Required,\" B.R.C. 1981, and no driver shall disobey the rules for flashing red signals;\n(2)\tA driver stopped at the required position for stopping facing a steady red traffic control signal indication may proceed in accordance with the rules for stop signs if portions of the traffic signal system at the intersection governing other lanes of travel are observed by the driver to go through two complete cycles while remaining steady red for such driver or if the lens governing the driver remains steadily red for more than four minutes; or\n(3)\tA driver facing a steady yellow traffic control signal indication that remains yellow for more than ten seconds shall follow the rules prescribed by paragraph (a)(1) of this section.\n(b)\tThe defense of malfunctioning traffic control signal is a specific defense."
  },
  {
    "corpus": "BRC",
    "title": "7",
    "title_name": "Vehicles, Pedestrians, and Parking",
    "chapter": "4",
    "chapter_name": "Operation of Vehicles",
    "anchor": "7-4-9",
    "heading": "Avoiding Traffic Control Device Prohibited.",
    "verbatim": "7-4-9. Avoiding Traffic Control Device Prohibited.\nNo driver shall turn from a street onto a private drive, parking lot, gas station or other non-street area and reenter the same street beyond a specified traffic control device or enter an intersecting street where a specified traffic control device would have controlled the movement through the intersection or past the device had the vehicle remained on the first street, without making a stop off of the street in addition to and before the stop required by Section 7-4-15, \"Stop Before Entering Street Required,\" B.R.C. 1981. The specified traffic control devices are stop signs, yield signs, traffic control signals of any color and otherwise applicable turn prohibition or regulation signs."
  },
  {
    "corpus": "BRC",
    "title": "7",
    "title_name": "Vehicles, Pedestrians, and Parking",
    "chapter": "4",
    "chapter_name": "Operation of Vehicles",
    "anchor": "7-4-10",
    "heading": "Stop When Traffic Obstructed.",
    "verbatim": "7-4-10. Stop When Traffic Obstructed.\nNo driver shall enter a crosswalk, intersection, or railroad grade crossing unless there is sufficient space beyond the crosswalk, intersection, or grade crossing to accommodate the vehicle without interfering with or obstructing the passage of pedestrians, vehicles, or railroad trains, notwithstanding the indication of any traffic control device to proceed."
  },
  {
    "corpus": "BRC",
    "title": "7",
    "title_name": "Vehicles, Pedestrians, and Parking",
    "chapter": "4",
    "chapter_name": "Operation of Vehicles",
    "anchor": "7-4-11",
    "heading": "Stop at Stop Sign Required.",
    "verbatim": "7-4-11. Stop at Stop Sign Required.\nA driver approaching a stop sign shall stop at a clearly marked stop line, or if none, at the stop sign."
  },
  {
    "corpus": "BRC",
    "title": "7",
    "title_name": "Vehicles, Pedestrians, and Parking",
    "chapter": "4",
    "chapter_name": "Operation of Vehicles",
    "anchor": "7-4-12",
    "heading": "Yield Required at Stop Sign.",
    "verbatim": "7-4-12. Yield Required at Stop Sign.\n(a)\tA driver required to stop at a stop sign shall yield the right-of-way to all vehicles within the intersection or approaching on an intersecting roadway and not required to stop.\n(b)\tAt an all-way stop intersection, a driver required to stop in obedience to a stop sign shall yield the right-of-way to all other vehicles that have previously executed the required stop. But as between vehicles executing the required stop simultaneously, a driver turning left shall yield to an opposing vehicle as prescribed by Section 7-4-22, \"Vehicle Turning Left to Yield,\" B.R.C. 1981, and other drivers shall yield to vehicles on the right, as prescribed by Section 7-4-14, \"Driver on Left to Yield at Uncontrolled Intersection,\" B.R.C. 1981."
  },
  {
    "corpus": "BRC",
    "title": "7",
    "title_name": "Vehicles, Pedestrians, and Parking",
    "chapter": "4",
    "chapter_name": "Operation of Vehicles",
    "anchor": "7-4-13",
    "heading": "Obedience to Yield Sign Required.",
    "verbatim": "7-4-13. Obedience to Yield Sign Required.\nA driver approaching a \"yield\" sign at an intersection shall yield the right-of-way to all vehicles within the intersection or approaching on an intersecting roadway, slowing or stopping as may be necessary so to yield."
  },
  {
    "corpus": "BRC",
    "title": "7",
    "title_name": "Vehicles, Pedestrians, and Parking",
    "chapter": "4",
    "chapter_name": "Operation of Vehicles",
    "anchor": "7-4-14",
    "heading": "Driver on Left to Yield at Uncontrolled Intersection.",
    "verbatim": "7-4-14. Driver on Left to Yield at Uncontrolled Intersection.\nWhen two vehicles approach an intersection on different streets, the driver of the vehicle on the left shall yield the right-of-way to the vehicle on the right, unless a traffic control device indicates otherwise."
  },
  {
    "corpus": "BRC",
    "title": "7",
    "title_name": "Vehicles, Pedestrians, and Parking",
    "chapter": "4",
    "chapter_name": "Operation of Vehicles",
    "anchor": "7-4-15",
    "heading": "Stop Before Entering Street Required.",
    "verbatim": "7-4-15. Stop Before Entering Street Required.\nA driver about to enter a street at any place other than an intersection shall stop at the near edge of a sidewalk and a path or its prolongation, but if none, at the curb.\nOrdinance No. 5241 (1989)"
  },
  {
    "corpus": "BRC",
    "title": "7",
    "title_name": "Vehicles, Pedestrians, and Parking",
    "chapter": "4",
    "chapter_name": "Operation of Vehicles",
    "anchor": "7-4-16",
    "heading": "Yield Required Before Entering or Leaving Street.",
    "verbatim": "7-4-16. Yield Required Before Entering or Leaving Street.\n(a)\tA driver entering a street at any place other than an intersection shall yield the right-of-way to any pedestrian, bicycle, electric assisted bicycle, human powered vehicle, or lightweight electric vehicle approaching on a sidewalk or multi-use path, where such vehicles are permitted, and to any vehicle approaching on a roadway of the street.\n(b)\tA driver leaving a street at any place other than an intersection shall yield the right-of-way to any pedestrian, or bicycle, electric assisted bicycle, human powered vehicle, or lightweight electric vehicle approaching on a sidewalk or multi-use path, where such vehicles are permitted.\nOrdinance Nos. 5241 (1989); 5920 (1997); 7941 (2013); 8447 (2021)"
  },
  {
    "corpus": "BRC",
    "title": "7",
    "title_name": "Vehicles, Pedestrians, and Parking",
    "chapter": "4",
    "chapter_name": "Operation of Vehicles",
    "anchor": "7-4-17",
    "heading": "Improper Starting of a Parked Vehicle.",
    "verbatim": "7-4-17. Improper Starting of a Parked Vehicle.\nNo driver shall move a stopped or parked vehicle unless and until such movement can be made in safety, and, except where legally angle parked, after first signaling the intention to enter the stream of traffic by the appropriate signal described in Section 7-4-29, \"Method of Signaling,\" B.R.C. 1981, for at least five seconds."
  },
  {
    "corpus": "BRC",
    "title": "7",
    "title_name": "Vehicles, Pedestrians, and Parking",
    "chapter": "4",
    "chapter_name": "Operation of Vehicles",
    "anchor": "7-4-18",
    "heading": "Improper Backing.",
    "verbatim": "7-4-18. Improper Backing.\n(a)\tNo driver shall back a vehicle unless such movement can be made in safety.\n(b)\tNo driver shall back a vehicle upon the roadway or shoulder of a controlled access street.\nOrdinance No. 5462 (1992)"
  },
  {
    "corpus": "BRC",
    "title": "7",
    "title_name": "Vehicles, Pedestrians, and Parking",
    "chapter": "4",
    "chapter_name": "Operation of Vehicles",
    "anchor": "7-4-19",
    "heading": "Obedience to Turn Requirement Device Required.",
    "verbatim": "7-4-19. Obedience to Turn Requirement Device Required.\nWhere a traffic control device is in place requiring a right turn or a left turn, no driver shall disobey the requirements of such device."
  },
  {
    "corpus": "BRC",
    "title": "7",
    "title_name": "Vehicles, Pedestrians, and Parking",
    "chapter": "4",
    "chapter_name": "Operation of Vehicles",
    "anchor": "7-4-20",
    "heading": "Obedience to Turn Prohibition Sign Required.",
    "verbatim": "7-4-20. Obedience to Turn Prohibition Sign Required.\nWhere a traffic control sign is in place prohibiting or restricting a right, left, or all turns, no driver shall disobey the directions of such sign."
  },
  {
    "corpus": "BRC",
    "title": "7",
    "title_name": "Vehicles, Pedestrians, and Parking",
    "chapter": "4",
    "chapter_name": "Operation of Vehicles",
    "anchor": "7-4-21",
    "heading": "U-Turn Prohibited.",
    "verbatim": "7-4-21. U-Turn Prohibited.\n(a)\tNo driver shall make a U-turn:\n(1)\tIf a traffic control sign is in place prohibiting U-turns or left turns;\n(2)\tUpon any curve or upon the approach to or near the crest of a grade, where the turning vehicle cannot be seen for three hundred feet by the driver of any other vehicle that might approach from either direction; or\n(3)\tUnless such movement can be made in safety.\n(b)\tU-turn means the movement of a vehicle on a street or within an intersection or junction so as to proceed in approximately the opposite direction from that in which the vehicle was originally proceeding."
  },
  {
    "corpus": "BRC",
    "title": "7",
    "title_name": "Vehicles, Pedestrians, and Parking",
    "chapter": "4",
    "chapter_name": "Operation of Vehicles",
    "anchor": "7-4-22",
    "heading": "Vehicle Turning Left to Yield.",
    "verbatim": "7-4-22. Vehicle Turning Left to Yield.\n(a)\tA driver turning to the left shall yield the right-of-way to any vehicle approaching from the opposite direction.\n(b)\tVehicles stopped for a traffic control signal or stop signs facing each other at an intersection are considered to be approaching each other.\n(c)\tA driver intending to turn left from a lane governed by a circular green signal light at an intersection shall not enter any oncoming lane of traffic until all oncoming vehicles stopped in that lane at the intersection at the time the green signal was last displayed and not displaying a left turn signal have proceeded through the intersection. It is a specific defense that the oncoming vehicle was disabled for at least ten seconds or that the driver thereof voluntarily relinquished the right-of-way and gave an unambiguous signal of such intent. But nothing in this subsection shall be deemed to limit any other provision of this code."
  },
  {
    "corpus": "BRC",
    "title": "7",
    "title_name": "Vehicles, Pedestrians, and Parking",
    "chapter": "4",
    "chapter_name": "Operation of Vehicles",
    "anchor": "7-4-23",
    "heading": "Yield to Pedestrian Required.",
    "verbatim": "7-4-23. Yield to Pedestrian Required.\nA driver shall yield the right-of-way to every pedestrian on a sidewalk or approaching or within a crosswalk.\nOrdinance Nos. 5241 (1989); 5920 (1997)"
  },
  {
    "corpus": "BRC",
    "title": "7",
    "title_name": "Vehicles, Pedestrians, and Parking",
    "chapter": "4",
    "chapter_name": "Operation of Vehicles",
    "anchor": "7-4-24",
    "heading": "Yield to Blind Pedestrian Required.",
    "verbatim": "7-4-24. Yield to Blind Pedestrian Required.\nA driver shall yield the right-of-way to any blind pedestrian carrying a clearly visible white cane or accompanied by a guide dog."
  },
  {
    "corpus": "BRC",
    "title": "7",
    "title_name": "Vehicles, Pedestrians, and Parking",
    "chapter": "4",
    "chapter_name": "Operation of Vehicles",
    "anchor": "7-4-25",
    "heading": "Improper Turn Prohibited.",
    "verbatim": "7-4-25. Improper Turn Prohibited.\n(a)\tA driver turning from a roadway shall do so only after giving the signal required by Section 7-4-26, \"Turn Signal Required,\" B.R.C. 1981, and in the following manner:\n(1)\tRight turn: The approach for the turn, the turn itself and the finish of the turn shall be made as close as practicable to the right-hand curb without driving over such curb.\n(2)\tLeft turn: Both the approach and the finish of a left turn shall be made immediately to the right of the left-hand edge of the farthest left lane lawfully available to vehicular traffic moving in the direction of travel of such vehicle. If practicable, the turn itself shall be made to the left of the center of the intersection.\n(3)\tDouble turn lanes: Where a traffic control sign is in place permitting a right or left turn to be made from two or more lanes, the driver of a vehicle in the lane farthest from any lane not permitted so to turn shall turn as required above and vehicles in each successive lane shall turn into the corresponding lane on the new roadway, following lane markings through the turn if present, and otherwise following a course reasonably calculated to reach that goal and to avoid interfering with vehicles turning from other lanes. No driver of a vehicle in any such turn lane shall fail to make the indicated turn, except vehicles in the lane nearest to any lane not permitted so to turn when a traffic control sign indicates that such option is permitted.\n(4)\tDefinitions: For the purposes of this section, approach means the last one hundred feet, or two hundred feet where the speed limit is more than forty miles per hour, traveled on the roadway before the place at which the turn is made, and finish means the first one hundred or two hundred feet as calculated above traveled on the new roadway.\n(b)\tTwo-Way Left Turn Lanes: Where a special lane for making left turns between intersections by vehicles proceeding in opposite directions has been indicated by a traffic control device, no driver shall turn left from any other lane, and no vehicle shall be driven in such special lane except while preparing for or making a left turn from or into the roadway, or while preparing for or making a U-turn when otherwise permitted by law."
  },
  {
    "corpus": "BRC",
    "title": "7",
    "title_name": "Vehicles, Pedestrians, and Parking",
    "chapter": "4",
    "chapter_name": "Operation of Vehicles",
    "anchor": "7-4-26",
    "heading": "Turn Signal Required.",
    "verbatim": "7-4-26. Turn Signal Required.\n(a)\tNo driver shall turn a vehicle at an intersection or junction, change lanes or otherwise turn a vehicle from a direct course, or move right or left upon a roadway, without first displaying a signal of such intention in the manner described in Section 7-4-29, \"Method of Signaling,\" B.R.C. 1981, continuously for at least the last one hundred feet traveled before making the movement where the speed limit is forty miles per hour or less and for two hundred feet upon portions of streets with higher speed limits.\n(b)\tWhere the turning vehicle is stopped or slowed in obedience to a stop sign or signal or because of a traffic obstruction, five seconds of signal may be substituted for the one hundred or two hundred feet required by this section.\n(c)\tFor the purposes of this section, each lane change or turn is considered, without limitation, a separate movement."
  },
  {
    "corpus": "BRC",
    "title": "7",
    "title_name": "Vehicles, Pedestrians, and Parking",
    "chapter": "4",
    "chapter_name": "Operation of Vehicles",
    "anchor": "7-4-27",
    "heading": "Improper Use of Turn Signal.",
    "verbatim": "7-4-27. Improper Use of Turn Signal.\nThe turn signals described in Section 7-4-29, \"Method of Signaling,\" B.R.C. 1981, shall not be displayed by any driver except when signaling a turn, lane change or start from a parked position, and then not for a time or distance greater than is reasonable. Four-way flashers shall not be displayed by any driver except while stopped to indicate a hazard or while disabled."
  },
  {
    "corpus": "BRC",
    "title": "7",
    "title_name": "Vehicles, Pedestrians, and Parking",
    "chapter": "4",
    "chapter_name": "Operation of Vehicles",
    "anchor": "7-4-28",
    "heading": "Braking Signal Required.",
    "verbatim": "7-4-28. Braking Signal Required.\nNo driver of a motor vehicle or moped shall stop or suddenly decrease speed substantially without displaying a stop signal described in Section 7-4-29, \"Method of Signaling,\" B.R.C. 1981, while so doing."
  },
  {
    "corpus": "BRC",
    "title": "7",
    "title_name": "Vehicles, Pedestrians, and Parking",
    "chapter": "4",
    "chapter_name": "Operation of Vehicles",
    "anchor": "7-4-29",
    "heading": "Method of Signaling.",
    "verbatim": "7-4-29. Method of Signaling.\nStop or turn signals as required by this title shall be given only as follows:\n(a)\tBy signal lamps or signal devices of a type approved by the Colorado Department of Revenue, or\n(b)\tExcept as provided by subsection (c) of this section, by hand and arm from the left side of the vehicle:\n(1)\tLeft turn, extended horizontally;\n(2)\tRight turn, extended upward;\n(3)\tStop or slow, extended downward.\n(c)\tWhere the distance from the center of the top of the steering post of a motor vehicle in use on a street exceeds two feet to the left outside limit of the body, cab or load or fourteen feet to the rear limit of the body or load, the vehicle shall be equipped with signal lamps, and the required signals shall be given only by such lamps."
  },
  {
    "corpus": "BRC",
    "title": "7",
    "title_name": "Vehicles, Pedestrians, and Parking",
    "chapter": "4",
    "chapter_name": "Operation of Vehicles",
    "anchor": "7-4-30",
    "heading": "Defense to Turning or Signaling Violation.",
    "verbatim": "7-4-30. Defense to Turning or Signaling Violation.\nWhere a driver turns a vehicle at an intersection and turns again at or before the next intersection but at least one hundred feet from the first, it is a specific defense to a charge of violating the requirements of subsection 7-4-25(a), B.R.C. 1981, or Section 7-4-26, \"Turn Signal Required,\" B.R.C. 1981, concerning the position of finishing a turn or the length of signaling before a lane change or the next turn, that:\n(a)\tThe distance involved between turns was too short to permit compliance with both sections, and\n(b)\tThe otherwise prohibited maneuver was completed in safety."
  },
  {
    "corpus": "BRC",
    "title": "7",
    "title_name": "Vehicles, Pedestrians, and Parking",
    "chapter": "4",
    "chapter_name": "Operation of Vehicles",
    "anchor": "7-4-31",
    "heading": "Vehicles Proceeding in Opposite Directions Must Pass to Right.",
    "verbatim": "7-4-31. Vehicles Proceeding in Opposite Directions Must Pass to Right.\nDrivers proceeding legally in opposite directions upon the roadway of a street or on a sidewalk or path shall pass each other to the right.\nOrdinance No. 5241 (1989)"
  },
  {
    "corpus": "BRC",
    "title": "7",
    "title_name": "Vehicles, Pedestrians, and Parking",
    "chapter": "4",
    "chapter_name": "Operation of Vehicles",
    "anchor": "7-4-32",
    "heading": "Driving on Right Side of Roadway Required.",
    "verbatim": "7-4-32. Driving on Right Side of Roadway Required.\nUpon all roadways of sufficient width, no person shall drive to the left of the centerline thereof, except as follows:\n(a)\tWhile overtaking and passing another vehicle proceeding in the same direction in conformance with all the rules governing such movement;\n(b)\tWhere an obstruction exists making it necessary to drive to the left of the centerline of the roadway, but any person so doing shall yield the right-of-way to all vehicles traveling in the proper direction upon the unobstructed portion of the roadway;\n(c)\tWhere proceeding in the proper direction upon a roadway restricted to one-way traffic as indicated by traffic control devices; or\n(d)\tWhile turning left within an intersection or junction in conformance with all the rules governing such movement."
  },
  {
    "corpus": "BRC",
    "title": "7",
    "title_name": "Vehicles, Pedestrians, and Parking",
    "chapter": "4",
    "chapter_name": "Operation of Vehicles",
    "anchor": "7-4-33",
    "heading": "Passing on the Left Prohibited.",
    "verbatim": "7-4-33. Passing on the Left Prohibited.\n(a)\tNo driver shall overtake or pass or attempt to overtake or pass upon the left of another vehicle proceeding in the same direction unless:\n(1)\tThe left side of the roadway is clearly visible and is free of oncoming traffic for a sufficient distance ahead to permit such overtaking and passing to be, and the same shall be, made only under all of the following conditions:\n(A)\tThe overtaking and passing is completed in safety and before coming within two hundred feet of any approaching vehicle; and\n(B)\tThe passing is made at a safe distance to the left of any overtaken vehicle, and the overtaking vehicle is not moved back to the right until it is safely clear of any overtaken vehicles;\n(2)\tAnd none of the following conditions exists:\n(A)\tApproaching the crest of a grade or curve in the street within a distance that would create a hazard if another vehicle approached from the opposite direction;\n(B)\tApproaching within one hundred feet of or traversing any intersection or railroad grade crossing;\n(C)\tAny overtaken vehicle is in the process of executing a left turn from a proper lane after exhibiting a sufficient signal;\n(D)\tThe overtaking vehicle is to the left of the centerline of a roadway with two or more lanes of travel in the direction of the vehicle's travel;\n(E)\tA traffic control sign or marking is in place to define a no passing zone; or\n(F)\tAny overtaken vehicle is stopped or slowed for a pedestrian in a crosswalk.\n(b)\tThe prohibitions of this section except Subparagraphs (a)(1)(B), (a)(2)(C) and (a)(2)(F) of this section do not apply to one-way streets. The prohibitions of this section except Subparagraphs (a)(1)(B), (a)(2)(C), (a)(2)(D) and (a)(2)(F) of this section do not apply to roadways marked for two or more lanes of travel in the direction of the overtaking vehicle."
  },
  {
    "corpus": "BRC",
    "title": "7",
    "title_name": "Vehicles, Pedestrians, and Parking",
    "chapter": "4",
    "chapter_name": "Operation of Vehicles",
    "anchor": "7-4-34",
    "heading": "Passing on the Right Prohibited.",
    "verbatim": "7-4-34. Passing on the Right Prohibited.\nNo driver shall overtake or pass or attempt to overtake or pass upon the right of another vehicle proceeding in the same direction upon a roadway unless:\n(a)\tThe overtaking and passing is completed in safety on unobstructed paved roadway of sufficient width; and\n(1)\tIt is done entirely within an unoccupied and marked driving lane on a roadway marked for two or more lanes of moving motor vehicles in the direction of the vehicle's travel;\n(2)\tThe overtaking vehicle is turning right and overtakes or passes a single stopped vehicle that is not signaling a right turn;\n(3)\tA single overtaken vehicle is signaling a left turn;\n(4)\tThe overtaking vehicle is a bicycle or electric assisted bicycle, or a human powered vehicle, or lightweight electric vehicle in a bike lane where such vehicles are allowed; or\n(5)\tThe overtaking vehicle is a bicycle or electric assisted bicycle, or a human powered vehicle or lightweight electric vehicle where such vehicles are allowed, that is traveling to the right of vehicles stopped or moving in the right-hand lane of traffic, but:\n(A)\tThe overtaking vehicle shall not overtake or pass the first vehicle stopped at an intersection unless such overtaking vehicle is preparing to turn right and the overtaken vehicle is not signaling a right turn;\n(B)\tThe overtaking vehicle shall not overtake or pass a moving vehicle signaling a right turn; and\n(C)\tThe overtaking vehicle shall not overtake or pass a vehicle within an intersection except as authorized by paragraph (a)(3) of this section; and\n(b)\tThe overtaken vehicle is not stopped or slowed for a pedestrian.\nOrdinance Nos. 5241 (1989); 7021 (1999); 8447 (2021)"
  },
  {
    "corpus": "BRC",
    "title": "7",
    "title_name": "Vehicles, Pedestrians, and Parking",
    "chapter": "4",
    "chapter_name": "Operation of Vehicles",
    "anchor": "7-4-35",
    "heading": "Passing Within Lane Prohibited.",
    "verbatim": "7-4-35. Passing Within Lane Prohibited.\nSubject to special rules applicable to motorcycles, mopeds, electric assisted bicycles, bicycles, human powered vehicles, or lightweight electric vehicles and rules permitting passing on the right, no driver of any vehicle shall pass another vehicle within the same lane. But any vehicle may pass to the left of a bicycle, electric assisted bicycle, moped, human powered vehicle, or lightweight electric vehicle within the same lane if it is done in safety and if the overtaking vehicle does not come within three feet of the bicycle, moped, human powered vehicle, or lightweight electric vehicle.\nOrdinance Nos. 7021 (1999); 8447 (2021)"
  },
  {
    "corpus": "BRC",
    "title": "7",
    "title_name": "Vehicles, Pedestrians, and Parking",
    "chapter": "4",
    "chapter_name": "Operation of Vehicles",
    "anchor": "7-4-36",
    "heading": "Improper Lane Change.",
    "verbatim": "7-4-36. Improper Lane Change.\nWhere any roadway has been divided into two or more clearly marked lanes for vehicular travel in the same direction, no person shall drive a vehicle other than entirely within a single lane, and no person shall move a vehicle from a lane until such movement can be made in safety, and then only after displaying the signal required by Section 7-4-26, \"Turn Signal Required,\" B.R.C. 1981."
  },
  {
    "corpus": "BRC",
    "title": "7",
    "title_name": "Vehicles, Pedestrians, and Parking",
    "chapter": "4",
    "chapter_name": "Operation of Vehicles",
    "anchor": "7-4-37",
    "heading": "Following Too Closely Prohibited.",
    "verbatim": "7-4-37. Following Too Closely Prohibited.\nThe driver of a vehicle shall not follow another vehicle more closely than is reasonable and prudent, having regard for the speed of both vehicles and the traffic upon and condition of the street, and in no event at a distance of less than one and one-half feet per mile per hour of speed of a motor vehicle following any vehicle.\nOrdinance No. 5241 (1989)"
  },
  {
    "corpus": "BRC",
    "title": "7",
    "title_name": "Vehicles, Pedestrians, and Parking",
    "chapter": "4",
    "chapter_name": "Operation of Vehicles",
    "anchor": "7-4-38",
    "heading": "Changing Lanes Prohibited.",
    "verbatim": "7-4-38. Changing Lanes Prohibited.\nWhenever a traffic control device is in place prohibiting the changing of lanes, no driver shall disobey the instruction of such device."
  },
  {
    "corpus": "BRC",
    "title": "7",
    "title_name": "Vehicles, Pedestrians, and Parking",
    "chapter": "4",
    "chapter_name": "Operation of Vehicles",
    "anchor": "7-4-39",
    "heading": "Slow Moving Vehicle Must Keep to Right.",
    "verbatim": "7-4-39. Slow Moving Vehicle Must Keep to Right.\nA driver proceeding at less than the normal and legal speed of traffic then existing upon a roadway shall drive in the lane farthest to the right then available to that class of vehicle and as close as practicable to the right-hand curb except when overtaking and passing another vehicle proceeding in the same direction or when preparing for a left turn at an intersection or junction, subject to specific rules for that class of vehicle that may provide otherwise."
  },
  {
    "corpus": "BRC",
    "title": "7",
    "title_name": "Vehicles, Pedestrians, and Parking",
    "chapter": "4",
    "chapter_name": "Operation of Vehicles",
    "anchor": "7-4-40",
    "heading": "Certain Vehicles Not to Pass in or Between Lanes.",
    "verbatim": "7-4-40. Certain Vehicles Not to Pass in or Between Lanes.\nExcept for the special rule for bicycles, human powered vehicles, and lightweight electric vehicles described at Paragraph 7-4-34(a)(5), B.R.C. 1981, the driver of a motorcycle, moped, electric assisted bicycle, bicycle, human powered vehicle or lightweight electric vehicle shall not overtake or pass in the same lane occupied by a four- or more, wheeled vehicle being overtaken, nor shall any person operate a motorcycle, moped, electric assisted bicycle, bicycle, human powered vehicle or lightweight electric vehicle between lanes of traffic or between adjacent lines or rows of vehicles. The prohibitions of this section shall not apply to police officers in the performance of their official duties.\nOrdinance Nos. 7021 (1999); 7572 (2008); 8447 (2021)"
  },
  {
    "corpus": "BRC",
    "title": "7",
    "title_name": "Vehicles, Pedestrians, and Parking",
    "chapter": "4",
    "chapter_name": "Operation of Vehicles",
    "anchor": "7-4-41",
    "heading": "When Cycles, Human Powered Vehicles and Lightweight Electric Vehicles May Pass Within a Lane.",
    "verbatim": "7-4-41. When Cycles, Human Powered Vehicles and Lightweight Electric Vehicles May Pass Within a Lane.\nThe driver of a motorcycle, moped, electric assisted bicycle, bicycle, human powered vehicle, or lightweight electric vehicle may pass another such vehicle within a single lane, but only if it may be done in safety.\nOrdinance Nos. 7021 (1999); 8447 (2021)"
  },
  {
    "corpus": "BRC",
    "title": "7",
    "title_name": "Vehicles, Pedestrians, and Parking",
    "chapter": "4",
    "chapter_name": "Operation of Vehicles",
    "anchor": "7-4-42",
    "heading": "Certain Vehicles Not to Ride More Than Two Abreast.",
    "verbatim": "7-4-42. Certain Vehicles Not to Ride More Than Two Abreast.\nNo person shall drive a motorcycle, moped, electric assisted bicycle, bicycle, human powered vehicle, or lightweight electric vehicle adjacent to more than one other such vehicle within the same lane.\nOrdinance Nos. 7021 (1999); 8447 (2021)"
  },
  {
    "corpus": "BRC",
    "title": "7",
    "title_name": "Vehicles, Pedestrians, and Parking",
    "chapter": "4",
    "chapter_name": "Operation of Vehicles",
    "anchor": "7-4-43",
    "heading": "Driving Wrong Way on One-Way Roadway Prohibited.",
    "verbatim": "7-4-43. Driving Wrong Way on One-Way Roadway Prohibited.\n(a)\tNo person shall drive the wrong way on a roadway restricted to one-way traffic.\n(b)\tA roadway is restricted to one-way traffic when so indicated by traffic control devices, including, without limitation, a \"one-way,\" \"do not enter,\" or \"wrong way\" sign or when the provisions of Section 7-4-45, \"Driving On Wrong Side of Divided Street Prohibited,\" B.R.C. 1981, apply. This section also applies where, had the driver obeyed a traffic control device requiring or prohibiting a turn, no violation would have occurred."
  },
  {
    "corpus": "BRC",
    "title": "7",
    "title_name": "Vehicles, Pedestrians, and Parking",
    "chapter": "4",
    "chapter_name": "Operation of Vehicles",
    "anchor": "7-4-44",
    "heading": "Rotary Traffic Islands and Traffic Circles.",
    "verbatim": "7-4-44. Rotary Traffic Islands and Traffic Circles.\n(a)\tNo person shall drive past a rotary traffic island except to the right of such island.\n(b)\tWhere yield signs are in place indicating that a traffic circle is a four-way-yield or an all-way-yield intersection, no driver entering the traffic circle shall fail to yield the right-of-way to any driver whose vehicle is already entirely or partially within the traffic circle.\n(c)\tDrivers entering or leaving a traffic circle are excused from the signaling requirements of Section 7-4-26, \"Turn Signal Required,\" B.R.C. 1981.\n(d)\tNo driver of a vehicle shall overtake or pass or attempt to overtake or pass any other vehicle proceeding in the same direction within a traffic circle.\nOrdinance No. 5920 (1997)"
  },
  {
    "corpus": "BRC",
    "title": "7",
    "title_name": "Vehicles, Pedestrians, and Parking",
    "chapter": "4",
    "chapter_name": "Operation of Vehicles",
    "anchor": "7-4-45",
    "heading": "Driving on Wrong Side of Divided Street Prohibited.",
    "verbatim": "7-4-45. Driving on Wrong Side of Divided Street Prohibited.\nWhere any street has been divided into separate one-way roadways by leaving an intervening space or by a physical barrier, curb or other clearly indicated dividing section so constructed as to impede vehicular traffic, no person shall drive other than on the right-hand roadway."
  },
  {
    "corpus": "BRC",
    "title": "7",
    "title_name": "Vehicles, Pedestrians, and Parking",
    "chapter": "4",
    "chapter_name": "Operation of Vehicles",
    "anchor": "7-4-46",
    "heading": "Driving on Median Prohibited.",
    "verbatim": "7-4-46. Driving on Median Prohibited.\n(a)\tWhere any street has been divided into separate roadways by leaving an intervening space or by a physical barrier, curb or other clearly indicated dividing space so constructed as to impede vehicular traffic, no person shall drive over, across or within such median space, except at a crossover or intersection established across such space if not otherwise prohibited.\n(b)\tThis section does not prohibit a left turn across a median island formed solely by traffic control markings where such movement is not otherwise prohibited and can be made in safety."
  },
  {
    "corpus": "BRC",
    "title": "7",
    "title_name": "Vehicles, Pedestrians, and Parking",
    "chapter": "4",
    "chapter_name": "Operation of Vehicles",
    "anchor": "7-4-47",
    "heading": "Restricted Access.",
    "verbatim": "7-4-47. Restricted Access.\nNo person shall drive onto or from the roadway of any controlled access street except at entrances and exits established or authorized by a public authority."
  },
  {
    "corpus": "BRC",
    "title": "7",
    "title_name": "Vehicles, Pedestrians, and Parking",
    "chapter": "4",
    "chapter_name": "Operation of Vehicles",
    "anchor": "7-4-48",
    "heading": "Driving on Restricted Street Prohibited.",
    "verbatim": "7-4-48. Driving on Restricted Street Prohibited.\nWhere a traffic control sign indicates that a street is prohibited to or restricted to a particular class or classes of vehicle or to particular vehicle occupancies, no driver shall disobey the direction of any such sign."
  },
  {
    "corpus": "BRC",
    "title": "7",
    "title_name": "Vehicles, Pedestrians, and Parking",
    "chapter": "4",
    "chapter_name": "Operation of Vehicles",
    "anchor": "7-4-49",
    "heading": "Driving in Restricted and Bicycle Lane Prohibited.",
    "verbatim": "7-4-49. Driving in Restricted and Bicycle Lane Prohibited.\n(a)\tWhere a traffic control device indicates that a lane is restricted to a particular class or classes of vehicle or to particular vehicle occupancies, no driver shall disobey the direction of any such device. Where traffic control devices restrict the lane to bicycles, such lane may also be used by electric assisted bicycles, lightweight electric vehicles, and by human powered vehicles.\n(b)\tNo person shall drive a motor vehicle powered by a combustible engine or a low-power scooter upon or within any bicycle lane.\nOrdinance Nos. 7021 (1999); 8447 (2021)"
  },
  {
    "corpus": "BRC",
    "title": "7",
    "title_name": "Vehicles, Pedestrians, and Parking",
    "chapter": "4",
    "chapter_name": "Operation of Vehicles",
    "anchor": "7-4-50",
    "heading": "Driving on Sidewalk Prohibited.",
    "verbatim": "7-4-50. Driving on Sidewalk Prohibited.\n(a)\tNo person shall drive a moped or a motor vehicle upon or within any sidewalk area or upon any sidewalk located therein or upon any multi-use path, except to cross it upon a permanent or duly authorized temporary driveway, or drive such vehicle upon any other public or private sidewalk, except with the permission of the manager or owner thereof.\n(b)\tThis prohibition shall not apply to a City employee operating a motor vehicle owned or leased by the City of Boulder in the performance of the duties of that employment, except for the provisions regulating unattended parking, backing, speed or inattentive or reckless driving, as may be reasonably necessary to carry out the employee's assigned tasks while on the property of the city other than on the traveled portion of streets. This subsection does not exempt such an employee from obeying any of the provisions of this title applicable to roadways and streets or from compliance with otherwise applicable City regulations or policies.\n(c)\tThis prohibition shall not apply to a private employee operating pursuant to an operating agreement or contract of service with the City and operating an authorized service vehicle in the performance of the duties of that operating agreement or contract of service, except for the provisions regulating unattended parking, backing, speed or inattentive or reckless driving, as may be reasonably necessary to carry out the employee's assigned tasks while on the property of the City other than on the traveled portion of streets. This subsection does not exempt such an employee from obeying any of the provisions of this title applicable to roadways and streets or from compliance with otherwise applicable City regulations or policies.\n(d)\tThis prohibition shall not apply to lightweight electric vehicles where there is not a bicycle lane provided on the roadway adjacent to the sidewalk.\n(e)\tNotwithstanding the provisions of subsections (b), (c) and (d), motorized vehicles shall yield to nonmotorized vehicles and pedestrians who have the right-of-way on sidewalks and multi-use paths.\nOrdinance Nos. 5241 (1989); 7572 (2008); 8447 (2021)"
  },
  {
    "corpus": "BRC",
    "title": "7",
    "title_name": "Vehicles, Pedestrians, and Parking",
    "chapter": "4",
    "chapter_name": "Operation of Vehicles",
    "anchor": "7-4-51",
    "heading": "Vehicle on Mall Prohibited.",
    "verbatim": "7-4-51. Vehicle on Mall Prohibited.\n(a)\tNo person shall drive or operate any motor vehicle, moped or animal-drawn vehicle on the mall except:\n(1)\tAuthorized emergency vehicles responding to an emergency or on other official business;\n(2)\tVehicles making deliveries to properties abutting the mall that cannot accept delivery in any other reasonable manner, but no such deliveries shall be made between the hours of 10:00 a.m. and 4:00 p.m.;\n(3)\tVehicles used in the construction, operation or maintenance of the mall; or\n(4)\tVehicles that have a permit issued by the city manager, who is authorized to issue the same for a period not to exceed forty-eight hours if the presence of the applicant's vehicle is reasonable and necessary for a special activity authorized under Chapter 4-11, \"Mall Permits and Leases,\" B.R.C. 1981.\n(b)\tNo driver excepted from the prohibition of subsection (a) of this section shall drive on the mall unless:\n(1)\tThe speed does not exceed five miles per hour;\n(2)\tThe vehicle is operated in a manner that is careful and prudent for an area that is primarily for pedestrians; and\n(3)\tAuthorized emergency vehicles responding to emergencies have emergency lights or sirens in use in accordance with subsection 7-2-12(c), B.R.C. 1981, maintenance vehicles with special warning lights display them, and all other motor vehicles have emergency flashers in use.\nOrdinance No. 8447 (2021)"
  },
  {
    "corpus": "BRC",
    "title": "7",
    "title_name": "Vehicles, Pedestrians, and Parking",
    "chapter": "4",
    "chapter_name": "Operation of Vehicles",
    "anchor": "7-4-52",
    "heading": "Careless driving.",
    "verbatim": "7-4-52. Careless driving.\n(a)\tNo person shall drive:\n(1)\tIn a careless, inattentive, negligent, or imprudent manner without due regard for the width, grade, curves, corners, traffic, and use of the streets or other places, or any other attendant circumstances; or\n(2)\tIn such a manner as to violate two or more of the specific sections of this title regulating the driving of vehicles for which penalty points are assessed against the driving privilege under the statutes of the state in a single driving episode. This paragraph does not limit the application of paragraph (a)(1) of this section.\n(b)\tAny person who violates any provision of this section commits the offense of careless driving, and upon conviction thereof shall be punished by a fine of no more than $1,000, jail of no more than ninety days, or both such fine and jail.\nOrdinance Nos. 7409 (2005); 7996 (2014)"
  },
  {
    "corpus": "BRC",
    "title": "7",
    "title_name": "Vehicles, Pedestrians, and Parking",
    "chapter": "4",
    "chapter_name": "Operation of Vehicles",
    "anchor": "7-4-53",
    "heading": "Driving on Roadway Required.",
    "verbatim": "7-4-53. Driving on Roadway Required.\n(a)\tNo driver proceeding on a roadway shall drive off the roadway except at an intersection or junction in accordance with the rules governing such movement.\n(b)\tIt is a specific defense to a charge of violating this section and Sections 7-4-47, \"Restricted Access,\" and 7-4-50, \"Driving On Sidewalk Prohibited,\" B.R.C. 1981, that the driver was engaged in a construction project that necessitated the conduct and was acting with the permission of the owner of the property adjacent to the street."
  },
  {
    "corpus": "BRC",
    "title": "7",
    "title_name": "Vehicles, Pedestrians, and Parking",
    "chapter": "4",
    "chapter_name": "Operation of Vehicles",
    "anchor": "7-4-54",
    "heading": "Colliding With Parked Vehicle Prohibited.",
    "verbatim": "7-4-54. Colliding With Parked Vehicle Prohibited.\nNo driver shall fail to prevent a collision between the driver's vehicle and any vehicle that is parked at a place where vehicles may legally be parked."
  },
  {
    "corpus": "BRC",
    "title": "7",
    "title_name": "Vehicles, Pedestrians, and Parking",
    "chapter": "4",
    "chapter_name": "Operation of Vehicles",
    "anchor": "7-4-55",
    "heading": "Failure to Avoid Interfering With Vehicle Ahead.",
    "verbatim": "7-4-55. Failure to Avoid Interfering With Vehicle Ahead.\nNo driver of a vehicle to the rear shall fail to avoid colliding or otherwise interfering with any vehicle ahead that is proceeding in the same direction as the driver's vehicle or that is stopped facing the same direction as the driver's vehicle. It is an affirmative defense to a charge of violating this section that the driver of the other vehicle violated any section of this title governing right-of-way, turning, lane use, passing or parking and that such violation was the proximate cause of the collision or interference."
  },
  {
    "corpus": "BRC",
    "title": "7",
    "title_name": "Vehicles, Pedestrians, and Parking",
    "chapter": "4",
    "chapter_name": "Operation of Vehicles",
    "anchor": "7-4-56",
    "heading": "Reckless Driving.",
    "verbatim": "7-4-56. Reckless Driving.\n(a)\tNo person shall drive a vehicle in such a manner as to:\n(1)\tIndicate either a willful or wanton disregard for the safety of persons or property;\n(2)\tExceed by thirty or more miles per hour the applicable speed limit; or\n(3)\tIn a single driving episode, violate four or more of the specific sections of this title regulating the driving of vehicles for which penalty points are assessed against the driving privilege under the statutes of the state.\n(4)\tNeither paragraph (a)(2) nor paragraph (a)(3) of this section limits the application of paragraph (a)(1) of this section.\n(b)\tAny person who violates any provision of this section commits the offense of reckless driving, and upon conviction thereof shall be punished by a fine of no more than $1,000, jail of no more than ninety days or both such fine and jail; but on a second or subsequent conviction such person shall be punished by a fine of not less than $50 nor more than $1,000, jail of no less than ten days nor more than six months, or both such fine and jail.\nOrdinance Nos. 5241 (1989); 5333 (1990); 7409 (2005)"
  },
  {
    "corpus": "BRC",
    "title": "7",
    "title_name": "Vehicles, Pedestrians, and Parking",
    "chapter": "4",
    "chapter_name": "Operation of Vehicles",
    "anchor": "7-4-57",
    "heading": "Speed Contest Prohibited.",
    "verbatim": "7-4-57. Speed Contest Prohibited.\n(a)\tNo person shall race or engage in any motor vehicle speed or acceleration contest or exhibition of speed or acceleration upon a street.\n(b)\tAny person who violates any provision of this section commits the offense of speed contest, and upon conviction thereof shall be punished by a fine of no more than $1,000, jail of no more than ninety days or both such fine and jail.\nOrdinance No. 7409 (2005)"
  },
  {
    "corpus": "BRC",
    "title": "7",
    "title_name": "Vehicles, Pedestrians, and Parking",
    "chapter": "4",
    "chapter_name": "Operation of Vehicles",
    "anchor": "7-4-58",
    "heading": "Speeding.",
    "verbatim": "7-4-58. Speeding.\n(a)\tNo person shall drive:\n(1)\tUpon any street, alley, parking lot, sidewalk or path in excess of the speed limit posted thereon;\n(2)\tIn excess of fifteen miles per hour on any alley, parking lot, sidewalk or path upon which no speed limit is posted; or\n(3)\tIn excess of twenty miles per hour on any street upon which no speed limit is posted or in any other place.\n(b)\tEvery complaint of violation of this section shall allege the speed at which the driver traveled and the speed limit applicable at the specified location of the violation. For increased penalties under paragraph (b)(5) of this section to be applicable, the complaint shall also indicate that the offense occurred in a school zone or construction zone. The trier of fact shall determine the applicable speed limit and shall determine in which of the following categories, if any, the speed fell:\n(1)\tExceeding the speed limit by one through four miles per hour. This infraction carries a penalty of not more than $500;\n(2)\tExceeding the speed limit by five through nine miles per hour. This infraction carries a penalty of not more than $500;\n(3)\tExceeding the speed limit by ten through nineteen miles per hour. This infraction carries a penalty of not more than $500;\n(4)\tExceeding the speed limit by twenty or more miles per hour. Any person who commits this offense is subject to punishment by a fine of no more than $1,000, jail of no more than ninety days or both such fine and jail; or\n(5)\tIf alleged in the complaint, whether the offense occurred in a school zone or a posted construction zone, in which case the maximum fine for the infraction or offense shall be doubled.\n(c)\tNo complaint shall be dismissed if the applicable speed limit differs from that alleged, but the court may not impose a sentence for a category of speeding infraction greater than the category alleged in the complaint.\nOrdinance Nos. 5333 (1990); 6033 (1998); 7409 (2005); 8395 (2020)"
  },
  {
    "corpus": "BRC",
    "title": "7",
    "title_name": "Vehicles, Pedestrians, and Parking",
    "chapter": "4",
    "chapter_name": "Operation of Vehicles",
    "anchor": "7-4-59",
    "heading": "Driving Too Fast for Conditions Prohibited.",
    "verbatim": "7-4-59. Driving Too Fast for Conditions Prohibited.\nThe fact that the speed of a vehicle is not in violation of Section 7-4-58, \"Speeding,\" B.R.C. 1981, does not relieve its driver from the duty to decrease speed to less than those limits where special hazard exists because of the presence of a pedestrian or other traffic or by reason of weather or roadway conditions, and no driver shall fail to reduce speed to a speed that permits the vehicle to be operated in compliance with all applicable requirements of this title."
  },
  {
    "corpus": "BRC",
    "title": "7",
    "title_name": "Vehicles, Pedestrians, and Parking",
    "chapter": "4",
    "chapter_name": "Operation of Vehicles",
    "anchor": "7-4-60",
    "heading": "Driving Too Slowly Prohibited.",
    "verbatim": "7-4-60. Driving Too Slowly Prohibited.\nNo person shall drive a motor vehicle on any roadway at such a slow speed as to impede or block the normal and legal forward movement of traffic or below any posted minimum speed, except when a reduced speed is necessary for safe operation of such vehicle or in compliance with law."
  },
  {
    "corpus": "BRC",
    "title": "7",
    "title_name": "Vehicles, Pedestrians, and Parking",
    "chapter": "4",
    "chapter_name": "Operation of Vehicles",
    "anchor": "7-4-61",
    "heading": "Obstructing Traffic Prohibited.",
    "verbatim": "7-4-61. Obstructing Traffic Prohibited.\nNo driver shall stop any vehicle upon a roadway in such a manner or under such conditions as to interfere with or obstruct the free movement of vehicular traffic, block a traffic lane or create a traffic hazard, but this section does not apply to a driver:\n(a)\tEngaged in the process of legally parking;\n(b)\tStopped so as to avoid conflict with other traffic;\n(c)\tActing in compliance with the directions of a peace officer, firefighter, flagger or traffic control sign or signal;\n(d)\tStopping a vehicle because it is involved in a collision or suffers a disabling mechanical failure or because of other similar matters beyond the driver's control or remedy when such stopping is reasonable under the circumstances; or\n(e)\tStopping a bus at a bus stop."
  },
  {
    "corpus": "BRC",
    "title": "7",
    "title_name": "Vehicles, Pedestrians, and Parking",
    "chapter": "4",
    "chapter_name": "Operation of Vehicles",
    "anchor": "7-4-62",
    "heading": "Obedience to Railroad Signal Required.",
    "verbatim": "7-4-62. Obedience to Railroad Signal Required.\nA driver approaching a railroad grade crossing shall stop within fifty feet but no fewer than fifteen feet from the nearest rail and shall not proceed unless it can be done in safety, if:\n(a)\tA clearly visible railroad signal gives warning of the approach or passing of a train;\n(b)\tA railroad employee or flagger gives or displays a signal of the approach or passage of a train;\n(c)\tAn approaching train gives an audible signal at a reasonable distance not more than one thousand five hundred feet from the railroad grade crossing; or\n(d)\tAn approaching or passing train is plainly visible and is in hazardous proximity to the railroad grade crossing."
  },
  {
    "corpus": "BRC",
    "title": "7",
    "title_name": "Vehicles, Pedestrians, and Parking",
    "chapter": "4",
    "chapter_name": "Operation of Vehicles",
    "anchor": "7-4-63",
    "heading": "Certain Vehicles Must Stop at Railroad Grade Crossings.",
    "verbatim": "7-4-63. Certain Vehicles Must Stop at Railroad Grade Crossings.\n(a)\tBefore crossing at grade any tracks of a railroad, the driver of any vehicle carrying more than six passengers for hire, of any school bus carrying any school child, of any vehicle carrying explosives or hazardous materials as a cargo or part of a cargo, or of any vehicle designed to carry flammable liquids, whether empty or loaded, shall stop such vehicle within fifty feet but no fewer than fifteen feet from the nearest rail, while so stopped shall listen and look in all directions along all tracks for any approaching train and for signals indicating the approach of a train, and shall not proceed until it can be done in safety. The driver of a vehicle so required to stop shall cross only in a gear that will not require changing gears while traversing such railroad grade crossing, and the driver shall not manually shift gears while crossing the tracks.\n(b)\tFor the purposes of this section, hazardous materials means any material that is a hazardous material for purposes of the federal Hazardous Materials Transportation Act, 49 U.S.C. §§ 1801 through 1812 and regulations promulgated thereunder that is transported in the city.\n(c)\tThis section does not apply at any railroad grade crossing:\n(1)\tProtected by crossing gates or an alternately flashing light intended to give warning of the approach of a train;\n(2)\tAt which traffic is regulated by a traffic control signal;\n(3)\tAt which traffic is controlled by a police officer or flagger; or\n(4)\tWhere a traffic control sign carrying the legend \"exempt\" is erected.\n(d)\tAny person who violates any provision of this section commits the offense of failure to stop at railroad grade crossing and upon conviction thereof shall be punished by a fine of no more than $1,000, jail of no more than ninety days or both such fine and jail.\nOrdinance Nos. 5462 (1992); 6054 (1999); 7409 (2005)"
  },
  {
    "corpus": "BRC",
    "title": "7",
    "title_name": "Vehicles, Pedestrians, and Parking",
    "chapter": "4",
    "chapter_name": "Operation of Vehicles",
    "anchor": "7-4-64",
    "heading": "Stop for School Bus Required.",
    "verbatim": "7-4-64. Stop for School Bus Required.\n(a)\tA driver meeting or overtaking from either direction a school bus stopped upon a street shall stop before reaching the school bus, if there is displayed on the school bus two or more alternately flashing red lights, and shall not proceed until the school bus resumes motion or the flashing red lights are no longer displayed. But the driver of a vehicle that is on a different roadway of a divided street than the school bus is not required by this section to stop upon meeting or passing a school bus. For the purposes of this section, divided street includes division by a painted median serving as a clearly indicated dividing island.\n(b)\tAny person who violates any provision of this section commits the offense of failure to stop for school bus and upon conviction thereof shall be punished by a fine of no more than $1,000, jail of no more than ninety days. or both such fine and jail.\nOrdinance Nos. 7409 (2005); 7996 (2014)"
  },
  {
    "corpus": "BRC",
    "title": "7",
    "title_name": "Vehicles, Pedestrians, and Parking",
    "chapter": "4",
    "chapter_name": "Operation of Vehicles",
    "anchor": "7-4-65",
    "heading": "Method of Stopping School Bus.",
    "verbatim": "7-4-65. Method of Stopping School Bus.\n(a)\tThe driver of a school bus shall activate the flashing red lights and stop arm required by § 42-4-1903, C.R.S., as amended, whenever stopped for the purpose of receiving or discharging a school child and at no other time. But these signals need not be activated when the school bus is stopped at a location where the traffic engineer has by prior written designation declared such activation unnecessary.\n(b)\tAny person who violates any provision of this section commits the offense of failure to follow method of stopping school bus and upon conviction thereof shall be punished by a fine of no more than $1,000, jail of no more than ninety days or both such fine and jail.\nOrdinance Nos. 5848 (1996); 7409 (2005)"
  },
  {
    "corpus": "BRC",
    "title": "7",
    "title_name": "Vehicles, Pedestrians, and Parking",
    "chapter": "4",
    "chapter_name": "Operation of Vehicles",
    "anchor": "7-4-66",
    "heading": "Operation of Vehicle on Approach of Authorized Emergency Vehicle.",
    "verbatim": "7-4-66. Operation of Vehicle on Approach of Authorized Emergency Vehicle.\n(a)\tUpon the immediate approach of an authorized emergency vehicle making use of audible or visual signals meeting the requirements of § 42-4-213 or 42-4-222, C.R.S., as amended, the driver of every other vehicle shall yield the right-of-way and where possible shall immediately clear the farthest left-hand lane lawfully available to through traffic, shall drive to a position parallel to and as close as possible to the right-hand curb of a roadway clear of any intersection, and shall stop and remain in that position until the authorized emergency vehicle has passed, except when otherwise directed by a police officer or firefighter or the driver of the authorized emergency vehicle.\n(b)\tA driver in a vehicle that is approaching or passing a stationary authorized emergency vehicle that is giving a visual signal by means of flashing, rotating, or oscillating red, blue, or white lights as permitted by § 42-4-213 or 42-2-222, C.R.S., or a stationary towing carrier vehicle that is giving a visual signal by means of flashing, rotating or oscillating yellow lights shall exhibit due care and caution and proceed as described in Paragraphs (1) and (2) of this subsection.\n(1)\tOn a highway with at least two adjacent lanes proceeding in the same direction on the same side of the highway where a stationary authorized emergency vehicle or stationary towing carrier vehicle is located, the driver of an approaching or passing vehicle shall proceed with due care and caution and yield the right-of-way by moving into a lane at least one moving lane apart from the stationary authorized emergency vehicle or stationary towing carrier vehicle, unless directed otherwise by a peace officer or other authorized emergency personnel. If movement to an adjacent moving lane is not possible due to weather, road conditions, or the immediate presence of vehicular or pedestrian traffic, the driver of the approaching vehicle shall proceed in the manner described in Paragraph (2) of this subsection.\n(2)\tOn a highway that does not have at least two adjacent lanes proceeding in the same direction on the same side of the highway where a stationary authorized emergency vehicle or stationary towing carrier vehicle is located, or if movement by the driver of the approaching vehicle into an adjacent moving lane, as described in Paragraph (1) of this subsection, is not possible, the driver of an approaching vehicle shall reduce and maintain a safe speed with regard to the location of the stationary authorized emergency vehicle or stationary towing carrier vehicle, weather conditions, road conditions, and vehicular or pedestrian traffic and proceed with due care and caution, or as directed by a peace officer or other authorized emergency personnel.\n(c)\tA driver in a vehicle that is approaching or passing a maintenance, repair, or construction vehicle that is moving at less than twenty miles per hour shall exhibit due care and caution and proceed as described in Paragraphs (1) and (2) of this subsection.\n(1)\tOn a highway with at least two adjacent lanes proceeding in the same direction on the same side of the highway where a stationary or slow-moving maintenance, repair, or construction vehicle is located, the driver of an approaching or passing vehicle shall proceed with due care and caution and yield the right-of-way by moving into a lane at least one moving lane apart from the vehicle, unless directed otherwise by a peace officer or other authorized emergency personnel. If movement to an adjacent moving lane is not possible due to weather, road conditions, or the immediate presence of vehicular or pedestrian traffic, the driver of the approaching vehicle shall proceed in the manner described in Paragraph (2) of this subsection.\n(2)\tOn a highway that does not have at least two adjacent lanes proceeding in the same direction on the same side of the highway where a stationary or slow-moving maintenance, repair, or construction vehicle is located, or if movement by the driver of the approaching vehicle into an adjacent moving lane, as described in Paragraph (1) of this subsection, is not possible, the driver of an approaching vehicle shall reduce and maintain a safe speed with regard to the location of the stationary or slow-moving maintenance, repair, or construction vehicle, weather conditions, road conditions, and vehicular or pedestrian traffic, and shall proceed with due care and caution, or as directed by a peace officer or other authorized emergency personnel.\n(d)\tA driver in a vehicle that is approaching or passing a motor vehicle where the tires are being equipped with chains on the side of the highway shall exhibit due care and caution and proceed as described in Paragraphs (1) and (2) of this subsection.\n(1)\tOn a highway with at least two adjacent lanes proceeding in the same direction on the same side of the highway where chains are being applied to the tires of a motor vehicle, the driver of an approaching or passing vehicle shall proceed with due care and caution and yield the right-of-way by moving into a lane at least one moving lane apart from the vehicle, unless directed otherwise by a peace officer or other authorized emergency personnel. If movement to an adjacent moving lane is not possible due to weather, road conditions, or the immediate presence of vehicular or pedestrian traffic, the driver of the approaching vehicle shall proceed in the manner described in Paragraph (2) of this subsection.\n(2)\tOn a highway that does not have at least two adjacent lanes proceeding in the same direction on the same side of the highway where chains are being applied to the tires of a motor vehicle, or if movement by the driver of the approaching vehicle into an adjacent moving lane, as described in Paragraph (1) of this subsection, is not possible, the driver of an approaching vehicle shall reduce and maintain a safe speed with regard to the location of the motor vehicle where chains are being applied to the tires, weather conditions, road conditions, and vehicular or pedestrian traffic, and shall proceed with due care and caution, or as directed by a peace officer or other authorized emergency personnel.\n(e)\tAny person who violates any provision of this section commits the offense of interference with an emergency vehicle and upon conviction thereof shall be punished by a fine of no more than $1,000, jail of no more than ninety days, or both such fine and jail.\nOrdinance Nos. 5848 (1996); 7409 (2005); 7996 (2014)"
  },
  {
    "corpus": "BRC",
    "title": "7",
    "title_name": "Vehicles, Pedestrians, and Parking",
    "chapter": "4",
    "chapter_name": "Operation of Vehicles",
    "anchor": "7-4-67",
    "heading": "Eluding.",
    "verbatim": "7-4-67. Eluding.\n(a)\tNo driver who has received or reasonably should have received a visual or audible signal, including, without limitation, a red light or siren from a peace officer driving a vehicle marked as a police, park ranger, sheriff or Colorado State Patrol car or an order given by a police officer directing the driver to stop, shall knowingly increase speed, extinguish lights in an attempt to elude such peace officer, or knowingly attempt in any other manner to elude the peace officer.\n(b)\tAny person who violates any provision of this section commits the offense of eluding, and upon conviction thereof shall be punished by a fine of no more than $1,000, jail of no more than ninety days or both such fine and jail.\nOrdinance Nos. 5241 (1989); 7409 (2005); 8339 (2019)"
  },
  {
    "corpus": "BRC",
    "title": "7",
    "title_name": "Vehicles, Pedestrians, and Parking",
    "chapter": "4",
    "chapter_name": "Operation of Vehicles",
    "anchor": "7-4-68",
    "heading": "Following or Parking Near Fire Truck Prohibited.",
    "verbatim": "7-4-68. Following or Parking Near Fire Truck Prohibited.\nNo driver of any vehicle, other than an authorized emergency vehicle on official business, shall follow any fire apparatus that is using a siren or displaying any emergency lighting closer than five hundred feet or drive into or park within the block where any fire apparatus is stopped displaying emergency lighting."
  },
  {
    "corpus": "BRC",
    "title": "7",
    "title_name": "Vehicles, Pedestrians, and Parking",
    "chapter": "4",
    "chapter_name": "Operation of Vehicles",
    "anchor": "7-4-69",
    "heading": "Crossing Fire Hose Prohibited.",
    "verbatim": "7-4-69. Crossing Fire Hose Prohibited.\nNo person shall drive over any unprotected fire hose unless so directed by a peace officer or firefighter."
  },
  {
    "corpus": "BRC",
    "title": "7",
    "title_name": "Vehicles, Pedestrians, and Parking",
    "chapter": "4",
    "chapter_name": "Operation of Vehicles",
    "anchor": "7-4-70",
    "heading": "Obedience to Peace Officers and Firefighters Directing Traffic Required.",
    "verbatim": "7-4-70. Obedience to Peace Officers and Firefighters Directing Traffic Required.\n(a)\tNo person shall fail to comply with any traffic direction given by voice, hand or other signal by any peace officer or firefighter.\n(b)\tAny person who violates any provision of this section commits the offense of disobeying a peace officer or firefighter and upon conviction thereof shall be punished by a fine of no more than $1,000, jail of no more than ninety days or both such fine and jail.\nOrdinance No. 7409 (2005)"
  },
  {
    "corpus": "BRC",
    "title": "7",
    "title_name": "Vehicles, Pedestrians, and Parking",
    "chapter": "4",
    "chapter_name": "Operation of Vehicles",
    "anchor": "7-4-71",
    "heading": "Obedience to Flagger Required.",
    "verbatim": "7-4-71. Obedience to Flagger Required.\nNo driver shall unreasonably disobey any visible instruction or signal of an official hand signal device of a type prescribed in the state traffic control manual when displayed to such driver by a flagger in the manner prescribed in the manual."
  },
  {
    "corpus": "BRC",
    "title": "7",
    "title_name": "Vehicles, Pedestrians, and Parking",
    "chapter": "4",
    "chapter_name": "Operation of Vehicles",
    "anchor": "7-4-72",
    "heading": "Yield to Maintenance Worker or Vehicle Required.",
    "verbatim": "7-4-72. Yield to Maintenance Worker or Vehicle Required.\nEvery driver shall yield the right-of-way to any vehicle or pedestrian engaged in street work upon a street within any street construction or maintenance area indicated by a traffic control device and shall also yield the right-of-way to any authorized service vehicle engaged in work upon a street and displaying flashing lights that substantially comply with the requirements of § 42-4-214, C.R.S., as amended.\nOrdinance No. 5848 (1996)"
  },
  {
    "corpus": "BRC",
    "title": "7",
    "title_name": "Vehicles, Pedestrians, and Parking",
    "chapter": "4",
    "chapter_name": "Operation of Vehicles",
    "anchor": "7-4-73",
    "heading": "Low-Speed Electric Vehicle Requirements.",
    "verbatim": "7-4-73. Low-Speed Electric Vehicle Requirements.\n(a)\tNo person shall drive a low-speed electric vehicle upon or along any limited access highway. For the purposes of this section, limited access highway means U.S. Highway 36 from the south city limits to Colorado Avenue, Colorado Highway 157 and any other limited access highway within the meaning of that term in the Uniform Safety Code of 1935, as amended, of the state.\n(b)\tA low-speed electric vehicle may be operated only on a roadway that has a speed limit equal to or less than thirty-five miles per hour; except that it may be operated to directly cross a roadway that has a speed limit greater than thirty-five miles per hour at an at-grade crossing to continue traveling along a roadway with a speed limit equal to or less than thirty-five miles per hour.\n(c)\tA low-speed electric vehicle shall conform with federal manufacturing equipment standards as set forth in Standard No. 500, 49 CFR § 571.500.\n(d)\tA golf car is not a low-speed electric vehicle unless it conforms with the standards sets forth in Subsection (c) of this section.\nOrdinance Nos. 5920 (1997); 8447 (2021)"
  },
  {
    "corpus": "BRC",
    "title": "7",
    "title_name": "Vehicles, Pedestrians, and Parking",
    "chapter": "4",
    "chapter_name": "Operation of Vehicles",
    "anchor": "7-4-74",
    "heading": "Automated Enforcement Systems.",
    "verbatim": "7-4-74. Automated Enforcement Systems.\n(a)\tThe city manager is authorized to use red-light cameras to detect violations of Section 7-4-3, \"Obedience to Red Signal Required,\" B.R.C. 1981, and to use camera radar to detect violations of Section 7-4-58, \"Speeding,\" B.R.C. 1981.\n(b)\tAs used in this section:\nCamera means a device capable of capturing visual images, and includes, without limitation, cameras which capture images by the effect of light on chemicals on a film and cameras which capture images by converting light into electromagnetic or optical data which are stored on magnetic tape, computer memory disks or other storage media.\nCamera radar means a device used for speed enforcement consisting of a camera and a radar unit or other speed measurement device that can be programmed to produce an image which depicts a vehicle, and which also indicates the vehicle's speed and the date and approximate time of day.\nRed-light camera means a device adapted for use at a signalized intersection or crosswalk and that is programmed to produce an image which depicts a vehicle, the driver of which has violated the provisions of Section 7-4-3, \"Obedience to Red Signal Required,\" B.R.C. 1981, at the intersection or crosswalk, and which also indicates the vehicle's location before entering and within the intersection or crosswalk and the date and approximate time of day and the status of the applicable traffic signal. Red-light camera also includes a device which will also use sensors, camera and other equipment used to detect red-light violations to compute the speed of vehicles by recording the time the vehicle takes to activate two or more sensors set at known distances.\n(c)\tWhen a peace officer, based on evidence obtained in whole or in part by means of camera radar or red-light camera, has probable cause to believe that a vehicle has been driven in violation of Section 7-4-58, \"Speeding,\" B.R.C. 1981, or has violated the provisions of Section 7-4-3, \"Obedience to Red Signal Required,\" B.R.C. 1981, the peace officer may issue, or cause to be issued through a contractor designated by the city manager, a summons and complaint charging the person in whose name the vehicle is registered based on the license plate or any other identification of the vehicle with violation of the applicable section. If, however, the vehicle is registered in more than one person's name, the summons and complaint shall be issued to the registrant whom the issuing peace officer determines, under all the facts and circumstances, was the person most likely depicted in the image produced by the camera. The summons and complaint shall contain the signature, or a reasonable facsimile thereof, of the peace officer issuing the summons and complaint.\n(d)\tProof that a particular vehicle was exceeding the legal speed limit in violation of Section 7-4-58, \"Speeding,\" B.R.C. 1981, as detected by camera radar or red-light camera, together with proof that the particular vehicle is registered in the charged person's name, shall raise the evidentiary presumption and constitute prima facie evidence in any prosecution of a violation of that section of the fact that the charged person was the person driving the vehicle depicted. However, such evidence and presumption may be rebutted by presentation of probative and competent evidence that the charged person was not the driver shown. And if the image is not of sufficient quality to permit reasonable identification of the driver of the vehicle, the presumption shall not arise.\n(e)\tIn any proceeding in municipal court to prosecute a violation of Section 7-4-58, \"Speeding,\" B.R.C. 1981:\n(1)\tThe image and related data produced by camera radar concerning the violation shall be admissible in court as prima facie evidence of the speed of the vehicle depicted in the image, provided that the person who activated the camera radar prior to the image being taken testifies as to the placement of the camera radar and the accuracy of the scene depicted, and further testifies that the person tested the radar unit of the camera radar for proper calibration within a reasonable period of time both before and after the taking of the image.\n(2)\tThe image and related data produced by a red-light camera concerning the violation shall be admissible in court as prima facie evidence of the speed of the vehicle depicted in the image, provided that the person who activated and tested the red-light camera prior to the image being taken testifies as to the placement of the red-light camera and the accuracy of the scene depicted in the image, and further testifies that the person tested the red-light camera for proper operation within a reasonable period of time both before and after the taking of the image.\n(3)\tIt shall not be necessary that the same person who did the testing before the taking of the image be the person who testifies concerning the testing which occurs thereafter. Testing and operation in accordance with the manufacturer's specifications shall be, without limitation, sufficient foundation for introduction of the evidence.\n(f)\tProof that a particular vehicle entered an intersection in violation of Section 7-4-3, \"Obedience to Red Signal Required,\" B.R.C. 1981, as detected by a red-light camera, together with proof that the particular vehicle is registered in the charged person's name, shall raise the evidentiary presumption and constitute prima facie evidence in any prosecution of a violation of that section of the fact that the charged person was the person driving the vehicle depicted in the image. However, such evidence and presumption may be rebutted by presentation of probative and competent evidence that the charged person was not the driver shown. And if the image is not of sufficient quality to permit reasonable identification of the driver of the vehicle, the presumption shall not arise.\n(g)\tIn any proceeding in municipal court to prosecute a violation of Section 7-4-3, \"Obedience to Red Signal Required,\" B.R.C. 1981, the image and related data produced by a red-light camera concerning the violation shall be admissible in court as prima facie evidence of a violation of such section, provided that the person who activated and tested the red-light camera prior to the image being taken testifies as to the placement of the red-light camera and the accuracy of the scene depicted in the image, and further testifies that the person tested the red-light camera for proper operation within a reasonable period of time both before and after the taking of the image. It shall not be necessary that the same person who did the testing before the taking of the image be the person who testifies concerning the testing which occurs thereafter. Testing and operation in accordance with the manufacturer's specifications shall be, without limitation, sufficient foundation for introduction of the evidence.\n(h)\tThe penalty for speeding less than twenty-five miles per hour over the applicable speed limit in violation of Section 7-4-58, \"Speeding,\" B.R.C. 1981, if evidence produced by camera radar or red-light camera constituted an indispensable element of the proof, shall be $40. The penalty for violation of Section 7-4-3, \"Obedience to Red Signal Required,\" B.R.C. 1981, if evidence produced by red-light camera constituted an indispensable element of the proof, shall be $75. The fine doubling provisions of subsection 7-2-4(b), B.R.C. 1981, concerning traffic infractions in school zones and construction zones shall also apply to fines imposed under this subsection.\n(i)\tIn addition to other court costs, there shall be imposed in the manner specified in Section 2-6-35, \"Court Costs,\" B.R.C. 1981, upon any defendant who did not waive service of process the additional court cost amount for service of process specified in Section 4-20-55, \"Court and Vehicle Impoundment Costs, Fees and Civil Penalties,\" B.R.C. 1981.\n(j)\tBecause the city council, acting pursuant to its home rule authority, has adopted by ordinance an absolute speed limit system, and not a prima facie system, with respect to any warning or any other matter purportedly required under state law for automated vehicle identification systems, the reasonable and prudent speed shall be the posted speed. The city manager may cause letters concerning violations detected by automated vehicle identification systems to be sent by first class mail to the owner of the vehicle involved, informing the owner of the event and of the steps the City may take subsequently, so long as it is clear that such letters are not the formal process of the municipal court. Because nothing in this section or in § 42-4-110.5, C.R.S., changes any element of the offenses of speeding or disobeying a signal light, no failure of compliance shall constitute grounds for dismissal of the charge, nor shall it preclude conviction if the underlying elements are proven.\n(k)\tThe city manager shall not release or permit the inspection or copying of images that are evidence required to prove a violation taken by license plate recognition technology, camera radar or red-light camera for other than law enforcement purposes, unless directed to do so by subpoena from a court of competent jurisdiction, or as part of litigation or threatened litigation involving the City. But such images shall be available to the owner of any vehicle and to the driver of any vehicle depicted in any such image. Images taken by license plate recognition technology that are determined to not be evidence required to prove a parking violation shall not be released or be permitted to be inspected or copied and shall be purged on a regular schedule adopted by the city manager.\nOrdinance Nos. 5954 (1997); 6033 (1998); 6073 (1999); 7143 (2001); 7394 (2004); 7409 (2005); 7445 (2005); 7778 (2011); 7824 (2012)"
  },
  {
    "corpus": "BRC",
    "title": "7",
    "title_name": "Vehicles, Pedestrians, and Parking",
    "chapter": "4",
    "chapter_name": "Operation of Vehicles",
    "anchor": "7-4-75",
    "heading": "Valid License Plate Required.",
    "verbatim": "7-4-75. Valid License Plate Required.\nNo motorized vehicle authorized to operate on city roadways shall be operated upon any street without displaying a valid, current license plate required by the laws of the state, and without displaying the valid, current license plate or plates in the location or locations required by the laws of the state, territory or country which issued the license plate or plates displayed.\nOrdinance No. 7572 (2008)"
  },
  {
    "corpus": "BRC",
    "title": "7",
    "title_name": "Vehicles, Pedestrians, and Parking",
    "chapter": "4",
    "chapter_name": "Operation of Vehicles",
    "anchor": "7-4-76",
    "heading": "Compulsory Insurance.",
    "verbatim": "7-4-76. Compulsory Insurance.\n(a)\tNo owner of a motor vehicle required to be registered in the state of Colorado shall operate the vehicle or permit it to be operated within the City when the owner has failed to have a complying policy or certificate of self-insurance in full force and effect as required by law.\n(b)\tNo person shall operate a motor vehicle on the streets or public highways within the City without a complying policy or certificate of self-insurance in full force and effect as required by law.\n(c)\tWhen an accident occurs, or when requested to do so following any lawful traffic contact or during any traffic investigation by a peace officer, no owner or operator of a motor vehicle shall fail to present to the requesting officer immediate evidence of a complying policy or certificate of self-insurance in full force and effect as required by law.\n(d)\tEvidence of the failure of any owner or operator of a motor vehicle to present immediate evidence of a complying policy or certificate of self-insurance in full force and effect as required by law, when requested to do so by a peace officer, shall constitute prima facie evidence, at a trial concerning a violation charged under this section, that such owner or operator of a motor vehicle violated the provisions of this section.\n(e)\tNo person charged with violating subsection (a), (b) or (c) above shall be convicted if the person produces in court a bona fide complying policy or certificate of self-insurance that was in full force and effect as required by law at the time of the alleged violation.\n(f)\tAny person who violates any provision of this section shall be guilty of a traffic offense and, upon conviction, shall be punished by a fine of not less than $100 nor more than $1,000, jail of no more than ninety days, or both such fine and jail. On any second or subsequent conviction under this section within a period of two years following a prior conviction under this section, such person shall be punished by a fine of not less than $200 nor more than $1,000, jail of no more than ninety days, or both such fine and jail.\nOrdinance No. 7654 (2009)"
  },
  {
    "corpus": "BRC",
    "title": "7",
    "title_name": "Vehicles, Pedestrians, and Parking",
    "chapter": "4",
    "chapter_name": "Operation of Vehicles",
    "anchor": "7-4-77",
    "heading": "Stop at Crosswalk Required.",
    "verbatim": "7-4-77. Stop at Crosswalk Required.\nWhenever any vehicle is stopped at a marked crosswalk or at any unmarked crosswalk at an intersection to permit a pedestrian to cross the roadway, the driver of any other vehicle approaching from the rear shall not overtake and pass such stopped vehicle.\nOrdinance No. 7824 (2012)"
  },
  {
    "corpus": "BRC",
    "title": "7",
    "title_name": "Vehicles, Pedestrians, and Parking",
    "chapter": "4",
    "chapter_name": "Operation of Vehicles",
    "anchor": "7-4-78",
    "heading": "Misuse of Mobile Electronic Device.",
    "verbatim": "7-4-78. Misuse of Mobile Electronic Device.\n(a)\tFor purposes of this section, the following words shall have the following definitions unless the context otherwise requires:\nEmergency means a circumstance in which an individual:\n(1)\tHas reason to fear for the individual's life or safety or believes that a criminal act may be perpetrated against the individual or another individual, requiring the use of a mobile electronic device when the individual is driving a motor vehicle; or\n(2)\tReports a fire, a traffic accident in which one or more injuries are apparent, a serious road hazard, a medical or hazardous materials emergency, or an individual who is driving in a reckless, careless, or unsafe manner.\nFirst responder means:\n(1)\tA peace officer, as described in § 16-2.5-101, C.R.S.;\n(2)\tA firefighter, as defined in § 29-5-203(10), C.R.S.;\n(3)\tA volunteer firefighter, as defined in § 31-30-1102(9)(a), C.R.S.;\n(4)\tAn emergency medical service provider, as defined in § 25-3.5-103(8), C.R.S.; or\n(5)\tAny other individual who responds in a professional capacity to a public safety emergency.\nHands-free accessory means an accessory with a feature or function that enables an individual to use a mobile electronic device without using either hand, except to activate, deactivate, or initiate the feature or function with a single touch or single swipe.\nMobile electronic device means a handheld or portable electronic device capable of providing voice communication between two or more persons, amusement, or the wireless transfer of data. A Mobile electronic device does not include:\n(1)\tA radio, citizens band radio, or citizens band radio hybrid;\n(2)\tA commercial two-way radio communication device or its functional equivalent;\n(3)\tA subscription-based emergency communication device;\n(4)\tA prescribed medical device;\n(5)\tAn amateur or ham radio device; or\n(6)\tSystems that are designed for and installed within the vehicle's electronics, such as an in-vehicle security, navigation, communications, or remote diagnostics system.\nOperating a motor vehicle means driving a motor vehicle on a public highway.\nOperating a motor vehicle does not include maintaining the instruments of control of a motor vehicle while the motor vehicle is at rest in a shoulder lane or lawfully parked.\nUse or Using means:\n(1)\tPhysically holding a mobile electronic device in the driver's hand or pinning a mobile electronic device to a driver's ear to conduct voice-based communication; except that an individual may use a speaker or other listening device that is built into protective headgear or a device or portion of a device that only covers all or a portion of one ear and that is connected to a wireless, handheld telephone as provided in § 42-4-1411, C.R.S.;\n(2)\tWatching a video or movie on a mobile electronic device, other than watching data related to the navigation of the motor vehicle; or\n(3)\tWriting, sending, or reading text-based communication, including a text message, instant message, e-mail, or internet data, on a mobile electronic device; except that text-based communication does not include:\n(A)\tA voice-based communication that is automatically converted by the mobile electronic device to be sent as a message in written form; or\n(B)\tCommunication concerning the navigation of a motor vehicle.\n(b)\tExcept as specified in subsection (c) of this section, an individual shall not use a mobile electronic device while operating a motor vehicle.\n(c)\tIt is not a violation of subsection (b) of this section to use a mobile electronic device:\n(1)\tTo contact a public safety entity;\n(2)\tDuring an emergency;\n(3)\tWhen an employee or contractor of a utility is acting within the scope of the employee's or contractor's duties when responding to a utility emergency;\n(4)\tWhen an employee or contractor of a city or county is acting within the scope of the employee's or contractor's duties as a code enforcement officer or animal protection officer; or\n(5)\tDuring the performance of a first responder's official duties.\n(d)\tAn individual charged with violating subsection (b) of this section shall not be convicted if the individual:\n(1)\tProduces a hands-free accessory or proof of purchase of a hands-free accessory; and\n(2)\tAffirms under penalty of perjury that the individual has not previously had a charge dismissed under subsection (d)(1), above.\n(e)\tThe municipal court clerk may dismiss the charge if the court clerk verifies that the individual has complied with both subsections (d)(1) and (d)(2) of this section.\n(f)\tThis section does not apply to an individual with a commercial driver's license who is operating a commercial vehicle.\n(g)\tAn individual operating a motor vehicle shall not be cited for a violation of subsection (b) of this section unless a law enforcement officer saw the individual use a mobile electronic device in a manner that caused the individual to drive in a careless and imprudent manner, without due regard for the width, grade, curves, corners, traffic, and use of the streets and highways and all other attendant circumstances.\n(h)\tThis section does not authorize the seizure and forfeiture of a mobile electronic device, unless otherwise provided by law.\nOrdinance Nos. 7996 (2014); 8678 (2025)"
  },
  {
    "corpus": "BRC",
    "title": "7",
    "title_name": "Vehicles, Pedestrians, and Parking",
    "chapter": "5",
    "chapter_name": "Pedestrian, Bicycle, Human Powered Vehicle, Lightweight Electric Vehicle and Animal Traffic",
    "anchor": "7-5-1",
    "heading": "Application of Traffic Laws to Bicycles, Human Powered Vehicles and Lightweight Electric Vehicles.",
    "verbatim": "7-5-1. Application of Traffic Laws to Bicycles, Human Powered Vehicles and Lightweight Electric Vehicles.\nEvery person driving a bicycle, electric assisted bicycle, human powered vehicle, and lightweight electric vehicle has all of the rights and duties applicable to the driver of any other vehicle under this title except as modified by this chapter.\nOrdinance Nos. 7021 (1999); 8447 (2021)"
  },
  {
    "corpus": "BRC",
    "title": "7",
    "title_name": "Vehicles, Pedestrians, and Parking",
    "chapter": "5",
    "chapter_name": "Pedestrian, Bicycle, Human Powered Vehicle, Lightweight Electric Vehicle and Animal Traffic",
    "anchor": "7-5-2",
    "heading": "Required Method of Riding Bicycle, Human Powered Vehicle, and Lightweight Electric Vehicle.",
    "verbatim": "7-5-2. Required Method of Riding Bicycle, Human Powered Vehicle, and Lightweight Electric Vehicle.\n(a)\tNo person driving a bicycle, electric assisted bicycle or seated electric scooter shall ride other than astride a permanent and regular seat attached thereto.\n(b)\tNo bicycle or electric assisted bicycle, human powered vehicle, or lightweight electric vehicle shall be used by either the driver or any passenger to carry more persons than the number for which it is designed or equipped.\n(c)\tAn adult riding on a bicycle or electric assisted bicycle may carry a child securely attached to the person in a backpack or sling.\nOrdinance Nos. 5241 (1989); 7021 (1999); 8447 (2021)"
  },
  {
    "corpus": "BRC",
    "title": "7",
    "title_name": "Vehicles, Pedestrians, and Parking",
    "chapter": "5",
    "chapter_name": "Pedestrian, Bicycle, Human Powered Vehicle, Lightweight Electric Vehicle and Animal Traffic",
    "anchor": "7-5-3",
    "heading": "Carrying Articles.",
    "verbatim": "7-5-3. Carrying Articles.\nEvery person driving a bicycle or electric assisted bicycle, human powered vehicle or lightweight electric vehicle equipped with handlebars shall keep at least one hand on the handlebars at all times and shall not carry any package, bundle or article that obstructs the driver's vision or prevents the use of both hands in the control and operation of the vehicle.\nOrdinance Nos. 7021 (1999); 8447 (2021)"
  },
  {
    "corpus": "BRC",
    "title": "7",
    "title_name": "Vehicles, Pedestrians, and Parking",
    "chapter": "5",
    "chapter_name": "Pedestrian, Bicycle, Human Powered Vehicle, Lightweight Electric Vehicle and Animal Traffic",
    "anchor": "7-5-4",
    "heading": "Bicycle, Human Powered Vehicle and Lightweight Electric Vehicle to be Driven to Right.",
    "verbatim": "7-5-4. Bicycle, Human Powered Vehicle and Lightweight Electric Vehicle to be Driven to Right.\n(a)\tEvery person driving a bicycle or electric assisted bicycle, human powered vehicle, or lightweight electric vehicle upon a roadway at a speed so slow as to impede or block the normal and legal forward movement of traffic proceeding immediately behind such vehicle shall drive within the right four feet of the right-hand through lane of the roadway, except under any of the following conditions:\n(1)\tWhen driving in a bike lane where such vehicles are permitted;\n(2)\tWhen preparing for a left turn except as otherwise provided in this chapter;\n(3)\tWhen reasonably necessary for safety because of debris or other obstruction on or a defect in the surface of the pavement, but the driver of the bicycle, human powered vehicle, or lightweight electric vehicle shall continue to drive as close to the right side of the roadway as is practicable;\n(4)\tWhen overtaking and passing on the left of another vehicle; or\n(5)\tOn a one-way street, when driving in the left four feet of the left-hand through lane.\n(b)\tA bicycle or electric assisted bicycle, human powered vehicle, and lightweight electric vehicle may be driven on a paved shoulder if such driving does not violate any section of this title for passing or direction of travel.\n(c)\tThe provisions of this section do not apply to roadways designated as shared streets.\nOrdinance Nos. 5241 (1989); 7021 (1999); 7996 (2014); 8447 (2021)"
  },
  {
    "corpus": "BRC",
    "title": "7",
    "title_name": "Vehicles, Pedestrians, and Parking",
    "chapter": "5",
    "chapter_name": "Pedestrian, Bicycle, Human Powered Vehicle, Lightweight Electric Vehicle and Animal Traffic",
    "anchor": "7-5-5",
    "heading": "Use of Crosswalk.",
    "verbatim": "7-5-5. Use of Crosswalk.\n(a)\tNo person shall immediately approach, enter, or traverse a crosswalk which spans a roadway at a speed greater than eight miles per hour.\n(b)\tPersons driving bicycles or electric assisted bicycles, human powered vehicles, and lightweight electric vehicles across a roadway upon and along a crosswalk from a sidewalk or multi-use path where such vehicles are permitted shall have the duties applicable to pedestrians under the same circumstances.\n(c)\tSuch persons similarly have the rights of a pedestrian, but only if the driver of such vehicle was entitled to use the sidewalk or multi-use path, and the approach, entry, and traversal of the crosswalk are made at a speed no greater than a reasonable crossing speed so that other drivers may anticipate the necessity to yield when required.\n(d)\tIt shall not be a defense to a violation of this section that the driver of the lightweight electric vehicle was not lawfully entitled to drive such vehicle on the sidewalk or multi-use path.\nOrdinance Nos. 5241 (1989); 5920 (1997); 7824 (2012); 7941 (2013); 8447 (2021)"
  },
  {
    "corpus": "BRC",
    "title": "7",
    "title_name": "Vehicles, Pedestrians, and Parking",
    "chapter": "5",
    "chapter_name": "Pedestrian, Bicycle, Human Powered Vehicle, Lightweight Electric Vehicle and Animal Traffic",
    "anchor": "7-5-6",
    "heading": "Driving More than Two Abreast on Multi-Use Path Prohibited.",
    "verbatim": "7-5-6. Driving More than Two Abreast on Multi-Use Path Prohibited.\nNo person shall drive a bicycle, human powered vehicle, or lightweight electric vehicle upon a multi-use path adjacent to more than one other bicycle, human powered vehicle, or lightweight electric vehicle.\nOrdinance Nos. 5241 (1989); 8447 (2021)"
  },
  {
    "corpus": "BRC",
    "title": "7",
    "title_name": "Vehicles, Pedestrians, and Parking",
    "chapter": "5",
    "chapter_name": "Pedestrian, Bicycle, Human Powered Vehicle, Lightweight Electric Vehicle and Animal Traffic",
    "anchor": "7-5-7",
    "heading": "Left Turns by Bicycles, Human Powered Vehicles and Lightweight Electric Vehicles.",
    "verbatim": "7-5-7. Left Turns by Bicycles, Human Powered Vehicles and Lightweight Electric Vehicles.\n(a)\tThe driver of a bicycle or electric assisted bicycle turning left in accordance with Section 7-4-25, \"Improper Turn Prohibited,\" B.R.C. 1981, may approach the turn anywhere within any separate left turn lane and may finish the turn by moving to the right lane as soon as it can be done in safety.\n(b)\tIn addition to any other method specified in this title, the driver of a bicycle or electric assisted bicycle may make a left turn by crossing the intersection as close as practicable to the right-hand curb line to the far curb and then turning left to proceed in the proper position on the other roadway. A person making a left turn under the provisions of this subsection may do so only after complying with all the obligations of drivers of vehicles approaching in the new direction on the other roadway, including, without limitation, the duties to stop and yield in response to traffic control signs or signals.\n(c)\tNo person operating a human powered vehicle other than a bicycle and no person operating a lightweight electric vehicle other than an electric assisted bicycle that is operating on a roadway with a bicycle lane shall leave the bicycle lane to make a left turn.\nOrdinance Nos. 7021 (1999); 8447 (2021)"
  },
  {
    "corpus": "BRC",
    "title": "7",
    "title_name": "Vehicles, Pedestrians, and Parking",
    "chapter": "5",
    "chapter_name": "Pedestrian, Bicycle, Human Powered Vehicle, Lightweight Electric Vehicle and Animal Traffic",
    "anchor": "7-5-8",
    "heading": "Bicycle, Human Powered Vehicle and Lightweight Electric Vehicle Turn Signals.",
    "verbatim": "7-5-8. Bicycle, Human Powered Vehicle and Lightweight Electric Vehicle Turn Signals.\nThe driver of a bicycle or human powered vehicle or lightweight electric vehicle equipped with handlebars is excepted from giving the hand and arm signal continuously if the hand is needed in the control or operation of the vehicle, but it shall be given for a substantial period while stopped waiting to turn. The driver of a bicycle or electric assisted bicycle, human powered vehicle, or lightweight electric vehicle may signal a right turn by extending the right hand and arm horizontally.\nOrdinance Nos. 7021 (1999); 8447 (2021)"
  },
  {
    "corpus": "BRC",
    "title": "7",
    "title_name": "Vehicles, Pedestrians, and Parking",
    "chapter": "5",
    "chapter_name": "Pedestrian, Bicycle, Human Powered Vehicle, Lightweight Electric Vehicle and Animal Traffic",
    "anchor": "7-5-9",
    "heading": "Bicycle, Human Powered Vehicle and Lightweight Electric Vehicle Must Yield Right-of-way and Obey Traffic Control Devices on Sidewalk, Crosswalk or Path.",
    "verbatim": "7-5-9. Bicycle, Human Powered Vehicle and Lightweight Electric Vehicle Must Yield Right-of-way and Obey Traffic Control Devices on Sidewalk, Crosswalk or Path.\n(a)\tA person driving a bicycle, electric assisted bicycle, human powered vehicle, or lightweight electric vehicle on a sidewalk, a crosswalk, or a multi-use path shall yield the right-of-way to any pedestrian and shall give an audible signal before overtaking or passing any pedestrian.\n(b)\tA person driving a lightweight electric vehicle on any multi-use path or sidewalk where such vehicles are permitted or in any crosswalk shall yield the right-of-way to any bicycle, electric assisted bicycle, human powered vehicle and pedestrian and shall give an audible signal before overtaking or passing any bicycle, electric assisted bicycle, human powered vehicle, and pedestrian.\n(c)\tIf any traffic control device is in place alongside of or on a sidewalk or a multi-use path, no pedestrian or driver of a bicycle, electric assisted bicycle or human powered vehicle, and no driver of a lightweight electric vehicle where such vehicles are permitted, shall fail to obey the requirements of the device.\nOrdinance Nos. 5241 (1989); 7941 (2013); 8447 (2021)"
  },
  {
    "corpus": "BRC",
    "title": "7",
    "title_name": "Vehicles, Pedestrians, and Parking",
    "chapter": "5",
    "chapter_name": "Pedestrian, Bicycle, Human Powered Vehicle, Lightweight Electric Vehicle and Animal Traffic",
    "anchor": "7-5-10",
    "heading": "Driving Bicycle, Human Powered Vehicle or Lightweight Electric Vehicle on Sidewalk Prohibited.",
    "verbatim": "7-5-10. Driving Bicycle, Human Powered Vehicle or Lightweight Electric Vehicle on Sidewalk Prohibited.\n(a)\tNo person shall drive a bicycle, electric assisted bicycle, human powered vehicle, or lightweight electric vehicle upon and along a sidewalk in an area designated as a dismount zone by a traffic control device or as depicted on the maps in Appendix A-1 and A-2 at the end of this section which are incorporated by reference into this chapter.\n(b)\tNo person shall drive a bicycle, electric assisted bicycle, human powered vehicle, or lightweight electric vehicle on the mall. This subsection does not apply to an entertainer who is performing an act on a unicycle.\n(c)\tNo person shall drive a bicycle, electric assisted bicycle, human powered vehicle, or lightweight electric vehicle upon and along a sidewalk where such use is prohibited by a traffic control device.\n(d)\tNo person shall drive a human powered vehicle or lightweight electric vehicle upon and along any sidewalk where there is a bicycle lane provided on the roadway adjacent to the sidewalk.\n(e)\tNo person shall drive a lightweight electric vehicle upon and along any sidewalk adjacent to a street with a speed limit of twenty miles per hour or less.\nOrdinance Nos. 5241 (1989); 5930 (1997); 7522 (2007); 8447 (2021); 8468(2021)"
  },
  {
    "corpus": "BRC",
    "title": "7",
    "title_name": "Vehicles, Pedestrians, and Parking",
    "chapter": "5",
    "chapter_name": "Pedestrian, Bicycle, Human Powered Vehicle, Lightweight Electric Vehicle and Animal Traffic",
    "anchor": "7-5-11",
    "heading": "Lights and Reflector Required.",
    "verbatim": "7-5-11. Lights and Reflector Required.\n(a)\tNo person shall drive a bicycle or electric assisted bicycle between sunset and sunrise unless it is equipped with a red rear reflector mounted on the bicycle so located and of sufficient size and reflectivity to be visible for six hundred feet to the rear when directly in front of lawful lower beams of headlamps on a motor vehicle.\n(b)\tNo person shall drive a bicycle or electric assisted bicycle between sunset and sunrise or at any other time when, due to insufficient light or unfavorable atmospheric conditions, persons and vehicles are not clearly discernible at a distance of one thousand feet ahead, unless it is equipped with a lamp mounted on the front of the bicycle and emitting a white light visible from a distance of at least five hundred feet to the front.\n(c)\tNo person shall drive a human powered vehicle between sunset and sunrise or at any other time when, due to insufficient light or unfavorable atmospheric conditions, persons and vehicles are not clearly discernible at a distance of one thousand feet ahead, unless the driver of such vehicle is equipped with at least one lamp displaying a white light visible from a distance of not less than five hundred feet to the front of such vehicle, and with at least one lamp displaying a red light or a rear red reflector visible from a distance of not less than five hundred feet to the rear of such driver and located at a height of not more than eighty-four inches nor less than twenty inches measured from the center of the lamp to the level ground upon which the driver sits or stands.\nOrdinance Nos. 4913 (1985); 5241 (1989); 7021 (1999); 8447 (2021)"
  },
  {
    "corpus": "BRC",
    "title": "7",
    "title_name": "Vehicles, Pedestrians, and Parking",
    "chapter": "5",
    "chapter_name": "Pedestrian, Bicycle, Human Powered Vehicle, Lightweight Electric Vehicle and Animal Traffic",
    "anchor": "7-5-12",
    "heading": "Bicycle, Human Powered Vehicle, and Lightweight Electric Vehicle Brake Required.",
    "verbatim": "7-5-12. Bicycle, Human Powered Vehicle, and Lightweight Electric Vehicle Brake Required.\nNo person shall drive a bicycle or electric assisted bicycle, human powered vehicle, or lightweight electric vehicle unless it is equipped with a brake system which will enable its driver to stop such vehicle within twenty-five feet from a speed of ten miles per hour on dry, level, clean pavement.\nOrdinance Nos. 5241 (1989); 7021 (1999); 8447 (2021)"
  },
  {
    "corpus": "BRC",
    "title": "7",
    "title_name": "Vehicles, Pedestrians, and Parking",
    "chapter": "5",
    "chapter_name": "Pedestrian, Bicycle, Human Powered Vehicle, Lightweight Electric Vehicle and Animal Traffic",
    "anchor": "7-5-13",
    "heading": "Definition of Walk.",
    "verbatim": "7-5-13. Definition of Walk.\nAny requirement placed on a walking pedestrian under this chapter applies to every pedestrian."
  },
  {
    "corpus": "BRC",
    "title": "7",
    "title_name": "Vehicles, Pedestrians, and Parking",
    "chapter": "5",
    "chapter_name": "Pedestrian, Bicycle, Human Powered Vehicle, Lightweight Electric Vehicle and Animal Traffic",
    "anchor": "7-5-14",
    "heading": "Pedestrian, Bicyclist, Human Powered Vehicle and Electric Powered Vehicle Entering Roadway.",
    "verbatim": "7-5-14. Pedestrian, Bicyclist, Human Powered Vehicle and Electric Powered Vehicle Entering Roadway.\nNo pedestrian or driver of a bicycle, human powered vehicle, or lightweight electric vehicle shall suddenly leave a curb or other place of safety and walk, run, or drive into the path of a moving vehicle that is so close as to constitute an immediate hazard.\nOrdinance Nos. 5241 (1989); 7996 (2014); 8447 (2021)"
  },
  {
    "corpus": "BRC",
    "title": "7",
    "title_name": "Vehicles, Pedestrians, and Parking",
    "chapter": "5",
    "chapter_name": "Pedestrian, Bicycle, Human Powered Vehicle, Lightweight Electric Vehicle and Animal Traffic",
    "anchor": "7-5-15",
    "heading": "Pedestrian Obedience to Traffic Signal Required.",
    "verbatim": "7-5-15. Pedestrian Obedience to Traffic Signal Required.\n(a)\tExcept as otherwise directed by a pedestrian traffic control signal as described in Subsection (b) below, no pedestrian shall enter the roadway at an intersection controlled by a steady traffic control signal unless a circular green signal is displayed governing the direction of travel.\n(b)\tWhere a pedestrian traffic control signal is in place and operating, no pedestrian shall enter the roadway except where the illuminated symbols described in this subsection are displayed governing the direction of travel:\n(1)\tA walking person (symbolizing \"Walk\") signal indication means that, exercising due caution, a pedestrian facing the signal indication may start to cross the roadway in the direction of the signal indication.\n(2)\tExcept as provided in Paragraph (4) of this subsection, a flashing upraised hand (symbolizing \"Don't Walk\") signal indication means that a pedestrian shall not start to cross the roadway in the direction of the signal indication, but that any pedestrian who has already started to cross on a \"Walk\" signal may complete crossing the roadway.\n(3)\tA steady \"Don't Walk\" signal indication means that a pedestrian shall not enter the roadway in the direction of the signal indication.\n(4)\tA countdown display showing the number of seconds remaining in the pedestrian change interval means that a pedestrian facing the signal indication may start to cross the roadway in the direction of the signal indication, but only if such pedestrian is able to safely walk completely across the street prior to the signal changing to assign the right-of-way to any conflicting traffic movement.\n(c)\tThe prohibitions of this section apply to a pedestrian crossing in the crosswalk, in the intersection, or within fifty feet of the crosswalk.\n(d)\tWhenever a traffic control signal provides for the stopping of all vehicular traffic and the exclusive movement of pedestrians and \"Walk\" and \"Don't Walk\" symbol indications control such pedestrian movement, pedestrians may cross in any direction between corners of the intersection offering the shortest route within the boundaries of the intersection while the \"Walk\" indication is exhibited.\n(e)\tAny pedestrian who has lawfully entered a crosswalk governed by traffic control signals may complete crossing the roadway notwithstanding any indication subsequently displayed.\n(f)\tNo pedestrian shall enter a roadway where an operable audible or visual warning device is located unless such device is activated. However, a pedestrian possessing the right-of-way who fails to activate a warning device or who is within the crosswalk upon the expiration of such warning continues to possess the right-of-way.\nOrdinance Nos. 7824 (2012); 7996 (2014)"
  },
  {
    "corpus": "BRC",
    "title": "7",
    "title_name": "Vehicles, Pedestrians, and Parking",
    "chapter": "5",
    "chapter_name": "Pedestrian, Bicycle, Human Powered Vehicle, Lightweight Electric Vehicle and Animal Traffic",
    "anchor": "7-5-16",
    "heading": "Pedestrian at Flashing Yellow or Red Light.",
    "verbatim": "7-5-16. Pedestrian at Flashing Yellow or Red Light.\nPedestrians facing any flashing yellow or red signal indicator at an intersection, unless otherwise directed by a pedestrian signal indicator or other traffic control device, are permitted to proceed across the roadway within any marked or unmarked associated crosswalk. Pedestrians shall yield the right-of-way to vehicles lawfully within the intersection at the time that the flashing yellow or red signal indicator is first displayed.\nOrdinance No. 7996 (2014)"
  },
  {
    "corpus": "BRC",
    "title": "7",
    "title_name": "Vehicles, Pedestrians, and Parking",
    "chapter": "5",
    "chapter_name": "Pedestrian, Bicycle, Human Powered Vehicle, Lightweight Electric Vehicle and Animal Traffic",
    "anchor": "7-5-17",
    "heading": "Pedestrian Crossing at Other Than Crosswalk.",
    "verbatim": "7-5-17. Pedestrian Crossing at Other Than Crosswalk.\n(a)\tNo pedestrian shall cross a roadway other than by a route at right angles to the curb or by the shortest route to the opposite curb.\n(b)\tWhere a traffic control signal is in operation at an intersection, no pedestrian shall cross a roadway within fifty feet of the crosswalk at the intersection except in the crosswalk in conformance with Section 7-5-15, \"Pedestrian Obedience to Traffic Signal Required,\" B.R.C. 1981.\n(c)\tThe provisions of this section do not apply to pedestrians crossing in crosswalks or in accordance with Subsection 7-5-15(d), B.R.C. 1981, or pedestrians walking along and upon streets designated as shared streets.\nOrdinance Nos. 7965 (2014); 7996 (2014)"
  },
  {
    "corpus": "BRC",
    "title": "7",
    "title_name": "Vehicles, Pedestrians, and Parking",
    "chapter": "5",
    "chapter_name": "Pedestrian, Bicycle, Human Powered Vehicle, Lightweight Electric Vehicle and Animal Traffic",
    "anchor": "7-5-18",
    "heading": "Action of Pedestrian Upon Approach of Authorized Emergency Vehicle.",
    "verbatim": "7-5-18. Action of Pedestrian Upon Approach of Authorized Emergency Vehicle.\nUpon the immediate approach of an authorized emergency vehicle making use of audible or visual signals meeting the requirements of § 42-4-213 or 42-4-222, C.R.S., as amended, all pedestrians shall yield the right-of-way and shall leave the roadway and remain off the same until said vehicle has passed, except if otherwise directed by a police officer or firefighter or the driver of the authorized emergency vehicle.\nOrdinance No. 5848 (1996)"
  },
  {
    "corpus": "BRC",
    "title": "7",
    "title_name": "Vehicles, Pedestrians, and Parking",
    "chapter": "5",
    "chapter_name": "Pedestrian, Bicycle, Human Powered Vehicle, Lightweight Electric Vehicle and Animal Traffic",
    "anchor": "7-5-19",
    "heading": "Pedestrian to Use Sidewalks on Main Streets.",
    "verbatim": "7-5-19. Pedestrian to Use Sidewalks on Main Streets.\n(a)\tWhere a sidewalk or bike lane between parking spaces and a curb is provided on or adjacent to any street that is a state highway, a street with four or more lanes for moving motor vehicular traffic, or a street in a district zoned BT, BC, or BR, and its use is practicable for walking, no person shall walk along and upon an adjacent roadway.\n(b)\tWhere no such sidewalk is provided on such a street, pedestrians shall walk along a road shoulder, if present, as far as practicable from the edge of the roadway, unless a traffic control device indicates otherwise.\n(c)\tThe provisions of this section do not apply to pedestrians walking along and upon streets designated as shared streets.\nOrdinance No. 7996 (2014)"
  },
  {
    "corpus": "BRC",
    "title": "7",
    "title_name": "Vehicles, Pedestrians, and Parking",
    "chapter": "5",
    "chapter_name": "Pedestrian, Bicycle, Human Powered Vehicle, Lightweight Electric Vehicle and Animal Traffic",
    "anchor": "7-5-20",
    "heading": "Pedestrian to Walk Facing Traffic.",
    "verbatim": "7-5-20. Pedestrian to Walk Facing Traffic.\nA pedestrian walking along and upon a roadway shall walk as near as practicable to an outside edge of the roadway and, if on a two-way street, shall walk only on the left side facing approaching traffic, unless the pedestrian is walking on a bike lane between parking spaces and a curb. The provisions of this section do not apply to pedestrians walking along and upon roadways designated as shared streets.\nOrdinance No. 7996 (2014)"
  },
  {
    "corpus": "BRC",
    "title": "7",
    "title_name": "Vehicles, Pedestrians, and Parking",
    "chapter": "5",
    "chapter_name": "Pedestrian, Bicycle, Human Powered Vehicle, Lightweight Electric Vehicle and Animal Traffic",
    "anchor": "7-5-21",
    "heading": "Hitchhiking in Roadway Prohibited.",
    "verbatim": "7-5-21. Hitchhiking in Roadway Prohibited.\n(a)\tNo person while upon a roadway shall solicit a ride from the driver of any vehicle.\n(b)\tNo person shall solicit a ride from the driver of any vehicle unless there exists an area within one hundred feet from the person soliciting the ride in which the vehicle may be stopped without obstructing traffic in violation of the provisions of Section 7-4-61, \"Obstructing Traffic Prohibited,\" B.R.C. 1981.\nOrdinance No. 5241 (1989)"
  },
  {
    "corpus": "BRC",
    "title": "7",
    "title_name": "Vehicles, Pedestrians, and Parking",
    "chapter": "5",
    "chapter_name": "Pedestrian, Bicycle, Human Powered Vehicle, Lightweight Electric Vehicle and Animal Traffic",
    "anchor": "7-5-22",
    "heading": "Animal to be Ridden Facing Traffic.",
    "verbatim": "7-5-22. Animal to be Ridden Facing Traffic.\nAny person on a street riding or leading any animal not pulling a vehicle shall ride or lead same on the far left side of the street facing approaching traffic. This requirement does not apply to persons driving herds of animals along streets."
  },
  {
    "corpus": "BRC",
    "title": "7",
    "title_name": "Vehicles, Pedestrians, and Parking",
    "chapter": "5",
    "chapter_name": "Pedestrian, Bicycle, Human Powered Vehicle, Lightweight Electric Vehicle and Animal Traffic",
    "anchor": "7-5-23",
    "heading": "Bicycle Racing Prohibited.",
    "verbatim": "7-5-23. Bicycle Racing Prohibited.\nNo person shall engage with another bicyclist or person driving any other vehicle in any bicycle race, speed or acceleration contest, or exhibition of speed or acceleration on a street, a sidewalk, or a path except as authorized in Paragraph 2-2-11(b)(16), B.R.C. 1981.\nOrdinance No. 5241 (1989)"
  },
  {
    "corpus": "BRC",
    "title": "7",
    "title_name": "Vehicles, Pedestrians, and Parking",
    "chapter": "5",
    "chapter_name": "Pedestrian, Bicycle, Human Powered Vehicle, Lightweight Electric Vehicle and Animal Traffic",
    "anchor": "7-5-24",
    "heading": "Approved Bicycle Races.",
    "verbatim": "7-5-24. Approved Bicycle Races.\nBicycle racing shall not be unlawful when a racing event has been approved by the city manager. It is a specific defense to a charge of violating any provision of Chapter 7-2, \"General Provisions,\" 7-3, \"Condition of Vehicles,\" 7-4, \"Operation of Vehicles,\" or 7-5, \"Pedestrian, Bicycle, and Animal Traffic,\" B.R.C. 1981, that the driver was racing as a participant in a bicycle race authorized under Paragraph 2-2-11(b)(16), B.R.C. 1981, and was driving in accordance with such authorization. This defense does not apply to charges of violating Paragraphs 7-4-52(a)(1), 7-4-56(a)(1) and Sections 7-4-66, \"Operation of Vehicle on Approach of Authorized Emergency Vehicle,\" 7-4-67, \"Eluding,\" 7-4-68, \"Following or Parking Near Fire Truck Prohibited,\" 7-4-69, \"Crossing Fire Hose Prohibited,\" or 7-4-70, \"Obedience to Peace Officers and Firefighters Directing Traffic Required,\" B.R.C. 1981.\nOrdinance No. 5241 (1989)"
  },
  {
    "corpus": "BRC",
    "title": "7",
    "title_name": "Vehicles, Pedestrians, and Parking",
    "chapter": "5",
    "chapter_name": "Pedestrian, Bicycle, Human Powered Vehicle, Lightweight Electric Vehicle and Animal Traffic",
    "anchor": "7-5-25",
    "heading": "Repealed.",
    "verbatim": "7-5-25. Repealed.\nEditor's note(s)—Ord. No. 8575, § 3, effective July 1, 2023, repealed § 7-5-25, which pertained to no electric assisted bicycles on open space and derived from Ordinance Nos. 7941 (2013); 7965 (2014); 8007 (2014); 8447 (2021)."
  },
  {
    "corpus": "BRC",
    "title": "7",
    "title_name": "Vehicles, Pedestrians, and Parking",
    "chapter": "6",
    "chapter_name": "Parking Infractions",
    "anchor": "7-6-1",
    "heading": "Driver and Owner Liable for Violation.",
    "verbatim": "7-6-1. Driver and Owner Liable for Violation.\nNo driver shall stop or park a vehicle and no owner of a vehicle shall fail to prevent the stopping or parking of that vehicle in violation of any of the prohibitions or requirements of this chapter. Both the owner and the driver are jointly and severally liable for any such violation. It is a specific defense to the liability of the owner that the vehicle was parked or stopped by a thief at the time of the violation."
  },
  {
    "corpus": "BRC",
    "title": "7",
    "title_name": "Vehicles, Pedestrians, and Parking",
    "chapter": "6",
    "chapter_name": "Parking Infractions",
    "anchor": "7-6-2",
    "heading": "Parking Penalties.",
    "verbatim": "7-6-2. Parking Penalties.\nViolations of any of the provisions of this chapter are traffic infractions. Every person who is convicted of, who admits liability for, or against whom a judgment is entered for such a traffic infraction shall be fined or penalized according to the following schedule:\n(a)\tSection 7-6-22, \"Parking in Handicapped Space Prohibited,\" B.R.C. 1981: $112.\n(b)\tParagraph 7-6-13(a)(10) (concerning parking in a fire lane), Paragraph 7-6-13(b)(2) (concerning parking within five feet of a fire hydrant), Paragraph 7-6-13(b)(8) (concerning parking in a work zone or closed street), and Section 7-6-30, \"Parking in Space Designated for Charging an Electric Vehicle,\" B.R.C. 1981: $60.\n(c)\tParagraph 7-6-23(a)(5) (concerning parking with expired license plates), B.R.C. 1981: $50.\n(d)\tAll violations in Section 7-6-21, \"Parking in Loading Zone Prohibited,\" Subsection 7-6-27(d) (concerning parks and open space parking permits), and all violations in Section 7-6-13, \"Stopping or Parking Prohibited in Specified Places,\" B.R.C. 1981, except the paragraphs listed in Subsection (b) of this section: $25.\n(e)\tSections 7-6-14, \"Unauthorized Parking Prohibited,\" and 7-6-15, \"Overtime Parking, Signs,\" B.R.C. 1981: $30 for a first violation; $45 for a second violation within a year, based on date of violation, and $60 for a third violation within a year, based on date of first violation.\n(f)\tSections 7-6-16, \"Overtime Parking, Payment Required,\" 7-6-17, \"Time Limit, Payment Required,\" and 7-6-20, \"Parking for More Than Seventy-Two Hours Prohibited,\" B.R.C. 1981: $30 for a first violation; $45 for a second violation within a year, based on date of violation, and $60 for a third violation within a year, based on date of first violation.\n(g)\tAll other sections for which no amount is specifically provided: $30 for a first violation; $45 for a second violation within a year, based on date of violation, and $60 for a third violation within a year, based on date of first violation.\n(h)\tWhere specific penalties are otherwise provided, those penalties apply.\nOrdinance Nos. 4817 (1984); 4903 (1985); 5082 (1987); 5425 (1991); 5546 (1993); 5686 (1994); 5869 (1997); 5888 (1997); 7105 (2000); 7120 (2001); 7190 (2002); 7294 (2003); 7495 (2006); 7959 (2014); 8509 (2021); 8642 (2024)"
  },
  {
    "corpus": "BRC",
    "title": "7",
    "title_name": "Vehicles, Pedestrians, and Parking",
    "chapter": "6",
    "chapter_name": "Parking Infractions",
    "anchor": "7-6-3",
    "heading": "Late Fee.",
    "verbatim": "7-6-3. Late Fee.\nWhenever enforcement is initiated by issuance of a parking ticket, and the fine or penalty is not received by the municipal court or the owner or driver does not appear in the municipal court to set a hearing on the allegation within fourteen days of the date of issue, the fine or penalty shall be increased by a late fee of $15.\nOrdinance Nos. 5686 (1994); 5888 (1997)"
  },
  {
    "corpus": "BRC",
    "title": "7",
    "title_name": "Vehicles, Pedestrians, and Parking",
    "chapter": "6",
    "chapter_name": "Parking Infractions",
    "anchor": "7-6-4",
    "heading": "Separate Infractions.",
    "verbatim": "7-6-4. Separate Infractions.\n(a)\tFor each overtime parking infraction, a new and separate infraction occurs when a vehicle remains illegally parked for more than the maximum allowable time for parking after the issuance of the preceding parking ticket.\n(b)\tFor all other parking infractions, a new and separate infraction occurs when a vehicle remains illegally parked for more than two hours after the issuance of the preceding parking ticket."
  },
  {
    "corpus": "BRC",
    "title": "7",
    "title_name": "Vehicles, Pedestrians, and Parking",
    "chapter": "6",
    "chapter_name": "Parking Infractions",
    "anchor": "7-6-5",
    "heading": "Initiation.",
    "verbatim": "7-6-5. Initiation.\n(a)\tEnforcement of the provisions of this chapter may be initiated in any of the following ways:\n(1)\tA parking ticket may be served by leaving it under the windshield wiper or otherwise attached to the vehicle, or handing it to the driver or owner if the driver or owner is present, or mailing it by first class or certified mail to the address of the owner of the vehicle as shown in the motor vehicle ownership records of the state of registration;\n(2)\tA summons and complaint may be served on the driver of the vehicle as provided in the Colorado Municipal Court Rules of Civil Procedure;\n(3)\tA summons and complaint may be served on the owner of the vehicle as provided in the Colorado Municipal Court Rules of Civil Procedure.\n(b)\tNo more than one fine or penalty may be collected for each infraction.\nOrdinance No. 5617 (1994)"
  },
  {
    "corpus": "BRC",
    "title": "7",
    "title_name": "Vehicles, Pedestrians, and Parking",
    "chapter": "6",
    "chapter_name": "Parking Infractions",
    "anchor": "7-6-6",
    "heading": "Regulations Not Exclusive.",
    "verbatim": "7-6-6. Regulations Not Exclusive.\nNo traffic control sign imposing a time limit on parking relieves any person from the duty of observing other and more restrictive regulations prohibiting or limiting the stopping or parking of vehicles in specified places or at specified times."
  },
  {
    "corpus": "BRC",
    "title": "7",
    "title_name": "Vehicles, Pedestrians, and Parking",
    "chapter": "6",
    "chapter_name": "Parking Infractions",
    "anchor": "7-6-7",
    "heading": "Misparking Vehicle of Other Prohibited.",
    "verbatim": "7-6-7. Misparking Vehicle of Other Prohibited.\nNo person shall move any vehicle not lawfully under such person's control into any area where parking or stopping is prohibited, leave such vehicle there, or leave such vehicle otherwise improperly parked. The penalty for violation of this section is a fine of $100."
  },
  {
    "corpus": "BRC",
    "title": "7",
    "title_name": "Vehicles, Pedestrians, and Parking",
    "chapter": "6",
    "chapter_name": "Parking Infractions",
    "anchor": "7-6-8",
    "heading": "Parked on Wrong Side of Street.",
    "verbatim": "7-6-8. Parked on Wrong Side of Street.\nOn a two-way street vehicles shall be parked on the right-hand side of the street facing in the direction of travel. On a one-way street vehicles shall be parked facing in the direction of travel."
  },
  {
    "corpus": "BRC",
    "title": "7",
    "title_name": "Vehicles, Pedestrians, and Parking",
    "chapter": "6",
    "chapter_name": "Parking Infractions",
    "anchor": "7-6-9",
    "heading": "Parked too Far from Curb.",
    "verbatim": "7-6-9. Parked too Far from Curb.\nExcept where a traffic control device indicates otherwise or where angle parking is permitted, vehicles shall be parked only in the position specified below:\n(a)\tOn a two-way street, all vehicles with four or more wheels shall be parked with the right-hand wheels within twelve inches of the right-hand curb. On a one-way street, vehicles parked on the right shall be parked in compliance with the rule for two-way streets, and vehicles parked on the left shall be parked with the left-hand wheels parallel to and within twelve inches of the left-hand curb. On a cul-de-sac or other closed street with traffic control devices designating parking spaces, vehicles shall be parked with all wheels within the marked parking space.\n(b)\tVehicles with three or fewer wheels shall be parked with at least one wheel in compliance with subsection (a) of this section, and no part of the vehicle shall be more than six feet from the appropriate curb.\n(c)\tIn no case shall any vehicle be double parked.\nOrdinance Nos. 7572 (2008); 7996 (2014)"
  },
  {
    "corpus": "BRC",
    "title": "7",
    "title_name": "Vehicles, Pedestrians, and Parking",
    "chapter": "6",
    "chapter_name": "Parking Infractions",
    "anchor": "7-6-10",
    "heading": "Obedience to Angle Parking Rules.",
    "verbatim": "7-6-10. Obedience to Angle Parking Rules.\n(a)\tUpon any portion of a street where front-in angle parking adjacent to a curb is indicated by a traffic control device, no vehicle shall be parked other than at the angle to the curb so indicated and with the front of the vehicle facing the curb and within twelve inches of it.\n(b)\tUpon any portion of a street where back-in angle parking adjacent to a curb is indicated by a traffic control device, no vehicle shall be parked other than at the angle to the curb so indicated and with the rear of the vehicle facing the curb and within twelve inches of it.\n(c)\tUpon any portion of a street where front-in angle parking is indicated by a traffic control device adjacent to a bike lane, no vehicle shall be parked other than at the angle to the left-hand edge of the protected bike lane so indicated and with the front of the vehicle facing the left-hand edge and within twelve inches of it.\n(d)\tUpon any portion of a street where back-in angle parking is indicated by a traffic control device adjacent to a bike lane, no vehicle shall be parked other than at the angle to the left-hand edge of the bike lane so indicated and with the back of the vehicle facing the left-hand edge and within twelve inches of it.\n(e)\tNo vehicle shall be parked in an angle parking zone if it exceeds twenty feet in length or eight feet in width, including cargo or load.\nOrdinance Nos. 7824 (2012); 7996 (2014)"
  },
  {
    "corpus": "BRC",
    "title": "7",
    "title_name": "Vehicles, Pedestrians, and Parking",
    "chapter": "6",
    "chapter_name": "Parking Infractions",
    "anchor": "7-6-11",
    "heading": "Right Angle Parking Permit.",
    "verbatim": "7-6-11. Right Angle Parking Permit.\nNotwithstanding the provisions of this chapter, vehicles may be parked at right angles to the curb for the purpose of loading or unloading merchandise if in accordance with a permit issued by the city manager. If the city manager provides for such permits by rule or regulation and upon application therefor in such reasonable form as the manager requires, the manager shall issue such a permit if the manager finds that no reasonable alternative exists and that traffic on the street, including sidewalks, will not be unreasonably obstructed considering the frequency, duration and nature of the parking and of the traffic in the area. The manager may place such reasonable restrictions on the permit as in the manager's discretion are deemed appropriate to minimize interference with traffic.\nOrdinance No. 8642 (2024)"
  },
  {
    "corpus": "BRC",
    "title": "7",
    "title_name": "Vehicles, Pedestrians, and Parking",
    "chapter": "6",
    "chapter_name": "Parking Infractions",
    "anchor": "7-6-12",
    "heading": "Unattended Motor Vehicle.",
    "verbatim": "7-6-12. Unattended Motor Vehicle.\n(a)\tNo motor vehicle shall be stopped unattended without the engine being stopped, the ignition being locked and the key being removed from the ignition. But this subsection does not apply to commercial delivery vehicles licensed as trucks by the Colorado Department of Revenue.\n(b)\tA driver who stops and leaves a vehicle unattended shall set the brake thereon in an effective manner. If the vehicle stands on any grade, such driver shall also turn the front wheels to the curb in such a manner as to prevent the vehicle from rolling away. The penalty for violation of any provision of this subsection is a fine of not less than $10 nor more than $100."
  },
  {
    "corpus": "BRC",
    "title": "7",
    "title_name": "Vehicles, Pedestrians, and Parking",
    "chapter": "6",
    "chapter_name": "Parking Infractions",
    "anchor": "7-6-13",
    "heading": "Stopping or Parking Prohibited in Specified Places.",
    "verbatim": "7-6-13. Stopping or Parking Prohibited in Specified Places.\n(a)\tNo vehicle may be stopped or parked:\n(1)\tOn a sidewalk or within the sidewalk area. For the purposes of this section, the far edge of a sidewalk parallel and adjacent to a roadway is presumed to be the property line;\n(2)\tWithin an intersection;\n(3)\tOn a crosswalk;\n(4)\tOn a roadway in such a manner or under such conditions as to leave available fewer than ten feet of width of the roadway of an alley or seven feet from the centerline of a street with no double center line for the free movement of vehicular traffic or on a roadway that has a marked double yellow centerline, unless ten feet of clearance between the parked vehicle and the centerline exists;\n(5)\tUpon any bridge or other elevated structure upon a street or within a street tunnel or underpass;\n(6)\tOn or within five feet of any railroad tracks;\n(7)\tOn any street with two or more lanes for moving traffic in both directions or on any state highway, unless otherwise signed or marked as an area where parking is allowed;\n(8)\tIn the area between the roadways of a divided street, including crossovers;\n(9)\tOn a bike lane or path;\n(10)\tIn a clearly marked fire lane;\n(11)\tAt any place on a street where a traffic control sign prohibits stopping; or\n(12)\tWithin the sidewalk area, except that a single vehicle may be stopped or parked at a right angle to the street within the sidewalk area on a paved driveway connecting a curb cut with an area of permitted off-street parking of a detached dwelling unit if no part of such vehicle is over or in the street or sidewalk and the driver has the express or implied permission of an occupant of the dwelling served by such driveway so to park. This exception applies only to driveways which were in existence on September 1, 1988.8 For the purposes of this subsection, the far edge of a sidewalk parallel and adjacent to a roadway is the property line.\n(b)\tNo vehicle may be parked:\n(1)\tOn a roadway in or within five feet of a public or private driveway or junction;\n(2)\tWhen a fire hydrant is within ten feet of the curb, on a roadway within five feet of that point on the curb closest to the hydrant;\n(3)\tOn a roadway within twenty feet of a crosswalk or intersection;\n(4)\tOn a roadway within thirty feet of any flashing beacon or signal, stop sign, yield sign or traffic control signal located at the side of the roadway;\n(5)\tWithin fifty feet of the nearest rail of a railroad grade crossing;\n(6)\tIn a bus stop unless the vehicle is a bus used by a mass transit district, a mass transit authority, or any other public entity authorized under the laws of this state to provide mass transportation services to the general public;\n(7)\tAt any place on a street where a traffic control sign prohibits parking; or\n(8)\tIn a manner that obstructs the commencement or ongoing operation of a public construction, maintenance, or repair project, or a street closure, after twenty-four hours' advance notice of the parking prohibition (i) in any location where permitted parking time is limited by any signs, parking payment apparatus or technology, or pavement markings that apply to that location, or (ii) after seventy-two hours' advance notice of the parking prohibition at any otherwise unregulated location, and the time the parking prohibition is effective has been conspicuously posted and reasonable efforts have been made to maintain notice on the site.\n(c)\tThe provisions of this section are limited or modified by and are expressly subject to any payment apparatus or technology, or traffic control device regulating payment, stopping, or parking a vehicle.\nOrdinance Nos. 5156 (1988); 5241 (1989); 5920 (1997); 7190 (2002); 7294 (2003); 7824 (2012); 7996 (2014); 8642 (2024)"
  },
  {
    "corpus": "BRC",
    "title": "7",
    "title_name": "Vehicles, Pedestrians, and Parking",
    "chapter": "6",
    "chapter_name": "Parking Infractions",
    "anchor": "7-6-14",
    "heading": "Unauthorized Parking Prohibited.",
    "verbatim": "7-6-14. Unauthorized Parking Prohibited.\n(a)\tNo vehicle shall be parked upon any public or private property without the express or implied consent of the owner, lessee or occupant of the property or for a time period in excess of or in a manner other than that for which consent was given by such person.\n(b)\tFor the purposes of this section, there is an implied consent to park in areas set aside for parking on any private or public property except on property used as a detached dwelling unit, but such implied consent is deemed revoked with respect to any person who has parked a vehicle or has allowed a vehicle to remain parked in disregard of or contrary to the direction or intended function of any of the following:\n(1)\tA parking attendant, access control device or technology, or any other means calculated to bar or otherwise control entrance onto or use of the property by unauthorized vehicles;\n(2)\tParking payment apparatus or technology limiting access to the property;\n(3)\tSigns or pavement markings located on the property indicating a limitation or prohibition on parking thereupon or that a parking fee must be paid, if the signs or markings:\n(A)\tClearly indicate, in not less than one-inch-high lettering on a sign or twelve-inch-high lettering or symbols on the pavement, the limitation, prohibition or fee schedule and method of payment;\n(B)\tAre located in or near the area where the limitation, prohibition or fee applies; and\n(C)\tAre located so as to be seen by an ordinarily observant person; or\n(4)\tAny other method of express revocation of implied consent communicated directly to the owner or driver of the vehicle by the owner of the property or the owner's authorized agent.\n(c)\tNo complaint shall issue for a violation of this section unless signed by the owner or lessee of the entire real property or any agent authorized by the owner or lessee.\n(d)\tThis section does not apply to parking on public streets or to parking regulated by Sections 7-6-13, \"Stopping or Parking Prohibited in Specified Places,\" 7-6-15, \"Overtime Parking, Signs,\" 7-6-16, \"Overtime Parking, Payment Required,\" 7-6-17, \"Time Limit, Payment Required,\" 7-6-18, \"Parking in Space Required,\" 7-6-22, \"Parking in Handicapped Space Prohibited,\" or 7-6-25, \"Parking in City Employee Lot Prohibited,\" B.R.C. 1981, unless located in the Chautauqua leasehold area as defined in Section 4-30-2, \"Definitions,\" B.R.C. 1981.\nOrdinance Nos. 5546 (1993); 7294 (2003); 8179 (2017); 8238 (2018); 8642 (2024); 8651 (2025)"
  },
  {
    "corpus": "BRC",
    "title": "7",
    "title_name": "Vehicles, Pedestrians, and Parking",
    "chapter": "6",
    "chapter_name": "Parking Infractions",
    "anchor": "7-6-15",
    "heading": "Overtime Parking, Signs.",
    "verbatim": "7-6-15. Overtime Parking, Signs.\n(a)\tWhen a traffic control sign is in place giving notice thereof, or a parking attendant, access control device or technology, or any other means calculated to bar or otherwise control entrance onto or use of the property by unauthorized vehicles is in place with a sign giving notice thereof, no vehicle shall remain parked for longer than the time designated thereon on any day except Sundays and holidays unless Sunday and holiday restrictions are required by regulation promulgated by the city manager pursuant to Chapter 1-4, \"Rulemaking,\" B.R.C. 1981.\n(b)\tWhen a traffic control sign is in place giving notice thereof, or a parking attendant, access control device or technology, or any other means calculated to bar or otherwise control entrance onto or use of the property by unauthorized vehicles is in place with a sign giving notice thereof, within a neighborhood permit parking zone established pursuant to Sections 2-2-15, \"Neighborhood Permit Parking Zones,\" or 2-2-21 \"Chautauqua Parking Management Plan,\" B.R.C. 1981, no vehicle shall remain parked for longer than the time specified unless a valid permit for that zone has been issued pursuant to Chapter 4-23, \"Neighborhood Parking Zone Permits,\" or 4-30, \"Chautauqua Parking Zone Permits\" B.R.C. 1981, and such permit is either displayed continuously and properly on the vehicle or, for digital permits, is otherwise valid and in effect.\nOrdinance Nos. 4966 (1986); 5720 (1995); 5869 (1997); 8179 (2017); 8238 (2018); 8642 (2024)"
  },
  {
    "corpus": "BRC",
    "title": "7",
    "title_name": "Vehicles, Pedestrians, and Parking",
    "chapter": "6",
    "chapter_name": "Parking Infractions",
    "anchor": "7-6-16",
    "heading": "Overtime Parking, Payment Required.",
    "verbatim": "7-6-16. Overtime Parking, Payment Required.\nNo vehicle shall be parked in a space regulated by a parking payment apparatus or technology except during the time purchased, when the parking payment apparatus or technology indicates no time needs to be displayed, or when the vehicle is displaying a valid handicapped parking permit in accordance with subsection 2-2-11(f), B.R.C. 1981, and regulations issued thereunder. If the parking payment apparatus or technology requires that a receipt be displayed on the vehicle, no vehicle shall be parked in a space regulated by a parking payment apparatus or technology without displaying a receipt showing unexpired time on the dashboard of the vehicle, face up, in a position where it may readily be read from outside the vehicle.\nOrdinance Nos. 5233 (1989); 7294 (2003); 8642 (2024)"
  },
  {
    "corpus": "BRC",
    "title": "7",
    "title_name": "Vehicles, Pedestrians, and Parking",
    "chapter": "6",
    "chapter_name": "Parking Infractions",
    "anchor": "7-6-17",
    "heading": "Time Limit, Payment Required.",
    "verbatim": "7-6-17. Time Limit, Payment Required.\nNo vehicle shall remain parked in a space regulated by a parking payment apparatus or technology for longer than the maximum time that can be purchased at one time, except during those times indicated on the parking payment apparatus or technology when no time need be displayed or when payment is not required.\nOrdinance Nos. 7294 (2003); 8642 (2024)"
  },
  {
    "corpus": "BRC",
    "title": "7",
    "title_name": "Vehicles, Pedestrians, and Parking",
    "chapter": "6",
    "chapter_name": "Parking Infractions",
    "anchor": "7-6-18",
    "heading": "Parking in Space Required.",
    "verbatim": "7-6-18. Parking in Space Required.\nEvery vehicle parked in a paid parking zone a parking space governed by a parking payment apparatus or technology, or in a parking lot of a public authority shall be parked entirely within one individual parking space as indicated by traffic control markings.\nOrdinance Nos. 7294 (2003); 8642 (2024)"
  },
  {
    "corpus": "BRC",
    "title": "7",
    "title_name": "Vehicles, Pedestrians, and Parking",
    "chapter": "6",
    "chapter_name": "Parking Infractions",
    "anchor": "7-6-19",
    "heading": "Applicability of Certain Parking Limits.",
    "verbatim": "7-6-19. Applicability of Certain Parking Limits.\nThe provisions of Sections 7-6-15, \"Overtime Parking, Signs,\" 7-6-16, \"Overtime Parking, Payment Required,\" 7-6-17, \"Time Limit, Payment Required,\" and 7-6-18, \"Parking in Space Required,\" B.R.C. 1981, apply to parking in lots owned or operated by the City, including those of any general improvement district established pursuant to Chapter 8-4, \"General Improvement Districts,\" B.R.C. 1981, and to parking regulated by payment apparatus or technology and free but time-limited parking on streets.\nOrdinance Nos. 5039 (1987); 5686 (1994); 7294 (2003); 8642 (2024)"
  },
  {
    "corpus": "BRC",
    "title": "7",
    "title_name": "Vehicles, Pedestrians, and Parking",
    "chapter": "6",
    "chapter_name": "Parking Infractions",
    "anchor": "7-6-20",
    "heading": "Parking for More than Seventy-Two Hours Prohibited.",
    "verbatim": "7-6-20. Parking for More than Seventy-Two Hours Prohibited.\n(a)\tNo vehicle shall be parked upon any street for more than seventy-two hours without being moved or for the principal purpose of storage for more than seventy-two hours.\n(b)\tProof that the vehicle's odometer shows movement of no more than two-tenths of a mile during a period of at least seventy-two hours shall constitute prima facie evidence of violation of this section.\nOrdinance No. 5686 (1994)"
  },
  {
    "corpus": "BRC",
    "title": "7",
    "title_name": "Vehicles, Pedestrians, and Parking",
    "chapter": "6",
    "chapter_name": "Parking Infractions",
    "anchor": "7-6-21",
    "heading": "Parking in Loading Zone Prohibited.",
    "verbatim": "7-6-21. Parking in Loading Zone Prohibited.\n(a)\tNo vehicle shall be parked in a loading zone for any purpose or period of time except:\n(1)\tIn a passenger loading zone, for the visible loading or unloading of passengers for a period indicated by a traffic control sign; or\n(2)\tIn any other loading zone, for the visible unloading and delivery or pick-up and loading of property for a period not in any case to exceed thirty minutes, or such shorter time indicated by a traffic control sign, or loading or unloading of passengers for a period not in any case to exceed three minutes, or such period indicated by a traffic control sign.\n(b)\tAll alleys in a district zoned BT, BC, BR, or I are a loading zone. On all other streets, traffic control signs indicate loading zones.\nOrdinance Nos. 5686 (1994); 7996 (2014); 8654 (2024)"
  },
  {
    "corpus": "BRC",
    "title": "7",
    "title_name": "Vehicles, Pedestrians, and Parking",
    "chapter": "6",
    "chapter_name": "Parking Infractions",
    "anchor": "7-6-22",
    "heading": "Parking in Handicapped Space Prohibited.",
    "verbatim": "7-6-22. Parking in Handicapped Space Prohibited.\n(a)\tNo vehicle shall be parked in a space designated for handicapped parking by any sign or pavement marking using the term \"handicapped,\" displaying a wheelchair symbol or otherwise reasonably indicating designation for handicapped parking, unless the vehicle displays a placard or license plate issued by the Colorado Department of Revenue pursuant to § 42-4-1208, C.R.S., as amended, based upon a finding that the individual has an impairment that substantially limits such person's ability to move from place to place.\n(b)\tThis section applies to all spaces designated for handicapped parking on public property and on private property. The designation of such spaces by a private property owner or lessee has the same effect as designation by public authority and operates as a waiver of any objection to enforcement by peace officers.\nOrdinance No. 5848 (1996)"
  },
  {
    "corpus": "BRC",
    "title": "7",
    "title_name": "Vehicles, Pedestrians, and Parking",
    "chapter": "6",
    "chapter_name": "Parking Infractions",
    "anchor": "7-6-23",
    "heading": "Parking for Certain Purposes Prohibited.",
    "verbatim": "7-6-23. Parking for Certain Purposes Prohibited.\n(a)\tNo vehicle shall be parked upon any street:\n(1)\tFor the principal purpose of displaying such vehicle for sale or displaying advertising;\n(2)\tFor selling merchandise from such vehicle except in accordance with the terms of a permit issued under Section 4-18-2, \"Public Property Use Permits,\" B.R.C. 1981;\n(3)\tFor greasing or repairing such vehicle, except repairs necessitated by an emergency;\n(4)\tWhile inoperable; or\n(5)\tOn property of a public authority or private property open to the use of the public for parking:\n(A)\tWithout displaying a valid, current license plate recognized under the laws of the State of Colorado, and\n(B)\tWithout displaying the license plate or plates in the location or locations required by the laws of the state, territory or country which issued the license plate or plates displayed.\n(b)\tNo vehicle shall be parked upon any private property within any required yard abutting a street. Required yard means the minimum front yard setback for principal buildings, the minimum side yard setback from a street for all buildings and the minimum front and side yard setbacks from major roads set forth in Section 9-7-1, \"Schedule of Form and Bulk Standards,\" B.R.C. 1981.\n(1)\tAs an exception to this prohibition, within districts zoned RR-1, RR-2, RE, RL-1, RL-2, A or P, up to two vehicles may be parked on a paved or improved driveway which serves as access to off-street parking provided on the lot in accordance with Sections 9-9-6, \"Parking Standards,\" and 9-7-1, \"Schedule of Form and Bulk Standards,\" B.R.C. 1981.\n(2)\tThis subsection does not apply to recreational vehicles parked or stored in accordance with subsection 9-9-6(f), B.R.C. 1981.\nOrdinance Nos. 4817 (1984); 5039 (1987); 5546 (1993); 5660 (1994); 5930 (1997); 7294 (2003); 7762 (2010); 8696 (2025)"
  },
  {
    "corpus": "BRC",
    "title": "7",
    "title_name": "Vehicles, Pedestrians, and Parking",
    "chapter": "6",
    "chapter_name": "Parking Infractions",
    "anchor": "7-6-24",
    "heading": "All-Night Parking of Commercial Vehicle, Camper or Motor Home, or Trailer Prohibited.",
    "verbatim": "7-6-24. All-Night Parking of Commercial Vehicle, Camper or Motor Home, or Trailer Prohibited.\n(a)\tNo commercial vehicle shall be parked on any street in any district of the city zoned RR-1, RR-2, RE, RL-1, RL-2, RM-1, RM-2, RM-3, RMX-1, RMX-2, RH-1, RH-2, RH-3, RH-4, RH-5, RH-6, RH-7, MH, P, or A for more than thirty minutes between 8 p.m. and 7 a.m. The penalty for a first violation of this section is $40. The penalty for a second violation of this section by the same vehicle or the same registered owner of a vehicle is $50. The penalty for a third and any subsequent violation of this section by the same vehicle or the same registered owner of a vehicle is $60.\n(b)\tNo camper, motor home, or trailer shall be parked on any street except as follows:\n(1)\tWhen located directly on a street frontage of the detached dwelling unit or multi-unit dwelling of the vehicle's registered owner for a consecutive period of forty-eight hours or less; or\n(2)\tFor a maximum of seventy-two hours when providing a service to a residence or business located directly adjacent to the parked vehicle; or\n(3)\tIn compliance with the terms and conditions of a permit issued by the city manager; or\n(4)\tThe penalty for a first violation of this section is $40. The penalty for a second violation of this section by the same vehicle or the same registered owner of a vehicle is $50. The penalty for a third and any subsequent violation of this section by the same vehicle or the same registered owner of a vehicle is $60.\n(c)\tIt shall not be a defense to this section that the camper, motor home, or trailer has been moved to a different location on any street. To be in compliance with this section, the vehicle must be removed from the street.\nOrdinance Nos. 5187 (1989); 5930 (1997); 7522 (2007); 7572 (2008); 7996 (2014); 8402 (2020); 8651 (2025)"
  },
  {
    "corpus": "BRC",
    "title": "7",
    "title_name": "Vehicles, Pedestrians, and Parking",
    "chapter": "6",
    "chapter_name": "Parking Infractions",
    "anchor": "7-6-25",
    "heading": "Parking in City Employee Lot Prohibited.",
    "verbatim": "7-6-25. Parking in City Employee Lot Prohibited.\n(a)\tNo vehicle shall be parked in a city employee parking lot except one displaying a valid permit or, for digital permits, with a valid permit in effect that has been issued by the city manager and in accordance with the manager's administrative instructions or one owned by the city.\n(b)\tCity employee parking lot means any lot designated by sign as city employee parking.\nOrdinance Nos. 5686 (1994); 8642 (2024)"
  },
  {
    "corpus": "BRC",
    "title": "7",
    "title_name": "Vehicles, Pedestrians, and Parking",
    "chapter": "6",
    "chapter_name": "Parking Infractions",
    "anchor": "7-6-26",
    "heading": "Hooded Parking Apparatus.",
    "verbatim": "7-6-26. Hooded Parking Apparatus.\n(a)\tNo person shall place any hood, sack, or covering or any sign restricting use of any parking payment apparatus or technology over, upon, or around any parking payment apparatus or technology, remove any parking payment apparatus hood or sign or otherwise indicate or show that the parking regulations of the city are suspended, without first obtaining a permit therefor from the city manager under Section 4-18-8, \"Parking Payment Apparatus Hood and Sign Permits,\" B.R.C. 1981. The penalty for violation of any provision of this subsection is a fine of not less than $10 nor more than $100.\n(b)\tNo vehicle shall be parked in a space regulated by a hooded or signed parking payment apparatus or technology except one authorized under a permit issued under Section 4-18-8, \"Parking Payment Apparatus Hood and Sign Permits,\" B.R.C. 1981.\nOrdinance No. 8642 (2024)"
  },
  {
    "corpus": "BRC",
    "title": "7",
    "title_name": "Vehicles, Pedestrians, and Parking",
    "chapter": "6",
    "chapter_name": "Parking Infractions",
    "anchor": "7-6-27",
    "heading": "Special Regulations for Parking in Parks and Open Space.",
    "verbatim": "7-6-27. Special Regulations for Parking in Parks and Open Space.\nNo vehicle shall be parked in any park, parkway, recreation area, or open space:\n(a)\tIn a manner that blocks or impedes travel on or into a designated fire road or other emergency access;\n(b)\tContrary to posted signs;\n(c)\tBetween 11 p.m. and 5 a.m. in open space and mountain parks unless otherwise posted or 12 midnight and 5 a.m. in other parks, parkways, recreation areas; or\n(d)\tIn an area for which a parking permit or fee is required without paying the required fee in accordance with Chapter 4-24, \"Parks and Open Space Parking Permits,\" B.R.C. 1981.\nOrdinance Nos. 5546 (1993); 7443 (2006); 8179 (2017); 8238 (2018); 8503 (2021)"
  },
  {
    "corpus": "BRC",
    "title": "7",
    "title_name": "Vehicles, Pedestrians, and Parking",
    "chapter": "6",
    "chapter_name": "Parking Infractions",
    "anchor": "7-6-28",
    "heading": "Bicycle Parking.",
    "verbatim": "7-6-28. Bicycle Parking.\n(a)\tNo person shall park a bicycle or electric assisted bicycle in such a way as to:\n(1)\tCause an obstruction to or impede the flow of traffic or of pedestrians on public or private sidewalks and paths;\n(2)\tHinder or restrict access to handrails or ramps;\n(3)\tLock the bicycle to a tree, parking payment apparatus or technology, or fire hydrant;\n(4)\tPark on a roadway except in an area designated for bicycle parking or unless licensed as a Mobile Food Vehicle pursuant to Section 9-6-5(d), B.R.C. 1981; or\n(5)\tLeave the bicycle locked to a pole or post owned or leased by a public authority for more than twelve consecutive hours.\n(b)\tPersons stopping or parking bicycles or electric assisted bicycles shall obey all the provisions of this chapter regulating those activities on roadways, but are exempt from other provisions of this chapter unless specifically mentioned, notwithstanding their status as vehicles.\nOrdinance Nos. 5546 (1993); 5920 (1997); 7021 (1999); 7294 (2003); 8124 (2016); 8642 (2024)"
  },
  {
    "corpus": "BRC",
    "title": "7",
    "title_name": "Vehicles, Pedestrians, and Parking",
    "chapter": "6",
    "chapter_name": "Parking Infractions",
    "anchor": "7-6-29",
    "heading": "Parking Bicycle on the Mall.",
    "verbatim": "7-6-29. Parking Bicycle on the Mall.\nNo person shall lock, attach, lean, or support any bicycle or electric assisted bicycle on any structure, apparatus, display, plant life, or building on the mall or any building on the perimeter of the mall, except bicycle racks provided for such use.\nOrdinance Nos. 5546 (1993); 7021 (1999)"
  },
  {
    "corpus": "BRC",
    "title": "7",
    "title_name": "Vehicles, Pedestrians, and Parking",
    "chapter": "6",
    "chapter_name": "Parking Infractions",
    "anchor": "7-6-30",
    "heading": "Parking in Space Designated for Charging an Electric Vehicle.",
    "verbatim": "7-6-30. Parking in Space Designated for Charging an Electric Vehicle.\n(a)\tNo vehicle shall be parked in a space designated for charging any electric vehicle by any sign or pavement marking using the term \"electric vehicle charging,\" or otherwise reasonably indicating designation for electric vehicle charging, unless the vehicle is a plug-in electric vehicle.\n(b)\tThis section applies to all spaces designated for electric vehicle charging on public property and on private property. The designation of such spaces by a private property owner or lessee has the same effect as designation by public authority and operates as a waiver of any objection to enforcement by peace officers.\n(c)\tWhen a traffic control sign is in place giving notice thereof, no vehicle shall remain in a space designated for electric vehicles for longer than the time designated thereon.\n(d)\tAs used in this section, plug-in electric vehicle shall mean any motor vehicle that draws electricity from a battery that is capable of being charged from an external source. It shall be presumptive evidence that a vehicle is a plug-in electric vehicle if the vehicle displays a plug-in electric vehicle decal issued by the State of Colorado.\nOrdinance No. 7959 (2014)"
  },
  {
    "corpus": "BRC",
    "title": "7",
    "title_name": "Vehicles, Pedestrians, and Parking",
    "chapter": "6",
    "chapter_name": "Parking Infractions",
    "anchor": "7-6-31",
    "heading": "Horse Trailer Parking.",
    "verbatim": "7-6-31. Horse Trailer Parking.\n(a)\tNo vehicle shall be parked in a space designated for horse trailer parking by any sign or pavement marking reasonably indicating designation for horse trailer parking, except a horse trailer and a motor vehicle that is attached to the horse trailer.\n(b)\tThis section applies to all spaces designated for horse trailer parking on open space land.\n(c)\tWhen a traffic control sign is in place giving notice thereof, no vehicle shall remain in a space designated for horse trailer parking for longer than the time designated thereon.\n(d)\tAs used in this section, horse trailer shall mean any trailer designed for transporting horses, mules, llamas, burros or other equine animals that is pulled behind another vehicle, and shall include equine haulers and equine motorcoaches.\n(e)\tNo vehicle shall be parked in any parking area on open space land where the vehicle is used in the staging of a commercial use event as defined in Section 8-8-9, B.R.C. 1981, unless such parking is specifically authorized in the commercial use permit issued for the event.\nOrdinance No. 8101 (2016)"
  },
  {
    "corpus": "BRC",
    "title": "7",
    "title_name": "Vehicles, Pedestrians, and Parking",
    "chapter": "7",
    "chapter_name": "Towing and Impoundment",
    "anchor": "7-7-1",
    "heading": "Legislative Intent.",
    "verbatim": "7-7-1. Legislative Intent.\nThe purpose of this chapter is to protect the public health, safety, and welfare by prohibiting the storage of abandoned or inoperable vehicles on public property or private property and to establish procedures for removing from such property any vehicle that is abandoned or inoperable, obstructs traffic, is so defective as to pose a safety hazard, is involved in criminal conduct, or whose impoundment is otherwise authorized."
  },
  {
    "corpus": "BRC",
    "title": "7",
    "title_name": "Vehicles, Pedestrians, and Parking",
    "chapter": "7",
    "chapter_name": "Towing and Impoundment",
    "anchor": "7-7-2",
    "heading": "Authority of City to Impound Vehicle.",
    "verbatim": "7-7-2. Authority of City to Impound Vehicle.\n(a)\tA peace officer is authorized to remove or cause to be removed a vehicle from any public or private property when:\n(1)\tA vehicle is situated in a manner that obstructs the normal movement of traffic or creates a hazard to other traffic on a public street, public alley, or public parking lot and the person in possession of the vehicle is not present or is unwilling or unable to provide for its immediate removal;\n(2)\tA vehicle being driven on a street is so defective as to pose an imminent hazard to the public safety;\n(3)\tA vehicle is found unattended and situated in a manner that obstructs the commencement or ongoing operation of a public construction, maintenance, or repair project, or street closure and:\n(A)\tIn any location where permitted parking time is limited by any signs, parking payment apparatus or technology, or pavement markings that apply to that location, twenty-four hours' advance notice of the parking prohibition, the time the parking prohibition is effective has been conspicuously posted and reasonable efforts have been made to maintain notice on the site; or\n(B)\tIn any otherwise unregulated location, seventy-two hours' advance notice of the parking prohibition, the time it is effective, and that the vehicle will be towed away at the owner's expense has been conspicuously posted and reasonable efforts have been made to maintain notice on the site;\n(4)\tThe driver of a vehicle is taken into custody by the police department;\n(5)\tRemoval of a vehicle is necessary in the interest of the public health or safety because of fire, flood, snow, storm, or other emergency, and the person in possession of the vehicle is not present or is unwilling or unable to provide for its immediate removal;\n(6)\tThere is probable cause to believe that the operator's license of the driver of a vehicle is suspended, revoked, denied, or cancelled;\n(7)\tThere is probable cause to believe that a vehicle is stolen;\n(8)\tA vehicle blocks ingress to or egress from a public or private driveway, and the person in possession of the vehicle is not present or is unwilling or unable to provide for its immediate removal;\n(9)\tParking on public property:\n(A)\tA vehicle has been found upon a street, public parking lot, or other public property in a signed \"tow away zone,\" and the person in possession of the vehicle is not present or is unwilling or unable to provide for its immediate removal;\n(B)\tA vehicle has been found parked at a parking space for which payment is required on a street or a parking space for which payment is required in a public parking lot for twenty-four hours or more than the time limited by any signs, parking payment apparatus or technology, or pavement markings that apply to that location, or for seventy-two or more hours at any otherwise unregulated location without being moved, there is a warning on the parking payment apparatus or technology or a sign which indicates that such a vehicle may be towed, and the person in possession of the vehicle is not present or is unwilling or unable to provide for its immediate removal;\n(10)\tImpoundment is authorized by Sections 2-6-7, \"Parking Infraction Office and Scofflaw List,\" and 2-6-8, \"Booting,\" B.R.C. 1981, except that if, but for a ticket or tickets issued to the vehicle while it was being operated under a lease whose term was less than thirty days, impoundment or immobilization of such vehicle would not have been authorized under said sections, then no such vehicle shall be impounded or immobilized under the authority of this paragraph after the municipal court has been notified of such lease;\n(11)\tA vehicle is parked in a space designated for handicapped parking pursuant to Section 7-6-22, \"Parking in Handicapped Space Prohibited,\" B.R.C. 1981, without displaying the placard or license plate required by that section; such space is also designated as a \"tow away\" space by any sign or pavement marking on or near the space using the term \"tow away,\" displaying a tow away symbol, or otherwise reasonably indicating that vehicles illegally parked in such space or spaces will be towed away; and the person in possession of the vehicle is not present or is unwilling or unable to provide for its immediate removal;\n(12)\tThere is probable cause to believe that a vehicle is being vandalized or its parts are being stolen, and reasonable inquiries have been made on abutting properties in an effort to locate the person in possession of the vehicle; or\n(13)\tTowing is authorized by subsection 8-3-6(b), B.R.C. 1981, concerning towing of vehicles from any posted \"tow away\" no-parking zone within any park, parkway, recreation area or open space to clear off-street parking areas after designated hours of operation and to clear designated fire roads and other emergency access routes.\n(b)\tWithin seventy-two hours of the time that a motor vehicle is impounded pursuant to subsection (a) of this section, the city manager shall give notice by certified or first class mail to the registered owner of such motor vehicle:\n(1)\tThat the motor vehicle has been removed and impounded;\n(2)\tOf the reason therefor;\n(3)\tOf the location of the vehicle;\n(4)\tThat the vehicle owner has a right to contest the validity of the impoundment by requesting a prompt hearing within fifteen days from the date on which such notice is mailed;\n(5)\tThat if the vehicle is not claimed by the owner or the owner's authorized agent and any accrued removal and storage charges are not paid in full within thirty days of the date on which the notice is mailed, the vehicle will be sold. If the vehicle has been appraised pursuant to Section 2-4-7, \"Disposition of Motor Vehicles,\" B.R.C. 1981, at a reasonable market value of less than $200, the notice shall so state and shall indicate that the period for payment and reclaiming of the vehicle before sale is fifteen days;\n(6)\tIf the vehicle is not registered in Colorado, or if the license plate or vehicle identification number is expired, altered or missing, the city manager shall send the notice required in this section as soon as reasonably practicable, but without regard to the seventy-two-hour limit;\n(7)\tIf the vehicle was impounded pursuant to Sections 2-6-7, \"Parking Infraction Office and Scofflaw List,\" and 2-6-8, \"Booting,\" B.R.C. 1981, the notice shall also specify the total amount of fines, late fees, scofflaw fees and administrative impound fees which must also be paid before the vehicle may be reclaimed; and\n(8)\tIf the vehicle was reclaimed from impoundment or a hearing concerning the impoundment was set before the notice required by this section was sent, then no such notice need be given.\n(c)\tNothing in this chapter shall be deemed to restrict the authority possessed by any peace officer under other provisions of law to seize any motor vehicle or part thereof if it is or contains evidence or is an instrumentality of a crime. Such provisions include, without limitation, the authority to seize a vehicle when there is probable cause to believe that a vehicle has been involved in a hit and run accident or contains stolen parts, or when a search of a vehicle has been authorized by court order. The release of any vehicle so seized shall be governed by the provisions of law under which it was seized. When such vehicle is released pursuant to such provisions, its owner shall be notified and shall not be liable for the towing or storage charges attributable solely to such seizure, but shall be liable for such costs to the extent attributable to any charge which arose concurrently under this chapter. Any vehicle not retrieved within seventy-two hours of notice under this subsection shall be deemed abandoned, and the city manager shall dispose of such vehicle in accordance with Section 2-4-7, \"Disposition of Motor Vehicles,\" B.R.C. 1981.\n(d)\tThis section does not apply to bicycles.3\nOrdinance Nos. 4903 (1985); 4917 (1985); 5546 (1993); 5686 (1994); 5920 (1997); 7190 (2002); 7996 (2014); 8642 (2024)\n3 See Section 7-7-9, \"Abandoned Bicycle,\" B.R.C. 1981, for provisions concerning impoundment of bicycles."
  },
  {
    "corpus": "BRC",
    "title": "7",
    "title_name": "Vehicles, Pedestrians, and Parking",
    "chapter": "7",
    "chapter_name": "Towing and Impoundment",
    "anchor": "7-7-3",
    "heading": "Abandoned and Inoperable Vehicle.",
    "verbatim": "7-7-3. Abandoned and Inoperable Vehicle.\n(a)\tAny vehicle left in one location upon any public property or on any private property, without the consent of the property owner, for twenty-four hours or more than the time limited by any signs, payment apparatus or technology, or pavement markings that apply to that location, or for a continuous period of more than seventy-two hours at any otherwise unregulated location, constitutes an abandoned vehicle, which is a public nuisance. Proof that the vehicle's odometer shows movement of no more than two-tenths of a mile during a period of at least twenty-four hours after the time limited by any signs, parking payment apparatus or technology, or pavement markings that apply to that location, or at least seventy-two hours at any otherwise unregulated location, shall constitute prima facie evidence that the vehicle was left in one location.\n(b)\tAny inoperable vehicle or any parts thereof left on any public property or on any private property other than the person's property, without the consent of the property owner, constitutes an inoperable vehicle, which is a public nuisance.\n(c)\tIf a peace officer has probable cause to believe that a vehicle left unattended on public or private property is an abandoned or inoperable motor vehicle, the officer shall leave under the windshield wiper or otherwise attach to the vehicle a conspicuous warning notice that:\n(1)\tStates the date and the time that the notice was attached to the motor vehicle;\n(2)\tOrders removal of an inoperable vehicle, as prescribed by subsection (b) of this section, or the moving of an abandoned vehicle, as prescribed by subsection (a) of this section, from the location within seven days of the notice;\n(3)\tWarns that, if the vehicle is still parked in violation of subsection (a) or (b) of this section after seven days from the date of the notice, it may be impounded by order of the police department and that the vehicle owner will be liable for the expenses of such impoundment; and\n(4)\tAdvises the person in possession of the vehicle that such person has a right to a prompt hearing to determine whether or not the vehicle has been parked in violation of subsection (a) or (b) of this section, if such person requests such hearing within seven days from the date and time that such notice is attached to the vehicle.\n(d)\tWithin forty-eight hours of the time that a notice is attached to a vehicle under subsection (c) of this section, the city manager shall give written notice by certified or first class mail to the registered owner of the vehicle containing all of the information described in subsection (c) of this section. The notice shall also advise the owner that if the vehicle is towed and is not claimed by the owner or the owner's authorized agent and the amount of any accrued removal and storage charges and the impoundment fee are not paid within thirty days from the date and time that the vehicle is impounded, the vehicle will be sold. If the vehicle has been appraised pursuant to Section 2-4-7, \"Disposition of Motor Vehicles,\" B.R.C. 1981, at a reasonable market value of less than $200, the notice shall so state and shall indicate that the period for payment and reclaiming of the vehicle before sale is fifteen days.\n(e)\tIf the vehicle is not registered in Colorado, or if the license plate or vehicle identification number is expired, altered or missing, the city manager shall send the notice required in this section as soon as is reasonably practicable, but without regard to the forty-eight-hour limit.\n(f)\tIf an abandoned or inoperable vehicle or any parts thereof is still parked in violation of subsection (a) or (b) of this section after seven days from the date and time that the notice prescribed by subsection (d) of this section is attached to the vehicle, a peace officer may cause the vehicle and parts thereof to be removed and impounded by a towing carrier, unless a hearing requested pursuant to Section 7-7-7, \"Hearing,\" B.R.C. 1981, is pending or unless a hearing officer has determined that the vehicle is not parked in violation of this section.\n(g)\tA vehicle or parts impounded pursuant to this section shall be released to its owner when payment to the city of an administrative impoundment fee of the amount specified in Section 4-20-55, \"Court and Vehicle Impoundment Costs, Fees and Civil Penalties,\" B.R.C. 1981, and payment to the towing carrier of the costs of towing and storage, unless ordered released as a result of a hearing held pursuant to subsection 7-7-7(f), B.R.C. 1981.\n(h)\tThis section does not apply to bicycles.8\nOrdinance Nos. 4917 (1985); 5686 (1994); 5760 (1995); 5920 (1997); 7996 (2014); 8642 (2024)\n8 See Section 7-7-9, \"Abandoned Bicycle,\" B.R.C. 1981, for provisions concerning impoundment of bicycles."
  },
  {
    "corpus": "BRC",
    "title": "7",
    "title_name": "Vehicles, Pedestrians, and Parking",
    "chapter": "7",
    "chapter_name": "Towing and Impoundment",
    "anchor": "7-7-4",
    "heading": "Inoperable Vehicle on Private Property.",
    "verbatim": "7-7-4. Inoperable Vehicle on Private Property.\n(a)\tAny inoperable motor vehicle parked, stored or left or permitted to be parked, stored or left upon any private property within the city for a period longer than thirty days constitutes a public nuisance. But nothing in this section applies to an antique vehicle, a vehicle in an enclosed building, a vehicle on the premises of a business enterprise that services and repairs such vehicles, a vehicle in an appropriate storage place or depository maintained for impounded vehicles, or a vehicle deemed inoperable solely because it lacks a current license plate or validation sticker.\n(b)\tWhenever the city manager has probable cause to believe that an inoperable vehicle is on private property in violation of subsection (a) of this section, the manager shall give written notice by certified mail to the owner and the lessee or occupant of the property, if known, declaring the existence of the nuisance, ordering such persons to remove the vehicle or request a hearing within seven days from the date the notice is mailed, and stating that failure to remove the vehicle or request a hearing within such seven-day period will result in the vehicle being removed and impounded and expenses being assessed jointly and severally against the owner and the lessee or occupant of the property.\n(c)\tIf an inoperable vehicle has not been removed from private property within seven days of the date on which the notice prescribed by subsection (b) of this section is mailed to the owner and the lessee or occupant of the property, a peace officer may, after obtaining an administrative search warrant from the municipal court, cause the vehicle to be removed and impounded by a towing carrier, unless a hearing requested pursuant to Section 7-7-7, \"Hearing,\" B.R.C. 1981, is pending or unless a hearing officer has determined that the vehicle was not parked, stored or left on private property in violation of subsection (a) of this section.\n(d)\tIf the city manager is able to determine from license plate or vehicle identification number information the name and address of the registered owner of the vehicle, and the notice prescribed in subsection (b) of this section was not sent to the owner of the vehicle, then the manager shall give written notice by certified or first class mail to the registered owner of the vehicle advising the owner that if the vehicle is towed and is not claimed by the owner or the owner's authorized agent and the amount of any accrued removal and storage charges and the administrative impoundment fee are not paid within thirty days from the date and time that the vehicle is impounded, the vehicle will be sold. If the vehicle has been appraised pursuant to Section 2-4-7, \"Disposition of Motor Vehicles,\" B.R.C. 1981, at a reasonable market value of less than $200, the notice shall so state and shall indicate that the period for payment and reclaiming of the vehicle before sale is fifteen days.\n(e)\tA vehicle impounded pursuant to this section shall be released to its owner when payment to the city of an administrative impoundment fee of the amount specified in Section 4-20-55, \"Court and Vehicle Impoundment Costs, Fees and Civil Penalties,\" B.R.C. 1981, and payment to the towing carrier of the costs of towing and storage, unless ordered released as a result of a hearing held pursuant to subsection 7-7-7(f), B.R.C. 1981.\nOrdinance Nos. 4917 (1985); 5686 (1994); 5760 (1995)"
  },
  {
    "corpus": "BRC",
    "title": "7",
    "title_name": "Vehicles, Pedestrians, and Parking",
    "chapter": "7",
    "chapter_name": "Towing and Impoundment",
    "anchor": "7-7-5",
    "heading": "Private Towing and Impounding of Vehicle Parked Without Authorization on Private Property.",
    "verbatim": "7-7-5. Private Towing and Impounding of Vehicle Parked Without Authorization on Private Property.\n(a)\tThe owner or lessee of real property or an agent authorized by the owner or lessee may cause any motor vehicle, parked on such property without the permission of the owner, lessee or occupant of the property, to be removed or impounded by a towing carrier, but, except on property used as a detached dwelling unit, only if any applicable requirements of Subsection 7-6-14(b), B.R.C. 1981, and subsection (b) of this section have been met. It is not necessary that a citation be issued for violation of Section 7-6-14, \"Unauthorized Parking Prohibited,\" B.R.C. 1981, for a vehicle to be removed or impounded pursuant to this section.\n(b)\tExcept on property used as a detached dwelling unit, the owner, lessee or occupant of real property or an agent thereof, prior to causing the removal and impoundment of a motor vehicle from any area set aside for motor vehicle parking on such person's property, shall:\n(1)\tProvide clear notice on signs or pavement markings meeting the requirements of Paragraph 7-6-14(b)(3), B.R.C. 1981, that unauthorized vehicles will be towed away at the owner's expense, including the name and telephone number of each towing company authorized to remove any vehicle;\n(A)\tProvided however, after April 1, 2019, all such signs shall include a symbol depicting a tow truck towing a car as set forth in regulations adopted by the city manager; and\n(B)\tThe requirements of subsection (A) above shall not apply to commercial non-residential properties except for external remodel, change of ownership and new construction; and\n(C)\tThe requirements of subsection (A) shall not apply to residential properties unless there are more than five tows in any twelve-month period or there is an external remodel, change of ownership or new construction.\n(2)\tNot receive any payment monetary or otherwise from any towing company.\n(c)\tA vehicle parked on private property in violation of Section 7-6-14, \"Unauthorized Parking Prohibited,\" B.R.C. 1981, is subject to immediate towing under state law as an abandoned vehicle on private property if the provisions of subsection (b) of this section are also met. Furthermore, any motor vehicle left unattended on private property for a period of twenty-four hours or longer without the consent of the owner or lessee of such property or the owner's or lessee's legally authorized agent is also subject to immediate towing under state law as an abandoned vehicle on private property.\n(d)\tVehicles towed pursuant to this section are privately impounded. All actions by the towing carrier and others shall be in accordance with and pursuant to the state statutes and regulations governing private tows of abandoned vehicles and pursuant to Section 7-7-11, \"Towing Regulations,\" B.R.C. 1981.\n(e)\tDisputes concerning the propriety of impoundments under this section shall be settled by the parties involved in the civil courts, and the city shall not be a proper party defendant in any such suit.\nOrdinance Nos. 4917 (1985); 5039 (1987); 5686 (1994); 8295 (2019); 8651 (2025)"
  },
  {
    "corpus": "BRC",
    "title": "7",
    "title_name": "Vehicles, Pedestrians, and Parking",
    "chapter": "7",
    "chapter_name": "Towing and Impoundment",
    "anchor": "7-7-6",
    "heading": "Lien of Towing Carrier.",
    "verbatim": "7-7-6. Lien of Towing Carrier.\nA towing carrier that has removed or impounded a vehicle pursuant to this chapter has a possessory lien upon such vehicle for all costs of towing and storage unless a hearing officer orders the vehicle released pursuant to Section 7-7-7, \"Hearing,\" B.R.C. 1981.\nOrdinance No. 5039 (1987)"
  },
  {
    "corpus": "BRC",
    "title": "7",
    "title_name": "Vehicles, Pedestrians, and Parking",
    "chapter": "7",
    "chapter_name": "Towing and Impoundment",
    "anchor": "7-7-7",
    "heading": "Hearing.",
    "verbatim": "7-7-7. Hearing.\n(a)\tThe owner of a vehicle impounded by or at the request of the city pursuant to this chapter or a person in possession of a vehicle at the time it was so impounded is entitled to a hearing regarding the impoundment, if such person requests a hearing within fifteen days from the date the notice of impoundment was mailed or within fifteen days of reclaiming the vehicle from impoundment if no notice was mailed and if such person had no hearing prior to the time of the impoundment. The hearing shall be conducted before a judge or a hearing officer appointed by the presiding judge of the municipal court within five city business days of the time of request for the hearing, unless the person requesting the hearing waives the five-day requirement. If a person requests a hearing and secures the release of the vehicle pursuant to subsection (b) of this section, and a summons and complaint or parking ticket has been issued which alleges a violation of this title which formed the basis of the impoundment, the hearing officer may schedule the hearing provided by this section to coincide with the trial of the infraction or may continue the hearing to such time. Within forty-eight hours of a request for a hearing under this section, the hearing officer shall obtain from the responsible city department the records concerning the impound, and shall determine from these records, and from any supplementary affidavits as the responsible department may provide, whether or not probable cause existed for the impoundment of the vehicle. If the hearing officer determines that no probable cause existed for the impoundment based on these written materials, the officer shall so find and shall issue a final order that the vehicle shall be released immediately to the person entitled to possession and shall assess the costs of removal and impoundment against the city. Copies of such order shall be provided to the responsible city department and mailed to the person requesting the hearing. If the hearing officer determines that probable cause existed, the hearing officer shall so notify the responsible city department and the person requesting the hearing at the hearing, but such a finding shall not change the burden of proof at such hearing.\n(b)\tA person who requests a post-impoundment hearing may obtain the release of the vehicle prior to the hearing by posting a bond in the amount of the towing and storage charges due as of the date of the request plus $25 in administrative costs. If such person fails to appear at the date and time of the scheduled hearing, the hearing request shall be dismissed with prejudice, and the bond amount shall be forfeited to the city.\n(c)\tExcept as otherwise provided in this section, the judge or hearing officer shall conduct the hearing under the procedures prescribed by Chapter 1-3, \"Quasi-Judicial Hearings,\" B.R.C. 1981. The party requesting the hearing bears the burden of establishing that such person has the right to possession of the vehicle. The city bears the burden of establishing the validity of the proposed or completed impoundment. The standard of proof is a preponderance of the evidence.\n(d)\tFailure of any person to request an impoundment hearing within the time provided or attend any such hearing constitutes a waiver of the right to such hearing and a determination of all issues then existing as supporting the impoundment or immobilization.\n(e)\tAt a hearing prior to the impoundment of a vehicle allegedly parked in violation of Section 7-7-3, \"Abandoned and Inoperable Vehicle,\" or 7-7-4, \"Inoperable Vehicle On Private Property,\" B.R.C. 1981, the hearing officer shall determine whether the vehicle is parked in violation of such section. If the hearing officer so finds, the officer shall order the vehicle removed and impounded and assess the costs thereof against the vehicle.\n(f)\tAt a hearing following the impoundment of a vehicle pursuant to Section 7-7-2, \"Authority of City to Impound Vehicle,\" 7-7-3, \"Abandoned and Inoperable Vehicle,\" or 7-7-4, \"Inoperable Vehicle on Private Property,\" B.R.C. 1981, or immobilization of a vehicle pursuant to Section 2-6-8, \"Booting,\" B.R.C. 1981, the hearing officer shall determine whether the vehicle was subject to impoundment under Section 2-6-8, \"Booting,\" or 7-7-2, \"Authority of City to Impound Vehicle,\" B.R.C. 1981, or was parked in violation of Section 7-7-3, \"Abandoned and Inoperable Vehicle,\" or 7-7-4, \"Inoperable Vehicle on Private Property,\" B.R.C. 1981. If the hearing officer so finds, the officer shall assess the costs of removal and impoundment, including, without limitation, any administrative impound fee, against the vehicle. If the hearing officer does not so find, the officer shall order the vehicle released immediately to the person entitled to possession and shall assess the costs of removal and impoundment against the city.\n(g)\tThis section does not apply to bicycles.9\nOrdinance Nos. 4879 (1985); 4917 (1985); 5686 (1994); 5920 (1997)\n9 See Section 7-7-9, \"Abandoned Bicycle,\" B.R.C. 1981, for provisions concerning impoundment of bicycles."
  },
  {
    "corpus": "BRC",
    "title": "7",
    "title_name": "Vehicles, Pedestrians, and Parking",
    "chapter": "7",
    "chapter_name": "Towing and Impoundment",
    "anchor": "7-7-8",
    "heading": "Failure to Claim Vehicle.",
    "verbatim": "7-7-8. Failure to Claim Vehicle.\nIf a vehicle, other than a bicycle, that has been impounded by the city pursuant to this chapter is still under impoundment seventy-two hours from the time at which notice prescribed by this chapter has been mailed to the registered owner and the owner has not requested a hearing pursuant to Section 7-7-7, \"Hearing,\" B.R.C. 1981, or obtained the release of the vehicle by paying accumulated removal and impoundment charges, the vehicle shall be deemed abandoned, and the city manager shall dispose of such vehicle in accordance with Section 2-4-7, \"Disposition of Motor Vehicles,\" B.R.C. 1981. But disposal shall be stayed if a timely request is made for a hearing as provided by this chapter.\nOrdinance Nos. 4917 (1985); 5686 (1994)"
  },
  {
    "corpus": "BRC",
    "title": "7",
    "title_name": "Vehicles, Pedestrians, and Parking",
    "chapter": "7",
    "chapter_name": "Towing and Impoundment",
    "anchor": "7-7-9",
    "heading": "Abandoned Bicycle.",
    "verbatim": "7-7-9. Abandoned Bicycle.\nEvery bicycle left at any place for such times and under such circumstances as to cause the bicycle reasonably to appear to be abandoned or parked in such manner as to cause an immediate safety hazard or an obstruction to entry or exit to a building or an area constitutes a public nuisance. If the person in possession of the bicycle is not present or is unwilling or unable to provide for its immediate removal, any peace officer may remove and impound the bicycle. The city manager shall dispose of bicycles impounded under this section in accordance with Section 2-4-6, \"Disposition of Property Other Than Motor Vehicles,\" B.R.C. 1981."
  },
  {
    "corpus": "BRC",
    "title": "7",
    "title_name": "Vehicles, Pedestrians, and Parking",
    "chapter": "7",
    "chapter_name": "Towing and Impoundment",
    "anchor": "7-7-10",
    "heading": "Authority to Move Vehicle.",
    "verbatim": "7-7-10. Authority to Move Vehicle.\nWhenever any peace officer finds a vehicle stopped upon a street or alley in violation of any of the provisions of Chapter 7-6, \"Parking Infractions,\" B.R.C. 1981, or finds a vehicle obstructing a construction, maintenance or repair project or a street closure on a public street, such officer is authorized, without limitation, to move or require the driver or person in charge to move the vehicle, if practicable, to a nearby position where it can be readily found by its driver and where it does not violate any provision of Chapter 7-6, \"Parking Infractions,\" B.R.C. 1981, and does not interfere with a project or closure."
  },
  {
    "corpus": "BRC",
    "title": "7",
    "title_name": "Vehicles, Pedestrians, and Parking",
    "chapter": "7",
    "chapter_name": "Towing and Impoundment",
    "anchor": "7-7-11",
    "heading": "Towing Regulations.",
    "verbatim": "7-7-11. Towing Regulations.\n(a)\tThe provisions herein are intended to compliment and not supersede the provision of state law and regulations governing towing. If there is a conflict between state law and the provisions in this section, state law will control.\n(b)\tIf the owner, authorized operator, or authorized agent of the owner of a motor vehicle that is parked without the authorization of the property owner appears in person to retrieve the motor vehicle after a tow truck is present and either backed up in alignment with such motor vehicle or tow equipment has come into contact with such motor vehicle, but before its removal from the property the operator shall release the vehicle without charge.\n(c)\tA towing carrier shall not tow any motor vehicle, unless one of the following conditions is met:\n(1)\tThe towing carrier is directed to perform a tow by a law enforcement officer;\n(2)\tThe towing carrier is requested to perform a tow by the owner, authorized operator, or authorized agent of the owner of a motor vehicle; or\n(3)\tThe towing carrier is requested to perform a tow upon the property owner's authorization, in form sufficient under state law.\n(d)\tA towing company shall not require cash payment for release of a vehicle.\n(e)\tIf a storage facility is not open during normal business hours or a representative does not respond within one hour to a request outside of normal business hours, then no towing or storage fee may be charged.\n(f)\tThe gate fee, or maximum hourly charge for releasing a vehicle after normal business hours, shall not exceed the amount permitted by state law or one-half of the state-permitted tow rate, whichever is less.\n(g)\tIf a vehicle is towed for storage more than twelve miles from where the vehicle was parked the towing company shall apply a credit to any invoice in an amount equal to the Internal Revenue Service Mileage Rate multiplied by the miles between the place where the vehicle was parked and the place of storage.\n(h)\tNo towing company shall operate in the city without a valid motor carrier permit.\n(i)\tWhen towing a vehicle, the operator shall record the reason for the tow, the location, the time that the vehicle was identified as being parked illegally, the time of the tow, and the make and model of the vehicle.\n(j)\tWhen towing a vehicle, the operator shall photograph the vehicle in a manner that accurately represents the vehicle's condition prior to towing.\n(k)\tAn operator shall provide notice via certified mail to the registered owner of any towed vehicle within the later of seventy-two hours of the initiation of the tow or the next business day after the initiation of the tow.\n(l)\tAn operator shall provide notice to the Boulder Police Department within thirty minutes of any vehicle towed without the owner's consent. Such notice shall include the date, time and place of the tow as well as the make, model and license plate of the vehicle.\n(m)\tWhether on the private property where the tow originates or at the towing carrier's storage lot, a towing company shall not refuse to relinquish personal property. The towing company shall immediately relinquish such items upon demand, without requiring payment and without additional charge.\nOrdinance No. 8295 (2019)"
  }
]