[
  {
    "corpus": "BRC",
    "title": "5",
    "title_name": "General Offenses",
    "chapter": "1",
    "chapter_name": "Definitions",
    "anchor": "5-1-1",
    "heading": "Definitions.",
    "verbatim": "5-1-1. Definitions.\nThe following terms used in this title have the following meanings unless the context clearly indicates otherwise:\nAct means a bodily movement and includes words and possession of property.\nAffirmative defense means a defense in which the defendant, to raise the issue, presents some credible evidence on that issue, unless the City's evidence raises the issue involving the alleged defense. If the issue involved in an affirmative defense is raised, then the guilt of the defendant must be established beyond a reasonable doubt as to that issue as well as all other elements of the violation.\nAge shall mean the chronological age of a person.\nAntipersonnel device means any assemblage of material that is designed to, or does, kill, injure or trap people when activated.\nApproach means to move closer with any part of the body or any extension thereof.\nBias motivated crime shall mean the commission of any of the underlying offenses specified below if the offense is committed by reason of the actual or perceived race, color, religion, religious expression, national origin, age, disability, sex, sexual orientation, gender, gender identity or gender expression of another individual or group of individuals, regardless of the existence of any other motivating factor or factors. The underlying offenses are Sections 5-3-1, \"Assault in the Third Degree,\" 5-3-2, \"Brawling,\" 5-3-3, \"Physical Harassment,\" 5-3-4, \"Threatening Bodily Injury,\" 5-3-6, \"Use of Fighting Words,\" 5-3-9, \"Brandishing a Weapon,\" 5-4-1, \"Damaging Property of Another,\" 5-4-14, \"Graffiti Prohibited,\" 5-4-15, \"Posting Signs on Property of Another Prohibited,\" 5-8-6, \"Aiming Weapon at Another,\" or 5-8-7, \"Flourishing Deadly Weapon in Alarming Manner,\" B.R.C. 1981. No \"bias motivated crime\" finding shall occur unless the allegation of bias motivation has been specifically charged and sustained by an in-court admission of a defendant, or by a specific finding established beyond a reasonable doubt by a judge or jury in a contested trial.\nBlackjack means any billy club, sand club, sandbag or other hand-operated striking weapon consisting, at the striking end, of an encased piece of lead or other heavy substance and, at the opposite end, a strap or springy shaft that increases the force of impact.\nBodily injury means physical pain, illness or any impairment of physical or mental condition.\nCode enforcement officer means any city employee or person employed under independent contract by the City who is appointed by the city manager to enforce the laws of the City. \"Code enforcement officer\" also means an authorized volunteer appointed by the city manager to enforce the laws concerning parking of vehicles in spaces reserved for the handicapped by issuing parking tickets.\nConduct means an act or omission and its accompanying state of mind, if any, or, where relevant, a series of acts or omissions.\nCulpable mental state means intentionally, or with intent, or knowingly, or willfully, or recklessly, or negligently as set forth below:\n(a)\tIntentionally or with intent means that one's conscious objective is to cause the specific result proscribed by the provision of this code or the ordinance defining the violation. All violations defined in this code in which the mental culpability requirement is expressed as intentionally or with intent are specific intent offenses. It is immaterial to the issue of specific intent whether or not the result actually occurred.\n(b)\tKnowingly or willfully means, with respect to conduct or to a circumstance described by a section of this code or an ordinance defining a violation, that a person is aware that such person's conduct is of that nature or that the circumstance exists. With respect to a result this means that a person is aware that such person's conduct is practically certain to cause the result. All violations defined in this code in which the mental culpability requirement is expressed as knowingly or willfully are general intent offenses.\n(c)\tRecklessly means consciously to disregard a substantial and unjustifiable risk that a result will occur or that a circumstance exists.\n(d)\tNegligently means to act with negligence with respect to a result or to a circumstance described by a section of this code by failing to exercise the degree of care that would be exercised by the ordinarily reasonable and prudent inhabitant of the City under the same or similar circumstances.\nDeadly physical force means force, the intended, natural and probable consequence of which is to produce death, and which does, in fact, produce death.\nDeadly weapon means any of the following that in the manner it is used or intended to be used is capable of producing death or serious bodily injury:\n(a)\tA firearm, whether loaded or unloaded;\n(b)\tA knife;\n(c)\tA bludgeon; or\n(d)\tAny other weapon, device, instrument, material or substance, whether animate or inanimate.\nDisability shall mean a physical or mental impairment that substantially limits one or more major life activities, a record of such impairment or being regarded as having such impairment. The term excludes current use of alcohol or drugs.\nDwelling means a building that is used, intended to be used or usually used by a person for habitation, but excludes lobbies, boiler rooms, hallways and other common areas of hotels, motels, apartments, condominiums, nursing homes and similar communal residential buildings.\nFirearm means any handgun, automatic revolver, pistol, rifle, shotgun, or other instrument or device capable or intended to be capable of discharging bullets, cartridges, or other explosive charges. This definition does not include an antique firearm as defined in 18 U.S.C. § 921(a)(16).\nGas gun means a device designed for projecting gas-filled projectiles that release their contents after having been projected from the device and includes projectiles designed for use in such a device.\nGas or mechanically operated gun means an air or gas operated gun that discharges pellets, BB shots, arrows or darts, including, without limitation, BB guns, spring guns and other similarly operated guns or weapons.\nGender shall have the same meaning as the term \"sex\" defined in Section 12-1-1, \"Definitions,\" B.R.C. 1981.\nGender identity and gender expression shall have the meanings defined in Section 12-1-1, \"Definitions,\" B.R.C. 1981.\nGravity knife means any knife with a blade that may be released from the handle or sheath thereof by the force of gravity or the application of centrifugal force, which when released is locked in place by means of a button, spring, lever or other device.\nHealth care facility means a state-licensed general hospital, psychiatric hospital or community clinic, as defined in Colorado state statutes, as they may be amended from time to time, or a building containing an office or other place where a state-licensed physician practices medicine, on a full- or part-time basis, which is not required to be licensed under Colorado state statutes, but which is identified by a sign, visible from the adjacent public way.\nKnife means any dagger, dirk, knife or stiletto with a blade over three and one-half inches in length, or any other dangerous instrument capable of inflicting cutting, stabbing or tearing wounds, but does not include a hunting or fishing knife carried for sports use.\nMall means the Downtown Boulder Mall as defined in Ordinance No. 4267, as amended by Ordinance No. 4543.\nOmission means a failure to perform an act as to which a duty of performance is imposed by law.\nPeace officer means any police officer or city code enforcement officer.\nPolice officer means:\n(a)\tAny city police officer commissioned by the city manager;\n(b)\tAny person appointed by the city manager pursuant to Charter Section 72;\n(c)\tAny peace officer of another jurisdiction who is also commissioned by the city manager to enforce the laws of the City;\n(d)\tAny city park patrol officer commissioned by the city manager;\n(e)\tAny city fire chief or fire marshal or firefighter commissioned by the city manager; and\n(f)\tAny other city employee designated by the city manager to exercise police powers, including the power of arrest, and commissioned by the city manager.\nReligious expression shall have the meaning defined in Section 12-1-1, \"Definitions,\" B.R.C. 1981.\nSerious bodily injury means bodily injury that involves a substantial risk of death, serious permanent disfigurement or protracted loss or impairment of the function of any part of an organ of the body.\nSpecific defense means a defense in which the defendant, to raise the issue, presents some credible evidence on that issue, unless the City's evidence raises the issue involving the defense. If the issue involved in the specific defense is raised, it may be submitted to the trier of fact along with other issues, but the defendant bears the burden of proving the issue by a preponderance of the evidence, although the City must prove all other issues by proof beyond a reasonable doubt in any criminal action.\nSwitchblade knife means any knife, the blade of which opens automatically by hand pressure applied to a button, spring or other device in its handle.\nOrdinance Nos. 4969 (1986); 5037 (1987); 5462 (1992); 5805 (1996); 7496 (2007); 7723 (2010); 8245 (2018); 8335 (2019); 8494 (2022)"
  },
  {
    "corpus": "BRC",
    "title": "5",
    "title_name": "General Offenses",
    "chapter": "2",
    "chapter_name": "General Provisions",
    "anchor": "5-2-1",
    "heading": "Legislative Intent.",
    "verbatim": "5-2-1. Legislative Intent.\nThe provisions of this chapter apply to all prosecutions in municipal court for violation of this code, any ordinance of the City or rule promulgated pursuant thereto."
  },
  {
    "corpus": "BRC",
    "title": "5",
    "title_name": "General Offenses",
    "chapter": "2",
    "chapter_name": "General Provisions",
    "anchor": "5-2-2",
    "heading": "Application of Code.",
    "verbatim": "5-2-2. Application of Code.\n(a)\tA person is subject to prosecution in the municipal court for a violation committed through the conduct of such person or through the conduct of another for whom such person is legally accountable, if:\n(1)\tThe conduct constitutes a violation and is committed either wholly or partly within the City or within any city park, parkway, recreation area or open space;\n(2)\tThe conduct outside the City constitutes an attempt, as defined by this code, to commit a violation within the City;\n(3)\tThe conduct outside the City constitutes a conspiracy to commit a violation within the City, and an act in furtherance of the conspiracy occurs in the City; or\n(4)\tThe conduct within the City constitutes an attempt, solicitation or conspiracy to commit in another jurisdiction a violation prohibited under the laws of this City and such other jurisdiction.\n(b)\tA violation is committed partly within this City if conduct occurs in this City that is an element of a violation or if the result of conduct in this City is such an element.\n(c)\tWhether a violator is in or outside the City is immaterial to the commission of a violation based on an omission to perform a duty imposed by the law of this City.\n(d)\tCity as used in this section and in any summons, summons and complaint or complaint alleging a violation of the code or any ordinance, includes both the area within the territorial limits of the City of Boulder, Colorado, and also those areas over which extraterritorial police power has been granted by the statutes of this state. It is the intent of the city council to extend the territorial jurisdiction of the municipal court as widely as possible. However, where specific sections of this code require that the violation occur \"within the City\" then the offense is limited to the territorial limits of the City.\n(e)\tOrdinance as used in this chapter includes the City of Boulder Design and Construction Standards.\nOrdinance No. 8323 (2019)"
  },
  {
    "corpus": "BRC",
    "title": "5",
    "title_name": "General Offenses",
    "chapter": "2",
    "chapter_name": "General Provisions",
    "anchor": "5-2-3",
    "heading": "Common Law Crimes Abolished.",
    "verbatim": "5-2-3. Common Law Crimes Abolished.\nCommon law crimes are abolished, and no conduct shall constitute a violation unless it is prohibited by this code, an ordinance of the City, the charter or a rule or regulation promulgated thereunder. But this provision does not affect the power of the municipal court to punish for contempt or to employ any sanction authorized by law for the enforcement of an order lawfully entered, or a civil judgment or decree; nor does it affect the use of case law as an interpretive aid in the construction of the provisions of this code.\nOrdinance No. 4969 (1986)"
  },
  {
    "corpus": "BRC",
    "title": "5",
    "title_name": "General Offenses",
    "chapter": "2",
    "chapter_name": "General Provisions",
    "anchor": "5-2-4",
    "heading": "General Penalties.",
    "verbatim": "5-2-4. General Penalties.\n(a)\tThe penalty for violation of any provision of this code or any ordinance is a fine of not more than $2,650 per violation, or incarceration for not more than ninety days in jail or by both such fine and incarceration, except as follows:\n(1)\tWhere any different provision is made elsewhere in this code or any ordinance;\n(2)\tWhere the defendant's criminal culpability is vicarious, jail may not be imposed as a penalty;\n(3)\tWhere a non-traffic violation is involved, in order to impose a jail sentence, the court must be satisfied from the evidence and other material available to it for sentencing that the defendant acted intentionally, knowingly or recklessly with respect to the material elements of the violation. Where traffic offenses are concerned, ordinary negligence is sufficient to permit the imposition of jail;\n(4)\tWhere a defendant is a child under the age of ten years, in which case the child may not be held accountable in municipal court for any violation; or\n(5)\tWhere the defendant is a child of ten years through and including seventeen years of age, the child may not be sentenced to jail except upon conviction of a moving traffic violation for which penalty points are assessed against the driving privilege under the laws of this state.\n(b)\tNothing in Subsection (a) of this section is intended to:\n(1)\tRemove or limit the discretion or authority of any public official to charge a child in a court other than the municipal court; or\n(2)\tLimit the power of the municipal court to incarcerate a defendant for nonpayment of a fine or for contempt.\n(c)\tThe penalty for violation of any rule or regulations promulgated under authority delegated by the charter, this code, or any ordinance of the city is a fine of not more than $2,650 per violation, except as provided in Paragraph (a)(4) of this section.\n(d)\tThe maximum penalty for violation of Sections 5-3-1, \"Assault in the Third Degree,\" 5-3-2, \"Brawling,\" 5-3-3, \"Physical Harassment,\" 5-3-4, \"Threatening Bodily Injury,\" 5-3-6, \"Use of Fighting Words,\" 5-3-9, \"Brandishing a Weapon,\" 5-4-1, \"Damaging Property of Another,\" 5-4-14, \"Graffiti Prohibited,\" 5-4-15, \"Posting Signs on Property of Another Prohibited,\" 5-8-6, \"Aiming Weapon at Another,\" and 5-8-7, \"Flourishing Deadly Weapon in Alarming Manner,\" B.R.C. 1981, when the offense is found to be a bias motivated crime, shall be a fine of not more than $2,650 per violation, or incarceration for not more than three hundred sixty-four days in jail, or both such fine and incarceration. The court shall not be required to make the findings required by Paragraph (a)(3) of this section in order to impose a sentence including incarceration. This ordinance shall not be applied in a manner that suppresses abstract thought or protected speech.\n(e)\tThe limitation on municipal court fines set forth in this section shall be adjusted for inflation on January 1, 2022, and on January 1 of each year thereafter. As used in this paragraph, \"inflation\" means the Colorado consumer price index or a similar index that is tied to the annual rate of inflation in the state or Denver-Boulder metropolitan area.\nOrdinance Nos. 4969 (1986); 5639 (1994); 7496 (2007); 7966 (2014); 8335 (2019); 8473 (2021)"
  },
  {
    "corpus": "BRC",
    "title": "5",
    "title_name": "General Offenses",
    "chapter": "2",
    "chapter_name": "General Provisions",
    "anchor": "5-2-5",
    "heading": "Violations.",
    "verbatim": "5-2-5. Violations.\n(a)\tThe terms crime, offense, misdemeanor, and violation as used in this code or any uncodified ordinance are synonymous. Any act or omission declared to be a violation or to be unlawful or required or prohibited by the phrase \"no person shall,\" or similar mandatory language in or by this code or any ordinance of the city or any rule promulgated thereunder constitutes a violation.\n(b)\tUnless otherwise specifically provided in this code or an ordinance of the city or a rule promulgated thereunder, every day of a violation of the code, ordinance, or rule constitutes a separate violation."
  },
  {
    "corpus": "BRC",
    "title": "5",
    "title_name": "General Offenses",
    "chapter": "2",
    "chapter_name": "General Provisions",
    "anchor": "5-2-6",
    "heading": "Statute of Limitations.",
    "verbatim": "5-2-6. Statute of Limitations.\nNo person shall be prosecuted, tried, or punished for any violation under this code or any ordinance unless the action for said violation is instituted within one year of the date of the alleged violation, but the statute of limitations within which a prosecution must be instituted shall be tolled for:\n(a)\tAny period not to exceed one year when the accused is absent from the city; or\n(b)\tAny period in which a prosecution is pending against the accused for the same conduct, even if the summons, the complaint, or the summons and complaint that commence the prosecution is quashed or the proceedings thereon are set aside or reversed on appeal."
  },
  {
    "corpus": "BRC",
    "title": "5",
    "title_name": "General Offenses",
    "chapter": "2",
    "chapter_name": "General Provisions",
    "anchor": "5-2-7",
    "heading": "Requirements for Criminal Liability and for Offenses of Strict Liability and of Mental Culpability.",
    "verbatim": "5-2-7. Requirements for Criminal Liability and for Offenses of Strict Liability and of Mental Culpability.\n(a)\tThe minimum requirement for criminal liability is the performance by a person of conduct that includes an act or the omission to perform an act. If such conduct is all that is required for commission of a particular violation, the violation is one of \"strict liability.\" If a culpable mental state on the part of the actor is required with respect to any material element of a violation, the violation is one of \"mental culpability.\"\n(b)\tIf a section of this code provides that negligence suffices to establish an element of a violation, that element also is established if a person acts recklessly, knowingly, or intentionally. If recklessness suffices to establish an element of a violation, that element also is established if a person acts knowingly or intentionally. If acting knowingly suffices to establishing an element of a violation, that element also is established if a person acts intentionally."
  },
  {
    "corpus": "BRC",
    "title": "5",
    "title_name": "General Offenses",
    "chapter": "2",
    "chapter_name": "General Provisions",
    "anchor": "5-2-8",
    "heading": "Principals and Parties Subject to Charge Under this code.",
    "verbatim": "5-2-8. Principals and Parties Subject to Charge Under this code.\n(a)\tA person is guilty of a violation committed by the behavior of another individual if:\n(1)\tSuch person is made accountable for the conduct of that other individual by the section defining the violation or by specific provision of this code or other ordinance of the city; or\n(2)\tSuch person acts with a mental state sufficient for the commission of the violation in question and causes an innocent individual to engage in such behavior. As used in this subsection, \"innocent individual\" includes any individual who is not guilty of the violation in question, despite such individual's behavior, because of duress, legal incapacity, or exemption, or unawareness of the illegal nature of the conduct in question, or of the defendant's illegal purpose or any other factor that precludes the mental state sufficient for the commission of the offense in question.\n(b)\tA person is legally accountable as principal for the behavior of another constituting a violation if, with the intent to promote or facilitate the commission of the violation, such person aids, abets, or advises the other in planning or committing the violation.\n(c)\tUnless otherwise provided by the section of this code or other ordinance of the city defining the violation, a person is not legally accountable for behavior of another individual constituting a violation if such person is a victim of that violation or the violation is so defined that such person's conduct is inevitably incidental to its commission.\n(d)\tIt is a specific defense under Subsection (b) of this section that, prior to the commission of a violation, the defendant's effort to promote or facilitate its commission was terminated by the defendant, and such defendant either gave timely warning to law enforcement authorities or gave timely warning to the intended victim.\n(e)\tIn any prosecution for a violation in which liability is based upon the behavior of another pursuant to this code, it is no defense that the other has not been prosecuted for or convicted of any violation based upon the behavior in question or has been convicted of a different violation or degree of violation or that the defendant belongs to a class of persons who by definition of the violation are legally incapable of committing the violation in an individual capacity.\n(f)\tA corporation is guilty of a violation if:\n(1)\tThe conduct constituting the violation consists of an omission to discharge a specific duty of affirmative performance imposed on the corporation by law; or\n(2)\tThe conduct constituting the violation is engaged in or solicited by the board of directors or by an employee acting within such employee's scope of employment or on behalf of the corporation.\n(3)\tIt is a specific defense to corporate liability for moving traffic violations, other than those in which defects in equipment are involved, that the corporation placed no pressure on its employees that would reasonably be understood by them to encourage or require unlawful driving, and that the corporation also had a policy that it regularly followed of training its employees in safe driving and disciplining its employees for unsafe or illegal driving.\n(g)\tA person is criminally liable for conduct constituting a violation that such person performs the act, omission, or possession, or causes it to occur in the name of or on behalf of a corporation to the same extent as if such person performed or caused that conduct in such person's own name or on such person's own behalf.\n(h)\tWhenever the law imposes a specific duty of affirmative performance on any person, where that person is:\n(1)\tA partnership, all the partners are liable for any failure to perform that duty;\n(2)\tAn association, all the members are liable for any failure to perform that duty; or\n(3)\tA corporation, all the officers and agents who are responsible in the course of their employment for the performance of the duty are liable for any failure to perform that duty."
  },
  {
    "corpus": "BRC",
    "title": "5",
    "title_name": "General Offenses",
    "chapter": "2",
    "chapter_name": "General Provisions",
    "anchor": "5-2-9",
    "heading": "Criminal Attempt.",
    "verbatim": "5-2-9. Criminal Attempt.\n(a)\tA person commits criminal attempt if, acting with the kind of mental culpability otherwise required for commission of a violation, the person engages in conduct that constitutes a substantial step toward the commission of the violation. A substantial step is any conduct, whether act, omission or possession, that strongly corroborates the firmness of the actor's purpose to complete the commission of the violation. Factual or legal impossibility of committing the violation is not a defense if the violation could have been committed had the intended circumstances been as the actor believed them to be, nor is it a defense that the violation attempted was actually perpetrated by the accused.\n(b)\tA person who engages in conduct intending to aid another to commit a violation commits criminal attempt if the conduct would establish such person's complicity were the violation committed by the other, even if the other is not guilty of committing or attempting the violation.\n(c)\tIt is an affirmative defense to a charge under this section that the defendant abandoned the effort to commit the violation or otherwise prevented its commission, under circumstances manifesting the complete and voluntary renunciation of the defendant's illegal intent.\n(d)\tThe maximum penalty upon conviction of attempting to violate a provision of this code, any ordinance of the city or any rule promulgated thereunder is half the penalty that would apply if the offense had been committed."
  },
  {
    "corpus": "BRC",
    "title": "5",
    "title_name": "General Offenses",
    "chapter": "2",
    "chapter_name": "General Provisions",
    "anchor": "5-2-10",
    "heading": "Conspiracy.",
    "verbatim": "5-2-10. Conspiracy.\n(a)\tA person commits conspiracy to commit a violation if, with the intent to promote or facilitate its commission, such person agrees with another individual or individuals that they, or one or more of them, will engage in conduct that constitutes a violation or an attempt to commit a violation, or such person agrees to aid the other individual or individuals in the planning or commission of a violation or an attempt to commit a violation.\n(b)\tNo person may be convicted of conspiracy to commit a violation unless an overt act is proved to have been done by such person or by an individual with whom such person conspired in pursuit of that conspiracy.\n(c)\tIf a person knows that an individual with whom such person conspires to commit a violation has conspired with another individual or individuals to commit the same violation, such person is guilty of conspiring to commit a violation with the other individual or individuals, whether or not such person knows their identity.\n(d)\tIf a person conspires to commit a number of violations, such person is guilty of only one conspiracy as long as such multiple violations are part of a single criminal episode.\n(e)\tSubject to the provisions of subsection (f) of this section, two or more persons charged with conspiracy may be prosecuted jointly if:\n(1)\tThey are charged with conspiring with one another; or\n(2)\tThey are charged with being involved in conspiracies that are so related as to constitute different aspects of a scheme of organized illegal conduct. In such case it is immaterial that the persons charged are not parties to the same conspiracy.\n(f)\tIn any joint prosecution under subsection (e) of this section:\n(1)\tNeither the liability of any defendant nor the admissibility against such defendant of evidence of acts or declarations of another shall be enlarged by this joinder; and\n(2)\tThe judge shall order a severance or take a special verdict as to any defendant who so requests, if the judge deems it necessary or appropriate to promote the fair determination of the defendant's guilt or innocence.\n(g)\tIt is an affirmative defense to a charge of conspiracy that the offender, after conspiring to commit a violation, thwarted the success of the conspiracy, under circumstances manifesting a complete and voluntary renunciation of the offender's illegal intent.\n(h)\tConspiracy is a continuing course of conduct that terminates when the violation or violations that are its object are committed or the agreement that they be committed is abandoned by the defendant and by those with whom the defendant conspired.\n(1)\tAbandonment is presumed if neither the defendant nor anyone with whom the defendant conspired does any overt act in pursuit of the conspiracy during the year prior to institution of the action.\n(2)\tIf an individual abandons the agreement, the conspiracy is terminated as to such individual only if and when such individual gives timely notice of such abandonment to those with whom the individual conspired, and the notice is evidenced by circumstances that corroborate the giving of the notice, or such individual informs the law enforcement authorities having jurisdiction of the existence of the conspiracy and of such individual's participation therein.\n(i)\tIt is immaterial to the liability of a person who conspires with another to commit a violation that:\n(1)\tSuch person or the individual with whom such person conspires does not occupy a particular position or have a particular characteristic that is an element of the violation, if such person believes that one of them does; or\n(2)\tThe individual with whom such person conspires is irresponsible or has an immunity to prosecution or conviction for the commission of the violation.\n(j)\tNo person shall conspire to violate this code or the charter or any ordinance of the city."
  },
  {
    "corpus": "BRC",
    "title": "5",
    "title_name": "General Offenses",
    "chapter": "2",
    "chapter_name": "General Provisions",
    "anchor": "5-2-11",
    "heading": "Prosecution of Multiple Counts for Same Act.",
    "verbatim": "5-2-11. Prosecution of Multiple Counts for Same Act.\n(a)\tWhen any conduct of a defendant establishes the commission of more than one violation, the defendant may be prosecuted for each such violation. A defendant may not be convicted for more than one violation if:\n(1)\tOne violation is included in the other, as defined in subsection (e) of this section;\n(2)\tOne violation consists only of an attempt to commit the other;\n(3)\tInconsistent findings of fact are required to establish the commission of the violations;\n(4)\tThe violations differ only by the fact that one is defined to prohibit a designated kind of conduct generally and the other to prohibit a specific instance of such conduct; or\n(5)\tThe violation is defined as a continuing course of conduct and the defendant's course of conduct was uninterrupted, unless this code provides that specific periods or instances of such conduct constitute separate violations. This paragraph does not apply where counts differ only by the fact that they occurred on different days.\n(b)\tIf the several violations are known to the city attorney at the time of commencing the prosecution, all such violations upon which the city attorney elects to proceed shall be prosecuted by separate counts in a single prosecution if they are based on the same act or series of acts arising from the same criminal episode. Any violation not thus joined at trial by separate count cannot thereafter be the basis of a subsequent prosecution.\n(c)\tIf more than one guilty verdict is returned as to any defendant in a prosecution where multiple counts are tried as required by subsection (b) of this section, the sentences imposed shall run concurrently. This paragraph does not apply where counts differ only in that they occurred on different days or at different times on the same day.\n(d)\tWhen a defendant is charged with two or more violations based on the same act or series of acts arising from the same criminal episode, the judge may, on application of either the defendant or the city attorney if the interest of justice so requires, order any such charge to be tried separately.\n(e)\tA defendant may be convicted of a violation included in a violation charged in the complaint. A violation is so included if:\n(1)\tIt is established by proof of the same or less than all of the facts required to establish the commission of the violation charged;\n(2)\tIt consists of an attempt to commit the violation charged or to commit a violation otherwise included therein; or\n(3)\tIt differs from the violation charged only in the respect that a less serious injury or risk of injury to the same person, property or public interest or a lessor kind of culpability suffices to establish its commission.\n(f)\tThe judge is not obligated to charge the jury with respect to an included violation unless there is evidence sufficient to support a verdict acquitting the defendant of the violation charged and convicting the defendant of the included violation.\n(g)\tIf the same conduct is defined as a violation in different enactments or sections of this code or any ordinance of the city, the violator may be prosecuted under any one or all of the enactments or sections subject to the limitations provided by this section. It is immaterial to the prosecution that one of the enactments or sections characterizes the violation as of lesser degree than another, or provides a lesser penalty than another, or was enacted by the city council at a later date than another, unless the later section or enactment specifically repeals the earlier."
  },
  {
    "corpus": "BRC",
    "title": "5",
    "title_name": "General Offenses",
    "chapter": "2",
    "chapter_name": "General Provisions",
    "anchor": "5-2-12",
    "heading": "Applicability of Defenses.",
    "verbatim": "5-2-12. Applicability of Defenses.\nOther than a failure of proof of any element of a violation, only the following may be defenses to a prosecution alleging violations of this code or other ordinance of the city.\n(a)\tAny defense made specifically applicable by the section, chapter or title defining the violation. All such defenses are specific defenses unless explicitly denominated as affirmative defenses.\n(b)\tAny affirmative defenses defined in this chapter insofar as they are made specifically applicable by the section defining them.\n(c)\tAny specific defenses defined in this chapter insofar as they are made specifically applicable by the section defining them.\n(d)\tExcept as specifically provided to the contrary, all exceptions, excuses, provisos or exemptions found in the section defining a violation or in any other relevant section, if not matters of law, constitute specific defenses."
  },
  {
    "corpus": "BRC",
    "title": "5",
    "title_name": "General Offenses",
    "chapter": "2",
    "chapter_name": "General Provisions",
    "anchor": "5-2-13",
    "heading": "Consent.",
    "verbatim": "5-2-13. Consent.\n(a)\tThe consent of the victim to conduct charged to constitute a violation or to the result thereof is not a defense unless the consent negates an element of the violation or precludes the infliction of the harm or evil sought to be prevented by the law defining the violation.\n(b)\tWhen conduct is charged to constitute a violation because it causes or threatens bodily injury, consent to that conduct or to the infliction of that injury is a defense only if the bodily injury consented to or threatened by the conduct consented to is not serious, the conduct and the injury are reasonably foreseeable hazards in joint participation in a lawful athletic contest or competitive sport or the consent establishes a justification under this code or other ordinance of the city.\n(c)\tUnless otherwise provided by this code or by the law defining the violation, assent does not constitute consent if:\n(1)\tIt is given by a person who is legally incompetent to authorize the conduct charged to constitute the violation;\n(2)\tIt is given by a person who, by reason of immaturity, mental disease, mental defect or intoxication, is manifestly unable and is known or reasonably should be known by the defendant to be unable to make a reasonable judgment as to the nature or harmfulness of the conduct charged to constitute the violation;\n(3)\tIt is given by a person whose consent is sought to be prevented by the law defining the violation; or\n(4)\tIt is induced by force, duress or deception.\n(d)\tConsent under this section is an affirmative defense, except for traffic law violations, where it is a specific defense. It is inapplicable where any government agency is the claimed victim."
  },
  {
    "corpus": "BRC",
    "title": "5",
    "title_name": "General Offenses",
    "chapter": "2",
    "chapter_name": "General Provisions",
    "anchor": "5-2-14",
    "heading": "Execution of Public Duty.",
    "verbatim": "5-2-14. Execution of Public Duty.\n(a)\tUnless inconsistent with other provisions of this code defining justifiable use of physical force or with other provisions of law, conduct that would otherwise constitute a violation is justifiable and not criminal when it is required or authorized by a provision of law or a judicial decree binding in the city.\n(b)\tA provision of law and a judicial decree as used in subsection (a) of this section mean:\n(1)\tLaws defining duties and functions of public servants;\n(2)\tLaws defining duties of private citizens to assist public servants in the performance of certain of their functions;\n(3)\tLaws governing the execution of legal process;\n(4)\tLaws governing the military service and conduct of war; and\n(5)\tJudgments and orders of court.\n(c)\tExecution of public duty under this section is an affirmative defense."
  },
  {
    "corpus": "BRC",
    "title": "5",
    "title_name": "General Offenses",
    "chapter": "2",
    "chapter_name": "General Provisions",
    "anchor": "5-2-15",
    "heading": "Choice of Evils.",
    "verbatim": "5-2-15. Choice of Evils.\n(a)\tConduct that would otherwise constitute a violation is justifiable and not criminal when it is unavoidably necessary as an emergency measure to avoid imminent public or private physical injury that is about to occur by reason of a situation occasioned or developed through no conduct of the actor and that is of sufficient gravity that, according to ordinary standards of intelligence and morality, the desirability and urgency of avoiding the injury clearly and convincingly outweigh the desirability of avoiding the injury sought to be prevented by the code section or ordinance defining the violation at issue.\n(b)\tThe necessity and justifiability of conduct under subsection (a) of this section do not rest upon considerations pertaining only to the morality and advisability of the code section or ordinance, either in its general application or with respect to its application to a particular class of cases arising thereunder.\n(c)\tBefore evidence relating to a defense of justification under this section is presented to a jury, the defendant shall first make a detailed offer of proof to the judge, who shall rule as a matter of law whether the claimed facts or circumstances would, if established, constitute a justification. If the judge admits such evidence, the judge shall again rule as a matter of law on the sufficiency of the evidence that, if believed by the jury, would establish the defense.\n(d)\tChoice of evils under this section is a specific defense. It does not apply to traffic violations.\nOrdinance No. 5099 (1988)"
  },
  {
    "corpus": "BRC",
    "title": "5",
    "title_name": "General Offenses",
    "chapter": "2",
    "chapter_name": "General Provisions",
    "anchor": "5-2-16",
    "heading": "Use of Physical Force.",
    "verbatim": "5-2-16. Use of Physical Force.\n(a)\tThe use of physical force upon another person that would otherwise constitute a violation is justifiable and not criminal under any of the following circumstances:\n(1)\tA parent, guardian, or other person entrusted with the care and supervision of a minor or an incompetent person and a teacher or other person entrusted with the care or supervision of a minor may use reasonable and appropriate physical force upon the minor or incompetent person when and to the extent it is reasonably necessary and appropriate to maintain discipline or promote the welfare of the minor or the incompetent person.\n(2)\tA superintendent or other authorized official of a jail or correctional institution may, in order to maintain order and discipline, use reasonable and appropriate physical force when and to the extent that such official reasonably believes it necessary to maintain order and discipline.\n(3)\tA person responsible for maintaining order in a common carrier of passengers or an individual acting under such person's direction may use reasonable and appropriate physical force when and to the extent that it is necessary to maintain order and discipline.\n(4)\tA person acting under a reasonable belief that another individual is about to commit suicide or to self-inflict serious bodily injury may use reasonable and appropriate physical force upon that individual to the extent that it is reasonably necessary to thwart the result.\n(5)\tA duly licensed physician or a person acting under such physician's direction may use reasonable and appropriate physical force for the purpose of administering a recognized form of treatment that such physician reasonably believes to be adapted to promoting the physical and mental health of the patient if:\n(A)\tThe treatment is administered with the consent of the patient or, if the patient is a minor or an incompetent person, with the consent of a parent, guardian, or other person entrusted with the patient's care and supervision; or\n(B)\tThe treatment is administered in an emergency when the physician reasonably believes that no one competent to consent can be consulted and that a reasonable person wishing to safeguard the welfare the patient would consent.\n(6)\tA police officer acting in good faith under color of official authority.\n(b)\tJustification of use of physical force under this section is an affirmative defense."
  },
  {
    "corpus": "BRC",
    "title": "5",
    "title_name": "General Offenses",
    "chapter": "2",
    "chapter_name": "General Provisions",
    "anchor": "5-2-17",
    "heading": "Use of Physical Force in Defense of a Person.",
    "verbatim": "5-2-17. Use of Physical Force in Defense of a Person.\n(a)\tExcept as provided in Subsection (b) of this section a person is justified in using physical force upon another individual in self-defense or in defense of a third person from what the first person reasonably believes to be the use or imminent use of unlawful physical force by that other individual.\n(b)\tNotwithstanding the provisions of Subsection (a) of this section, a person is not justified in using physical force if:\n(1)\tWith an intent to cause bodily injury to another individual, such person provokes the use of unlawful physical force by that other individual;\n(2)\tSuch person is the initial aggressor, except that the use of physical force upon another individual under the circumstances is justifiable if such person withdraws from the encounter and effectively communicates to the other individual the intent to do so, but the latter nevertheless continues or threatens the use of unlawful physical force; or\n(3)\tThe physical force involved is the product of a combat by agreement not specifically authorized by law.\n(c)\tUse of physical force in defense of a person under this section is an affirmative defense."
  },
  {
    "corpus": "BRC",
    "title": "5",
    "title_name": "General Offenses",
    "chapter": "2",
    "chapter_name": "General Provisions",
    "anchor": "5-2-18",
    "heading": "Use of Physical Force in Defense of Premises.",
    "verbatim": "5-2-18. Use of Physical Force in Defense of Premises.\n(a)\tA person in possession or control of any building, realty, or other premises or a person who is licensed or permitted to be thereon is justified in using reasonable and appropriate physical force upon another individual when and to the extent that such person reasonably believes it necessary to prevent or terminate what such person reasonably believes to be the commission or attempted commission of an unlawful trespass by the other individual in or upon the building, realty, or premises.\n(b)\tUse of physical force in defense of premises under this section is an affirmative defense."
  },
  {
    "corpus": "BRC",
    "title": "5",
    "title_name": "General Offenses",
    "chapter": "2",
    "chapter_name": "General Provisions",
    "anchor": "5-2-19",
    "heading": "Use of Physical Force in Defense of Property.",
    "verbatim": "5-2-19. Use of Physical Force in Defense of Property.\n(a)\tA person is justified in using reasonable and appropriate physical force upon another individual when and to the extent that such person reasonably believes it necessary to prevent what is, in such person's reasonable belief, an attempt by the other individual to commit theft, criminal mischief, or criminal tampering involving property.\n(b)\tUse of physical force in defense of property under this section is an affirmative defense."
  },
  {
    "corpus": "BRC",
    "title": "5",
    "title_name": "General Offenses",
    "chapter": "2",
    "chapter_name": "General Provisions",
    "anchor": "5-2-20",
    "heading": "Use of Physical Force in Making an Arrest or in Preventing an Escape.",
    "verbatim": "5-2-20. Use of Physical Force in Making an Arrest or in Preventing an Escape.\n(a)\tA police officer, a person who has been directed by a police officer to assist the officer, or a private person acting on his or her own account, is justified in using reasonable and appropriate physical force upon another individual when and to the extent that such officer or person reasonably believes it necessary as authorized by state or city law in making an arrest or in preventing an escape.\n(b)\tUse of physical force in making an arrest or in preventing an escape under this section is an affirmative defense."
  },
  {
    "corpus": "BRC",
    "title": "5",
    "title_name": "General Offenses",
    "chapter": "2",
    "chapter_name": "General Provisions",
    "anchor": "5-2-21",
    "heading": "Duress.",
    "verbatim": "5-2-21. Duress.\n(a)\tA person may not be convicted of a violation based upon conduct in which such person engaged because of the use of or threatened use of unlawful physical force upon such person or upon another individual, which force or threatened use thereof a reasonable person in such a situation would have been unable to resist. This defense is not available when a person intentionally, knowingly, or recklessly engages in a situation in which it is foreseeable that such person will be subjected to such force or threatened use thereof.\n(b)\tDuress under this section is an affirmative defense."
  },
  {
    "corpus": "BRC",
    "title": "5",
    "title_name": "General Offenses",
    "chapter": "2",
    "chapter_name": "General Provisions",
    "anchor": "5-2-22",
    "heading": "Entrapment.",
    "verbatim": "5-2-22. Entrapment.\n(a)\tConduct that would otherwise constitute a violation is not criminal if the accused engaged in the proscribed conduct because the accused was induced to do so by a law enforcement official or a person acting under such official's direction seeking to obtain evidence for the purpose of prosecution and if the methods used to obtain that evidence were such as to create a substantial risk that the conduct would be committed by a person who, but for such inducement, would not have conceived of or engaged in conduct of the sort induced. Merely affording a person an opportunity to commit an offense is not entrapment even though representations or inducements are used that are calculated to overcome the violator's fear of detection.\n(b)\tEntrapment under this section is a specific defense."
  },
  {
    "corpus": "BRC",
    "title": "5",
    "title_name": "General Offenses",
    "chapter": "2",
    "chapter_name": "General Provisions",
    "anchor": "5-2-23",
    "heading": "Impaired Mental Condition.",
    "verbatim": "5-2-23. Impaired Mental Condition.\nEvidence of an impaired mental condition or insanity may be offered in a proper case as bearing upon the capacity of the accused to form a specific intent if such an intent is an element of the violation charged. Otherwise, insanity is never a defense to a charge of violation of this code or other ordinance of the city."
  },
  {
    "corpus": "BRC",
    "title": "5",
    "title_name": "General Offenses",
    "chapter": "2",
    "chapter_name": "General Provisions",
    "anchor": "5-2-24",
    "heading": "Intoxication.",
    "verbatim": "5-2-24. Intoxication.\n(a)\tIntoxication of the accused is not a defense to a charge of violation of this code or other ordinance of the city, except as provided in subsection (b) of this section; but in any prosecution for a violation, evidence of intoxication of the accused may be offered by the accused when it is relevant to negate the existence of a specific intent, if such intent is an element of the crime charged.\n(b)\tA person is not criminally responsible for conduct if, by reason of intoxication that is not self-induced at the time of the conduct, such person lacks capacity to conform the conduct to the requirements of the law.\n(c)\tIntoxication as used in this section means a disturbance of mental or physical capacities resulting from the introduction of any substance into the body.\n(d)\tSelf-induced intoxication means intoxication caused by substances that the accused knows or that a reasonable person would know have the tendency to cause intoxication and that the accused knowingly introduced or allowed to be introduced into the accused's body.\n(e)\tIntoxication under this section is a specific defense."
  },
  {
    "corpus": "BRC",
    "title": "5",
    "title_name": "General Offenses",
    "chapter": "2",
    "chapter_name": "General Provisions",
    "anchor": "5-2-25",
    "heading": "Mistake.",
    "verbatim": "5-2-25. Mistake.\n(a)\tA person is not relieved of criminal liability for conduct because such person engaged in that conduct under a mistaken belief of fact unless:\n(1)\tIt negates the existence of a particular mental state essential to the commission of the violation;\n(2)\tThe section defining the violation or a section relating thereto expressly provides that a factual mistake or the mental state resulting therefrom constitutes a defense or exemption; or\n(3)\tThe factual mistake or the mental state resulting therefrom is of a kind that supports a defense of justification as defined in this code and is reasonable.\n(b)\tA person is not relieved of liability for conduct because such person engages in that conduct under a mistaken belief that it does not as a matter of law constitute a violation, unless the conduct is permitted by one or more of the following:\n(1)\tA provision of the charter, this code or an ordinance of the city;\n(2)\tA written administrative regulation, order or grant of permission by a body or official authorized to make such order or grant of permission under the charter, this code or an ordinance of the city;\n(3)\tAn official written interpretation of the section, ordinance, regulation or order relating to the violation, made or issued by a public servant, agency or body legally charged or empowered with the responsibility of administering, enforcing or interpreting this section, ordinance, regulation or order. If such interpretation is by judicial decision, it must be binding in the city.\n(c)\tIgnorance or mistake under this section is a specific defense."
  },
  {
    "corpus": "BRC",
    "title": "5",
    "title_name": "General Offenses",
    "chapter": "2",
    "chapter_name": "General Provisions",
    "anchor": "5-2-26",
    "heading": "Matters of Local and Mixed Concern.",
    "verbatim": "5-2-26. Matters of Local and Mixed Concern.\nIt is the intention of the City Council that those ordinances and provisions of this code that deal with matters of \"local\" concern supersede the laws of the State of Colorado to the extent that they conflict and that those that deal with matters of \"mixed\" concern apply concurrently with the laws of the State of Colorado. No provision of this code on a matter of \"mixed\" concern is to be construed expressly or by implication to permit conduct that is illegal under the laws of the State of Colorado. The provisions of this code are to be construed to apply to conduct subject to the jurisdiction of the City of Boulder.\nOrdinance No. 8494 (2022)"
  },
  {
    "corpus": "BRC",
    "title": "5",
    "title_name": "General Offenses",
    "chapter": "2",
    "chapter_name": "General Provisions",
    "anchor": "5-2-27",
    "heading": "Penalties Not Released by Repeal.",
    "verbatim": "5-2-27. Penalties Not Released by Repeal.\n(a)\tThe repeal, revision, amendment or consolidation of any section of the Boulder Revised Code 1981, as amended, does not constitute a bar to the prosecution and punishment of an act already committed in violation of the section so repealed, unless the repealing, revising, amending or consolidating ordinance expressly so provides.\n(b)\tAny such section so repealed, amended, revised or consolidated shall remain in full force and effect for the purpose of sustaining all actions, suits, proceedings and prosecutions brought thereunder that arose before the effective date of the repeal, amendment, revision or consolidation. An administrative order that is stayed by administrative or judicial appeal shall be deemed to be an \"action\" brought under the code within the meaning of this subsection."
  },
  {
    "corpus": "BRC",
    "title": "5",
    "title_name": "General Offenses",
    "chapter": "3",
    "chapter_name": "Offenses Against the Person",
    "anchor": "5-3-1",
    "heading": "Assault in the Third Degree.",
    "verbatim": "5-3-1. Assault in the Third Degree.\nNo person shall recklessly cause bodily injury to another. This section does not apply where there is serious bodily injury, a deadly weapon is used or the assault is otherwise felonious."
  },
  {
    "corpus": "BRC",
    "title": "5",
    "title_name": "General Offenses",
    "chapter": "3",
    "chapter_name": "Offenses Against the Person",
    "anchor": "5-3-2",
    "heading": "Brawling.",
    "verbatim": "5-3-2. Brawling.\nNo person shall fight with another in a public place except in a prearranged amateur or professional contest of athletic skills."
  },
  {
    "corpus": "BRC",
    "title": "5",
    "title_name": "General Offenses",
    "chapter": "3",
    "chapter_name": "Offenses Against the Person",
    "anchor": "5-3-3",
    "heading": "Physical Harassment.",
    "verbatim": "5-3-3. Physical Harassment.\nNo person shall, with intent to harass or annoy another, strike, shove, kick or otherwise touch or subject an individual to physical contact."
  },
  {
    "corpus": "BRC",
    "title": "5",
    "title_name": "General Offenses",
    "chapter": "3",
    "chapter_name": "Offenses Against the Person",
    "anchor": "5-3-4",
    "heading": "Threatening Bodily Injury.",
    "verbatim": "5-3-4. Threatening Bodily Injury.\nNo person shall knowingly, by threat or physical action, place another in fear of imminent bodily injury. This section does not apply if the threat or physical action is committed by the use of a deadly weapon or if the threat is made with the intent to induce the threatened person or another person to do an act or refrain from doing a lawful act against such individual's will."
  },
  {
    "corpus": "BRC",
    "title": "5",
    "title_name": "General Offenses",
    "chapter": "3",
    "chapter_name": "Offenses Against the Person",
    "anchor": "5-3-5",
    "heading": "Obstructing Public Streets, Places or Buildings.",
    "verbatim": "5-3-5. Obstructing Public Streets, Places or Buildings.\n(a)\tNo person without legal privilege shall knowingly obstruct vehicular or pedestrian movement in a public place.\n(b)\tFor the purpose of this section obstruct means to interfere with or prevent, whether alone or with others, convenient or reasonable passage or use. For purposes of this section concerning a public walk, sidewalk or building, convenient means providing enough passageway to permit passage of a thirty-six-inch-wide wheelchair at an average unobstructed pedestrian speed. Reasonable includes permitting passage of a pedestrian without pause or detour, and evidence that a pedestrian had to alter substantially the pedestrian's direction of travel in order to accommodate a person sitting or lying in the pedestrian's way shall be prima facie evidence of obstruction.\n(c)\tFor the purpose of this section public place means in or upon any public highway, street, alley, walk, parking lot, building, park or other public property, or in or upon those portions of any private property upon which the public has an express or implied license to enter or remain.\n(d)\tFor the purpose of this sectionlegal privilege includes, without limitation, awaiting public transportation in areas designated therefor and acting in accordance with a license or permit used by the city for construction or other work in, over, on or under, the public way or place.\n(e)\tNo person shall be deemed to have violated this section solely because of a gathering of persons for the purpose of hearing such person speak or solely because of being a member of such a gathering. Such person commits a violation by refusing to obey a reasonable request or order by a police officer to move:\n(1)\tTo prevent obstruction of a public street, alley, sidewalk, public way, place, or building or entrance or doorway into or out of a building open to the public, if compliance with that order at the same time permits the gathering to continue to satisfy its communicative purpose; or\n(2)\tTo maintain public safety by dispersing those gathered in dangerous proximity to a fire or hazard.\n(f)\tThe provisions of Subsection (a) of this section do not apply to persons on the sidewalk along the route of a parade permitted under Section 7-2-14, \"Permit Required for Parades, Processions, and Sound Trucks,\" B.R.C. 1981; but any such person who fails to move when requested to do so by a police officer making a lane available for pedestrians commits a violation of this section.\nOrdinance No. 5955 (1997)"
  },
  {
    "corpus": "BRC",
    "title": "5",
    "title_name": "General Offenses",
    "chapter": "3",
    "chapter_name": "Offenses Against the Person",
    "anchor": "5-3-6",
    "heading": "Use of Fighting Words.",
    "verbatim": "5-3-6. Use of Fighting Words.\nNo person shall, with intent to harass, annoy, or alarm another, repeatedly insult, taunt, or challenge another in a manner likely to provoke a disorderly response. If the person to whom such insult, taunt, or challenge is directed is a police officer, there is no violation of this section until the police officer requests the person to cease and discontinue the conduct, but the person repeats or continues the conduct.\nOrdinance No. 7974 (2014)"
  },
  {
    "corpus": "BRC",
    "title": "5",
    "title_name": "General Offenses",
    "chapter": "3",
    "chapter_name": "Offenses Against the Person",
    "anchor": "5-3-7",
    "heading": "Aggressive Begging Prohibited.",
    "verbatim": "5-3-7. Aggressive Begging Prohibited.\n(a)\tNo person shall beg or solicit aggressively for a gift of money or any thing of value on any public street, sidewalk, way, mall, park, building, or other public property or on any private property open to the public while in close proximity to the individual addressed. Aggressive begging means begging or soliciting accompanied by or followed immediately by one or more of the following:\n(1)\tConduct that is intimidating, threatening, coercive, or obscene and that causes the person addressed to reasonably fear for his or her safety; or\n(2)\tAddressing fighting words to the individual addressed.\n(b)\tIf one person acts in concert with another to beg aggressively, such that one person begs or solicits, and another commits one or more of the additional acts constituting aggressive begging, both have committed the crime.\nOrdinance Nos. 5955 (1997); 7259 (2003); 8089 (2015)"
  },
  {
    "corpus": "BRC",
    "title": "5",
    "title_name": "General Offenses",
    "chapter": "3",
    "chapter_name": "Offenses Against the Person",
    "anchor": "5-3-8",
    "heading": "Disrupting Quiet Enjoyment of Home.",
    "verbatim": "5-3-8. Disrupting Quiet Enjoyment of Home.\nRepealed.\nOrdinance Nos. 5271 (1990); 5309 (1990); 7151 (2001); 7358 (2004)"
  },
  {
    "corpus": "BRC",
    "title": "5",
    "title_name": "General Offenses",
    "chapter": "3",
    "chapter_name": "Offenses Against the Person",
    "anchor": "5-3-9",
    "heading": "Brandishing a Weapon.",
    "verbatim": "5-3-9. Brandishing a Weapon.\nNo person not a police officer, or a peace officer of any state of the United States and acting in such capacity, shall display a deadly weapon in a public place in a manner calculated to alarm. It is an affirmative defense to a charge of violating this section that the display constituted legitimate self-defense under state law."
  },
  {
    "corpus": "BRC",
    "title": "5",
    "title_name": "General Offenses",
    "chapter": "3",
    "chapter_name": "Offenses Against the Person",
    "anchor": "5-3-10",
    "heading": "Harassment Near Health Care Facility.",
    "verbatim": "5-3-10. Harassment Near Health Care Facility.\n(a)\tNo person shall knowingly obstruct, detain, hinder, impede, or block another person's entry to or exit from a health care facility.\n(b)\tNo person shall knowingly approach another person within eight feet of such person, unless such other person consents, for the purpose of passing a leaflet or handbill to, displaying a sign to, or engaging in oral protest, education, or counseling with such other person in the public way or sidewalk area within a radius of one hundred feet from any entrance door to a health care facility.\n(c)\tFor the purposes of this section, health care facility means any entity that is licensed, certified, or otherwise authorized or permitted by law to administer medical treatment.\nOrdinance Nos. 4982 (1986); 5037 (1987); 7129 (2001)"
  },
  {
    "corpus": "BRC",
    "title": "5",
    "title_name": "General Offenses",
    "chapter": "3",
    "chapter_name": "Offenses Against the Person",
    "anchor": "5-3-11",
    "heading": "Nuisance Party Prohibited.",
    "verbatim": "5-3-11. Nuisance Party Prohibited.\n(a)\tNo owner, occupant, tenant, or other person having possessory control, individually or jointly with others, of any premises shall sponsor, conduct, host, or permit a social gathering or party on the premises which is or becomes a public nuisance where such nuisance is either the intentional result of, or reasonably anticipated by, the person or persons having such possessory control. Reasonable anticipation shall be adjudicated using a reasonable person standard.\n(b)\tA social gathering shall be deemed to constitute a public nuisance when, by reason of the conduct of persons in attendance, it results in one or more of the following violations of this code and which violations occur at the site of the social gathering, or on neighboring public or private property:\nSection 5-3-1, \"Assault in the Third Degree,\" B.R.C. 1981;\nSection 5-3-2, \"Brawling,\" B.R.C. 1981;\nSection 5-3-4, \"Threatening Bodily Injury,\" B.R.C. 1981;\nSection 5-3-5, \"Obstructing Public Streets, Places, or Buildings,\" B.R.C. 1981;\nSection 5-3-6, \"Use of Fighting Words,\" B.R.C. 1981;\nSection 5-4-1, \"Damaging Property of Another,\" B.R.C. 1981;\nSection 5-4-2, \"Damaging Public Property,\" B.R.C. 1981;\nSection 5-4-3, \"Trespass,\" B.R.C. 1981;\nSection 5-4-10, \"Fires on Public Property,\" B.R.C. 1981;\nSection 5-4-13, \"Littering,\" B.R.C. 1981;\nSection 5-4-14, \"Graffiti Prohibited,\" B.R.C. 1981;\nSection 5-5-3, \"Obstructing a Peace Officer or Firefighter,\" B.R.C. 1981;\nSection 5-5-10, \"False Reports,\" B.R.C. 1981;\nSection 5-6-6, \"Fireworks,\" B.R.C. 1981;\nSection 5-6-7, \"Public Urination,\" B.R.C. 1981;\nSection 5-7-2, \"Possession and Consumption of Alcoholic Beverages in Public Prohibited,\" B.R.C. 1981;\nSection 5-7-3, \"Unlawful to Sell or Give to or Procure for Minors,\" B.R.C. 1981;\nSection 5-7-4, \"Possession and Sale by Minors Unlawful,\" B.R.C. 1981;\nSection 5-9-3, \"Exceeding Decibel Sound Levels Prohibited,\" B.R.C. 1981;\nSection 5-9-5, \"Disrupting Quiet Enjoyment of Home,\" B.R.C. 1981;\nSection 5-9-6, \"Unreasonable Noise Prohibited,\" B.R.C. 1981;\nA violation of any provision in Chapter 6-3, \"Trash, Recyclables, and Compostables,\" B.R.C. 1981, relating to the unlawful deposit of trash;\nSection 7-4-61, \"Obstructing Traffic Prohibited,\" B.R.C. 1981;\nParagraph 10-8-2(b)(12), B.R.C. 1981, concerning open burning.\n(c)\tA social gathering shall be deemed to constitute a public nuisance when an open keg of beer is located in any yard adjacent to a street, on a front porch in a place visible to the public, or in any side yard of the premises upon which the social gathering takes place such that the open keg of beer is visible to members of the public standing on public streets, on sidewalks, or on the grounds of other adjoining or nearby private properties.\n(d)\tAll participants in any party or social gathering declared to be a public nuisance by a police officer shall cease participating in that party or social gathering and disperse immediately upon the order of a police officer, and all persons not domiciled at the site of such party or social gathering shall leave the premises immediately. No person shall fail or refuse to obey and abide by such an order.\nOrdinance Nos. 7126 (2001); 7831 (2012); 7965 (2014); 8531 (2022)"
  },
  {
    "corpus": "BRC",
    "title": "5",
    "title_name": "General Offenses",
    "chapter": "3",
    "chapter_name": "Offenses Against the Person",
    "anchor": "5-3-12",
    "heading": "Reserved.",
    "verbatim": "5-3-12. Reserved.\nEditor's note:Ord. No. 8089, § 2, adopted October 6, 2015, repealed § 5-3-12, which pertained to begging in certain places prohibited and derived from Ordinance No. 7259 (2003)."
  },
  {
    "corpus": "BRC",
    "title": "5",
    "title_name": "General Offenses",
    "chapter": "3",
    "chapter_name": "Offenses Against the Person",
    "anchor": "5-3-13",
    "heading": "Failure to Pay Wages Due.",
    "verbatim": "5-3-13. Failure to Pay Wages Due.\n(a)\tNo employer or agent of an employer who is under a duty to pay wages or compensation shall fail to pay those wages or that compensation or falsely deny the amount of the claim for the payment of wages or compensation.\n(b)\tIt shall be an affirmative defense to a charged violation of this section that:\n(1)\tThe employer or the employer's agent was unable to pay the wages or compensation;\n(2)\tAt the time of initially employing the employee, the employer or employer's agent had a good faith and reasonable belief that payment would be made in a timely manner when due;\n(3)\tThe employee was informed as soon as the employer or employer's agent was aware, or through the exercise of reasonable diligence should have been aware, of conditions that would make it impossible to pay an employee;\n(4)\tThe employer or employer's agent provided to each employee who did not receive full and timely payment a written acknowledgement of debt that accurately reflected the full amount owed to that employee; and\n(5)\tAfter becoming aware of the inability to pay an employee, the employer or employer's agent did not employ any new or additional employees before satisfying the existing wage and compensation obligations.\n(c)\tFor purposes of this section, wages or compensation means all amounts for labor or service performed by employees, whether the amount is fixed or determined by the standard of time, task, piece, commission basis, or other method of calculation or whether the labor or service is performed under contract, subcontract, partnership, or other agreement for the performance of labor or service. However, wages or compensation only includes payment for service performed personally by the person demanding payment. No amount is considered to be wages or compensation until such amount is earned, vested, and determinable.\n(d)\tFor purposes of this section, failure to pay wages or compensation for each 30-day period of employment, or any part thereof, shall be considered a separate violation.\nOrdinance No. 7557 (2007)"
  },
  {
    "corpus": "BRC",
    "title": "5",
    "title_name": "General Offenses",
    "chapter": "3",
    "chapter_name": "Offenses Against the Person",
    "anchor": "5-3-14",
    "heading": "Antipersonnel Devices Prohibited.",
    "verbatim": "5-3-14. Antipersonnel Devices Prohibited.\nNo person shall create, install, use, possess, or allow an antipersonnel device within or connected to a person or to property which the person owns, manages, or has under physical control.\nOrdinance No. 7723 (2010)"
  },
  {
    "corpus": "BRC",
    "title": "5",
    "title_name": "General Offenses",
    "chapter": "4",
    "chapter_name": "Offenses Against Property",
    "anchor": "5-4-1",
    "heading": "Damaging Property of Another.",
    "verbatim": "5-4-1. Damaging Property of Another.\n(a)\tNo person shall knowingly damage the real or personal property of another.\n(b)\tThis section does not apply where the damage in the course of a single criminal episode is $500 or more, is effected by means of fire or explosives, or is otherwise feloniously caused.\nOrdinance Nos. 5039 (1987); 7129 (2001)"
  },
  {
    "corpus": "BRC",
    "title": "5",
    "title_name": "General Offenses",
    "chapter": "4",
    "chapter_name": "Offenses Against Property",
    "anchor": "5-4-2",
    "heading": "Damaging Public Property.",
    "verbatim": "5-4-2. Damaging Public Property.\n(a)\tNo person shall damage, move, remove, destroy, drill a hole in, dig, or injure in any manner whatsoever any grass, tree, shrub, plant, flower, soil, rock, or other natural object, railing, bridge, culvert, sign, building, equipment, bolt, archeological, historic, or cultural object or any other property whatsoever belonging to the city or under the possession and control of the city, unless done pursuant to a written permit or contract from the city manager.\n(b)\tThis section does not apply where damage knowingly caused in the course of a single criminal episode is $500 or more, is effected by means of fire or explosives or is otherwise feloniously caused.\nOrdinance Nos. 5389 (1991); 7129 (2001)"
  },
  {
    "corpus": "BRC",
    "title": "5",
    "title_name": "General Offenses",
    "chapter": "4",
    "chapter_name": "Offenses Against Property",
    "anchor": "5-4-3",
    "heading": "Trespass.",
    "verbatim": "5-4-3. Trespass.\nNo person shall:\n(a)\tEnter or remain upon land or premises other than a dwelling of another in defiance of a legal request or order by the owner or some other authorized person; or\n(b)\tEnter into or upon land or a building other than a dwelling that is posted, locked, or otherwise fenced or enclosed in such a manner that a reasonably prudent person would understand that the owner does not want any such person on the land or in the building."
  },
  {
    "corpus": "BRC",
    "title": "5",
    "title_name": "General Offenses",
    "chapter": "4",
    "chapter_name": "Offenses Against Property",
    "anchor": "5-4-4",
    "heading": "Trespass to a Motor Vehicle.",
    "verbatim": "5-4-4. Trespass to a Motor Vehicle.\nNo person shall enter any motor vehicle of another without permission of the owner. It is a specific defense to a charge under this section that the defendant had permission of the owner's agent for the entry, that the entry was for a brief period of time to secure the vehicle from harm, or was directed or authorized by a public official. This section does not apply where the entry was made with the intent to steal anything of value or where the vehicle was parked on the property of the defendant or of the defendant's principal."
  },
  {
    "corpus": "BRC",
    "title": "5",
    "title_name": "General Offenses",
    "chapter": "4",
    "chapter_name": "Offenses Against Property",
    "anchor": "5-4-5",
    "heading": "Trespass on Public Buildings.",
    "verbatim": "5-4-5. Trespass on Public Buildings.\n(a)\tNo person shall climb on any building or other structure belonging to the city or under the possession and control of the city or any portion thereof not designed for such activity, or on any shrub or tree growing on the mall.\n(b)\tNo person shall attach or secure any object to mall property not specifically designed for such purpose without first obtaining authorization from the city manager.\n(c)\tNo person shall climb on any structure on the mall belonging to the city or under the possession and control of the city or any portion thereof not specifically designed for such purpose without first obtaining authorization from the city manager.\nOrdinance No. 4922 (1985)"
  },
  {
    "corpus": "BRC",
    "title": "5",
    "title_name": "General Offenses",
    "chapter": "4",
    "chapter_name": "Offenses Against Property",
    "anchor": "5-4-6",
    "heading": "Trespass on Public Property.",
    "verbatim": "5-4-6. Trespass on Public Property.\nNo person shall enter any property belonging to the city or under the possession and control of the city that is fenced or otherwise enclosed in a manner designed to exclude intruders or is posted with signs at intervals of not more than four hundred forty yards that forbid entry."
  },
  {
    "corpus": "BRC",
    "title": "5",
    "title_name": "General Offenses",
    "chapter": "4",
    "chapter_name": "Offenses Against Property",
    "anchor": "5-4-7",
    "heading": "Grazing on Public Property.",
    "verbatim": "5-4-7. Grazing on Public Property.\nNo person shall knowingly cause or permit any domesticated animal that such person owns, possesses, or controls, including, without limitation, cows, goats, llamas, burros, mules, horses, pigs, or sheep, to graze, pasture, or run at large, or to be driven or herded within any property belonging to the city or under the possession and control of the city, except pursuant to a written permit from the city manager.\nOrdinance Nos. 7831 (2012); 7965 (2014)"
  },
  {
    "corpus": "BRC",
    "title": "5",
    "title_name": "General Offenses",
    "chapter": "4",
    "chapter_name": "Offenses Against Property",
    "anchor": "5-4-8",
    "heading": "Rolling or Throwing Rocks on Public Property.",
    "verbatim": "5-4-8. Rolling or Throwing Rocks on Public Property.\nNo person shall roll, throw, or otherwise move any rocks or boulders on any public property. But this section does not apply to city employees acting within the scope of their employment.\nOrdinance Nos. 7831 (2012); 7965 (2014)"
  },
  {
    "corpus": "BRC",
    "title": "5",
    "title_name": "General Offenses",
    "chapter": "4",
    "chapter_name": "Offenses Against Property",
    "anchor": "5-4-9",
    "heading": "Unauthorized Research Projects.",
    "verbatim": "5-4-9. Unauthorized Research Projects.\nNo person shall conduct any research project that includes marking, tagging, sampling, trapping, or removing any soil, rock, fossil, tree, shrub, plant, flower, or wildlife or that includes the construction of a physical grid in or on any property belonging to the city or under the possession and control of the city, except pursuant to a written permit from the city manager.\nOrdinance Nos. 7831 (2012); 7965 (2014)"
  },
  {
    "corpus": "BRC",
    "title": "5",
    "title_name": "General Offenses",
    "chapter": "4",
    "chapter_name": "Offenses Against Property",
    "anchor": "5-4-10",
    "heading": "Fires on Public Property.",
    "verbatim": "5-4-10. Fires on Public Property.\nNo person shall start or maintain or cause to be started or maintained any fire on any public property, park, parkway recreation area, open space, street, or public way, unless confined within a fire pit permanently erected by the city for such purpose. No person shall place, erect, build, or construct a fireplace, stove, or other fire container in any public property, park, parkway, recreation area, open space, or public way, except pursuant to a written permit from the city manager. For purposes of this section, public property means property belonging to the city or under the possession and control of the city.\nOrdinance No. 5187 (1989)"
  },
  {
    "corpus": "BRC",
    "title": "5",
    "title_name": "General Offenses",
    "chapter": "4",
    "chapter_name": "Offenses Against Property",
    "anchor": "5-4-11",
    "heading": "Polluting Streams.",
    "verbatim": "5-4-11. Polluting Streams.\nNo person shall wash dishes, empty waste liquids, or in any other manner pollute the water of any fountain, pond, lake, stream, or ditch on property belonging to the city or under the possession and control of the city."
  },
  {
    "corpus": "BRC",
    "title": "5",
    "title_name": "General Offenses",
    "chapter": "4",
    "chapter_name": "Offenses Against Property",
    "anchor": "5-4-12",
    "heading": "Depositing Trash on Property in Violation of Sign.",
    "verbatim": "5-4-12. Depositing Trash on Property in Violation of Sign.\n(a)\tNo person shall deposit or cause to be deposited any trash, refuse, garbage, or rubble in any receptacle designated or designed for the deposit of such materials without the express or implied consent of the owner or a person in possession and control of the property on which the receptacle is located.\n(b)\tFor purposes of this section, there is no such consent when the deposit contravenes a sign that is posted on or near the receptacle, has a minimum area of one-half square foot, contains at least one-inch lettering, clearly indicates the limitation, and is located so that it can be seen by an ordinarily observant person.\n(c)\tNothing in this section shall be construed to exempt a person posting a sign from complying with the sign code, Section 9-9-21, \"Signs,\" B.R.C. 1981.\nOrdinance Nos. 7831 (2012); 7965 (2014)"
  },
  {
    "corpus": "BRC",
    "title": "5",
    "title_name": "General Offenses",
    "chapter": "4",
    "chapter_name": "Offenses Against Property",
    "anchor": "5-4-13",
    "heading": "Littering.",
    "verbatim": "5-4-13. Littering.\n(a)\tNo person shall deposit, leave, dump, or cause to be deposited, left, or dumped any trash, refuse, garbage, or rubble on any public or private property other than within those containers specifically designated for the deposit of such materials.\n(b)\tNo driver of any vehicle, other than a vehicle carrying passengers for hire, shall fail to prevent any passenger in the driver's vehicle from violating Subsection (a) of this section.\n(c)\tNo owner of any private real property, no resident manager, local agent of any real property appointed by the owner pursuant to Section 10-3-14, \"Local Agent Required,\" B.R.C. 1981, as shown in the records of the city, and no private tenant of any real property shall fail to prevent any trash, refuse, garbage, or rubble which had been deposited, left, or dumped outdoors upon such real property from being moved, whether by wind, water, animals, or any other cause, onto the property of another. It is a specific defense to a charge of violating this subsection that the trash, refuse, garbage, or rubble was placed upon the responsible person's property by persons who did not have implied or express permission to be on that property, and that the responsible person did not have a reasonable time to clean it up. This subsection does not apply to material subsequently moved onto property with the express prior permission of the owner of the recipient property.\n(d)\tNo person shall deposit, leave, dump, or cause to be deposited, left, or dumped any trash, refuse, garbage, or rubble in any designated container in any city park, recreation area, or open space unless such material originated from any lawful activity in such area.\n(e)\tIt is a specific defense to a violation of Subsection (a) of this section that the owner of private property gave the defendant permission to perform the acts proscribed in this section.\n(f)\tThis section does not apply to the distribution of literature on private property in the exercise of First Amendment rights under the United States Constitution when such literature is placed in reasonable quantities at reasonable locations designed to reach the attention of the occupant of the property.\n(g)\tThis section does not apply to deposit of hazardous wastes in violation of § 18-13-112, C.R.S.\nOrdinance Nos. 5660 (1994); 7831 (2012); 7965 (2014)"
  },
  {
    "corpus": "BRC",
    "title": "5",
    "title_name": "General Offenses",
    "chapter": "4",
    "chapter_name": "Offenses Against Property",
    "anchor": "5-4-14",
    "heading": "Graffiti Prohibited.",
    "verbatim": "5-4-14. Graffiti Prohibited.\n(a)\tGraffiti A Nuisance: Graffiti is hereby determined to be a nuisance because its continued existence constitutes a visual blight upon the area in which it is located and acts as a catalyst for other antisocial behavior. Prompt removal is the greatest disincentive to graffiti and minimizes the blight and related effects created by graffiti.\n(b)\tGraffiti Defined: Graffiti means the intentional painting, scratching, or coloring (with any contrast medium whatsoever) of any public or private property except by permission of the owner of private property, the city manager, in the case of city property, or the supervisory officer of any other public property.\n(c)\tGraffiti Prohibited: No person shall place graffiti upon any property.\n(d)\tObligation of Owner of Commercial Property to Remove Graffiti: No person owning any vacant land or any structure or personal property (including, without limitation, dumpsters) used for commercial or industrial purposes or any rental housing shall fail to remove graffiti from such property within three working days of the time such person knows, or reasonably should have known, either directly or through such owner's agents, of such graffiti.\n(e)\tAuthority of City to Enter and Remove Graffiti From Any Property:\n(1)\tThe city manager may enter onto private property and remove or paint over graffiti, if the manager first attempts to notify the affected property owner and provide such property owner with an opportunity to eradicate the graffiti. Such notice must be given or mailed no later than seventy-two hours prior to removing or painting over the graffiti.\n(2)\tIf a property owner does not eradicate the graffiti, or make arrangements satisfactory to the city manager for the eradication of such graffiti, within three working days of actual notice or mailed notice, the city manager may enter and remove or paint over the graffiti. If, prior to such entry, the city manager determines that entry onto the property is opposed by the property owner or will be technically difficult or if the city manager wishes to clarify the appropriate nature and conditions of entry upon the land, the city manager may submit an affidavit to the municipal court in support of a request for an administrative warrant to authorize entry upon the property to remove graffiti. Such affidavit shall set forth probable cause to believe that graffiti exists on the property and shall specify that the owner of the property has not eradicated the graffiti following notice to do so. Upon receipt of such affidavit and determination of probable cause, the municipal court shall issue a warrant authorizing the manager or the manager's agents to enter upon the property as needed to eradicate graffiti.\n(3)\tIf, pursuant to the provisions of this subsection, the city manager removes graffiti from private property by painting over it, the manager shall not be required to use paint that matches preexisting paint in color or kind. In this regard, it is legislatively determined that the eradication of graffiti with contrasting paint does not damage private property more than does the continued presence of such graffiti on that property.\n(4)\tNo graffiti removal by the city manager authorized by this subsection shall, without property owner permission, extend to areas not visible to the public.\n(5)\tNothing in this section shall impose a duty upon the city manager to remove or eradicate graffiti. Nothing in this section shall prevent the manager from giving additional notice to agents of the property owner, should it appear to the manager that such extra notice is likely to produce prompt removal of the graffiti.\n(f)\tReimbursement to City for Removal of Graffiti: Any person required by Subsection (d) of this section to remove graffiti who fails to remove the graffiti may be charged the reasonable costs of such removal by the city manager if the city removes it pursuant to Subsection (e) of this section. However, reimbursement of city expenses for graffiti removal shall not be required unless the following procedures are used:\n(1)\tNotice of the obligation to remove graffiti, and of the possibility that reimbursement may be sought if the city manager removes the graffiti, shall be provided to the owner of the property upon which the graffiti is located personally or by the deposit of such notice in the United States mail, postage prepaid, and addressed to the owner thereof at the owner's address as the same appears on the most recent assessment roll of the Boulder County Assessor.\n(2)\tIn the event that a notice to remove is also given to the person in possession or control of the property, such notice shall be provided in the manner specified in this subsection with respect to giving notice to the owner of the property, and may be addressed to \"occupant\" or \"to whom it may concern,\" if the name of such person is not known.\n(3)\tUpon removal of graffiti by the city after the notice required by this subsection, if the city manager determines to seek reimbursement the manager shall deliver a demand for reimbursement to the owner of the property detailing:\n(A)\tThe reason that the removal was required;\n(B)\tThe date upon which the removal was accomplished; and\n(C)\tThe cost of doing such work.\nThe demand for reimbursement for the costs of graffiti removal shall be provided to the owner of the property upon which the graffiti was located personally or by the deposit of such demand in the United States mail, postage prepaid, and addressed to the owner thereof at the owner's address as the same appears on the most recent assessment roll of the Boulder County Assessor.\n(4)\tThe owner of any property from which graffiti has been removed and who has received a demand for reimbursement pursuant to this section shall make such payment within forty-five days of date upon which the demand was deposited into the United States mail, or if it is shorter, within thirty days of the date upon which such owner received personal service of such report and demand. However, the city manager may enter into an agreement with a property owner for payment to be made on some other mutually agreed date or schedule.\n(5)\tThe owner of any property upon whom a demand for reimbursement has been made under this subsection may challenge the requirement of reimbursement or the amount demanded, or both, pursuant to the procedures prescribed by Chapter 1-3, \"Quasi-Judicial Hearings,\" B.R.C. 1981. However, a demand for such a quasi-judicial hearing must be made within forty-five days of date upon which the demand for reimbursement was deposited into the United States mail, or, if it is shorter, within thirty days of that date upon which such owner received personal service of such a demand.\n(6)\tIf any person fails or refuses to pay when due any charge for reimbursement imposed under this section, the city manager may, in addition to taking other collection remedies, certify due and unpaid charges to the Boulder County Treasurer for collection as provided by Section 2-2-12, \"City Manager May Certify Taxes, Charges, and Assessments to County Treasurer for Collection,\" B.R.C. 1981.\nOrdinance Nos. 5186 (1989); 7146 (2001)"
  },
  {
    "corpus": "BRC",
    "title": "5",
    "title_name": "General Offenses",
    "chapter": "4",
    "chapter_name": "Offenses Against Property",
    "anchor": "5-4-15",
    "heading": "Posting Signs on Property of Another Prohibited.",
    "verbatim": "5-4-15. Posting Signs on Property of Another Prohibited.\n(a)\tNo person shall post a sign in the public right of way or on any other public property except on a kiosk or public bulletin board meant solely for posting signs. No beneficiary of any such sign shall fail to prevent the violation of this section. This prohibition does not extend to persons employed or authorized by the public property's owner and acting within the scope of their employment or authority.\n(b)\tNo person shall post a sign on private property without the express permission of the owner thereof. This prohibition does not extend to communications intended solely for the owner or occupant of the private property whose posting does not damage that property nor require a trespass.\n(c)\tFor the purposes of this section:\nBeneficiary of a sign means a person who is the intended recipient of the benefit brought about by the posting of a sign in the downtown DT zone and in that portion of the P zone adjacent thereto, or in the University Hill BC-2 zone adjacent to Broadway and College, and includes, without limitation, any business whose premises are specified in such sign.\nKiosk means a freestanding structure located within a pedestrian circulation area used for posting of notices or advertisement of goods.\nPost means to affix in any manner, including, without limitation, nailing, tacking, taping, tying, gluing, pasting, painting, staking, marking, or writing.\nSign has the meaning given in Section 9-16-1, \"General Definitions,\" B.R.C. 1981.\nOrdinance Nos. 6017 (1998); 7522 (2007); 7831 (2012); 7965 (2014)"
  },
  {
    "corpus": "BRC",
    "title": "5",
    "title_name": "General Offenses",
    "chapter": "4",
    "chapter_name": "Offenses Against Property",
    "anchor": "5-4-16",
    "heading": "Outdoor Furniture Restriction.",
    "verbatim": "5-4-16. Outdoor Furniture Restriction.\n(a)\tNo person shall place, use, keep, store, or maintain any upholstered furniture not manufactured for outdoor use, including, without limitation, upholstered chairs, upholstered couches, and mattresses, in any outside areas located in the following places:\n(1)\tIn any front yard;\n(2)\tIn any side yard;\n(3)\tIn any rear yard or other yard that is adjacent to a public street. However, an alley shall not be considered a \"public street\" for the purpose of this subsection; or\n(4)\tOn any covered or uncovered porch located in or adjacent to any of the yards described in Paragraphs (a)(1) through (a)(3) of this section.\n(b)\tThe provisions of this section shall apply within the following described area: Those portions of the University Hill neighborhood bordered by Baseline Road on the south, Arapahoe Road on the north, Broadway on the east, and on the west by the western boundary lines of those properties located on the west side of Ninth Street.\n(c)\tFor the purpose of this section, yards are defined as follows:\n(1)\tThe terms front yard, rear yard, and side yard refer to the open space between buildings and property lines at the front, rear, and sides of a property, respectively.\n(2)\tA side yard extends the full length of a lot as if a line running along the edge of a building was extended to intersect with the rear property line.\n(3)\tOn a corner lot, the open space adjacent to the shorter street right of way shall be considered the front yard.\n(4)\tThe rear yard is that yard located on the opposite side of the lot from the front yard.\n(d)\tThe interior of any fully enclosed porch (including, without limitation, a porch enclosed by screening material) that cannot be accessed from outside except through a door that can be locked shall not be considered an outside area for the purpose of this section.\n(e)\tPlacement of upholstered furniture on balconies or porches located on the second floor, or any floor above the second floor, of a building is not precluded by the provisions of this section.\n(f)\tThe following shall constitute specific defenses to any alleged violation of this provision:\n(1)\tThat such furniture was placed in an outside location in order to allow it to be moved during a move of a resident or residents or removed as part of a trash or recycling program on a day scheduled for such moving or removal.\n(2)\tThat such furniture was located in a yard other than a front yard and was placed in such a manner that it could not be seen from ground level by a person located on a public right of way (excluding public alleys) and that it was not visible by such a person unless that person took extraordinary steps such as climbing a ladder or peering over a screening fence in order to achieve a point of vantage.\n(3)\tThat such furniture was temporarily placed in an outside location in order that it be offered for sale at a yard or garage sale if each of the following conditions exists:\n(A)\tThe furniture is located in an outside location only during the hours of 8 a.m. and 6 p.m.\n(B)\tThe person attempting to sell the furniture, or that person's agent, is outside during the period of the yard or garage sale in order to monitor the sale.\n(C)\tA sign is placed on or near the furniture indicating that it is for sale.\n(D)\tThis defense shall not apply if upholstered furniture is located in an outside location for more than two days in any six-month period.\n(g)\tIf the city manager finds that any upholstered furniture exists on any property in violation of this section, the manager may require that the owner and the lessee, agent, occupant, or other person in possession or control of the property correct the violation and bring the property into conformity with this section, using the following procedure:\n(1)\tThe manager shall notify the owner and the lessee, agent, occupant, or other person in possession or control of the property that such persons have seven days from the date of the notice to make such corrections. Notice under this subsection is sufficient if it is deposited in the mail, first class, to the last known owner of the property on the records of the Boulder County Assessor and to the last known address of the lessee, agent, occupant, or person in possession or control of the property.\n(2)\tIf the person notified fails to correct the violation as required by the notice prescribed by Paragraph (g)(1) of this section, the manager may correct the violation by removing and disposing of the upholstered furniture and charge the costs thereof, plus an additional amount of $25 for administrative costs, to the owner and to the lessee, agent, occupant, or other person in possession and control of the property.\n(3)\tIf any property owner fails or refuses to pay when due any charge imposed under this section, the manager may, in addition to taking other collection remedies, certify due and unpaid charges, including interest, to the Boulder County Treasurer to be levied against the person's property for collection by the county in the same manner as delinquent general taxes upon such property are collected as provided by Section 2-2-12, \"City Manager May Certify Taxes, Charges, and Assessments to County Treasurer for Collection,\" B.R.C. 1981.\nOrdinance Nos. 7125 (2002); 7360 (2004)"
  },
  {
    "corpus": "BRC",
    "title": "5",
    "title_name": "General Offenses",
    "chapter": "5",
    "chapter_name": "Offenses Against Government Operations",
    "anchor": "5-5-1",
    "heading": "Obstructing Government Operations.",
    "verbatim": "5-5-1. Obstructing Government Operations.\n(a)\tNo person shall knowingly obstruct, impair, or hinder the performance of a governmental function by a public servant by using or threatening to use violence, force, or physical interference or obstacle.\n(b)\tIt is an affirmative defense to violation of this section that:\n(1)\tThe obstruction, impairment, or hindrance was of unlawful action by a public servant;\n(2)\tThe obstruction, impairment, or hindrance was of the making of an arrest; or\n(3)\tThe obstruction, impairment, or hindrance was by lawful activities in connection with a labor dispute with the government."
  },
  {
    "corpus": "BRC",
    "title": "5",
    "title_name": "General Offenses",
    "chapter": "5",
    "chapter_name": "Offenses Against Government Operations",
    "anchor": "5-5-2",
    "heading": "Resisting Arrest.",
    "verbatim": "5-5-2. Resisting Arrest.\n(a)\tNo person shall knowingly prevent or attempt to prevent a police officer acting under color of official authority from effecting an arrest of the actor or another by:\n(1)\tUsing or threatening to use physical force or violence against the police officer or another;\n(2)\tUsing any other means that creates a substantial risk of causing bodily injury to the police officer or another; or\n(3)\tFleeing from the police officer after being ordered to stop in a manner that would indicate to a reasonable person that the police officer was ordering such person to stop.\n(b)\tIt is no defense to a prosecution under this section that the police officer was attempting to make an arrest that in fact was unlawful if the police officer was acting under color of official authority and in attempting to make the arrest such officer was not resorting to unreasonable or excessive force giving rise to the right of self-defense. A police officer acts under color of official authority when, in the regular course of assigned duties, such officer is called upon to make, and does make, a judgment in good faith based upon surrounding facts and circumstances that an arrest should be made.\n(c)\tThe term police officer as used in this section means a police officer in uniform or a police officer out of uniform who has identified himself or herself by exhibiting police officer credentials to the person whom such officer is attempting to arrest."
  },
  {
    "corpus": "BRC",
    "title": "5",
    "title_name": "General Offenses",
    "chapter": "5",
    "chapter_name": "Offenses Against Government Operations",
    "anchor": "5-5-3",
    "heading": "Obstructing a Peace Officer or Firefighter.",
    "verbatim": "5-5-3. Obstructing a Peace Officer or Firefighter.\n(a)\tNo person shall, by using or threatening to use violence, force, or physical interference or obstacle knowingly obstruct, impair, or hinder the enforcement of the law or the preservation of the peace by a peace officer, acting under color of official authority or knowingly obstruct, impair, or hinder the prevention, control, or abatement of fire or other emergency action by a firefighter, acting under color of official authority.\n(b)\tNo person, upon being ordered by a police officer to move to a distance of eight feet from the police officer, or to a specific place which is no more than eight feet from the officer, while the officer is investigating what the officer reasonably suspects is a crime or violation of this code, is interviewing a suspect or potential witness, or is making an arrest, shall fail to comply with such order.\n(c)\tIt is no defense to a prosecution under this section that the police officer was attempting to make an arrest that in fact was unlawful if the police officer was acting under color of official authority and in attempting to make the arrest such officer was not resorting to unreasonable or excessive force giving rise to the right of self-defense. A police officer acts \"under color of official authority\" when, in the regular course of assigned duties, such officer is called upon to make, and does make, a judgment in good faith based upon surrounding facts and circumstances that an arrest should be made.\n(d)\tThe term police officer as used in this section means a police officer in uniform or a police officer out of uniform who has identified himself or herself by exhibiting police officer credentials to the person whom such officer is attempting to arrest.\nOrdinance Nos. 4879 (1984); 7129 (2001)"
  },
  {
    "corpus": "BRC",
    "title": "5",
    "title_name": "General Offenses",
    "chapter": "5",
    "chapter_name": "Offenses Against Government Operations",
    "anchor": "5-5-4",
    "heading": "Refusal to Permit Inspections.",
    "verbatim": "5-5-4. Refusal to Permit Inspections.\n(a)\tNo person, knowing that a public servant is legally authorized to inspect property, shall:\n(1)\tRefuse to produce or make available the property for inspection at a reasonable hour; or\n(2)\tRefuse to permit the inspection at a reasonable hour if the property is available for inspection.\n(b)\tFor purposes of this section, property means any real or personal property, including, without limitation, books, records, and documents that are owned, possessed, or otherwise subject to the control of the defendant. A legally authorized inspection means any lawful search, sampling, testing, or other examination of property, in connection with the regulation of a specific business or occupation, that is authorized by an ordinance, statute, or lawful regulatory provision regulating such business or occupation, or by a search warrant.\nOrdinance Nos. 7831 (2012); 7965 (2014)"
  },
  {
    "corpus": "BRC",
    "title": "5",
    "title_name": "General Offenses",
    "chapter": "5",
    "chapter_name": "Offenses Against Government Operations",
    "anchor": "5-5-5",
    "heading": "Refusing to Aid a Police Officer.",
    "verbatim": "5-5-5. Refusing to Aid a Police Officer.\nNo person who is eighteen years of age or older, upon command by an individual known to such person to be a police officer, shall unreasonably refuse or fail to aid the police officer in effecting or securing an arrest or preventing the commission by another of any violation."
  },
  {
    "corpus": "BRC",
    "title": "5",
    "title_name": "General Offenses",
    "chapter": "5",
    "chapter_name": "Offenses Against Government Operations",
    "anchor": "5-5-6",
    "heading": "Compounding.",
    "verbatim": "5-5-6. Compounding.\n(a)\tNo person shall accept or agree to accept any pecuniary benefit as consideration for:\n(1)\tRefraining from seeking prosecution of a violator; or\n(2)\tRefraining from reporting to law enforcement authorities the commission or suspected commission of any violation or information relating to a violation.\n(b)\tIt is a specific defense to prosecution under this section that the benefit received by the accused did not exceed an amount that the accused reasonably believed to be due as restitution or indemnification to such accused for the damage caused by the violation."
  },
  {
    "corpus": "BRC",
    "title": "5",
    "title_name": "General Offenses",
    "chapter": "5",
    "chapter_name": "Offenses Against Government Operations",
    "anchor": "5-5-7",
    "heading": "Impersonating a Peace Officer.",
    "verbatim": "5-5-7. Impersonating a Peace Officer.\nRepealed.\nOrdinance No. 7589 (2008)"
  },
  {
    "corpus": "BRC",
    "title": "5",
    "title_name": "General Offenses",
    "chapter": "5",
    "chapter_name": "Offenses Against Government Operations",
    "anchor": "5-5-8",
    "heading": "Impersonating a Public Servant.",
    "verbatim": "5-5-8. Impersonating a Public Servant.\n(a)\tNo person shall falsely represent in any manner whatsoever to another that the actor is a public servant of the city and perform any act in that pretended capacity.\n(b)\tIt is no defense to a prosecution under this section that the office the actor pretended to hold did not in fact exist."
  },
  {
    "corpus": "BRC",
    "title": "5",
    "title_name": "General Offenses",
    "chapter": "5",
    "chapter_name": "Offenses Against Government Operations",
    "anchor": "5-5-9",
    "heading": "Abuse of Public Record.",
    "verbatim": "5-5-9. Abuse of Public Record.\n(a)\tNo person shall:\n(1)\tKnowingly make a false entry in or falsely alter any public record;\n(2)\tKnowing that such person lacks the authority to do so, knowingly destroy, mutilate, conceal, remove, or impair the availability of any public record; or\n(3)\tKnowing that such person lacks the authority to retain the record, refuse to deliver up a public record in such person's possession upon proper request of any individual lawfully entitled to receive such record.\n(b)\tAs used in this section, the term public record includes, without limitation, all official books, papers, or records created, received, or used by or in any city office or agency."
  },
  {
    "corpus": "BRC",
    "title": "5",
    "title_name": "General Offenses",
    "chapter": "5",
    "chapter_name": "Offenses Against Government Operations",
    "anchor": "5-5-10",
    "heading": "False Reports.",
    "verbatim": "5-5-10. False Reports.\n(a)\tNo person shall:\n(1)\tMake a report or knowingly cause the transmission of a report to any peace officer or other city official of a crime or other incident when such person knows that it did not occur; or\n(2)\tMake a report or knowingly cause the transmission of a report to any peace officer or other city official pretending to furnish information relating to a violation or other incident when such person knows that he or she has no such information or knows that such information is false, including, without limitation, a false alarm of a fire.\n(b)\tThis section does not apply to false reports concerning explosives in violation of § 18-8-110, C.R.S."
  },
  {
    "corpus": "BRC",
    "title": "5",
    "title_name": "General Offenses",
    "chapter": "5",
    "chapter_name": "Offenses Against Government Operations",
    "anchor": "5-5-11",
    "heading": "Accessory to a Violation.",
    "verbatim": "5-5-11. Accessory to a Violation.\n(a)\tNo person shall, with intent to hinder, delay, or prevent the discovery, detection, apprehension, prosecution, conviction, or punishment of another for the commission of a violation, render assistance to such person.\n(b)\tRender assistance means to:\n(1)\tHarbor or conceal the other;\n(2)\tWarn such person of impending discovery or apprehension, but this does not apply to a warning given in an effort to bring such person into compliance with the law;\n(3)\tProvide such person with money, transportation, weapon, disguise, or other thing to be used in avoiding discovery or apprehension;\n(4)\tObstruct, by force, intimidation, or deception, anyone in the performance of any act if there is a reasonable probability that such act will aid in the discovery, detection, apprehension, prosecution, conviction, or punishment of such person; or\n(5)\tConceal, destroy, or alter any physical evidence if there is a reasonable probability that such evidence will aid in the discovery, detection, apprehension, prosecution, conviction, or punishment of such person.\nOrdinance No. 5187 (1989)"
  },
  {
    "corpus": "BRC",
    "title": "5",
    "title_name": "General Offenses",
    "chapter": "5",
    "chapter_name": "Offenses Against Government Operations",
    "anchor": "5-5-12",
    "heading": "Duty to Report Fires.",
    "verbatim": "5-5-12. Duty to Report Fires.\n(a)\tNo person, knowing or reasonably believing that a fire exists, shall fail to turn in an alarm of such fire without delay.\n(b)\tIt is a specific defense to a charge of violating this section that the person was acting pursuant to a written waiver from the city manager. The manager may waive the requirements of Subsection (a) of this section if the manager finds that the person provides a satisfactory alternative fire control program that provides no less protection than the city fire control program."
  },
  {
    "corpus": "BRC",
    "title": "5",
    "title_name": "General Offenses",
    "chapter": "5",
    "chapter_name": "Offenses Against Government Operations",
    "anchor": "5-5-13",
    "heading": "Refusing to Aid Firefighter.",
    "verbatim": "5-5-13. Refusing to Aid Firefighter.\nNo person who is eighteen years of age or older, upon command by an individual known by such person to be a firefighter, shall unreasonably refuse or fail to aid the firefighter in suppressing or extinguishing a fire or in any other emergency."
  },
  {
    "corpus": "BRC",
    "title": "5",
    "title_name": "General Offenses",
    "chapter": "5",
    "chapter_name": "Offenses Against Government Operations",
    "anchor": "5-5-14",
    "heading": "Disobeying Order of Firefighter.",
    "verbatim": "5-5-14. Disobeying Order of Firefighter.\nNo person shall disobey any lawful order of a firefighter or enter any restricted area lawfully delineated by a firefighter."
  },
  {
    "corpus": "BRC",
    "title": "5",
    "title_name": "General Offenses",
    "chapter": "5",
    "chapter_name": "Offenses Against Government Operations",
    "anchor": "5-5-15",
    "heading": "Breaking Into Animal Pound.",
    "verbatim": "5-5-15. Breaking Into Animal Pound.\nNo person shall break or open any pound, pen, corral, or other enclosure in which any animal is impounded under the provisions of this code or other ordinance of the city or take any animal from such place without permission from the city manager after payment of all applicable fees."
  },
  {
    "corpus": "BRC",
    "title": "5",
    "title_name": "General Offenses",
    "chapter": "5",
    "chapter_name": "Offenses Against Government Operations",
    "anchor": "5-5-16",
    "heading": "Tampering With Boot.",
    "verbatim": "5-5-16. Tampering With Boot.\n(a)\tNo person other than the city manager or the manager's agent shall remove the boot described in Section 2-6-8, \"Booting,\" B.R.C. 1981, from any vehicle on which it has been installed.\n(b)\tNo person shall move any vehicle after it has been booted but before the boot has been removed by the city manager.\n(c)\tIn any prosecution for violation of this section, upon proof that the defendant owned the vehicle at the time the boot was installed and that the boot was removed or the vehicle moved before the vehicle was removed from the scofflaw list, it shall be a rebuttable presumption that the accused removed the boot or moved the vehicle or aided, abetted, or advised the person who did so.\nOrdinance Nos. 5187 (1989); 5271 (1990)"
  },
  {
    "corpus": "BRC",
    "title": "5",
    "title_name": "General Offenses",
    "chapter": "5",
    "chapter_name": "Offenses Against Government Operations",
    "anchor": "5-5-17",
    "heading": "Crossing Police Line.",
    "verbatim": "5-5-17. Crossing Police Line.\n(a)\tNo person shall cross or unlawfully remain within a police line established under Section 2-4-9, \"Police Lines,\" B.R.C. 1981.\n(b)\tIt is a specific defense to a charge of violation of this section that the person was a person for whose protection the line was established, or a peace officer, firefighter, or other person whose assistance in dealing with an emergency has been requested by the public employee in command of the incident.\nOrdinance Nos. 4980 (1986); 7129 (2001)"
  },
  {
    "corpus": "BRC",
    "title": "5",
    "title_name": "General Offenses",
    "chapter": "5",
    "chapter_name": "Offenses Against Government Operations",
    "anchor": "5-5-18",
    "heading": "Suspension of Facility Privileges.",
    "verbatim": "5-5-18. Suspension of Facility Privileges.\n(a)\tThe city manager may suspend the privilege of any person to enter, use, or remain on the premises of any facility owned or managed by the city who has violated any provision of this code, ordinance of the city, order of the presiding officer of any public meeting, or other law or a rule issued pursuant to Chapter 1-4, \"Rulemaking,\" B.R.C. 1981, or posted on the premises of the facility by the manager, if such person's conduct constitutes a hazard to the health, safety, or welfare of the users of, or visitors to, the facility. Any person so suspended shall immediately leave the facility.\n(b)\tThe suspension period shall be reasonably related to the severity of the offense and its danger to public health, safety, and welfare, and shall not, except for sexual offenses, exceed one year. The manager may also consider any criminal convictions of the offender and any prior suspensions under this code. If the suspension period does not begin and end on the day of violation, the manager shall provide the person with a written notice specifying the provision violated, the facility covered by the suspension, the period of suspension, and the opportunity for a hearing thereafter to contest the suspension or its duration, or both, under the procedures prescribed by Chapter 1-3, \"Quasi-Judicial Hearings,\" B.R.C. 1981. If requested by the person, such hearing shall be held as soon as practical, but not later than five days, weekends and holidays excluded, of a request therefor. Unless stated otherwise in the order of suspension, suspensions are effective immediately whether or not appealed.\n(c)\tA person suspended for only the remainder of the day of violation may appeal the suspension under the provisions of Chapter 1-3, \"Quasi-Judicial Hearings,\" B.R.C. 1981, if the appeal is filed with the manager within ten days of the date of suspension.\n(d)\tAs an additional restriction, the manager, after notice to the offender and an opportunity for a hearing under the provisions of Chapter 1-3, \"Quasi-Judicial Hearings,\" B.R.C. 1981, may suspend the privilege of the person to use other similar facilities if the person's conduct, if engaged in those other facilities, would constitute grounds for suspension under Subsection (a) of this section. If the manager offers the offender the opportunity for a hearing on the question of suspension from similar facilities immediately, or otherwise within a time less than ten days, and the offender requests a continuance of such hearing to a later date, such hearing may be continued in the sound exercise of the manager's discretion, but in the interim such person is suspended from use of the facilities specified in the manager's notice under this subsection.\n(e)\tThe following additional provisions apply to suspensions for sexual offenses:\n(1)\tFor the purposes of this section, sexual offenses means any offense defined in part 4, \"Unlawful Sexual Behavior,\" of title 18, C.R.S., or any other crime defined in the statutes of the state which include sexual assault or attempted sexual assault as an element, and also includes any of the crimes defined as an \"unlawful sexual offense\" in §§ 18-3-411 and 412, C.R.S., as those statutes now read and as they may be amended in the future.\n(2)\tA suspension for more than a year may be imposed only after notice and an opportunity for a hearing under the provisions of Chapter 1-3, \"Quasi-Judicial Hearings,\" B.R.C. 1981, but the city manager may, after notice given within thirty days of a suspension for no more than a year, hold a hearing on the question of extending the suspension for more than a year.\n(3)\tAny person suspended for more than five years may, after five years, petition the manager to end the suspension on the grounds that the person has been fully rehabilitated and has been definitively cured of any mental or behavioral disorder associated with the relevant prior conduct. The manager shall hold a hearing on such petition under the provisions of Chapter 1-3, \"Quasi-Judicial Hearings,\" B.R.C. 1981. Before such hearing the manager may require the petitioner to undergo an examination by a psychiatrist or clinical psychologist of the manager's choice, and may require that the examiner present the results at the hearing, all at the petitioner's expense. The manager may require the petitioner to advance the estimated cost of examination and professional testimony. The manager may direct the police chief or any other city employee not a supervisor of the hearing officer to investigate a petitioner's claim of rehabilitation and cure and to report and present evidence and testimony at the hearing. The manager shall also give notice, to the extent practical, to any victim and complaining witness related to the original suspension, and shall permit such persons to give testimony at the hearing concerning rehabilitation and cure. The burden is on the petitioner to show rehabilitation and cure. Denial of such a petition shall preclude any further petition for an additional five years.\n(f)\tThe city manager may, pursuant to Chapter 1-4, \"Rulemaking,\" B.R.C. 1981, make procedural rules governing the suspension process under this section, and may make substantive rules governing the conduct of patrons in the facilities subject to this section so long as such rules are reasonably related to the public purposes of the facility, the protection of the health, safety, or welfare of the public, patrons, or staff of the facility, or the public property in or used by the facility.\n(g)\tNo person shall violate any order of the city manager suspending the privilege of using a facility.\nOrdinance Nos. 5757 (1995); 8617 (2024); 8687 (2025)"
  },
  {
    "corpus": "BRC",
    "title": "5",
    "title_name": "General Offenses",
    "chapter": "5",
    "chapter_name": "Offenses Against Government Operations",
    "anchor": "5-5-19",
    "heading": "False Application Prohibited.",
    "verbatim": "5-5-19. False Application Prohibited.\n(a)\tNo person who applies for a benefit, license, permit, grant, variance, special review, nonconforming use review, height review, solar access review, subdivision approval, planned unit development approval, zoning, rezoning, or for permission to do any other act or to alter any status for which approval by the city is required by this code or other law, shall recklessly make any false statement in writing on such application or in support of it thereafter, or orally to any city employee, board, or city council on any matter material to such application or the disposition thereof, nor shall such person recklessly omit or fail to state any fact material to such application.\n(b)\tThe city manager may deem any approval of such application void.\nOrdinance No. 7129 (2001)"
  },
  {
    "corpus": "BRC",
    "title": "5",
    "title_name": "General Offenses",
    "chapter": "5",
    "chapter_name": "Offenses Against Government Operations",
    "anchor": "5-5-20",
    "heading": "Unlawful Conduct on Public Property.",
    "verbatim": "5-5-20. Unlawful Conduct on Public Property.\n(a)\tIt is unlawful for any person to enter or remain in any public building or on any public property or to conduct himself or herself in or on the same in violation of any order, rule, or regulation concerning any matter prescribed in this subsection, limiting or prohibiting the use or activities or conduct in such public building or on such public property, issued by any officer or agency having the power of control, management, or supervision of the building or property. In addition to any authority granted by any other law, each such officer or agency may adopt such orders, rules, or regulations as are reasonably necessary for the administration, protection, and maintenance of such public buildings and property, specifically, orders, rules, and regulations upon the following matters:\n(1)\tPreservation of property, vegetation, wildlife, signs, markers, statues, buildings, and grounds, and other structures, and any object of scientific, historical, or scenic interest;\n(2)\tRestriction or limitation of the use of such public buildings or property as to time, manner, or permitted activities;\n(3)\tProhibition of activities or conduct within public buildings or on public property which may be reasonably expected to substantially interfere with the use and enjoyment of such places by others or which may constitute a general nuisance or which may interfere with, impair, or disrupt a funeral or funeral procession;\n(4)\tNecessary sanitation, health, and safety measures;\n(5)\tCamping and picnicking, public meetings and assemblages, and other individual or group usages, including the place, time, and manner in which such activities may be permitted;\n(6)\tUse of all vehicles as to place, time, and manner of use;\n(7)\tControl and limitation of fires, including but not limited to the prohibition, restriction, or ban on fires or other regulation of fires to avert the start of or lessen the likelihood of wildfire, and the designation of places where fires are permitted, restricted, prohibited, or banned.\n(b)\tNo conviction may be obtained under this section unless notice of such limitations or prohibitions is prominently posted at all public entrances to such building or on such property or unless such notice is actually first given the person by the officer or agency, including any agent thereof, or by any law enforcement officer having jurisdiction or authority to enforce this section.\n(c)\tAny violation of this section shall be considered a violation punishable pursuant to Section 5-2-4, \"General Penalties,\" B.R.C. 1981.\nOrdinance No. 7966 (2014)"
  },
  {
    "corpus": "BRC",
    "title": "5",
    "title_name": "General Offenses",
    "chapter": "6",
    "chapter_name": "Miscellaneous Offenses",
    "anchor": "5-6-1",
    "heading": "Unreasonable Noise.",
    "verbatim": "5-6-1. Unreasonable Noise.\nRepealed.\nOrdinance Nos. 5660 (1994); 7151 (2001); 7349 (2004); 7358 (2004)"
  },
  {
    "corpus": "BRC",
    "title": "5",
    "title_name": "General Offenses",
    "chapter": "6",
    "chapter_name": "Miscellaneous Offenses",
    "anchor": "5-6-2",
    "heading": "Excessive Sound Levels.",
    "verbatim": "5-6-2. Excessive Sound Levels.\nRepealed.\nOrdinance Nos. 4981 (1986); 5206 (1989); 5271 (1990); 5821 (1996); 5930 (1997); 7083 (2000); 7152 (2001); 7358 (2004)"
  },
  {
    "corpus": "BRC",
    "title": "5",
    "title_name": "General Offenses",
    "chapter": "6",
    "chapter_name": "Miscellaneous Offenses",
    "anchor": "5-6-3",
    "heading": "Unlawful Use of Vehicles as Residence.",
    "verbatim": "5-6-3. Unlawful Use of Vehicles as Residence.\nNo person shall occupy a vehicle upon any city street or streets or other public property if any of the purposes for such occupation is to use the vehicle as a permanent or temporary residence. Sleeping overnight upon any city street once in any seven-day period does not constitute use of the vehicle as a temporary residence.\nOrdinance Nos. 5546 (1993); 7831 (2012); 7965 (2014)"
  },
  {
    "corpus": "BRC",
    "title": "5",
    "title_name": "General Offenses",
    "chapter": "6",
    "chapter_name": "Miscellaneous Offenses",
    "anchor": "5-6-4",
    "heading": "Hotel and Motel Registration.",
    "verbatim": "5-6-4. Hotel and Motel Registration.\n(a)\tNo person who manages or keeps a hotel, motel, boarding house, rooming house, or lodging house in the city shall fail:\n(1)\tTo keep a book in which shall be registered shortly after arrival the name and residence address of each transient guest, and, if the guest is traveling in a motor vehicle, the license number and owner of such motor vehicle;\n(2)\tTo number the rooms available for transient guests;\n(3)\tTo record the number of the room occupied by any such guest in such register; and\n(4)\tTo maintain such register for three years and open it for inspection at all times to all federal, state, and local peace officers.\n(b)\tNo person shall register in other than such person's true name or by the name by which such person is generally known.\nOrdinance Nos. 7831 (2012); 7965 (2014)"
  },
  {
    "corpus": "BRC",
    "title": "5",
    "title_name": "General Offenses",
    "chapter": "6",
    "chapter_name": "Miscellaneous Offenses",
    "anchor": "5-6-5",
    "heading": "Juvenile Curfew.",
    "verbatim": "5-6-5. Juvenile Curfew.\n(a)\tNo person under sixteen years of age shall be or remain upon any public street, sidewalk, alley, or any public place or right of way between 11 p.m. and 5 a.m., except as provided in Subsection (b) of this section.\n(b)\tIn the following exceptional cases, a minor may be or remain in a public place beyond the hours set forth in Subsection (a) of this section:\n(1)\tWhen accompanied by a parent or legal guardian, a person between eighteen and twenty-one years of age with written parental authorization, or a person twenty-one years of age or older with parental authorization;\n(2)\tFor one-half hour before or after employment hours when commuting directly to and from such employment and when carrying an employer's certification of time and place of employment;\n(3)\tWhen conducting an errand directed by the parent or legal guardian;\n(4)\tWhen returning home from events such as movies, theater, or sporting events;\n(5)\tUntil 12:30 a.m. if the person is on the property or a sidewalk directly adjacent to a building in which such person resides or buildings immediately adjacent to the building in which such person resides; or\n(6)\tWhen exercising First Amendment rights under the United States Constitution, such as the free exercise of religion, speech, and assembly.\n(c)\tA police officer who has probable cause to believe that a child is in violation of this section shall take such child into custody and immediately contact the child's parent or guardian. If, after this contact, there is still probable cause to believe that the child was violating this section, the child shall be turned over to the custody of the juvenile authorities until a parent or guardian can take custody of the child.\n(d)\tNo parent or guardian shall permit or by inefficient control allow a violation of this section by a child in such person's custody or control.\nOrdinance Nos. 7831 (2012); 7965 (2014)"
  },
  {
    "corpus": "BRC",
    "title": "5",
    "title_name": "General Offenses",
    "chapter": "6",
    "chapter_name": "Miscellaneous Offenses",
    "anchor": "5-6-6",
    "heading": "Fireworks.",
    "verbatim": "5-6-6. Fireworks.\n(a)\tFor purposes of this section, the term fireworks means any article, device, or substance prepared for the primary purpose of producing a visual or auditory sensation by combustion, explosion, deflagration, or detonation, including, without limitation, the following articles and devices: toy cannons, or toy canes in which explosives are used, blank cartridges, firecrackers, torpedoes, skyrockets, rockets, Roman candles, Day-Glo bombs, aerial shells, trick matches, torches, fountains, sparklers, or other fireworks of like construction, and any fireworks containing any explosive or flammable compound, or any tablets or other device containing any explosive substance. Excluded from this definition are fireworks used by railroads or other transportation agencies for signaling or illumination; blank cartridges used for theatrical performances, historical reenactments, signaling, or ceremonial purposes; and fireworks used by police officers, the armed forces of the United States, or the Colorado National Guard.\n(b)\tThe possession, manufacture, storage, sale, handling, and use of fireworks are prohibited. No person shall possess, store to offer for sale, expose for sale, sell at retail, or use or explode any fireworks except after obtaining a permit for the supervised public display of fireworks as prescribed by the city fire code, Chapter 10-8, \"Fire Code,\" B.R.C. 1981.\n(c)\tOn residential property, each resident of such property who is present in the immediate vicinity when another person attempts to fire or explode fireworks has an affirmative duty to take reasonable measures under the circumstances to prevent the firing or exploding and, if those fail to prevent the offense, to cooperate with investigating law enforcement officers to identify the perpetrator of such act. Failure to discharge this duty shall render such a person a complicitor to the offense of firing or exploding the fireworks.\nOrdinance Nos. 4879 (1985); 7083 (2000); 7358 (2004); 7842 (2012); 7925 (2013)"
  },
  {
    "corpus": "BRC",
    "title": "5",
    "title_name": "General Offenses",
    "chapter": "6",
    "chapter_name": "Miscellaneous Offenses",
    "anchor": "5-6-7",
    "heading": "Public Urination.",
    "verbatim": "5-6-7. Public Urination.\nNo person shall urinate or defecate while on the mall, in any city park within the city limits, on any property zoned for residential uses without the express permission of the owner, or within any portion of the city zoned for business, industrial, or public uses, unless such voiding is made into a receptacle that has been provided for that purpose that stores or disposes of the wastes in a sanitary manner and that is enclosed from the view of the general public."
  },
  {
    "corpus": "BRC",
    "title": "5",
    "title_name": "General Offenses",
    "chapter": "6",
    "chapter_name": "Miscellaneous Offenses",
    "anchor": "5-6-8",
    "heading": "Skateboards on Mall.",
    "verbatim": "5-6-8. Skateboards on Mall.\nNo person on the mall shall ride upon the mall any skateboard, skates, coaster, or other similar device.\nOrdinance Nos. 7831 (2012); 7965 (2014)"
  },
  {
    "corpus": "BRC",
    "title": "5",
    "title_name": "General Offenses",
    "chapter": "6",
    "chapter_name": "Miscellaneous Offenses",
    "anchor": "5-6-9",
    "heading": "Projectiles on Mall.",
    "verbatim": "5-6-9. Projectiles on Mall.\n(a)\tNo person shall cast, throw, or propel any projectile on the mall. This prohibition includes, without limitation, throwing balls, boomerangs, bottles, darts, Frisbees, and other like devices, model airplanes, rocks, snowballs, and sticks.\n(b)\tThis section does not apply to a juggler if the juggler does not cast, throw, or propel a knife, including, without limitation, a knife with a blade three and one-half inches in length or less, or burning projectile, or if the juggler is acting within the terms of a special entertainment permit issued under the provisions of Chapter 4-11, \"Mall Permits and Leases,\" B.R.C. 1981.\nOrdinance Nos. 7831 (2012); 7965 (2014)"
  },
  {
    "corpus": "BRC",
    "title": "5",
    "title_name": "General Offenses",
    "chapter": "6",
    "chapter_name": "Miscellaneous Offenses",
    "anchor": "5-6-10",
    "heading": "Camping or Lodging on Property Without Consent.",
    "verbatim": "5-6-10. Camping or Lodging on Property Without Consent.\n(a)\tNo person shall camp within any park, parkway, recreation area, open space, or other city property.\n(b)\tNo person shall camp within any public property other than city property or any private property without first having obtained:\n(1)\tPermission of the authorized officer of such public property; or\n(2)\tPermission of the owner of private property.\n(c)\tThis section does not apply to any dwelling in the city, as defined by Section 5-1-1, \"Definitions,\" B.R.C. 1981.\n(d)\tFor purposes of this section, camp means to reside or dwell temporarily in a place, with shelter, and conduct activities of daily living, such as eating or sleeping, in such place. But the term does not include napping during the day or picnicking. The term shelter includes, without limitation, any cover or protection from the elements other than clothing. The phraseduring the day means from one hour after sunrise until sunset, as those terms are defined in Chapter 7-1, \"Definitions,\" B.R.C. 1981. Camp does not include temporary residence associated with the performance of a governmental service by emergency responders or relief workers during a Disaster Emergency as defined in Section 2-2.5-2, \"Definitions,\" B.R.C. 1981.\n(e)\tTestimony by an agent of the persons specified in Subsection (b) of this section that such agent is the person who grants permission to camp or lodge upon such property, or that in the course of such agent's duties such agent would be aware of permission and that no such permission was given, is prima facie evidence of that fact.\nOrdinance Nos. 7129 (2001); 7719 (2010); 7831 (2012); 7946 (2013); 7965 (2014)"
  },
  {
    "corpus": "BRC",
    "title": "5",
    "title_name": "General Offenses",
    "chapter": "6",
    "chapter_name": "Miscellaneous Offenses",
    "anchor": "5-6-11",
    "heading": "Inhaling Toxic Vapors.",
    "verbatim": "5-6-11. Inhaling Toxic Vapors.\n(a)\tNo person shall knowingly smell or inhale the fumes of toxic vapors for the purpose of causing a condition of euphoria, excitement, exhilaration, stupefaction, or dulled senses of the nervous system, or possess, buy, or use any such substance for the purpose of violating or aiding another to violate this section. But this section does not apply to the inhalation of anesthesia for medical or dental purposes.\n(b)\tAs used in this section, the term toxic vapors means the following substances or products containing such substances: alcohols (methyl, isopropyl, propyl, or butyl), aliphatic acetates (ethyl, methyl, propyl, or methyl cellosolve acetate), acetone, allyl isothiocyanate, nitrous oxide, benzene, carbon tetrachloride, cyclohexane, Freons (Freon 11 and Freon 12), hexane, methyl ethyl ketone, methyl isobutyl ketone, naphtha, perchlorethylene, toluene, trichloromethane, or xylene. Evidence that a container, or a similar container, if the label is missing, lists one or more of these substances is prima facie evidence that the substance in such container contains toxic vapors and emits the fumes thereof.\nOrdinance No. 5209 (1989)"
  },
  {
    "corpus": "BRC",
    "title": "5",
    "title_name": "General Offenses",
    "chapter": "6",
    "chapter_name": "Miscellaneous Offenses",
    "anchor": "5-6-12",
    "heading": "Fraudulent Identification Documents Prohibited.",
    "verbatim": "5-6-12. Fraudulent Identification Documents Prohibited.\n(a)\tNo person shall:\n(1)\tPossess an identification document that is forged, counterfeited, or possessed for the purpose of committing an act in violation of law.\n(2)\tPossess an identification document that was validly issued but then altered by someone other than the issuing agency.\n(3)\tPossess any identification document of another person with the intent to display or present it as having been issued to the person possessing the document.\n(4)\tDisplay or present an identification document of another person in a manner that falsely suggests that it was issued to the person displaying or presenting it.\n(5)\tProvide a valid identification to another person under circumstances in which the provider knows, or reasonably should know, that the document will be displayed or presented as having been issued to the person to whom the identification document was provided.\n(b)\tFor the purposes of this section, identification documents means documents that were issued for the purpose of identifying the person to whom the document was issued. Such documents include, without limitation, documents issued by governmental agencies that contain identifying data such as the date and place of birth of the person identified; licenses issued by any national, state, or local government; birth certificates; social security cards; drivers' licenses issued by any government; and official identification cards. An identification document is of another person if it was validly issued, but for a person other than the possessor.\n(c)\tA liquor licensee, or an employee of a liquor licensee, may seize and hold for evidence any identification if acting in good faith and upon probable cause to believe that the identification is possessed or displayed or presented in violation of this section.\nOrdinance Nos. 7129 (2001); 7534 (2007)"
  },
  {
    "corpus": "BRC",
    "title": "5",
    "title_name": "General Offenses",
    "chapter": "6",
    "chapter_name": "Miscellaneous Offenses",
    "anchor": "5-6-13",
    "heading": "Public Nudity Prohibited.",
    "verbatim": "5-6-13. Public Nudity Prohibited.\n(a)\tNo person who is ten years of age or older shall intentionally expose any portion of his or her anus, vulva, penis, or scrotum while that person is located:\n(1)\tIn a public right of way, in a park or recreation center, in a public building, in a public square, or while located in any other public space or mall; or\n(2)\tOn private property if the person is in a place that can be viewed from the ground level by another who is located on public property and who does not take extraordinary steps, such as climbing a ladder or peering over a screening fence, in order to achieve a point of vantage.\n(b)\tThis prohibition does not extend to:\n(1)\tPeople who are undergoing bona fide emergency medical examinations or treatment; or\n(2)\tPeople located in dressing rooms, shower rooms, bathrooms, or in other enclosed areas specifically designated for changing clothes or in which nudity is explicitly permitted.\nOrdinance Nos. 7711 (2010); 7831 (2012); 7965 (2014)"
  },
  {
    "corpus": "BRC",
    "title": "5",
    "title_name": "General Offenses",
    "chapter": "6",
    "chapter_name": "Miscellaneous Offenses",
    "anchor": "5-6-14",
    "heading": "Hot Air Balloons.",
    "verbatim": "5-6-14. Hot Air Balloons.\n(a)\tFor purposes of this section, the term hot air balloon means any balloon that requires fire underneath to propel it.\n(b)\tNo person shall take or carry any hot air balloon into any park, parkway, recreation area, or open space or launch a hot air balloon from any public property in the city.\n(c)\tNo person shall launch or land any hot air balloon on any private property except in an industrial zoning district with the permission of the property owner.\nOrdinance No. 7842 (2012)"
  },
  {
    "corpus": "BRC",
    "title": "5",
    "title_name": "General Offenses",
    "chapter": "6",
    "chapter_name": "Miscellaneous Offenses",
    "anchor": "5-6-15",
    "heading": "Pedestrian Interference in Roadway Prohibited.",
    "verbatim": "5-6-15. Pedestrian Interference in Roadway Prohibited.\nEvery pedestrian crossing or otherwise within a roadway shall yield the right of way to and avoid any interference with all vehicles upon or approaching the roadway. This section does not apply to pedestrians crossing in crosswalks or in accordance with Subsection 7-5-15(d), B.R.C. 1981, or to pedestrians walking along and upon roadways designated as shared streets.\nOrdinance Nos. 7965 (2014); 7996 (2014)"
  },
  {
    "corpus": "BRC",
    "title": "5",
    "title_name": "General Offenses",
    "chapter": "6",
    "chapter_name": "Miscellaneous Offenses",
    "anchor": "5-6-16",
    "heading": "Staying on Medians Prohibited.",
    "verbatim": "5-6-16. Staying on Medians Prohibited.\n(a)\tNo person shall stand or be upon a median of any street for longer than is reasonably necessary to cross the street.\n(b)\tFor the purposes of this section, median means:\n(1)\tThe area of a street, generally in the middle, which separates traffic traveling in one direction from traffic traveling in another direction, or which, at intersections, separates traffic turning left from traffic proceeding straight. Such an area is physically defined by curbing, landscaping, or other physical obstacles to the area's use by motor vehicles, or by traffic control markings which prohibit use of a portion of the pavement of a street by motor vehicles other than to drive generally perpendicularly across the markings, or to wait there awaiting the opportunity to cross or merge with the opposing lanes of traffic (also known as painted medians, which are wider than a double yellow line); or\n(2)\tThe area of a street at an intersection between the streets and a right turn only lane, roughly triangular in shape, and separated from the motor vehicular traffic lanes by curbing, landscaping, or other physical obstacles to the area's use by motor vehicles (also known as a right turn island).\n(c)\tThis section does not apply to any median other than those which are unpaved or less than thirty-six inches wide, to the medians on Mapleton Avenue between Fourth Street and Ninth Street, or to persons maintaining or working on the median for the government which owns the underlying right of way or for a public utility.\nOrdinance Nos. 7965 (2014); 8382 (2020)"
  },
  {
    "corpus": "BRC",
    "title": "5",
    "title_name": "General Offenses",
    "chapter": "6",
    "chapter_name": "Miscellaneous Offenses",
    "anchor": "5-6-17",
    "heading": "Fur Products.",
    "verbatim": "5-6-17. Fur Products.\n(a)\tIt shall be unlawful to manufacture, sell, display for sale, distribute, or trade for monetary or nonmonetary consideration any fur product in the city.\n(b)\tThis prohibition does not extend to:\n(1)\tA fur product where the activity is expressly authorized by federal or state law;\n(2)\tA fur product used by or traded with an American Indian, Alaskan Native, Indian tribe member, and/or persons having origins in any of the original peoples of North, Central, or South America, as a sacred object, funerary object, cultural item, or object of cultural patrimony, as these terms are defined under state and federal law, Referencing the American Indian Religious Freedom Act (42 USC 1996), and the Native American Graves Protection and Repatriation Act (25 USC 3001 and 43 C.F.R. Part 10);\n(3)\tA used fur product bought, sold, donated or owned by a person not in the primary business of selling fur or a fur product, including a Non-Profit Organization, secondhand store, or pawn shop; and\n(4)\tThe manufacture for sale of a fur product using fur sourced exclusively from a used fur product.\n(c)\tFor the purposes of this section, the term fur means any animal skin or part thereof with fur, fleece or fur fibers attached thereto, either in its raw or processed state.\n(d)\tFor the purposes of this section, the term fur product means any article of clothing or covering for any part of the body or fashion accessory made in whole or in part of fur, including, but not limited to, a coat, jacket, handbag, purse, wallet, shoe, slipper, hat, earmuff, scarf, shawl, glove, jewelry or keychain. \"Fur Product\" does not include any of the following:\n(1)\tA dog or cat fur product, as defined in Section 1308 of Title 19 of the United States Code;\n(2)\tAn animal skin or part thereof that is to be converted into leather, or which in processing will have the hair, fleece, or fur fiber completely removed;\n(3)\tCowhide with the hair attached thereto;\n(4)\tLambskin or sheepskin with the fleece attached thereto; or\n(5)\tThe pelt or skin of any animal that is preserved through taxidermy or for the purpose of taxidermy.\n(e)\tFor the purposes of this section, the term non-profit organization means any charity or corporation that is authorized under United States Code 26 Section 501(c)(3) for charitable, religious, philanthropic, educational or other similar purposes.\n(f)\tFor the purposes of this section, the term taxidermy means the practice of preparing and preserving the skin and fur of a deceased animal or part of a deceased animal that is stuffed and mounted in a lifelike form.\n(g)\tFor the purposes of this section, the term used fur product means fur product in any form which has been worn or used by an ultimate consumer.\n(h)\tThis section shall be effective on July 1, 2022.\nOrdinance No. 8480 (2021); 8495 (2022)"
  },
  {
    "corpus": "BRC",
    "title": "5",
    "title_name": "General Offenses",
    "chapter": "7",
    "chapter_name": "Alcohol Offenses",
    "anchor": "5-7-1",
    "heading": "Definitions.",
    "verbatim": "5-7-1. Definitions.\n(a)\tFor purposes of this code, fermented malt beverage has the same meaning as its meaning under the Colorado Beer Code.\n(b)\tFor purposes of this code, malt, vinous, and spirituous liquor has the same meaning as its meaning under the Colorado Liquor Code."
  },
  {
    "corpus": "BRC",
    "title": "5",
    "title_name": "General Offenses",
    "chapter": "7",
    "chapter_name": "Alcohol Offenses",
    "anchor": "5-7-2",
    "heading": "Possession and Consumption of Alcoholic Beverages in Public Prohibited.",
    "verbatim": "5-7-2. Possession and Consumption of Alcoholic Beverages in Public Prohibited.\n(a)\tNo person shall possess an opened container of or consume any malt, vinous, or spirituous liquor or fermented malt beverage in public, except upon premises licensed for consumption of the liquor or beverage involved.\n(b)\tFor purposes of this section, opened container means any container other than an original closed container as sealed or closed for sale to the public by the manufacturer or bottler of the liquor or beverage. If an original container has been unsealed, undone, or opened in any manner, it is an opened container for purposes of this section.\n(c)\tFor purposes of this section, in public means:\n(1)\tIn or upon any public highway, street, alley, walk, parking lot, building, city park, parkway, recreation area, open space, or other public property or place, whether in a vehicle or not;\n(2)\tIn or upon those portions of any private property upon which the public has an express or implied license to enter or remain; or\n(3)\tIn or upon any other private property without the express or implied permission of the owner or person in possession and control of such property or such person's agent.\n(d)\tThe following property owned or managed by the city is excluded from the coverage of this section during park and facility hours of operation: Boulder Reservoir, Flatirons Golf Course, East Mapleton Ball Fields, Pleasant View Fields Sports Complex and Stazio Recreation Complex, but if a special event permit for the sale of liquor or fermented malt beverages has been issued for all or a portion of such property pursuant to § 44-5-101, et seq., C.R.S., then no person shall take or consume any malt, vinous, or spirituous liquor or fermented malt beverage onto or in the area designated in such permit except in accordance with such permit if a sign has been posted giving notice of the time and location of the area so restricted.\n(e)\tNothing in this section shall prohibit the consumption of any malt, vinous, or spirituous liquor or fermented malt beverages as allowed by permit under Section 5-7-5, B.R.C. 1981.\n(f)\tIt is an affirmative defense to a charge of violating this section that the premises were licensed by the city or by the State of Colorado for the consumption of the liquor or beverage involved, and any judge shall take judicial notice of the official records of such license and dismiss forthwith any charge to which this defense applies. If such dismissal is ex parte, the judge shall notify the city attorney, who may petition the court for permission to refile the charge.\n(g)\tIt is a specific defense to a charge of violating this section that:\n(1)\tThe owner of the property involved or the owner's agent gave express permission to the accused or to members of the accused's class to perform the acts complained of; or\n(2)\tThe accused was transporting the liquor or beverage from one place where it could be lawfully consumed directly and without delay to another such place, and the container was at all times during the transportation capped, corked, or otherwise reclosed with a firmly affixed waterproof lid. When the liquor or beverage was being transported in a motor vehicle, this defense is only available if the container was in the trunk or was not otherwise immediately accessible to the driver or any passenger.\n(h)\tNo person shall drive or sit in the driver's seat of any motor vehicle, other than one carrying passengers for hire, in which a violation of Subsection (a) of this section is occurring.\nOrdinance Nos. 5003 (1986); 7831 (2012); 7965 (2014); 8276 (2018); 8455 (2021)"
  },
  {
    "corpus": "BRC",
    "title": "5",
    "title_name": "General Offenses",
    "chapter": "7",
    "chapter_name": "Alcohol Offenses",
    "anchor": "5-7-3",
    "heading": "Unlawful to Sell or Give to or Procure for Minors.",
    "verbatim": "5-7-3. Unlawful to Sell or Give to or Procure for Minors.\nNo person shall sell, serve, deliver, or give away any malt, vinous, or spirituous liquor or fermented malt beverage to any person then under the age of twenty-one years, or purchase such liquor for such minor.\nOrdinance Nos. 5077 (1987); 5377 (1991)"
  },
  {
    "corpus": "BRC",
    "title": "5",
    "title_name": "General Offenses",
    "chapter": "7",
    "chapter_name": "Alcohol Offenses",
    "anchor": "5-7-4",
    "heading": "Possession and Sale by Minors Unlawful.",
    "verbatim": "5-7-4. Possession and Sale by Minors Unlawful.\n(a)\tNo person under the age of twenty-one years (underage person) shall consume, possess, or have under such person's control or request that any other person purchase for such minor person or sell, serve, give away, or offer for sale any ethyl alcohol. Ethyl alcohol, under this section, means any substance which is or contains ethyl alcohol.\n(b)\tIt is an affirmative defense to a charge of violating this section that a defendant eighteen years of age or older acted lawfully in only selling or serving ethyl alcohol within the course of employment in an establishment holding a license under state law.\n(c)\tPrima facie evidence that a violation of this section occurred within the city shall consist of:\n(1)\tEvidence that the defendant was under the age of twenty-one years and possessed or consumed ethyl alcohol within the city; or\n(2)\tEvidence that the defendant was under the age of twenty-one years and manifested any of the characteristics commonly associated with ethyl alcohol intoxication or impairment while present anywhere within the city.\n(d)\tIn any trial for a violation of this section, any bottle, can, or any other container with labeling indicating the contents of such bottle, can, or container shall be admissible into evidence, and the information contained on any label on such bottle, can, or other container shall be admissible into evidence and shall not constitute hearsay. A jury or a judge, whichever is appropriate, may consider the information upon such label in determining whether the contents of the bottle, can, or other container were composed in whole or in part of ethyl alcohol. A label identifying the contents of any bottle, can, or other container as \"beer,\" \"ale,\" \"malt beverage,\" \"fermented malt beverage,\" \"malt liquor,\" \"wine,\" \"champagne,\" \"whiskey\" or \"whisky,\" \"gin,\" \"vodka,\" \"tequila,\" \"schnapps,\" \"brandy,\" \"cognac,\" \"liqueur,\" \"cordial,\" \"alcohol,\" or \"liquor\" shall constitute prima facie evidence that the contents of the bottle, can, or other container was composed in whole or in part of ethyl alcohol.\n(e)\tAn underage person and one or two other persons shall be immune from criminal prosecution under this section if they establish the following:\n(1)\tOne of the underage persons called 911 and reported that another underage person was in need of medical assistance due to alcohol consumption;\n(2)\tThe underage person who called 911 and, if applicable, one or two other persons acting in concert with the underage person who called 911 provided each of their names to the 911 operator;\n(3)\tThe underage person was the first person to make the 911 report; and\n(4)\tThe underage person and, if applicable, one or two other persons acting in concert with the underage person who made the 911 call remained on the scene with the underage person in need of medical assistance until assistance arrived and cooperated with medical assistance and law enforcement personnel on the scene.\n(f)\tUpon the expiration of one year from the date of a conviction of a charge under this section, the defendant may petition the municipal court for an order sealing the record of such municipal court charge. The court shall grant such petition if the petitioner has not been arrested for, charged with, or convicted of any felony, misdemeanor, petty offense, or criminal city ordinance violation during the period of one year following the date of such petitioner's conviction of charges under this section. Upon acquittal, dismissal, or a decision not to file a charge under this section, the defendant may petition the municipal court for an order sealing the record of such municipal court charge and the court shall grant such petition.\n(g)\tOfficial records of the department of public health and environment relating to the certification of breath test instruments, certification of operators and operator instructors of breath test instruments, certification of standard solutions, and certification of laboratories shall be official records of the state. Copies of such records, attested by the executive director of the department of public health and environment or his or her deputy, and accompanied by a certificate bearing the official seal for said department, which state that the executive director of the department has custody of such records, shall be admissible in all courts of record and shall constitute prima facie evidence of the information contained in such records. The official seal of the department described in this subsection may consist of a rubber stamp producing a facsimile of the seal stamped upon the document.\n(h)\tIn any judicial proceeding in any court of this state concerning a charge under this section, the court shall take judicial notice of methods of testing a person's blood, breath, saliva, or urine for the presence of alcohol and of the design and operation of devices certified by the department of public health and environment for testing a person's blood, breath, saliva, or urine for the presence of alcohol. This subsection shall not prevent the necessity of establishing during a trial that the testing devices were working properly and that such testing devices were properly operated. Nothing in this subsection shall preclude a defendant from offering evidence concerning the accuracy of testing devices.\nOrdinance Nos. 5077 (1987); 5377 (1991); 7752 (2010); 7778 (2011); 7831 (2012); 7965 (2014)"
  },
  {
    "corpus": "BRC",
    "title": "5",
    "title_name": "General Offenses",
    "chapter": "7",
    "chapter_name": "Alcohol Offenses",
    "anchor": "5-7-5",
    "heading": "City Manager Authority to Grant Permission to Consume Alcoholic Beverages on City-Owned Property.",
    "verbatim": "5-7-5. City Manager Authority to Grant Permission to Consume Alcoholic Beverages on City-Owned Property.\n(a)\tThe city manager may grant express permission, as provided in Subsection (b) of this section, to persons to consume any malt, vinous, or spirituous liquor or fermented malt beverage on city-owned property for the following special functions: athletic events, artistic events, cultural events, receptions, farm-to-table events on open space properties with a current farm crop and grazing lease in good standing, street closure events, or civic events.\n(b)\tThe city manager shall grant such permission to persons applying therefor if, considering the type of function and the type of alcohol to be served, the manager finds that:\n(1)\tThe time, location, route, and duration of the function are not likely to significantly interfere with public traffic or fire or police services;\n(2)\tThe number and concentration of participants at the function are not likely to result in crowds exceeding limitations in the city fire code, Chapter 10-8, \"Fire Code,\" B.R.C. 1981, or noise prohibited by Chapter 5-9, \"Noise,\" B.R.C. 1981, or other significant inconvenience to the residents of the surrounding neighborhood;\n(3)\tUnderage persons are not likely to obtain malt, vinous, or spirituous liquors or fermented malt beverages served at the function;\n(4)\tPrecautions are proposed that are likely to secure and supervise the area and the participants during the function; and\n(5)\tThe applicant meets other reasonable requirements to implement the provisions of Paragraphs (b)(1) through (b)(4) of this section.\n(c)\tAn agricultural tenant seeking to organize, promote or stage a farm-to-table event on open space land subject to an agricultural lease for crop and grazing purposes in good standing who seeks to serve vinous or fermented malt beverages satisfies the requirements of subsection (b) by obtaining a permit from the city manager under Section 8-8-9, \"Permits for Commercial Uses on Open Space and Mountain Parks Lands,\" B.R.C. 1981. As used in this subsection, farm-to-table event means an event to which members of the public have access or that has been publicly announced where the majority of the food served at the event is made with ingredients grown or raised by the host tenant.\n(d)\tThe city manager may adopt legislative and procedural rules for granting such permission, consistent with the criteria set forth in Subsections (b) and (c) of this section.\nOrdinance Nos. 7925 (2013); 8670 (2025)"
  },
  {
    "corpus": "BRC",
    "title": "5",
    "title_name": "General Offenses",
    "chapter": "7",
    "chapter_name": "Alcohol Offenses",
    "anchor": "5-7-6",
    "heading": "Alcoholic Beverage Consumption in Massage Parlors Prohibited.",
    "verbatim": "5-7-6. Alcoholic Beverage Consumption in Massage Parlors Prohibited.\nRepealed.\nOrdinance No. 5347 (1990)"
  },
  {
    "corpus": "BRC",
    "title": "5",
    "title_name": "General Offenses",
    "chapter": "7",
    "chapter_name": "Alcohol Offenses",
    "anchor": "5-7-7",
    "heading": "Preservation of Evidence Seized for Violation of This Chapter.",
    "verbatim": "5-7-7. Preservation of Evidence Seized for Violation of This Chapter.\n(a)\tAny police officer who seizes any malt, vinous, or spirituous liquors or any fermented malt beverages as evidence for trial of a violation of this code shall keep such seized items in a secure place until trial according to the regulations of the chief of police.\n(b)\tThe chief of police shall destroy such evidence after the expiration of fourteen days after trial if:\n(1)\tThere was a conviction at the trial; or\n(2)\tThere was an acquittal at trial and no person has claimed the evidence in writing and produced proof of ownership.\n(c)\tFailure to comply with the requirements of Subsection (a) of this section does not constitute a ground for dismissal of charges under this code or suppression of evidence at trial."
  },
  {
    "corpus": "BRC",
    "title": "5",
    "title_name": "General Offenses",
    "chapter": "7",
    "chapter_name": "Alcohol Offenses",
    "anchor": "5-7-8",
    "heading": "Taking Fermented Malt Beverage From Premises Licensed for On-Premises Consumption Only Prohibited.",
    "verbatim": "5-7-8. Taking Fermented Malt Beverage From Premises Licensed for On-Premises Consumption Only Prohibited.\nNo person shall transport or remove from premises licensed for on-premises consumption only of fermented malt beverages any fermented malt beverage. This prohibition applies to premises licensed pursuant to Paragraph 4-2-3(b)(9), B.R.C. 1981, or pursuant to a fermented malt beverage special event permit issued under § 44-5-101, et seq., C.R.S. This prohibition does not apply to employees or agents of the licensee acting in accordance with lawful directions of the licensee.\nOrdinance Nos. 5003 (1986); 7831 (2012); 7965 (2014); 8276 (2018)"
  },
  {
    "corpus": "BRC",
    "title": "5",
    "title_name": "General Offenses",
    "chapter": "7",
    "chapter_name": "Alcohol Offenses",
    "anchor": "5-7-9",
    "heading": "Alcoholic Beverage on Mall on Halloween Prohibited.",
    "verbatim": "5-7-9. Alcoholic Beverage on Mall on Halloween Prohibited.\n(a)\tNo person shall possess any malt, vinous, or spirituous liquor or fermented malt beverage in or upon any public highway, street, alley, walk, parking lot, the Downtown Boulder Mall, or any other public property or place, or in or upon those portions of any private property upon which the public has an express or implied license to enter or remain, within the area bounded by the north curbline of Spruce Street, the east curbline of 15th Street, the south curbline of Walnut Street, and the west curbline of 10th Street between 6 p.m. October 31 and 6 a.m. November 1 of each year.\n(b)\tThe city manager may, by publishing a notice in a newspaper of general circulation within the city, extend the evenings on which this section is in effect to include one or more of the seven evenings immediately preceding and succeeding October 31, if the manager reasonably believes that large crowds of Halloween celebrants will appear on the mall on such evenings.\n(c)\tAny peace officer is authorized to seize any malt, vinous, or spirituous liquor or fermented malt beverage possessed in violation of this section. If no summons or complaint is issued for the violation and if the circumstances reasonably permit, the officer may require the possessor to leave the prohibited area with the alcoholic beverage or to abandon the beverage to the officer for destruction, at such person's option.\n(d)\tThe defenses at Subsections 5-7-2(e) and (f), B.R.C. 1981, are applicable to this section.\nOrdinance Nos. 5078 (1987); 5334 (1990); 7831 (2012); 7965 (2014)"
  },
  {
    "corpus": "BRC",
    "title": "5",
    "title_name": "General Offenses",
    "chapter": "8",
    "chapter_name": "Weapons",
    "anchor": "5-8-1",
    "heading": "Legislative Intent.",
    "verbatim": "5-8-1. Legislative Intent.\nThe purpose of this chapter is to protect the public health, safety, and welfare by regulating the possession, storage, and use of weapons.\nOrdinance No. 7299 (2003)"
  },
  {
    "corpus": "BRC",
    "title": "5",
    "title_name": "General Offenses",
    "chapter": "8",
    "chapter_name": "Weapons",
    "anchor": "5-8-2",
    "heading": "Definitions.",
    "verbatim": "5-8-2. Definitions.\nThe following terms used in this chapter have the following meanings unless the context clearly requires otherwise:\nAbout the person means sufficiently close to the person to be readily accessible for immediate use.\nAssault weapon means:\n(a)\tAll semi-automatic center-fire rifles that have the capacity to accept a detachable magazine and that have any of the following characteristics:\n(1)\tA pistol grip or thumbhole stock;\n(2)\tA folding or telescoping stock;\n(3)\tA flash suppressor; or\n(4)\tA shroud attached to the barrel, or that partially or completely encircles the barrel, allowing the bearer to hold the firearms with the non-trigger hand without being burned, but excluding a slide that encloses the barrel.\n(b)\tAll semi-automatic center-fire pistols that have any of the following characteristics:\n(1)\tA threaded barrel;\n(2)\tA secondary protruding grip or other device to allow the weapon to be stabilized with the non-trigger hand;\n(3)\tA shroud attached to the barrel, or that partially or completely encircles the barrel, allowing the bearer to hold the firearm with the non-trigger hand without being burned, but excluding a slide that encloses the barrel;\n(4)\tA flash suppressor;\n(5)\tThe capacity to accept a detachable ammunition feeding device at some location outside of the pistol grip;\n(6)\tA manufactured weight of fifty ounces or more when unloaded;\n(7)\tA buffer tube, arm brace, or other part that protrudes horizontally under the pistol grip; or\n(8)\tA fixed magazine that has the capacity to accept more than ten rounds.\n(c)\tAll semi-automatic shotguns that have any of the following characteristics:\n(1)\tA pistol grip or thumbhole stock;\n(2)\tA folding or telescoping stock;\n(3)\tA fixed magazine capacity in excess of five rounds; or\n(4)\tThe capacity to accept a detachable magazine.\n(d)\tAny firearm which has been modified to be operable as an assault weapon as defined herein.\n(e)\tAny part or combination of parts designed or intended to convert a firearm into an assault weapon, including any combination of parts from which an assault weapon may be readily assembled if those parts are in the possession or under the control of the same person.\nConstructive knowledge means knowledge of facts or circumstances sufficient to cause a reasonable person to be aware of the fact in question.\nFederal licensee means a federally licensed firearms manufacturer, importer, or dealer licensed under 18 U.S.C. 923(a), or other federal licensee authorized to identify firearms with serial numbers.\nFrame or receiver means the part of a firearm that, when the complete weapon is assembled, is visible from the exterior and provides the housing or structure designed to hold or integrate one or more fire control components, even if pins or other attachments are required to connect those components to the housing or structure. For models of firearms in which multiple parts provide such housing or structure, the part or the parts that the Director of the Federal Bureau of Alcohol, Tobacco, Firearms & Explosives has determined are a frame or receiver constitute the frame or receiver. For the purposes of this definition, the term \"fire control component\" means a component necessary for the firearm to initiate, complete, or continue the firing sequence, and includes a hammer, bolt, bolt carrier, breechblock, cylinder, trigger mechanism, firing pin, striker, or slide rails.\nIllegal weapon means an assault weapon, large-capacity magazine, rapid-fire trigger activator, blackjack, gas gun, metallic knuckles, gravity knife or switchblade knife.\nLarge-capacity magazine means any ammunition feeding device with the capacity to accept more than ten rounds, but shall not be construed to include any of the following:\n(a)\tA feeding device that has been permanently altered so that it cannot accommodate more than ten rounds.\n(b)\tA 22-caliber tube rim-fire ammunition feeding device.\n(c)\tA tubular magazine that is contained in a lever-action firearm.\nLaw enforcement officer means any person employed by the United States, or a state, county, city, municipality, village, town, or other political subdivision as a police officer, peace officer, or in some like position involving the enforcement of the law and protection of the public interest.\nLicensed firearms dealer means any person who is a licensed importer, licensed manufacturer, or dealer licensed pursuant to 18 U.S.C. sec. 923, as amended, as a federally licensed firearms dealer and has obtained all necessary state and local licenses to sell firearms in the state.\nLocked container means a secure container which is enclosed on all sides and locked by a padlock, key lock, combination lock, or similar device, but does not include the utility compartment, glove compartment, or trunk of a motor vehicle.\nMinor means a person under twenty-one years of age.\nPistol grip means a grip that protrudes conspicuously beneath the action of the weapon and that allows for a pistol style grasp in which the web of the trigger hand (between the thumb and index finger) can be placed below the top of the exposed portion of the trigger while firing.\nProvide means to give, lend, sell, or to place in an unsecured location where a minor, an unauthorized person or an incompetent person could foreseeably gain access to a firearm.\nRapid-fire trigger activator means:\n(a)\tA device that attaches to a firearm to allow the firearm to discharge two or more shots in a burst when the device is activated; or\n(b)\tA manual or power-driven trigger-activating device that, when attached to a firearm, increases the rate of fire of that firearm.\nSale means the actual approval of the delivery of a firearm in consideration of payment or promise of payment.\nSemi-automatic means a firearm that fires a single round for each pull of the trigger and automatically chambers a new round immediately after a round is fired.\nSite means the facility or location where a sale and/or transfer of firearms is conducted.\nTransfer means the intended delivery of a firearm from a dealer to another person without consideration of payment or promise of payment including, but not limited to, gifts and loans. \"Transfer\" does not include the delivery of a firearm owned or leased by an entity licensed or qualified to do business in Colorado to, or return of such firearm by, any of that entity's employees or agents for lawful purposes in the ordinary course of business.\nUnfinished frame or receiver means any forging, casting, printing, extrusion, machined body or similar article that:\n(a)\tHas reached a stage in manufacture where it may readily be completed, assembled or converted to be used as the frame or receiver of a functional firearm; or\n(b)\tIs marketed or sold to the public to become or be used as the frame or receiver of a functional firearm once completed, assembled or converted.\nFor the purposes of this definition, the term \"assemble\" means to fit together component parts. In determining whether a forging, casting, printing, extrusion, machined body, or similar article may be readily completed, assembled, or converted to a functional state, the city manager may consider any available instructions, guides, templates, jigs, equipment, tools, or marketing materials.\nOrdinance Nos. 8245 (2018); 8494 (2022); 8526 (2022); 8528 (2022); 8529 (2022)"
  },
  {
    "corpus": "BRC",
    "title": "5",
    "title_name": "General Offenses",
    "chapter": "8",
    "chapter_name": "Weapons",
    "anchor": "5-8-3",
    "heading": "Discharge of Firearms.",
    "verbatim": "5-8-3. Discharge of Firearms.\nNo person shall discharge any projectile from a firearm or gas or mechanically operated gun. For purposes of this section, any person who was the proximate cause of the discharge shall be deemed to have discharged the firearm or gun. It is a violation of this section if the discharge occurs within the jurisdiction of the city, or if the projectile travels over such jurisdiction.\nOrdinance No. 5497 (1992)"
  },
  {
    "corpus": "BRC",
    "title": "5",
    "title_name": "General Offenses",
    "chapter": "8",
    "chapter_name": "Weapons",
    "anchor": "5-8-4",
    "heading": "Possessing and Discharging Firearm or Bow in Park or Open Space.",
    "verbatim": "5-8-4. Possessing and Discharging Firearm or Bow in Park or Open Space.\n(a)\tNo person shall possess any firearm or gas or mechanically operated gun in any park or open space.\n(b)\tNo person shall discharge a missile from, into, or over or possess any bow, slingshot, or crossbow in any park or open space.\nOrdinance No. 5497 (1992)"
  },
  {
    "corpus": "BRC",
    "title": "5",
    "title_name": "General Offenses",
    "chapter": "8",
    "chapter_name": "Weapons",
    "anchor": "5-8-5",
    "heading": "Negligently Shooting Bow or Slingshot.",
    "verbatim": "5-8-5. Negligently Shooting Bow or Slingshot.\nNo person shall shoot a bow and arrow, crossbow, or slingshot in a negligent manner."
  },
  {
    "corpus": "BRC",
    "title": "5",
    "title_name": "General Offenses",
    "chapter": "8",
    "chapter_name": "Weapons",
    "anchor": "5-8-6",
    "heading": "Aiming Weapon at Another.",
    "verbatim": "5-8-6. Aiming Weapon at Another.\nNo person shall knowingly aim a loaded or unloaded firearm or gas or mechanically operated gun at another person."
  },
  {
    "corpus": "BRC",
    "title": "5",
    "title_name": "General Offenses",
    "chapter": "8",
    "chapter_name": "Weapons",
    "anchor": "5-8-7",
    "heading": "Flourishing Deadly Weapon in Alarming Manner.",
    "verbatim": "5-8-7. Flourishing Deadly Weapon in Alarming Manner.\nNo person shall display or flourish a deadly weapon in a manner calculated to alarm another person."
  },
  {
    "corpus": "BRC",
    "title": "5",
    "title_name": "General Offenses",
    "chapter": "8",
    "chapter_name": "Weapons",
    "anchor": "5-8-8",
    "heading": "Possession of Loaded Firearms.",
    "verbatim": "5-8-8. Possession of Loaded Firearms.\n(a)\tExcept as set forth in this chapter, no person shall possess a loaded firearm or a loaded gas or mechanically operated gun.\n(b)\tFor the purposes of this section, a firearm is loaded if there is a projectile, with charge,1 in the chamber, in the cylinder, or in the clip in the firearm.\n(c)\tA peace officer shall not undertake an arrest under this section without first giving due consideration to the city's burden of proof with regard to the affirmative defenses set forth in Section 5-8-22, \"Defenses,\" B.R.C. 1981.\n1 See Chapter 10-8, \"Fire Code,\" B.R.C. 1981, prohibiting discharge of fireworks."
  },
  {
    "corpus": "BRC",
    "title": "5",
    "title_name": "General Offenses",
    "chapter": "8",
    "chapter_name": "Weapons",
    "anchor": "5-8-9",
    "heading": "Carrying a Concealed Weapon.",
    "verbatim": "5-8-9. Carrying a Concealed Weapon.\nNo person shall have a knife or firearm concealed on or about such person's body."
  },
  {
    "corpus": "BRC",
    "title": "5",
    "title_name": "General Offenses",
    "chapter": "8",
    "chapter_name": "Weapons",
    "anchor": "5-8-10",
    "heading": "Possession and Sale of Illegal Weapons.",
    "verbatim": "5-8-10. Possession and Sale of Illegal Weapons.\n(a)\tNo person shall knowingly possess or sell or otherwise transfer an illegal weapon.\n(b)\tNothing in this section shall be construed to forbid any person:\n(1)\tHolding a Federal Firearms License issued by the United States Government from possession of any firearm authorized pursuant to such license;\n(2)\tFrom possessing a firearm for which the United States Government has issued a stamp or permit pursuant to the National Firearms Act; or\n(3)\tSelling an illegal weapon to a person identified in Section 5-8-25, \"Exemptions from this Chapter,\" B.R.C. 1981.\n(c)\tNothing in this section shall be deemed to apply to any firearm that has been modified either to render it permanently inoperable or to permanently make it not an assault weapon.\n(d)\tNothing in this section shall be deemed to restrict a person's ability to travel with a firearm in a private motor vehicle or other private means of conveyance for lawful hunting, for lawful competition, or for lawful protection of a person or another person or property while traveling into, though, or within, the City of Boulder, regardless of the number of times the person stops in the City of Boulder.\nOrdinance Nos. 8245 (2018); 8259 (2018); 8494 (2022)"
  },
  {
    "corpus": "BRC",
    "title": "5",
    "title_name": "General Offenses",
    "chapter": "8",
    "chapter_name": "Weapons",
    "anchor": "5-8-11",
    "heading": "Possessing Firearm While Intoxicated.",
    "verbatim": "5-8-11. Possessing Firearm While Intoxicated.\nNo person shall possess a firearm while such person's ability is impaired by intoxicating liquor, as defined by state law,1 or a controlled substance, as defined by state law.2\n1 § 42-4-1301, C.R.S.\n2 § 12-22-303(7), C.R.S."
  },
  {
    "corpus": "BRC",
    "title": "5",
    "title_name": "General Offenses",
    "chapter": "8",
    "chapter_name": "Weapons",
    "anchor": "5-8-12",
    "heading": "Providing Firearm to Intoxicated Persons or Minors.",
    "verbatim": "5-8-12. Providing Firearm to Intoxicated Persons or Minors.\nNo person shall provide any firearm to any person whose ability is impaired by intoxicating liquor, as defined by state law,1 or any controlled substance, as defined by state law;2 or to any person in a condition of agitation and excitability; or to any minor unless the person providing the firearm has obtained the consent of the minor's parent or legal guardian. Knowledge of the minor's age shall not be an element of this offense.\n1 § 42-4-1202(b), C.R.S.\n2 § 12-22-303(7), C.R.S."
  },
  {
    "corpus": "BRC",
    "title": "5",
    "title_name": "General Offenses",
    "chapter": "8",
    "chapter_name": "Weapons",
    "anchor": "5-8-13",
    "heading": "False Information on Weapons Application.",
    "verbatim": "5-8-13. False Information on Weapons Application.\nRepealed.\nOrdinance No. 7299 (2003)"
  },
  {
    "corpus": "BRC",
    "title": "5",
    "title_name": "General Offenses",
    "chapter": "8",
    "chapter_name": "Weapons",
    "anchor": "5-8-14",
    "heading": "Setting Spring Gun.",
    "verbatim": "5-8-14. Setting Spring Gun.\nNo person shall knowingly set a loaded gun, trap or device designed to cause an explosion upon being tripped or approached and leave it unattended by a competent person immediately present."
  },
  {
    "corpus": "BRC",
    "title": "5",
    "title_name": "General Offenses",
    "chapter": "8",
    "chapter_name": "Weapons",
    "anchor": "5-8-15",
    "heading": "Prohibition on Possession of Firearms in Sensitive Areas.",
    "verbatim": "5-8-15. Prohibition on Possession of Firearms in Sensitive Areas.\n(a)\tNo person shall knowingly carry any firearm, whether in an open or concealed manner, in any of the following locations:\n(1)\tAny building or real property owned or operated by the City of Boulder, or an entity created or controlled by the City of Boulder, except for city rights-of-way.\n(2)\tThe portion of any building that is being used for governmental purposes by the City of Boulder or an entity created or controlled by the City of Boulder.\n(3)\tAny public parks, playgrounds, or open space.\n(4)\tAny recreation or community center facility owned, operated, or managed by the City of Boulder.\n(5)\tAt any demonstration as described in this section held on public property.\n(6)\tWithin five hundred feet of any polling location within the City of Boulder on the day of an election or at a place officially designated by the Boulder County Clerk and Recorder for the counting of ballots on any day when ballots are being counted or conducting activities related to a federal, state, or municipal election.\n(7)\tThe area of any facility licensed to serve alcohol pursuant to Title 44, Article 3, Colorado Revised Statues.\n(b)\tNo person shall knowingly carry any firearm, whether in an open or concealed matter, in any of the following locations without explicit permission of the operating authority:\n(1)\tA hospital.\n(2)\tA facility or office that has medical, mental health, or substance abuse professionals to provide screening, evaluation, or treatment for mental health or substance abuse disorders.\n(3)\tAny property or facility owned or operated by a church, synagogue, mosque, temple, or other place of worship.\n(4)\tA stadium or arena.\n(5)\tA courthouse.\n(6)\tA depository financial institution or a subsidiary or affiliate of a depository financial institution.\n(7)\tA theater.\n(8)\tA day care center or preschool.\n(9)\tA grocery store.\n(c)\tNotice of the prohibitions on the concealed and open carry of firearms shall be posted conspicuously at all public entrances to the locations identified in subsections (a) and (b) as required by C.R.S. 29-11.7-104 and C.R.S. 18-12-214(c)(2).\n(1)\tNo later than sixty days after the enactment of this ordinance, the City of Boulder shall make compliant signs available for download on a publicly accessible website in English and Spanish.\n(2)\tNo person shall be determined to violate this section if signs are not posted as required by this subsection.\n(d)\tThe provisions of this section do not apply to:\n(1)\tAny federal, state, or local law enforcement officer when engaged in official duties.\n(2)\tAny member of the United States Armed Forces or Colorado National Guard when engaged in official duties.\n(3)\tPrivate security guards acting in the course of their duties.\n(4)\tThe carrying or possession of a firearm in a private motor vehicle in a trunk or locked container.\n(e)\tAs used in this section:\n(1)\t\"Demonstration\" means demonstrating, picketing, speechmaking or marching, holding of vigils and all other like forms of conduct occurring in a public place which involve the communication or expression of views or grievances engaged in by one or more persons, the conduct of which has the effect, intent or propensity to draw a crowd or onlookers. Such term shall not include casual use of property by visitors or tourists which does not have an intent or propensity to attract a crowd or onlookers.\n(2)\t\"Firearm\" has the same meaning as set forth in 18 U.S.C. Sec. 921(a)(3), as amended.\n(f)\tAnyone violating the provisions of this subsection shall be subject to immediate removal from the premises in addition to any other penalty provided by law.\nOrdinance No. 8525 (2022)\nEditor's note(s)—Ord. No. 8525, § 1, effective July 7, 2022, repealed the former § 5-8-15, and enacted a new § 5-8-15 as set out herein. The former § 5-8-15 pertained to deadly weapons in city buildings prohibited and derived from Ordinance No. 7299 (2003)."
  },
  {
    "corpus": "BRC",
    "title": "5",
    "title_name": "General Offenses",
    "chapter": "8",
    "chapter_name": "Weapons",
    "anchor": "5-8-16",
    "heading": "Possession of Firearm by Minor Prohibited.",
    "verbatim": "5-8-16. Possession of Firearm by Minor Prohibited.\n(a)\tNo minor shall knowingly possess a firearm.\n(b)\tThis section does not apply to a second or subsequent offense by the minor if the firearm in both instances was a handgun, or if the possession is otherwise a felony under state law.\n(c)\tIt is a specific defense to a charge of violating this section that the minor was, with the consent of his or her parent or legal guardian:\n(1)\tIn attendance at a hunter's safety course or a firearms safety course;\n(2)\tEngaging in practice in the use of a firearm or target shooting in an area designated as a target range by the city manager under Section 5-8-26, \"City Manager May Designate Target Ranges,\" B.R.C. 1981, for the type of weapon involved;\n(3)\tEngaging in an organized competition involving the use of a firearm or participating in or practicing for a performance by an organized group exempt from payment of income tax under 26 U.S.C. §501(c)(3) as determined by the federal internal revenue service which uses firearms as a part of such performance;\n(4)\tHunting or trapping pursuant to a valid license issued to such person pursuant to article 4 of title 33, C.R.S.;\n(5)\tTraveling with an unloaded firearm in such minor's possession to or from any activity described in Paragraph (c)(1), (c)(2), (c)(3) or (c)(4) of this section or to or from an established range authorized by the governing body of the jurisdiction in which such range is located or any other area outside the city where target practice is legal and the minor has permission from the landowner for such practice;\n(6)\tPossessing a firearm at such minor's residence for the purpose of exercising the rights contained in § 18-1-704 or 18-1-704.5, C.R.S.; and\n(7)\tFor the purposes of Paragraph (c)(5) of this section, a firearm is loaded if:\n(A)\tThere is a cartridge in the chamber or cylinder of the firearm or in a clip in the firearm; or\n(B)\tThe firearm, and the ammunition for such firearm, is carried on the person of the minor or is in such close proximity to the minor that the minor could readily gain access to the firearm and the ammunition and load the firearm."
  },
  {
    "corpus": "BRC",
    "title": "5",
    "title_name": "General Offenses",
    "chapter": "8",
    "chapter_name": "Weapons",
    "anchor": "5-8-17",
    "heading": "Providing Rifle or Shotgun to Minor Prohibited.",
    "verbatim": "5-8-17. Providing Rifle or Shotgun to Minor Prohibited.\n(a)\tNo person shall provide a rifle or shotgun with or without remuneration to any minor under circumstances which cause the minor to be in violation of Section 5-8-16, \"Possession of Firearm by Minor Prohibited,\" B.R.C. 1981. Knowledge of the minor's age shall not be an element of this offense.\n(b)\tNo parent or legal guardian of a minor shall provide a rifle or shotgun to the minor for any purpose or shall permit the minor to possess a rifle or shotgun for any purpose if the parent or guardian has actual or constructive knowledge of a substantial risk that the minor will use the rifle or shotgun to violate a federal, state or local law.\n(c)\tNo parent or legal guardian of a minor shall provide a rifle or shotgun to, or permit the minor to possess a rifle or shotgun, for any purpose, if the minor has been convicted of a crime of violence, as defined in § 16-11-309, C.R.S., or if the minor has been adjudicated a juvenile delinquent for an act which would have constituted a crime of violence, as so defined, if committed by an adult.\n(d)\tIt is a specific defense to a charge of violating this section by providing a firearm that had been stolen from the defendant either by the minor or by another person who subsequently provided the firearm to the minor."
  },
  {
    "corpus": "BRC",
    "title": "5",
    "title_name": "General Offenses",
    "chapter": "8",
    "chapter_name": "Weapons",
    "anchor": "5-8-18",
    "heading": "Unlawful Storage of Assault Weapons.",
    "verbatim": "5-8-18. Unlawful Storage of Assault Weapons.\n(a)\tNo person shall store, control or possess any assault weapon within any premises of which that person has an ownership interest, custody or control, in such a manner that the person knows, or has constructive knowledge, that a minor is likely to gain possession of the assault weapon and in fact does obtain possession of the assault weapon.\n(b)\tIt is a specific defense to a charge or violation of this section that:\n(1)\tThe assault weapon was located within a room or closet from which all minors were excluded by locks; or\n(2)\tThe assault weapon was stored in a locked container.\n(c)\tIt is an affirmative defense to civil negligence liability that the assault weapon was stored in a locked container."
  },
  {
    "corpus": "BRC",
    "title": "5",
    "title_name": "General Offenses",
    "chapter": "8",
    "chapter_name": "Weapons",
    "anchor": "5-8-19",
    "heading": "Unlawful Storage of Firearms Where There is Personal Injury.",
    "verbatim": "5-8-19. Unlawful Storage of Firearms Where There is Personal Injury.\n(a)\tNo person shall store, control or possess any firearm within any premises of which that person has an ownership interest, custody or control, in such manner that the person knows, or has constructive knowledge, that a minor is likely to gain possession of the firearm and in fact does obtain control of the firearm and either injures or kills himself or herself or another person with the firearm or uses the firearm in violation of federal, state or local law.\n(b)\tIt is a specific defense to a charge of violation of this section that:\n(1)\tThe firearm was located within a room or closet from which all minors were excluded by locks; or\n(2)\tThe firearm was stored in a locked container.\n(c)\tIt is an affirmative defense to civil negligence liability that the firearm was stored in a locked container.\n(d)\tIt is an affirmative defense that the firearm was used by a minor at such minor's residence with the permission of the minor's parent or legal guardian, for the purpose of exercising the rights contained in § 18-1-704 or 18-1-704.5, C.R.S."
  },
  {
    "corpus": "BRC",
    "title": "5",
    "title_name": "General Offenses",
    "chapter": "8",
    "chapter_name": "Weapons",
    "anchor": "5-8-20",
    "heading": "Parent or Legal Guardian Liability for Illegal Possession of Firearms by a Minor.",
    "verbatim": "5-8-20. Parent or Legal Guardian Liability for Illegal Possession of Firearms by a Minor.\n(a)\tNo parent or legal guardian, having actual or constructive knowledge of illegal possession of a firearm by a minor shall fail to either:\n(1)\tImmediately take possession of the firearm; or\n(2)\tImmediately notify law enforcement authorities of the details of the illegal possession so that law enforcement authorities can act to take possession of the firearm.\n(b)\tThis section does not create a duty on a parent or legal guardian to search the bedroom of a minor for firearms.\n(c)\tAs used in this section, illegal possession of a firearm by a minor means possession in violation of Section 5-8-16, \"Possession of Firearm by Minor Prohibited,\" B.R.C. 1981, or any provision of state or federal law concerning possession of a firearm by a minor."
  },
  {
    "corpus": "BRC",
    "title": "5",
    "title_name": "General Offenses",
    "chapter": "8",
    "chapter_name": "Weapons",
    "anchor": "5-8-21",
    "heading": "Prohibition on Openly Carrying Firearms.",
    "verbatim": "5-8-21. Prohibition on Openly Carrying Firearms.\n(a)\tNo person shall knowingly openly carry a firearm on or about their person in a public place.\n(b)\tThis section shall not apply to:\n(1)\tAny federal, state, or local law enforcement officer when engaged in official duties.\n(2)\tAny member of the United States Armed Forces or Colorado National Guard when engaged in official duties.\n(3)\tA person carrying a firearm when engaged in target shooting or when engaged in lawful hunting activity.\n(4)\tThe carrying of a firearm on a person's own property, business, or dwelling or on the property of another with permission from the property owner.\n(5)\tThe carrying of a firearm in a private motor vehicle or other private means of conveyance while traveling in, into or through the city, as permitted by § 18-12-105.6, C.R.S.\n(6)\tThe carrying of an unloaded firearm in an opaque locked or enclosed case that must be recognizable as a gun carrying case by a reasonable person. A plain-shaped case must be clearly marked to be deemed recognizable under this standard. A holster satisfies the requirement of a carrying case for a pistol.\n(7)\tThe carrying of a concealed handgun by a person with a valid permit to carry issued or recognized pursuant to Title 18, Article 12, Part 2 of the Colorado Revised Statutes, or the otherwise lawful use of a handgun by a person with a valid permit to carry.\n(8)\tPrivate security guards acting in the course and scope of their duties.\n(c)\tAs is used in this section:\n(1)\t\"Public place\" means a place to which the public or a substantial number of the public has access, except for premises where firearms are lawfully sold or repaired.\nOrdinance No. 8527 (2022)\nEditor's note(s)—Ord. No. 8527, § 1, effective July 7, 2022, repealed the former § 5-8-21, and enacted a new § 5-8-21 as set out herein. The former § 5-8-21 pertained to open carriage of firearms in carrying cases required and derived from Ordinance No. 8245 (2018)."
  },
  {
    "corpus": "BRC",
    "title": "5",
    "title_name": "General Offenses",
    "chapter": "8",
    "chapter_name": "Weapons",
    "anchor": "5-8-22",
    "heading": "Defenses.",
    "verbatim": "5-8-22. Defenses.\n(a)\tIt is an affirmative defense to a charge of violating Sections 5-8-3, \"Discharge of Firearms,\" 5-8-4, \"Possessing and Discharging Firearm or Bow in Park or Open Space,\" 5-8-5, \"Negligently Shooting Bow or Slingshot,\" 5-8-6, \"Aiming Weapon at Another,\" 5-8-7, \"Flourishing Deadly Weapon in Alarming Manner,\" and 5-8-8, \"Possession of Loaded Firearms,\" B.R.C. 1981, that the defendant was:\n(1)\tReasonably engaged in lawful self-defense under the statutes of the State of Colorado; or\n(2)\tReasonably exercising the right to keep and bear arms in defense of the defendant's or another's home, person and property or in aid of the civil power when legally thereto summoned.\n(b)\tIt is a specific defense to a charge of violating Sections 5-8-3, \"Discharge of Firearms,\" 5-8-4, \"Possessing and Discharging Firearm or Bow in Park or Open Space,\" and 5-8-8, \"Possession of Loaded Firearms,\" B.R.C. 1981, that the events occurred in an area designated as a target range by the city manager under Section 5-8-26, \"City Manager May Designate Target Ranges,\" B.R.C. 1981, for the type of weapon involved. It is a specific defense to a charge of violating Section 5-8-4, \"Possessing and Discharging Firearm or Bow in Park or Open Space,\" B.R.C. 1981, by possession that the defendant was going directly to or returning directly from such a target range.\n(c)\tIt is an affirmative defense to a charge of violating Sections 5-8-8, \"Possession of Loaded Firearms,\" 5-8-9, \"Carrying a Concealed Weapon,\" and 5-8-11, \"Possessing Firearm While Intoxicated,\" B.R.C. 1981, that the defendant was:\n(1)\tIn the defendant's own dwelling or place of business or on property owned or under the defendant's control at the time; or\n(2)\tIn a private automobile or other private means of conveyance at the time and was carrying the weapon for lawful protection of the defendant's or another's person or property while traveling; or\n(3)\tCharged with carrying a knife that was a hunting or fishing knife carried by the defendant for sport use.\n(d)\tIt is a specific defense to a charge of violating Sections 5-8-8, \"Possession of Loaded Firearms,\" and 5-8-9, \"Carrying a Concealed Weapon,\" B.R.C. 1981, that the defendant was carrying the weapon pursuant to a concealed weapons permit valid under the statutes of the State of Colorado.\n(e)\tIt is a specific defense to a charge of violating Sections 5-8-3, \"Discharge of Firearms,\" and 5-8-8, \"Possession of Loaded Firearms,\" B.R.C. 1981, that the loaded gas or mechanically operated gun was possessed or discharged in a building with the permission of the property owner and the projectile did not leave the building.\n(f)\tIt is a specific defense to a charge of violating Section 5-8-10, \"Possession of Illegal Weapons,\" B.R.C. 1981:\n(1)\tThat the person had a valid permit for such weapon pursuant to federal law at the time of the offense; or\n(2)\tThat the illegal weapon was an assault weapon accompanied by a certificate of ownership, issued under Section 5-8-28(i), or previously issued prior to December 31, 2018, by the Boulder Police Department.\n(g)\tIt is a specific defense to a charge of violating Section 5-8-4, \"Possessing and Discharging Firearm or Bow in Park or Open Space,\" B.R.C. 1981, that the firearm, gas or mechanically operated gun, bow, slingshot or crossbow possessed by the person was being transported in a motor vehicle. This defense does not apply to a charge of violation involving discharge of a missile.\n(h)\tIt is an affirmative defense to any charge of a violation of this chapter relating to carrying firearms that the defendant was carrying the firearm in a private automobile or other private means of conveyance for hunting while traveling in, into or through the city, as permitted by § 18-12-105.6, C.R.S.\nOrdinance Nos. 5497 (1992); 8245 (2018); 8494 (2022)\nState law reference(s)—§ 18-12-105(2)(b), C.R.S."
  },
  {
    "corpus": "BRC",
    "title": "5",
    "title_name": "General Offenses",
    "chapter": "8",
    "chapter_name": "Weapons",
    "anchor": "5-8-23",
    "heading": "Seizure of Weapons.",
    "verbatim": "5-8-23. Seizure of Weapons.\nAny peace officer who has probable cause to believe that a violation of this chapter has occurred may, in addition to taking any other action, seize the weapons or items used in said violation. Any weapon or items so seized shall be secured by the peace officer in accordance with the rules of the chief of police."
  },
  {
    "corpus": "BRC",
    "title": "5",
    "title_name": "General Offenses",
    "chapter": "8",
    "chapter_name": "Weapons",
    "anchor": "5-8-24",
    "heading": "Forfeiture and Disposition of Deadly Weapons.",
    "verbatim": "5-8-24. Forfeiture and Disposition of Deadly Weapons.\nAfter final conviction, every person convicted of any violation of any provision of this code, another ordinance of the city or a state statute involving a deadly weapon shall forfeit to the city the weapon involved. After conviction, it shall be the duty of the chief of police to dispose of the weapon or item, as the chief deems appropriate."
  },
  {
    "corpus": "BRC",
    "title": "5",
    "title_name": "General Offenses",
    "chapter": "8",
    "chapter_name": "Weapons",
    "anchor": "5-8-25",
    "heading": "Exemptions from Chapter.",
    "verbatim": "5-8-25. Exemptions from Chapter.\nNothing in this chapter shall be construed to forbid the following persons from having in their possession, displaying, concealing or discharging such weapons as are necessary in the authorized and proper performance of their official duties:\n(a)\tUnited States Marshals, any sheriffs, constables, and their deputies.\n(b)\tAny regular or ex officio police officer.\n(c)\tAny government agent, officer, or employee, any other peace officer, or members of the United States Armed Forces, Colorado National Guard or Reserve Officer Training Corps acting in the course and scope of their duties.\nOrdinance Nos. 5462 (1992); 8245 (2018); 8259 (2018); 8494 (2022)"
  },
  {
    "corpus": "BRC",
    "title": "5",
    "title_name": "General Offenses",
    "chapter": "8",
    "chapter_name": "Weapons",
    "anchor": "5-8-26",
    "heading": "City Manager May Designate Target Ranges.",
    "verbatim": "5-8-26. City Manager May Designate Target Ranges.\n(a)\tThe city manager may designate and establish areas within any property owned by the city as target ranges.\n(b)\tThe city manager shall issue a permit for a private or commercial target range upon application therefor, if the manager finds that:\n(1)\tThe range is so located and constructed as to protect the health and safety of range users and residents of the city;\n(2)\tUse of the range will not violate Chapter 5-9, \"Noise,\" B.R.C. 1981; and\n(3)\tOperation of the range will not violate any provision of this code or an ordinance of the city or state or federal law.\n(c)\tThe city manager may adopt reasonable regulations to implement the provisions of subsection (b) of this section and prescribe the form and content of the permit application.\n(d)\tPermits issued under subsection (b) of this section are valid for five years, if issued to the owner of the land upon which the range is located, or for the period of the lease or permission to use the land, if issued to any other person, but for no more than five years.\n(e)\tThe city manager may revoke a permit issued under subsection (b) of this section if the target range under the permit ceases to meet the requirements of that subsection. Before revoking a permit issued under this section, the manager shall afford the permittee an opportunity for a hearing under the procedures prescribed by Chapter 1-3, \"Quasi-Judicial Hearings,\" B.R.C. 1981."
  },
  {
    "corpus": "BRC",
    "title": "5",
    "title_name": "General Offenses",
    "chapter": "8",
    "chapter_name": "Weapons",
    "anchor": "5-8-27",
    "heading": "Firearms Dealers; Display of Weapons.",
    "verbatim": "5-8-27. Firearms Dealers; Display of Weapons.\nNo secondhand dealer, pawnbroker or any other person engaged in the wholesale or retail sale, rental or exchange of any firearms shall display or place on exhibition any firearm in any show window or other window facing upon any street of the city.\nOrdinance No. 7299 (2003)"
  },
  {
    "corpus": "BRC",
    "title": "5",
    "title_name": "General Offenses",
    "chapter": "8",
    "chapter_name": "Weapons",
    "anchor": "5-8-28",
    "heading": "Assault Weapons.",
    "verbatim": "5-8-28. Assault Weapons.\n(a)\tAny person who, prior to July 1, 2022, was legally in possession of an assault weapon or large capacity magazine shall have until December 31, 2022 to obtain a certificate for the assault weapon as provided in subsection (c) of this section.\n(b)\tAny person who, prior to July 1, 2022, was legally in possession of a rapid-fire trigger activator shall have until August 1, 2022 to do any of the following without being subject to prosecution:\n(1)\tRemove the rapid-fire trigger activator from the City of Boulder; or\n(2)\tSurrender the rapid-fire trigger activator to the Boulder Police Department for destruction.\n(c)\tAny person seeking to certify an assault weapon that he or she legally possessed prior to July 1, 2022, unless they obtained a certificate of ownership prior to December 31, 2018, must comply with the following requirements:\n(1)\tSubmit to a background check conducted by the appropriate law enforcement agency to confirm that he or she is not prohibited from possessing a firearm pursuant to 18 U.S.C. § 922 or C.R.S § 18-12-108; and\n(2)\tUnless the person is currently prohibited by law from possessing a firearm, prior to December 31, 2022 apply for a certificate for the assault weapon from the Boulder Police Department.\n(d)\tAll persons who hold a certificate issued prior to December 31, 2018 or who obtain a certificate pursuant to subsection (i) of this section shall:\n(1)\tSafely and securely store the assault weapon pursuant to the regulations adopted by the appropriate law enforcement agency;\n(2)\tPossess the assault weapon only on property owned or immediately controlled by the person, or while on the premises of a licensed gunsmith for the purpose of lawful repair, or while engaged in the legal use of the assault weapon at a duly licensed firing range, or while traveling to or from these locations, provided that the assault weapon is stored unloaded in a locked container during transport. The term \"locked container\" does not include the utility compartment, glove compartment, or trunk of a motor vehicle; and\n(3)\tReport the loss or theft of a certified assault weapon to the appropriate law enforcement agency within 48 hours of the time the discovery was made or should have been made.\n(e)\tIf a certified assault weapon is used in the commission of a crime, the owner shall be civilly liable for any damages resulting from that crime. The liability imposed by this subsection shall not apply if the assault weapon was stolen and the certified owner reported the theft of the firearm to law enforcement within 48 hours of the time the discovery was made or should have been made.\n(f)\tCertified assault weapons may not be purchased, sold or transferred in the City of Boulder, except for transfer to a licensed gunsmith for the purpose of lawful repair, or transfer to the appropriate law enforcement agency for the purpose of surrendering the assault weapon for destruction.\n(g)\tPersons acquiring an assault weapon by inheritance, bequest, or succession shall, within 90 days of acquiring title, do one of the following:\n(1)\tModify the assault weapon to render it permanently inoperable;\n(2)\tSurrender the assault weapon to the Boulder Police Department for destruction;\n(3)\tTransfer the assault weapon to a firearms dealer who is properly licensed under federal, state and local laws; or\n(4)\tPermanently remove the assault weapon from the City of Boulder.\n(h)\tThe owner of a certified assault weapon may not possess in the City of Boulder any assault weapons purchased on or after July 1, 2022.\n(i)\tThe city manager shall charge a fee for each certificate sufficient to cover the costs of administering the certificate program. The city manager shall issue to qualified applicants two original copies of each certificate issued. The City of Boulder shall not maintain any records of certificates issued. The person who received the certificate shall keep one copy with the weapon certified and the second copy in a secure place to replace the certificate maintained with the weapon.\nOrdinance Nos. 7299 (2003); 8245 (2018); 8259 (2018); 8494 (2022)"
  },
  {
    "corpus": "BRC",
    "title": "5",
    "title_name": "General Offenses",
    "chapter": "8",
    "chapter_name": "Weapons",
    "anchor": "5-8-29",
    "heading": "Application for Permits and Fees.",
    "verbatim": "5-8-29. Application for Permits and Fees.\nRepealed.\nOrdinance No. 7299 (2003)"
  },
  {
    "corpus": "BRC",
    "title": "5",
    "title_name": "General Offenses",
    "chapter": "8",
    "chapter_name": "Weapons",
    "anchor": "5-8-30",
    "heading": "Investigation, Approval and Issuance of Permits.",
    "verbatim": "5-8-30. Investigation, Approval and Issuance of Permits.\nRepealed.\nOrdinance No. 7299 (2003)"
  },
  {
    "corpus": "BRC",
    "title": "5",
    "title_name": "General Offenses",
    "chapter": "8",
    "chapter_name": "Weapons",
    "anchor": "5-8-31",
    "heading": "Term of Permit, Renewal Procedures.",
    "verbatim": "5-8-31. Term of Permit, Renewal Procedures.\nRepealed.\nOrdinance No. 7299 (2003)"
  },
  {
    "corpus": "BRC",
    "title": "5",
    "title_name": "General Offenses",
    "chapter": "8",
    "chapter_name": "Weapons",
    "anchor": "5-8-32",
    "heading": "Change of Firearms, Address or Employment.",
    "verbatim": "5-8-32. Change of Firearms, Address or Employment.\nRepealed.\nOrdinance No. 7299 (2003)"
  },
  {
    "corpus": "BRC",
    "title": "5",
    "title_name": "General Offenses",
    "chapter": "8",
    "chapter_name": "Weapons",
    "anchor": "5-8-33",
    "heading": "Permit Not Transferable.",
    "verbatim": "5-8-33. Permit Not Transferable.\nRepealed.\nOrdinance No. 7299 (2003)"
  },
  {
    "corpus": "BRC",
    "title": "5",
    "title_name": "General Offenses",
    "chapter": "8",
    "chapter_name": "Weapons",
    "anchor": "5-8-34",
    "heading": "Exhibition of Permit.",
    "verbatim": "5-8-34. Exhibition of Permit.\nRepealed.\nOrdinance No. 7299 (2003)"
  },
  {
    "corpus": "BRC",
    "title": "5",
    "title_name": "General Offenses",
    "chapter": "8",
    "chapter_name": "Weapons",
    "anchor": "5-8-35",
    "heading": "Revocation and Suspension of Permits.",
    "verbatim": "5-8-35. Revocation and Suspension of Permits.\nRepealed.\nOrdinance No. 7299 (2003)"
  },
  {
    "corpus": "BRC",
    "title": "5",
    "title_name": "General Offenses",
    "chapter": "8",
    "chapter_name": "Weapons",
    "anchor": "5-8-36",
    "heading": "Surrender of Permit.",
    "verbatim": "5-8-36. Surrender of Permit.\nRepealed.\nOrdinance No. 7299 (2003)"
  },
  {
    "corpus": "BRC",
    "title": "5",
    "title_name": "General Offenses",
    "chapter": "8",
    "chapter_name": "Weapons",
    "anchor": "5-8-37",
    "heading": "No City Liability for Issuing Permit.",
    "verbatim": "5-8-37. No City Liability for Issuing Permit.\nRepealed.\nOrdinance No. 7299 (2003)"
  },
  {
    "corpus": "BRC",
    "title": "5",
    "title_name": "General Offenses",
    "chapter": "8",
    "chapter_name": "Weapons",
    "anchor": "5-8-38",
    "heading": "State Preemption.",
    "verbatim": "5-8-38. State Preemption.\nIt is an affirmative defense to any charge of a violation of this chapter relating to carrying firearms that the defendant was carrying the firearm in a private automobile or other private means of conveyance for lawful protection of such person's or another's person or property or for hunting while traveling in, into or through the city, as permitted by § 18-12-105.6, C.R.S.\nOrdinance Nos. 7134 (2001); 7299 (2003)"
  },
  {
    "corpus": "BRC",
    "title": "5",
    "title_name": "General Offenses",
    "chapter": "8",
    "chapter_name": "Weapons",
    "anchor": "5-8-39",
    "heading": "Prohibitions.",
    "verbatim": "5-8-39. Prohibitions.\n(a)\tExcept as provided in subsection (c), it shall be a civil offense for any person to possess any firearm that has not been identified with a serial number by a federal licensee.\n(b)\tA violation of subsection (a) that includes a finding that the person possessed one or more firearms, which have not been identified with a serial number by a federal licensee, with an intent to sell or distribute the firearms unlawfully is a criminal offense.\n(c)\tSubsection (a) shall not apply to:\n(1)\tA federal licensee;\n(2)\tAny firearm made before October 22, 1968 (unless remanufactured after that date); or\n(3)\tA local, state, or federal law enforcement officer who possesses a firearm pursuant to their official duties.\nOrdinance No. 8526 (2022)"
  },
  {
    "corpus": "BRC",
    "title": "5",
    "title_name": "General Offenses",
    "chapter": "8",
    "chapter_name": "Weapons",
    "anchor": "5-8-40",
    "heading": "Disclosure.",
    "verbatim": "5-8-40. Disclosure.\n(a)\tAt any site where firearm sales or transfers are conducted in the City of Boulder, a licensed firearms dealer shall conspicuously display a sign containing the information set forth in subsection (b) in any area where the sales or transfers occur.\nSuch signs shall be posted in a manner so that they can be easily viewed by persons to whom firearms are sold or transferred, and shall not be removed, obscured, or rendered illegible. If the site where the sales or transfers occur are the premises listed on the licensed firearms dealer's federal license(s), an additional such sign shall be placed at or near the entrance.\n(b)\tEach informational sign shall be at least eight and one-half inches high by eleven inches wide and feature black text against a white background and letters that are at least one-half inch high. The signs shall not contain other statements or markings other than the following text in English and Spanish:\nWARNING: Access to a firearm in the home significantly increases the risk of suicide, death during domestic violence disputes, and the unintentional death of children, household members, or others. If you or a loved one is experiencing distress and/or depression, call 1-844-493-8255. Posted pursuant to Section 5-8-40, B.R.C. 1981.\n(c)\tThe City of Boulder shall make available a downloadable sign as described in subsection (b) of this section in English and Spanish and make such sign available on the City's website.\n(d)\tThe Boulder Police Department is authorized to enforce this chapter consistent with subsection (e) of this section.\n(e)\tWhen violations of this section occur, a warning shall first be given to the licensed firearms dealer or other person in charge of the site. Any subsequent violation is subject to a fine of up to five hundred dollars ($500). Each day upon which a violation occurs or is permitted to continue constitutes a separate violation.\nOrdinance No. 8528 (2022)"
  },
  {
    "corpus": "BRC",
    "title": "5",
    "title_name": "General Offenses",
    "chapter": "8",
    "chapter_name": "Weapons",
    "anchor": "5-8-41",
    "heading": "Waiting Period Prior to Firearm Purchase.",
    "verbatim": "5-8-41. Waiting Period Prior to Firearm Purchase.\nNo licensed firearms dealer shall deliver a firearm, and no person shall take possession of a firearm from a licensed dealer, until both of the following have occurred:\n(a)\tTen days have elapsed from the date the dealer initiated the Colorado Bureau of Investigation check of the purchaser pursuant to § 24-33.5-424, C.R.S.; and\n(b)\tThe dealer has received approval for the firearms transfer as required by § 18-12-112.5, C.R.S.\n(c)\tExceptions. This section does not apply to:\n(1)\tAny law enforcement or corrections agency, or law enforcement or corrections officer acting within the course and scope of his or her employment or official duties;\n(2)\tA United States Marshal or member of the Armed Forces of the United States or the National Guard, or a federal official transferring firearms as required in the operation of his or her official duties;\n(3)\tLicensed firearms manufacturers, importers or dealers, while engaged in the course and scope of their activities as licensees, provided that the transfers are between licensees and all such licensees are properly licensed under federal, state and local law;\n(4)\tA gunsmith who receives a firearm for service or repair;\n(5)\tA properly licensed private security firm, or private security personnel, who acquires the firearms for use in the course and scope of employment; or\n(6)\tA common carrier, warehouseman, or other person engaged in the business of transporting or storing goods, to the extent that the possession or receipt of any firearm or having on or about the person of any firearm, is in the ordinary course of business and not for the personal use of any such person.\nOrdinance No. 8529 (2022)"
  },
  {
    "corpus": "BRC",
    "title": "5",
    "title_name": "General Offenses",
    "chapter": "8",
    "chapter_name": "Weapons",
    "anchor": "5-8-42",
    "heading": "Severability.",
    "verbatim": "5-8-42. Severability.\nIf any section, subsection, sentence or clause of this chapter is for any reason declared unconstitutional or invalid or unenforceable by any court of competent jurisdiction, such decision shall not affect the constitutionality, validity or enforceability of the remaining portions of this chapter or any part thereof. The City Council hereby declares that it would have adopted this chapter notwithstanding the unconstitutionality, invalidity or unenforceability of any one or more of its sections, subsections, sentences or clauses.\nOrdinance No. 8494 (2022)"
  },
  {
    "corpus": "BRC",
    "title": "5",
    "title_name": "General Offenses",
    "chapter": "9",
    "chapter_name": "Noise",
    "anchor": "5-9-1",
    "heading": "Legislative Intent.",
    "verbatim": "5-9-1. Legislative Intent.\nThe purpose of this chapter is to protect the public health, safety and welfare by defining those noises and sounds which by their volume or other physical characteristics, and, depending on their time, place and manner, disturb people of normal sensitivity, and to regulate such noises and sounds to the extent that can be done without detrimentally affecting necessary residential, commercial and governmental activities.1 It is not the intention of the council to differentiate on the basis of the content, if there be any, of the prohibited sounds. However, in certain instances the council finds that there is a compelling governmental interest in making an exception for the loudness of certain sounds, such as warnings of imminent hazard.\n1 For other provisions involving noise, see sections 6-1-19, \"Barking, Howling, or Other Unreasonable Animal Noise Prohibited,\" 7-3-4, and \"Adequate Muffling of Noise Required,\" B.R.C. 1981."
  },
  {
    "corpus": "BRC",
    "title": "5",
    "title_name": "General Offenses",
    "chapter": "9",
    "chapter_name": "Noise",
    "anchor": "5-9-2",
    "heading": "Definitions.",
    "verbatim": "5-9-2. Definitions.\nAs used in this chapter, the following words are defined to mean:\nCommercial district or commercial zone or commercial means any area zoned A, BCS, BMS, BC, MU, P, BT, BR or DT.\nGroup living arrangement means those group residencies in which the individual or family lives in a room or rooms of their own, but which contains common dining facilities and where decisions concerning the use of common areas for social events are shared among the individual residents. These include, without limitation, cooperative housing units, congregate or residential care facilities, rooming houses, dormitories, fraternities and sororities, as those terms are used in Title 9, \"Land Use Code,\" B.R.C. 1981. These exclude buildings where people only reside temporarily such as hotels, motels or bed and breakfasts and buildings where each person resides in and controls a complete dwelling unit, including, without limitation, duplexes, triplexes, fourplexes, apartment buildings and condominiums.\nIndustrial district or industrial zone or industrial means any area zoned IG, IM, IS, or IMS.\nLight construction work means work which uses only hand tools and power tools of no more than five horsepower, but not including power actuated fastening devices (e.g., nail guns).\nResidential district or residential zone or residential means any area zoned RE, RH-1, RH-2, RH-3, RH-4, RH-5, RL, MH, RM, RMX, RR-1, or RR-2.\nZoned means classified into one of the zoning districts specified in Section 9-5-2, \"Zoning Districts,\" B.R.C. 1981, as shown on the zoning map adopted by Section 9-5-3, \"Zoning Map,\" B.R.C. 1981. Each district includes all areas zoned under the same prefix (i.e., RL includes RL-1 and RL-2). If new districts are established without amendment to this section, it is intended that the new district be governed under this chapter as if in the existing district which it most closely resembles, and if it could as easily be in one category or another, that it be in the category with the lower allowable decibel levels.\nOrdinance No. 7522 (2007)"
  },
  {
    "corpus": "BRC",
    "title": "5",
    "title_name": "General Offenses",
    "chapter": "9",
    "chapter_name": "Noise",
    "anchor": "5-9-3",
    "heading": "Exceeding Decibel Sound Levels Prohibited.",
    "verbatim": "5-9-3. Exceeding Decibel Sound Levels Prohibited.\n(a)\tNo person shall:\n(1)\tOperate any type of vehicle, machine, or device;\n(2)\tCarry on any activity; or\n(3)\tPromote or facilitate the carrying on of any activity, which makes sound in excess of the level specified in this section.\n(b)\tSound from any source, other than a moving vehicular source located within the public right of way, shall not exceed any of the following limits for its appropriate zone:\n(1)\tThe sound limits prescribed by this section are set forth in the following table for the zoning district within the following use classifications in Section 9-5-2, \"Zoning Districts,\" B.R.C. 1981:\n(2)\tSound from construction work for which a building permit has been issued:\n(A)\tDuring the hours of 7 a.m. to 5 p.m., sound for work of any type shall be deemed received in an industrial zoning district;\n(B)\tDuring the hours of 5 p.m. until 9 p.m., sound from light construction work received in a residential zone shall be deemed received in a commercial zoning district; and\n(C)\tUnder no circumstances shall amplified sound be considered as construction work activity.\n(3)\tSound from a source regulated by this subsection:\n(A)\tSound from a source on private property shall be measured at or inside the property line of property other than that on which the sound source is located;\n(B)\tSound from a source on public property may be measured on that receiving property so long as the measurement is taken at least twenty-five feet from the source, or it may be measured at or inside the property line of receiving property other than the public property on which the sound source is located;\n(C)\tFor the purposes of this paragraph, a leasehold shall be deemed a property of the lessee, and its boundary, other than a boundary with adjacent property owned by the lessee, shall be deemed a property line.\n(c)\tAll sound measurements shall be made on a sound level meter that meets ANSI specification S1.4-1974 for Type I or Type II equipment. The manufacturer's published indication of compliance with such specifications is prima facie evidence of compliance with this subsection.\n(d)\tIt shall be a defense to a charge of violating this section that:\n(1)\tThe sound was made by an authorized emergency vehicle when responding to an emergency or as otherwise authorized by law or acting in time of emergency or by an emergency warning device operated by a government;\n(2)\tThe sound was made by the sounding of the horn of any vehicle as a danger warning signal or by the sounding of any warning device as required by law;\n(3)\tThe sound was made within the terms of a fireworks display or temporary street closure permit issued by the city manager, or was made by the rendering of military honors at a funeral by a military funeral honors detail;\n(4)\tThe sound was made by an animal;\n(5)\tThe sound was made within the terms and conditions of a sound level variance granted by the city manager;\n(6)\tThe sound was made on property belonging to or leased or managed by a federal, state, or county governmental body other than the city and made by an activity of the governmental body or by others pursuant to a contract, lease, or permit granted by such governmental body;\n(7)\tThe sound was made by a police alarm device, if the police alarm shuts off automatically after no longer than ten minutes, by a fire alarm, or by an alarm system installed in a motor vehicle, if the car alarm shuts off automatically after no longer than five minutes;\n(8)\tThe sound was made by snow removal equipment equipped with a standard muffling system in good repair while removing snow; or\n(9)\tThe sound was made between the hours of 7 a.m. and 9 p.m. by a lawn mower or gardening equipment equipped with a standard muffling system in good repair.\n(e)\tThis section shall not be construed to conflict with the right of any person to maintain an action in equity to abate a noise nuisance under the laws of the state.\nOrdinance Nos. 7522 (2007); 7831 (2012); 7965 (2014)"
  },
  {
    "corpus": "BRC",
    "title": "5",
    "title_name": "General Offenses",
    "chapter": "9",
    "chapter_name": "Noise",
    "anchor": "5-9-4",
    "heading": "Exceeding Decibel Sound Levels From a Motor Vehicle Prohibited.",
    "verbatim": "5-9-4. Exceeding Decibel Sound Levels From a Motor Vehicle Prohibited.\n(a)\tSound from a motor vehicle located within the public right of way shall not exceed eighty decibels on the \"A\" weighting scale (dBA), except that sound from a vehicle with a manufacturer's gross weight rating of ten thousand pounds and above may exceed eighty dBA but shall not exceed eighty-eight dBA. Such sound shall be measured at a distance of at least twenty-five feet from a vehicle located within the public right of way.\n(b)\tSuch sound measurements shall be made on a sound level meter that meets the requirements of Subsection 5-9-3(c), B.R.C. 1981.\n(c)\tIt shall be an affirmative defense to a charge of violating this section that:\n(1)\tThe sound was made by an authorized emergency vehicle when responding to an emergency or as otherwise authorized by law or acting in time of emergency or by an emergency warning device operated by a government;\n(2)\tThe sound was made by the sounding of the horn of any vehicle as a danger warning signal or by the sounding of any warning device as required by law;\n(3)\tThe sound was made within the terms and conditions of a sound level variance granted by the city manager;\n(4)\tThe sound was made by an alarm system installed in a motor vehicle, if the car alarm shuts off automatically after no longer than five minutes; or\n(5)\tThe sound was made by snow removal equipment equipped with a standard muffling system in good repair while removing snow.\nOrdinance Nos. 7831 (2012); 7965 (2014)"
  },
  {
    "corpus": "BRC",
    "title": "5",
    "title_name": "General Offenses",
    "chapter": "9",
    "chapter_name": "Noise",
    "anchor": "5-9-5",
    "heading": "Disrupting Quiet Enjoyment of Home.",
    "verbatim": "5-9-5. Disrupting Quiet Enjoyment of Home.\n(a)\tNo person shall engage in, or be responsible for, a course of conduct which is so loud that it materially interferes with or disrupts another individual in the conduct of activities at such individual's home.\n(b)\tThe following standards and definitions shall be used in the application of this section:\n(1)\tThe person engaging in such conduct must be at a location other than the complainant's home.\n(2)\tHome includes the physical residence as well as the outside premises.\n(3)\tAnother individual includes all members of the household as well as others rightfully in the residence or on the premises.\n(4)\tNo person shall be convicted of a violation of this section unless that person has been warned that conduct violating this section is occurring or has recently occurred and, following such warning, the conduct is repeated or continued.\n(A)\tNo additional warning need be issued as a precondition to enforcement of this provision if similar conduct occurred within the previous ninety days and if a warning was communicated to an individual regarding his or her role in that past conduct.\n(B)\tA prior warning shall be sufficient with respect to each of the residents of an individual dwelling unit at which a prior noise incident occurred (including any resident in a group living arrangement), if, after a personal communication was made to a person who engaged in conduct subject to the provisions of this section, the city manager caused a warning letter to be sent by first class mail addressed to \"residents\" of the dwelling unit in which the person who received the prior warning resided at the time of the issuance of the prior warning and at which the prior noise incident occurred. If a warning was attempted but could not be personally communicated because no one would answer the door or the person engaged in the conduct could not be identified, a warning letter under this subparagraph shall be sufficient.\n(C)\tNo warning under this paragraph is required if the conduct would violate Subsection 5-9-6(b), B.R.C. 1981, concerning unreasonable unamplified sound, and it originated on private property.\n(5)\tIf conduct violative of this section:\n(A)\tOriginates upon private property;\n(B)\tThe owner or some other person with authority to control that property is present at the time that such occurs; and\n(C)\tThe owner or authorized person has received a communication requesting cessation or reduction in the level;\nthen the owner or authorized person is also responsible for the repeated or continued conduct under this section, even though not directly engaged in the conduct.\n(6)\tWhether or not noise is \"so loud that it materially interferes with or disrupts\" shall be measured against the objective standard of a reasonable person of normal sensitivity.\n(7)\tIt shall be an affirmative defense to a charge of violating this section that:\n(A)\tThe sound was made by an authorized emergency vehicle when responding to an emergency or as otherwise authorized by law or acting in time of emergency or by an emergency warning device operated by a government;\n(B)\tThe sound was made by the sounding of the horn of any vehicle as a danger warning signal or by the sounding of any warning device as required by law;\n(C)\tThe sound was made within the terms of a parade, fireworks display, or temporary street closure permit issued by the city manager, or was made by the rendering of military honors at a funeral by a military funeral honors detail;\n(D)\tThe sound was made by an animal;\n(E)\tThe sound was made on property belonging to or leased or managed by a federal, state, or county governmental body other than the city and made by an activity of the governmental body or by others pursuant to a contract, lease, or permit granted by such governmental body;\n(F)\tThe sound was made by a police alarm device, if the police alarm shuts off automatically after no longer than ten minutes, by a fire alarm, or by an alarm system installed in a motor vehicle, if the car alarm shuts off automatically after no longer than five minutes;\n(G)\tThe sound was made by snow removal equipment equipped with a standard muffling system in good repair while removing snow;\n(H)\tThe sound was made between the hours of 7 a.m. and 9 p.m. by a lawn mower or gardening equipment equipped with a standard muffling system in good repair; or\n(I)\tThe loud conduct consisted solely of natural speech or communication by or between people, unless such conduct was used as a guise materially to interfere with or disrupt another individual in the conduct of activities at the individual's home and that was the result.\n(8)\tIt is not a defense to a charge of violation of this section that the sound levels complied with the requirements of Section 5-9-3, \"Exceeding Decibel Sound Levels Prohibited,\" B.R.C. 1981.\nOrdinance Nos. 7831 (2012); 7965 (2014)"
  },
  {
    "corpus": "BRC",
    "title": "5",
    "title_name": "General Offenses",
    "chapter": "9",
    "chapter_name": "Noise",
    "anchor": "5-9-6",
    "heading": "Unreasonable Noise Prohibited.",
    "verbatim": "5-9-6. Unreasonable Noise Prohibited.\n(a)\tUnreasonable Amplified Noise:\n(1)\tNighttime Hours: Between the hours of 11 p.m. through 7 a.m., no person shall electronically amplify any sound, or make any noise by means of any electronic amplifier, which is loud enough to be audible to a person of normal hearing:\n(A)\tOne hundred or more feet beyond the property line of the property upon which the loudspeakers are located where they are located in a residential district.\n(B)\tOne hundred fifty or more feet beyond the property line of the property upon which the loudspeakers are located where they are located in a commercial or industrial district.\n(2)\tDaytime Hours: Between the hours of 7 a.m. through 11 p.m., no person shall electronically amplify any sound, or make any noise by means of any electronic amplifier, which is loud enough to be audible to a person of normal hearing two hundred or more feet beyond the property line of the property upon which the loudspeakers are located where they are located in a residential district.\n(3)\tEach resident or person in control of an activity or event in or on the premises of a dwelling unit who is present within that dwelling unit or upon the premises of that dwelling unit when sound in violation of this section is amplified or generated upon the premises shall be responsible for the generation of that sound or noise.\n(4)\tEach owner, manager, or person in control of an activity or event in or on the premises of a commercial or industrial property upon which sound in violation of this subsection is generated shall be responsible for the generation of that sound or noise.\n(5)\tIt shall be an affirmative defense to a charge of violating this subsection that:\n(A)\tThe sound was made by an authorized emergency vehicle when responding to an emergency call or acting in time of emergency or by an emergency warning device operated by a government;\n(B)\tThe sound was made by the sounding of the horn of any vehicle as a danger warning signal or by the sounding of any warning device as required by law;\n(C)\tThe sound was made within the terms of a city manager issued permit;\n(D)\tThe sound was made on property belonging to or leased or managed by a federal, state, or county governmental body other than the city and made by an activity of the governmental body or by others pursuant to a contract, lease, or permit granted by such governmental body;\n(E)\tThe sound was made by a police alarm device if the police alarm shuts off automatically after no longer than ten minutes, by a fire alarm, or by an alarm system installed in a motor vehicle, if the car alarm shuts off automatically after no longer than five minutes;\n(F)\tFor a charge of violation based on Paragraph (a)(3) or (a)(4) of this section, the defendant did all that a reasonable person could have done under the circumstances of the creation of the noise to prevent the offense and, if requested to do so, cooperated with law enforcement officers to identify accurately the offender or offenders; or\n(G)\tFor a charge of violation based on Paragraph (a)(4) of this section, the sound was made by a trespasser.\n(b)\tUnreasonable Unamplified Noise:\n(1)\tBetween the hours of 11 p.m. and 7 a.m., while on public property within a residential district, no person shall yell, scream, shout, cheer, sing, or otherwise make noise with the human voice louder than that which is reasonably necessary for normal conversational speech.\n(2)\tIt shall be an affirmative defense to a charge of violating this subsection that the noise was reasonably necessary to gain assistance to prevent a crime, catch a criminal, warn of fire or other danger, or to seek assistance for a health problem or injury or for assistance in dealing with an accident.\n(c)\tTrash Pickup: Between the hours of 11 p.m. and 7 a.m., no person shall make any trash pickup with a truck which has a compactor or the capacity to raise and dump dumpsters in any residential or commercial district, and no employer shall fail to prevent its employee from violating this subsection while the employee is driving a trash truck owned by or under the control of the employer. For the purposes of this subsection, testimony that the name of a business which holds itself out as being in the business of trash hauling was written on the trash truck shall be prima facie evidence that the trash truck was owned by or was under the control of the employer so identified.\nOrdinance Nos. 7831 (2012); 7965 (2014); 8531 (2022)"
  },
  {
    "corpus": "BRC",
    "title": "5",
    "title_name": "General Offenses",
    "chapter": "9",
    "chapter_name": "Noise",
    "anchor": "5-9-7",
    "heading": "Unreasonable Noise Prohibited Between the Hours of 9:00 p.m. Through 7:00 a.m. - Lawn Mowers, Leaf Blowers, and Construction.",
    "verbatim": "5-9-7. Unreasonable Noise Prohibited Between the Hours of 9:00 p.m. Through 7:00 a.m. - Lawn Mowers, Leaf Blowers, and Construction.\nBetween the hours of 9:00 p.m. through 7:00 a.m., no person shall:\n(a)\tLawn Mowers and Leaf Blowers: Operate any lawn mower, leaf blower, or other power lawn or gardening tool on any private property within, or within one hundred feet of the boundary of, any residential district.\n(b)\tConstruction in a Residential Zone: In a residential zone, use power tools which are audible off the property upon which they are being used as part of construction work for which a building permit has been issued or is required for the work.\nOrdinance Nos. 7831 (2012); 7965 (2014)"
  },
  {
    "corpus": "BRC",
    "title": "5",
    "title_name": "General Offenses",
    "chapter": "9",
    "chapter_name": "Noise",
    "anchor": "5-9-8",
    "heading": "Unreasonable Noise Prohibited at Any Time - Motor Vehicle Amplified Sound.",
    "verbatim": "5-9-8. Unreasonable Noise Prohibited at Any Time - Motor Vehicle Amplified Sound.\n(a)\tNo person shall operate any electronic amplifier in or attached to any motor vehicle so that the sound is audible at a distance of twenty-five feet or more from the motor vehicle, or which emits vibrations which can be felt by persons outside of that vehicle. This prohibition does not apply to sound made on private property with the permission of the property owner and not audible or palpable beyond the property line.\n(b)\tIt shall be an affirmative defense to a charge of violating this section that:\n(1)\tThe sound was made by an authorized emergency vehicle when responding to an emergency call or acting in time of emergency or by an emergency warning device operated by a government;\n(2)\tThe sound was made by the sounding of the horn of any vehicle as a danger warning signal or by the sounding of any warning device as required by law;\n(3)\tThe sound was made within the terms of a parade or temporary street closure permit issued by the city manager; or\n(4)\tThe sound was made by an alarm system installed in a motor vehicle, if the car alarm shuts off automatically after no longer than five minutes.\nOrdinance Nos. 7831 (2012); 7965 (2014)"
  },
  {
    "corpus": "BRC",
    "title": "5",
    "title_name": "General Offenses",
    "chapter": "9",
    "chapter_name": "Noise",
    "anchor": "5-9-9",
    "heading": "Certain Musical Instruments Prohibited on the Mall Between 12 Midnight and 7:00 a.m.",
    "verbatim": "5-9-9. Certain Musical Instruments Prohibited on the Mall Between 12 Midnight and 7:00 a.m.\nNo person shall play any percussive or amplified musical instrument on the mall between the hours of 12 midnight and 7 a.m.\nOrdinance Nos. 7831 (2012); 7965 (2014)"
  },
  {
    "corpus": "BRC",
    "title": "5",
    "title_name": "General Offenses",
    "chapter": "9",
    "chapter_name": "Noise",
    "anchor": "5-9-10",
    "heading": "Sound Variances.",
    "verbatim": "5-9-10. Sound Variances.\n(a)\tDecibel Variance: A variance shall be granted for the decibel limits of Section 5-9-3, \"Exceeding Decibel Sound Levels Prohibited,\" or 5-9-4, \"Exceeding Decibel Sound Levels From a Motor Vehicle Prohibited,\" B.R.C. 1981, after application is made if the city manager finds that compliance will cause an undue hardship and further finds that:\n(1)\tAdditional time is necessary for the applicant to alter or modify the activity or operation to comply with this section; or\n(2)\tThe activity, operation, or sound source will be of temporary duration, and even with the application of the best available control technology cannot be done in a manner that would comply with this section.\nIn either case, the manager must also find that no reasonable alternative is available to the applicant. If the manager grants a variance, the manager shall prescribe such reasonable conditions or requirements as are necessary to minimize adverse effects upon the community or the surrounding neighborhood.\n(b)\tTrash Variance: Trash haulers may apply to the city manager for a variance of the provisions of Subsection 5-9-6(c), B.R.C. 1981, for locations within a commercial district. Possession of a valid variance shall be a specific defense to any charge under Subsection 5-9-6(c), B.R.C. 1981, if the act complained of was within the variance granted. The manager may grant all or a part of any requested variance, and may place such conditions upon any variance granted as are reasonably suited to limit the harmful effects of the variance. Such variances shall be granted only if the applicant can demonstrate to the manager's satisfaction:\n(1)\tThat the location in question is sufficiently removed from any residential use that the noise of trash removal will not disturb anyone in their residence, including, without limitation, hotel and motel accommodations; or\n(2)\tThat the location cannot feasibly be serviced during permitted hours, and that the variance is the least necessary to permit trash removal while still assuring nearby residents reasonable nocturnal quiet."
  },
  {
    "corpus": "BRC",
    "title": "5",
    "title_name": "General Offenses",
    "chapter": "9",
    "chapter_name": "Noise",
    "anchor": "5-9-11",
    "heading": "Flood Debris Removal.",
    "verbatim": "5-9-11. Flood Debris Removal.\nNotwithstanding any other provision of this chapter, until April 15, 2014, individuals and entities involved in debris removal necessitated by flooding, may engage in operations as necessary from 5 a.m. until 12 midnight.\nOrdinance No. 7946 (2013)"
  },
  {
    "corpus": "BRC",
    "title": "5",
    "title_name": "General Offenses",
    "chapter": "10",
    "chapter_name": "Marijuana Offenses",
    "anchor": "5-10-1",
    "heading": "Definitions.",
    "verbatim": "5-10-1. Definitions.\nFor purposes of this chapter, the following words shall have the following definitions:\nCannabis means Marijuana or Hemp.\nHemp or Industrial Hemp means the plant from the genus cannabis and any part of the plant, including the seeds of the plant and all derivatives, extracts, cannabinoids, isomers, acids, salts, and salts of isomers, whether growing or not, with a delta-9 tetrahydrocannabinol concentration of no more than three-tenths of one percent on a dry-weight basis. Any increase of delta-9 tetrahydrocannabinol concentration over three-tenths of one percent on a dry-weight basis causes the cannabis to be regulated as marijuana even if it was grown as hemp or is intended to be sold as a hemp plant or product.\nMarijuana means all parts of the plant from the genus cannabis whether growing or not, the seeds thereof, the resin extracted from any part of the plant, and every compound, manufacture, salt, derivative, mixture, or preparation of the plant, its seeds, or its resin. It does not include fiber produced from the stalks, oil, or cake made from the seeds of the plant, or sterilized seed of the plant which is incapable of germination, if these items exist apart from any other item defined as marijuana in this subsection. Marijuana does not include Hemp or Industrial Hemp.\nRegistry identification card shall have the same meaning as is set forth in Article XVIII, Section 14(1)(b) of the Colorado Constitution, or as may be more fully defined in any applicable state law or regulation.\nUnderage person means any person under twenty-one years of age.\nOrdinance Nos. 7892 (2013); 8393 (2020); 8437 (2020)"
  },
  {
    "corpus": "BRC",
    "title": "5",
    "title_name": "General Offenses",
    "chapter": "10",
    "chapter_name": "Marijuana Offenses",
    "anchor": "5-10-2",
    "heading": "Consumption of Marijuana in Public Prohibited.",
    "verbatim": "5-10-2. Consumption of Marijuana in Public Prohibited.\n(a)\tNo person shall consume any marijuana in public.\n(b)\tFor purposes of this section,in public means:\n(1)\tIn or upon any public way or public right-of-way, whether in a vehicle or not;\n(2)\tOn any property or in any building that is owned, leased, used by, or open to the public; or\n(3)\tIn or upon those portions of any private property upon which the public has an express or implied license to enter or remain.\n(c)\tNo person shall drive or sit in the driver's seat of any motor vehicle, other than one licensed to carry passengers for hire, in which a violation of Subsection (a) of this section is occurring.\nOrdinance Nos. 7892 (2013); 7965 (2014)"
  },
  {
    "corpus": "BRC",
    "title": "5",
    "title_name": "General Offenses",
    "chapter": "10",
    "chapter_name": "Marijuana Offenses",
    "anchor": "5-10-3",
    "heading": "Unlawful to Sell or Give to or Procure Marijuana for Minors.",
    "verbatim": "5-10-3. Unlawful to Sell or Give to or Procure Marijuana for Minors.\nNo person shall sell, serve, deliver, or give away any marijuana or any product containing marijuana to any underage person or purchase marijuana or marijuana-infused product for an underage person.\nOrdinance Nos. 7892 (2013); 8393 (2020)"
  },
  {
    "corpus": "BRC",
    "title": "5",
    "title_name": "General Offenses",
    "chapter": "10",
    "chapter_name": "Marijuana Offenses",
    "anchor": "5-10-4",
    "heading": "Possession and Sale of Marijuana by Minors Unlawful.",
    "verbatim": "5-10-4. Possession and Sale of Marijuana by Minors Unlawful.\n(a)\tNo underage person shall consume, possess, or have under such person's control or request that any other person purchase for such underage person or sell, serve, give away, or offer for sale any marijuana or any product containing marijuana.\n(b)\tPrima facie evidence that a violation of this chapter occurred within the city shall consist of:\n(1)\tEvidence that the defendant was under the age of twenty-one years and possessed or consumed marijuana within the city;\n(2)\tEvidence that the defendant was under the age of twenty-one years and manifested any of the characteristics commonly associated with marijuana use or impairment while present anywhere within the city; or\n(3)\tIndicia including bloodshot eyes, watery eyes, eyelid tremors, green particulate on tongue, dilated pupils, dry mouth, or any other indicator of marijuana consumption.\n(c)\tAn underage person and one or two other persons shall be immune from criminal prosecution under this section if they establish the following:\n(1)\tOne of the underage persons called 911 and reported that another underage person was in need of medical assistance due to marijuana consumption;\n(2)\tThe underage person who called 911 and, if applicable, one or two other persons acting in concert with the underage person who called 911 provided each of their names to the 911 operator;\n(3)\tThe underage person was the first person to make the 911 report; and\n(4)\tThe underage person and, if applicable, one or two other persons acting in concert with the underage person who made the 911 call remained on the scene with the underage person in need of medical assistance until assistance arrived and cooperated with medical assistance and law enforcement personnel on the scene.\n(d)\tUpon the expiration of one year from the date of a conviction of a charge under this section, the defendant may petition the municipal court for an order sealing the record of such municipal court charge. The court shall grant such petition if the petitioner has not been arrested for, charged with, or convicted of any felony, misdemeanor, petty offense, or criminal city ordinance violation during the period of one year following the date of such petitioner's conviction of charges under this section. Upon acquittal, dismissal, or a decision not to file a charge under this section, the defendant may petition the municipal court for an order sealing the record of such municipal court charge and the court shall grant such petition.\n(e)\tIn any judicial proceeding in any court of this state concerning a charge under this section, the court shall take judicial notice of methods of testing a person's blood, breath, saliva, or urine for the presence of Tetrahydrocannabinol (THC) and of the design and operation of devices certified by the department of public health and environment for testing a person's blood, breath, saliva, or urine for the presence of Tetrahydrocannabinol (THC). This subsection shall not prevent the necessity of establishing during a trial that the testing devices were working properly and that such testing devices were properly operated. Nothing in this subsection shall preclude a defendant from offering evidence concerning the accuracy of testing devices.\n(f)\tIt shall be an affirmative defense to a charged violation of this section that the underage person (1) on the date of the alleged offense lawfully possessed a current registry identification card issued by the state of Colorado to the underage person, and (2) possessed no more marijuana than the amount permitted by Article XVIII, Section 14 of the Colorado Constitution. Before evidence of this affirmative defense is presented to a jury, the underage person shall first provide written notice of this defense to the court and prosecution and a photocopy of the underage person's registry identification card, at least ten days prior to trial. An underage person who raises this defense waives doctor-patient privilege and confidentiality concerning the underage person's patient registry information.\nOrdinance Nos. 7892 (2013); 7965 (2014); 8393 (2020)"
  },
  {
    "corpus": "BRC",
    "title": "5",
    "title_name": "General Offenses",
    "chapter": "10",
    "chapter_name": "Marijuana Offenses",
    "anchor": "5-10-5",
    "heading": "Evidence of Marijuana in Trials.",
    "verbatim": "5-10-5. Evidence of Marijuana in Trials.\n(a)\tIn any trial for a violation of this chapter, any witness with prior personal experience of the appearance, taste, or smell of marijuana may state an opinion that a substance was marijuana, based on his or her observations and experience. The witness need not be offered as an expert witness.\n(b)\tIn any trial for a violation of this chapter, any witness may testify that a person manifested characteristics commonly associated with marijuana use if the witness has personal experience or training that would enable the witness to recognize the characteristics. The witness need not be offered as an expert witness.\n(c)\tIn any trial for a violation of this section, any container or wrapper with labeling indicating the contents of the container or wrapper shall be admissible into evidence, and the information on any label on such container or wrapper shall be admissible into evidence and shall not constitute hearsay. A jury or a judge, whichever is appropriate, may consider the information upon such label in determining whether the contents of the container or wrapper were composed in whole or in part of marijuana. A label identifying the contents of the container as \"marijuana,\" \"MJ,\" \"weed,\" \"bud,\" \"sativa,\" \"indica,\" or \"kush\" shall constitute prima facie evidence that the contents of the container were composed in whole or in part of marijuana.\n(d)\tIn any trial for a violation of this section, testimony of a competent witness, including the arresting officer, that the substance possessed exhibited the smell, appearance, or other characteristics of marijuana shall be sufficient to establish that the substance in question was marijuana. The defendant may rebut such testimony with a laboratory test, performed at the defendant's expense demonstrating that the substance was not marijuana.\nOrdinance No. 7892 (2013)"
  },
  {
    "corpus": "BRC",
    "title": "5",
    "title_name": "General Offenses",
    "chapter": "10",
    "chapter_name": "Marijuana Offenses",
    "anchor": "5-10-6",
    "heading": "Reserved.",
    "verbatim": "5-10-6. Reserved.\nEditor's note(s)—Ordinance No. 8393, § 3, adopted July 7, 2020, repealed § 5-10-6, which pertained to marijuana odor emissions and derived from Ordinance Nos. 7931 (2013); 8240 (2018)."
  },
  {
    "corpus": "BRC",
    "title": "5",
    "title_name": "General Offenses",
    "chapter": "10",
    "chapter_name": "Marijuana Offenses",
    "anchor": "5-10-7",
    "heading": "Unlawful to Transport Marijuana.",
    "verbatim": "5-10-7. Unlawful to Transport Marijuana.\nIt shall be unlawful for any person to distribute, or contract to distribute, as such terms are defined in Section 6-16-2 of this code, any marijuana using any freight or package service, community rideshare, or other commercial transportation network, not including the United States Postal Service. It shall be an affirmative defense if the person holds a valid marijuana transporter license from the state and the transporter is transporting the marijuana in compliance with all applicable state and local requirements.\nOrdinance Nos. 8081 (2015); 8393 (2020)"
  },
  {
    "corpus": "BRC",
    "title": "5",
    "title_name": "General Offenses",
    "chapter": "10",
    "chapter_name": "Marijuana Offenses",
    "anchor": "5-10-8",
    "heading": "Reserved.",
    "verbatim": "5-10-8. Reserved.\nEditor's note(s)—Ordinance No. 8393, § 3, adopted July 7, 2020, repealed § 5-10-8, which pertained to unlawful to produce marijuana without a license and derived from Ordinance No. 8081 (2015)."
  },
  {
    "corpus": "BRC",
    "title": "5",
    "title_name": "General Offenses",
    "chapter": "11",
    "chapter_name": "Cannabis Offenses",
    "anchor": "5-11-1",
    "heading": "Definitions.",
    "verbatim": "5-11-1. Definitions.\nFor purposes of this chapter, the following words shall have the following definitions:\nCannabis means all parts of the plant from the genus cannabis whether growing or not, the seeds thereof, the resin extracted from any part of the plant, and every compound manufacture, salt, derivative, mixture, or preparation of the plant, its seeds, or its resin. It does not include fiber produced from the stalks, oil, or cake made from the seeds of the plant, or sterilized seed of the plant which is incapable of germination, if these items exist apart from any other item defined as Marijuana in this subsection. Cannabis shall include Hemp or Marijuana, and Industrial Hemp, medical marijuana, and recreational marijuana as defined in this chapter or elsewhere in this Code.\nCultivation or cultivate means: (i) all phases of growth of Hemp from seed to harvest; or (ii) preparing, packaging, or repackaging, labeling, or relabeling of Hemp prior to consumption, or incorporation into a cannabis-infused product.\nDistribute or distribution means the actual, constructive, or attempted transfer, delivery, sale, or dispensing of Hemp to another, with or without remuneration.\nHemp or Industrial Hemp means the plant from the genus cannabis and any part of the plant, including the seeds of the plant and all derivatives, extracts, cannabinoids, isomers, acids, salts, and salts of isomers, whether growing or not, with a delta-9 tetrahydrocannabinol concentration of no more than three-tenths of one percent on a dry-weight basis. Any increase of delta-9 tetrahydrocannabinol concentration over three-tenths of one percent on a dry-weight basis causes the cannabis to be regulated as marijuana even if it was grown as hemp or is intended to be sold as a hemp plant or product.\nLicensee means the cannabis business named on the cannabis business license, and all individuals named in the cannabis business license application or later reported to the city as owner or keyholder as defined in section 6-16-2, including, without limitation, owners.\nMarijuana means any Cannabis that is not Hemp.\nProduce or production means: (i) combining Cannabis with any other substance for distribution, including storage and packaging for resale; or (ii) preparing, compounding, processing, encapsulating, packaging or repackaging, labeling, or relabeling of cannabis or its derivatives, whether alone or mixed with any amount of any other substance. Production shall not include packaging or repackaging, labeling, or relabeling of Cannabis if no Production has occurred and such packaging and labeling qualify as Cultivation.\nOrdinance Nos. 8393 (2020); 8437 (2020)"
  },
  {
    "corpus": "BRC",
    "title": "5",
    "title_name": "General Offenses",
    "chapter": "11",
    "chapter_name": "Cannabis Offenses",
    "anchor": "5-11-2",
    "heading": "Evidence of Cannabis in Trials.",
    "verbatim": "5-11-2. Evidence of Cannabis in Trials.\n(a)\tIn any trial for a violation of this chapter, any witness with professional or occupational experience to identify cannabis by its appearance, taste, or smell may state an opinion that a substance was cannabis, based on his or her observations and experience. The witness need not be offered as an expert witness.\n(b)\tIn any trial for a violation of this chapter, any witness may testify that a person manifested characteristics commonly associated with cannabis use if the witness has personal experience or training that would enable the witness to recognize the characteristics. The witness need not be offered as an expert witness.\n(c)\tIn any trial for a violation of this section, testimony of a competent witness, including the arresting officer, that the substance possessed exhibited the smell, appearance, or other characteristics of cannabis shall be sufficient to establish that the substance in question was cannabis. The defendant may rebut such testimony with a laboratory test, performed at the defendant's expense demonstrating that the substance was not cannabis.\n(d)\tFor purposes of this chapter, no witness shall be required to identify cannabis as either hemp or marijuana.\nOrdinance No. 8393 (2020)"
  },
  {
    "corpus": "BRC",
    "title": "5",
    "title_name": "General Offenses",
    "chapter": "11",
    "chapter_name": "Cannabis Offenses",
    "anchor": "5-11-3",
    "heading": "Cannabis Odor Emissions.",
    "verbatim": "5-11-3. Cannabis Odor Emissions.\n(a)\tNo person, tenant, occupant, or property owner shall permit the emission of cannabis odor from any source to result in detectable odors that leave the premises upon which they originated and interfere with the reasonable and comfortable use and enjoyment of another's property.\n(b)\tWhether or not a cannabis odor emission interferes with the reasonable and comfortable use and enjoyment of a property shall be measured against the objective standards of a reasonable person of normal sensitivity.\n(c)\tA cannabis odor emission shall be deemed to interfere with the reasonable and comfortable use and enjoyment of property if cannabis odor is detectable outside the premises.\n(d)\tNo person shall be convicted of a violation of this section unless the city manager has delivered or posted a written warning, in the previous twelve months, that conduct violating this section is occurring or has occurred.\n(e)\tExtended grace period for licensed cannabis business. No person who receives a warning at a licensed cannabis business shall be convicted of a violation that allegedly occurred within thirty days after the first warning issued pursuant to Subsection (d), if all of the following conditions are met:\n(1)\tA first warning within twelve months was previously issued pursuant to Subsection (d) of this section for the person's property, and the subject property is licensed as a cannabis cultivation facility by the city or the state;\n(2)\tSeven or fewer days after the warning was posted or delivered, the person submitted a written document to the city manager which explained (i) why the cannabis odor emissions could not be abated within seven days feasibly, and (ii) how the person planned to abate the cannabis odor emission in the following ninety days;\n(3)\tThe person receiving the warning has diligently pursued to completion the plans for abating the cannabis odor emission; and\n(4)\tThe written document described in Paragraph (2) was submitted fewer than ninety days before the date of the violation.\nOrdinance No. 8393 (2020)"
  },
  {
    "corpus": "BRC",
    "title": "5",
    "title_name": "General Offenses",
    "chapter": "11",
    "chapter_name": "Cannabis Offenses",
    "anchor": "5-11-4",
    "heading": "Unlawful to Cultivate, Distribute, or Produce Cannabis Without a License.",
    "verbatim": "5-11-4. Unlawful to Cultivate, Distribute, or Produce Cannabis Without a License.\nIt shall be unlawful for any person to:\n(1)\tCultivate any cannabis without a license from the city for a marijuana cultivation facility if the plant is marijuana or a hemp cultivation facility if the plant is hemp;\n(2)\tPossess extraction vessels, and butane, propane, compressed CO 2 , ethanol, isopropanol, acetone, heptane, hexane, or any other volatile materials used in the production of solvent-based cannabis concentrate, in the same premise as cannabis without a license from the city as a hemp or marijuana infused product manufacturer; or\n(3)\tPossess extraction vessels, and butane, propane, compressed CO 2 , ethanol, isopropanol, acetone, heptane, hexane, or any other volatile materials used in the production of solvent-based cannabis concentrate, in the same premise as cannabis without a license from the city as a cannabis infused product manufacturer.\nFor purposes of this section, the terms \"produce\" and \"distribute\" shall have the same definition as specified in Section 6-16-2 of this Code.\nOrdinance No. 8393 (2020)\nBOULDER CHARTER AND REVISED CODE\n1981"
  }
]